{
  "title": "Sensor Device and Method for the Detection of a Gripping of a Hand-Held Device as Well as a Hand-Held Device",
  "date_published": "20160929",
  "publication_number": "US20160285450A1-20160929",
  "date_produced": "20160914",
  "ipcr_labels": [
    "H03K1796",
    "G06F132",
    "G01N2722"
  ],
  "decision": "PENDING",
  "application_number": "13808700",
  "patent_number": "None",
  "inventor_list": [
    {
      "inventor_name_last": "Steffens",
      "inventor_name_first": "Holger",
      "inventor_city": "Munchen",
      "inventor_state": "",
      "inventor_country": "DE"
    },
    {
      "inventor_name_last": "Fasshauer",
      "inventor_name_first": "Peter",
      "inventor_city": "Neubiberg",
      "inventor_state": "",
      "inventor_country": "DE"
    },
    {
      "inventor_name_last": "Kaltner",
      "inventor_name_first": "Claus",
      "inventor_city": "Bergkirchen",
      "inventor_state": "",
      "inventor_country": "DE"
    }
  ],
  "abstract": "A sensor device for the detection of a gripping of a hand-held device with one hand has at least one first electrode and at least one second electrode. The first electrode can be operated in a first operating mode. The second electrode can be operated in the first operating mode and in a second operating mode. In the first operating mode, the capacitive coupling between the first electrode and the second electrode is analyzed. In the second operating mode, a capacitive load of the second electrode is analyzed against a reference ground.",
  "filing_date": "20160406",
  "summary": "<SOH> SUMMARY <EOH>Accoridng to various embodiments, solutions can be provided in order to at least partially avoid the disadvantages known from the state of the art and to achieve a precise and secure detection of a gripping of a hand-held device, particularly of an electrical hand-held device. According to various embodiments, a sensor device may comprise at least one first electrode and at least one second electrode being coupled with an analysis device, wherein the at least one first electrode can be operated in a first operating mode, the at least one second electrode can be operated in said first operating mode and in a second operating mode, in the first operating mode, the capacitive coupling between the at least one first electrode and the at least one second electrode are analyzed by the analysis device, and in the second operating mode, a capacitive load of the at least one second electrode against a reference ground are analyzed by the analysis device",
  "main_ipcr_label": "H03K1796",
  "_processing_info": {
    "original_size": 44317,
    "optimized_size": 2430,
    "reduction_percent": 94.52
  }
}