{
  "title": "SYSTEMS, METHODS AND APPARATUS THAT EMPLOY STATISTICAL ANALYSIS OF STRUCTURAL TEST INFORMATION TO IDENTIFY YIELD LOSS MECHANISMS",
  "date_published": "20170803",
  "publication_number": "US20170220706A1-20170803",
  "date_produced": "20170719",
  "ipcr_labels": [
    "G06F1750"
  ],
  "decision": "PENDING",
  "application_number": "13822625",
  "patent_number": "None",
  "inventor_list": [
    {
      "inventor_name_last": "ORBON",
      "inventor_name_first": "Jacob J.",
      "inventor_city": "Cupertino",
      "inventor_state": "CA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "VOLKERINK",
      "inventor_name_first": "Eric",
      "inventor_city": "Palo Alto",
      "inventor_state": "CA",
      "inventor_country": "US"
    }
  ],
  "abstract": "A method for statistically analyzing structural test information to identify at least one yield loss mechanism includes executing a plurality of instructions on a computer system. The executed instructions cause the computer system to perform the steps of: 1) identifying potential root causes for items of structural test information obtained for a plurality of semiconductor devices; 2) statistically analyzing the items of structural test information to identify at least one non-random device failure signature within the items of structural test information; and 3) identifying from the potential root causes a probable root cause for at least a first of the at least one non-random device failure signature.",
  "filing_date": "20160210",
  "summary": "<SOH> BRIEF DESCRIPTION OF THE DRAWINGS <EOH>Illustrative embodiments of the invention are illustrated in the drawings, in which: FIG. 1 illustrates an exemplary computer-implemented method for identifying systematic or parametric yield loss mechanisms; FIG. 2 illustrates an exemplary system for implementing the method shown in FIG. 1 ; FIG. 3 illustrates an exemplary flow of a semiconductor production process, in conjunction with an implementation of the method shown in FIG. 1 or the system shown in FIG. 2 ; FIG. 4 illustrates an exemplary flow of a semiconductor design and production process, in conjunction with an implementation of the method shown in FIG. 1 or the system shown in FIG. 2 ; FIG. 5 illustrates an exemplary process for identifying production groups or lots having semiconductor devices associated with a particular non-random device failure signature; FIG. 6 illustrates use of the method shown in FIG. 1 in a first exemplary method for improving a FMEA process; FIG. 7 illustrates use of the method shown in FIG. 1 in a second exemplary method for improving a FMEA process; FIG. 8 illustrates an exemplary GUI for displaying an exemplary output of the method shown in FIG. 1 or the system shown in FIG. 2 ; and FIG. 9 illustrates an exemplary computer system for implementing the method shown in FIG. 1, 6 or 7 , or the system shown in FIG. 2 . It is noted that, in the following description, like reference numbers appearing in different drawing figures refer to like elements/features. Often, therefore, like elements/features that appear in different drawing figures will not be described in detail with respect to each of the drawing figures. detailed-description description=\"Detailed Description\" end=\"lead\"?",
  "main_ipcr_label": "G06F1750",
  "_processing_info": {
    "original_size": 74351,
    "optimized_size": 3224,
    "reduction_percent": 95.66
  }
}