{
  "title": "SYSTEMS AND METHODS FOR ENABLING SECURE TRANSACTIONS WITH MOBILE DEVICES",
  "date_published": "20161117",
  "publication_number": "US20160335619A1-20161117",
  "date_produced": "20161102",
  "ipcr_labels": [
    "G06Q2032",
    "H04W1206",
    "G06Q2038",
    "H04W400",
    "H04B500"
  ],
  "decision": "PENDING",
  "application_number": "13976539",
  "patent_number": "None",
  "inventor_list": [
    {
      "inventor_name_last": "CE",
      "inventor_name_first": "Rafeeq",
      "inventor_city": "Bangalore",
      "inventor_state": "",
      "inventor_country": "IN"
    }
  ],
  "abstract": "Techniques for enabling transactions using mobile devices are described herein. A mobile device is configured to wirelessly receive from a provider of products and services an encrypted near field communications (NFC) data exchange format (NDEF) message using an over-the-air communications standard different from the NFC standard. The NDEF message is decrypted to recover the NDEF payload. An NFC emulated card is generated from the information included in the NDEF payload and stored in the mobile device. The NFC emulated card is used to store funds for making payments. For conducting a transaction at the provider's place of business, the NFC emulated card is provided to a point-of-sale terminal for authorization, fund transfer, and completion of transaction.",
  "filing_date": "20160627",
  "summary": "<SOH> BRIEF DESCRIPTION OF THE DRAWINGS <EOH>The Detailed Description references the accompanying figures. In the figures, the left-most digit(s) of a reference number identifies the figure in which the reference number first appears. The same numbers are used throughout the drawings to reference like features and components. FIG. 1 illustrates a block diagram of a transaction processing system configured to process transactions. FIG. 2 is a block diagram illustrating additional details of a computing device described with reference to FIG. 1 . The illustrated portions implement tools and techniques to conduct transactions described herein. FIG. 3 a flow diagram illustrating a process to implement the techniques described herein for processing a financial transaction. FIG. 4 a flow diagram illustrating a process to implement the techniques described herein for processing an airline ticketing transaction. FIG. 5 a flow diagram illustrating a process to implement the techniques described herein for processing a secure transaction. detailed-description description=\"Detailed Description\" end=\"lead\"?",
  "main_ipcr_label": "G06Q2032",
  "_processing_info": {
    "original_size": 51763,
    "optimized_size": 2483,
    "reduction_percent": 95.2
  }
}