{
  "date_produced": "20180608",
  "publication_number": "US20180174035A1-20180621",
  "main_ipcr_label": "G06N308",
  "decision": "PENDING",
  "application_number": "14786749",
  "inventor_list": [
    {
      "inventor_name_last": "NUGENT",
      "inventor_name_first": "Alex",
      "inventor_city": "Santa Fe",
      "inventor_state": "NM",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "MOLTER",
      "inventor_name_first": "Timothy",
      "inventor_city": "Oberstdorf",
      "inventor_state": "",
      "inventor_country": "DE"
    }
  ],
  "abstract": "A universal machine learning building block, comprising in some embodiments a differential pair of output electrodes, wherein each electrode comprises a plurality of input lines coupled to it via collections of meta-stable switches. In other embodiments, a methodology can be implemented in the context of hardware and/or software for deriving linear neurons implementing an AHaH plasticity rule and generating an AHaH node(s) that can include one or more such linear neurons, wherein the AHaH node(s) functions according to an AHaH rule. Some embodiments can also include an AHaH classifier and/or AHaH cluster that include one or more such AHaH nodes.",
  "filing_date": "20160404",
  "patent_number": "None",
  "summary": "<SOH> BRIEF SUMMARY <EOH>The following summary of the invention is provided to facilitate an understanding of some of the innovative features unique to the disclosed embodiments and is not intended to be a full description. A full appreciation of the various aspects of the invention can be gained by taking the entire specification, claims, drawings, and abstract as a whole. It is, therefore, one aspect of the disclosed embodiments to provide for a universal machine learning building block. It is another aspect of the disclosed embodiments to form an adaptive synaptic weight from a differential pair of memristors and AHaH (Anti-Hebbian and Hebbian) plasticity. It is a further aspect of the disclosed embodiments to provide for a physical synaptic component that can be added to integrated circuit devices for machine learning applications. It is also an aspect of the disclosed embodiments to provide for differential arrays of synaptic weights to form a neural node circuit, the attractor states of which are logic functions that form a computationally complete set. It is yet another aspect of the disclosed embodiments to provide for a universal machine learning building block, which may include a differential pair of output electrodes, wherein each electrode comprises a plurality of input lines coupled to it via collections of meta-stable switches. It is another aspect of the disclosed embodiments to provide for a machine learning method, which can be implemented in the context of hardware and/or software. It is a further aspect of the disclosed embodiments to provide for an AHaH node, which can be implemented in the context of hardware and/or software. It is also another aspect of the disclosed embodiments to provide for an AHaH classifier, which can be implemented in the context of hardware and/or software. It is an additional aspect of the disclosed embodiments to provide for an AHaH cluster, which can be implemented in the context of hardware and/or software. The afor...",
  "date_published": "20180621",
  "title": "UNIVERSAL MACHINE LEARNING BUILDING BLOCK",
  "ipcr_labels": [
    "G06N308",
    "G06N304",
    "G06N3063"
  ],
  "_processing_info": {
    "original_size": 99505,
    "optimized_size": 3350,
    "reduction_percent": 96.63
  }
}