{
  "decision": "PENDING",
  "application_number": "14905094",
  "date_published": "20160915",
  "date_produced": "20160831",
  "title": "Method and Wearable Apparatus for Synchronizing a User With a Virtual Environment",
  "filing_date": "20160114",
  "inventor_list": [
    {
      "inventor_name_last": "MAROZAU",
      "inventor_name_first": "Dzmitry",
      "inventor_city": "Smorgon",
      "inventor_state": "",
      "inventor_country": "BY"
    },
    {
      "inventor_name_last": "KHURS",
      "inventor_name_first": "Siarhei",
      "inventor_city": "Brest",
      "inventor_state": "",
      "inventor_country": "BY"
    },
    {
      "inventor_name_last": "ALEKSANDROVICH",
      "inventor_name_first": "Raman",
      "inventor_city": "Minsk",
      "inventor_state": "",
      "inventor_country": "BY"
    }
  ],
  "ipcr_labels": [
    "G06F301",
    "H04B13827",
    "G09G512",
    "G06T1900",
    "G06F1310",
    "G06F116"
  ],
  "main_ipcr_label": "G06F301",
  "summary": "<SOH> OBJECT AND BRIEF SUMMARY OF THE INVENTION <EOH>The object of the present invention is to create a deep-sense reality through a sufficiently sensible adjustment of feedback pulses' behavior; to transmit any change in virtual environment to the level of user's sensory perception with getting a maximum feeling experience of the occurring events; to establish an instant direct (feedforward) and feedback connections between the user and the digital environment intelligence in an interactive mode; to establish a maximum possible immersion in the gaming or simulation process; to create a proper digital double. The aforementioned object is achieved in the following way. An inventive method is proposed for interactive physiological and technological synchronization of a user with a virtual environment that includes: taking the user's biometric and/or kinematic parameters, transferring the user's biometric and/or kinematic parameters to an application program, generating feedback signals in the application program, transmitting the feedback signals to a computing device, processing the feedback signals and supplying feedback pulses which invoke physical sensations in the nervous system of the user through contact with the user's skin, wherein the feedback pulses are supplied using the principle of the cascaded distribution of electrical pulses. For implementation of the inventive method, a wearable apparatus is proposed for the interactive physiological and technological synchronization of a user with a virtual environment, one of the variants of which comprises at least one module containing at least one element for collecting biometric and/or kinematic parameters of the user and/or at least one element for supplying electrical feedback pulses and at least one slot for connecting at least one working unit selected from the following group: a device for collecting biometric and/or kinematic parameters of a user; a device for supplying electrical feedback pulses; a compu...",
  "patent_number": "None",
  "abstract": "The proposed method relates to the field of providing physical feedback to a user from a virtual application, particularly a computer game or other software applications. The method for interactive physiological and technological synchronization of a user with a virtual environment includes taking the user's biometric and/or kinematic parameters, transferring the user's biometric and/or kinematic parameters to an application program, generating feedback signals in the application program, transmitting the feedback signals to a computing device, processing the feedback signals and supplying feedback pulses which invoke physical sensations in the nervous system of the user through contact with the user's skin, wherein the feedback pulses are supplied using the principle of cascaded distribution of electrical pulses. Also claimed are variants of a wearable apparatus for implementation of the proposed method. The proposed method and apparatus allow for creating a deep-sense reality for the...",
  "publication_number": "US20160266645A1-20160915",
  "_processing_info": {
    "original_size": 34968,
    "optimized_size": 3919,
    "reduction_percent": 88.79
  }
}