{
  "decision": "REJECTED",
  "application_number": "14909371",
  "date_published": "20160623",
  "date_produced": "20160608",
  "title": "SYSTEM AND METHOD FOR REPRESENTING POWER SYSTEM INFORMATION",
  "filing_date": "20160201",
  "inventor_list": [
    {
      "inventor_name_last": "Yeo",
      "inventor_name_first": "Jeffrey W.",
      "inventor_city": "Saanichton",
      "inventor_state": "",
      "inventor_country": "CA"
    },
    {
      "inventor_name_last": "Tovey",
      "inventor_name_first": "Peter",
      "inventor_city": "Kelowna",
      "inventor_state": "",
      "inventor_country": "CA"
    },
    {
      "inventor_name_last": "Pettit",
      "inventor_name_first": "James",
      "inventor_city": "Victoria",
      "inventor_state": "",
      "inventor_country": "CA"
    },
    {
      "inventor_name_last": "Nelson",
      "inventor_name_first": "Avro Anthony Sargeaunt",
      "inventor_city": "Victoria",
      "inventor_state": "",
      "inventor_country": "CA"
    },
    {
      "inventor_name_last": "Schubert",
      "inventor_name_first": "Shannon",
      "inventor_city": "Victoria",
      "inventor_state": "",
      "inventor_country": "CA"
    },
    {
      "inventor_name_last": "Smith",
      "inventor_name_first": "Peter",
      "inventor_city": "Victoria",
      "inventor_state": "",
      "inventor_country": "CA"
    },
    {
      "inventor_name_last": "Swinkels",
      "inventor_name_first": "Mark Anthony Mary",
      "inventor_city": "Victoria",
      "inventor_state": "",
      "inventor_country": "CA"
    },
    {
      "inventor_name_last": "Ducharme",
      "inventor_name_first": "Timothy Robert",
      "inventor_city": "Victoria",
      "inventor_state": "",
      "inventor_country": "CA"
    }
  ],
  "ipcr_labels": [
    "G06F132"
  ],
  "main_ipcr_label": "G06F132",
  "summary": "<SOH> SUMMARY OF INVENTION <EOH>Aspects and examples disclosed herein a system for representing power system information to a user. The system comprises a memory, and at least one processor coupled to the memory. The at the least one processor is configured to receive data descriptive of a plurality of logical elements including data descriptive of a first logical element and a second logical element, the first logical element being different from the second logical element, receive data descriptive of a plurality of devices including data descriptive of a first device, receive data descriptive of a plurality of measured characteristics of the plurality of devices including data descriptive of a first measured characteristic of the first device, receive data mapping the first device to the first logical element for a first period of time, receive data mapping the first device to the second logical element for a second period of time to different from the first period of time, receive data requesting at least one summary value for the first logical element over a period of time spanning the first period of time and the second period of time, calculate, in response to receiving the data requesting the at least one summary value, at least one first summary for the first logical element using one or more values of the first measured characteristic recorded during the first period of time and not using one or more values of the first measured characteristic recorded during the second period of time, and provide the first summary in association with the first logical element. According to one embodiment, the data descriptive of the plurality of devices includes data descriptive of a second device different from the first device, the data descriptive of the plurality of measured characteristics includes data descriptive of a second measured characteristic of the second device. The least one processor is further configured to receive data mapping the second device to the fi...",
  "patent_number": "None",
  "abstract": "A system for representing power system information to a user includes a processor configured to receive data descriptive of logical elements including data descriptive of a first logical element and a second logical element, receive data descriptive of devices including data descriptive of a first device, receive data descriptive of measured characteristics of the devices including data descriptive of a first measured characteristic of the first device, receive data mapping the first device to the first logical element for a first period of time, receive data mapping the first device to the second logical element for a second period of time, receive data requesting at least one summary value for the first logical element over a period of time spanning the first period of time and the second period of time, calculate, in response to receiving the data requesting the at least one summary value.",
  "publication_number": "US20160179167A1-20160623",
  "_processing_info": {
    "original_size": 102502,
    "optimized_size": 4498,
    "reduction_percent": 95.61
  }
}