{
  "decision": "PENDING",
  "application_number": "14907787",
  "date_published": "20170223",
  "date_produced": "20170208",
  "title": "VEHICLE-MOUNTED DISPLAY SYSTEM AND VEHICLE",
  "filing_date": "20160126",
  "inventor_list": [
    {
      "inventor_name_last": "LV",
      "inventor_name_first": "Xuewen",
      "inventor_city": "Beijing",
      "inventor_state": "",
      "inventor_country": "CN"
    },
    {
      "inventor_name_last": "SU",
      "inventor_name_first": "Jing",
      "inventor_city": "Beijing",
      "inventor_state": "",
      "inventor_country": "CN"
    },
    {
      "inventor_name_last": "CHEN",
      "inventor_name_first": "Yanshun",
      "inventor_city": "Beijing",
      "inventor_state": "",
      "inventor_country": "CN"
    },
    {
      "inventor_name_last": "LI",
      "inventor_name_first": "Wenbo",
      "inventor_city": "Beijing",
      "inventor_state": "",
      "inventor_country": "CN"
    },
    {
      "inventor_name_last": "WU",
      "inventor_name_first": "Xinyin",
      "inventor_city": "Beijing",
      "inventor_state": "",
      "inventor_country": "CN"
    }
  ],
  "ipcr_labels": [
    "B60R100",
    "B62D1502",
    "H04N5232",
    "G02F11333",
    "G06T1160",
    "G06K900",
    "G06F301",
    "G02B2701",
    "B60K3500",
    "H04N718"
  ],
  "main_ipcr_label": "B60R100",
  "summary": "<SOH> SUMMARY <EOH>An object of the present disclosure is to provide a vehicle-mounted display system and a vehicle, so as to improve the privacy of the existing vehicle-mounted display system. In one aspect, the present disclosure provides a vehicle-mounted display system, including a transparent projection screen and a projector configured to project an image onto the transparent projection screen. A first polarizer is attached onto a lens of the projector, and a second polarizer is attached onto the transparent projection screen. The second polarizer has a polarization transmission direction crossing a polarization transmission direction of the first polarizer at such an angle as to enable a light beam from the projector and passing through the first polarizer and the second polarizer to be of an intensity smaller than an intensity of a light beam capable of being recognized by human eyes. The second polarizer has a polarization reflection direction perpendicular to its polarization transmission direction, so as to reflect a light component in the polarization reflection direction. Alternatively, the polarization transmission direction of the second polarizer is perpendicular to the polarization transmission direction of the first polarizer. Alternatively, the polarization transmission direction of the second polarizer is parallel to a horizontal plane. Alternatively, the transparent projection screen is separately arranged above a dashboard in front of a driver, and the vehicle-mounted display system further includes a screen bracket connected to the transparent projection screen, and a screen bracket controller connected to the screen bracket and configured to control the screen bracket to move the transparent projection screen to a position above the dashboard in front of the driver so as to enable the transparent projection screen to be within a visual range of the driver, or control the screen bracket to withdraw the transparent projection screen so as to mo...",
  "patent_number": "None",
  "abstract": "The present disclosure provides a vehicle-mounted display system and a vehicle. The vehicle-mounted display system includes a transparent projection screen and a projector configured to project an image onto the transparent projection screen. A first polarizer is attached onto a lens of the projector, and a second polarizer is attached onto the transparent projection screen. The second polarizer has a polarization transmission direction crossing a polarization transmission direction of the first polarizer at such an angle as to enable a light beam from the projector and passing through the first polarizer and the second polarizer to be of an intensity smaller than an intensity of a light beam capable of being recognized by human eyes. The second polarizer has a polarization reflection direction perpendicular to its polarization transmission direction, so as to reflect a light component in the polarization reflection direction.",
  "publication_number": "US20170050564A1-20170223",
  "_processing_info": {
    "original_size": 63938,
    "optimized_size": 4125,
    "reduction_percent": 93.55
  }
}