{
  "date_produced": "20160615",
  "publication_number": "US20160189025A1-20160630",
  "main_ipcr_label": "G06N306",
  "decision": "PENDING",
  "application_number": "14902944",
  "inventor_list": [
    {
      "inventor_name_last": "Hayes",
      "inventor_name_first": "William",
      "inventor_city": "Marlborough",
      "inventor_state": "MA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Hoeng",
      "inventor_name_first": "Julia",
      "inventor_city": "Corcelles",
      "inventor_state": "",
      "inventor_country": "CH"
    },
    {
      "inventor_name_last": "Peitsch",
      "inventor_name_first": "Manuel Claude",
      "inventor_city": "Peseux",
      "inventor_state": "",
      "inventor_country": "CH"
    }
  ],
  "abstract": "Systems and methods are provided for curating and disseminating a network model. A representation of a network model is provided, and data is received that is representative of user actions. The user actions are directed to at least one element of the network model. A score is assigned to each respective element based on a number of user actions received for the respective element. A verified subset of edges is identified that have assigned scores that exceed a verification threshold, and a rejected subset of edges is identified that have assigned scores that are below a rejection threshold. The verified subset of edges and the associated nodes are provided as a curated network model, which omits the rejected subset of edges.",
  "filing_date": "20160105",
  "patent_number": "None",
  "summary": "<SOH> SUMMARY <EOH>As noted above, early solutions for verifying knowledge by appointed individuals may not match the speed required where an abundance of quantitative data concerning various related aspects of a single complex topic is generated by many researchers in a short period of time. Applicants have recognized that curating a network model by a crowd and dissemination of the resulting curated network model may be facilitated by the use of a computer network. The computer systems and computer program products described herein implement methods that include curation of a network model by including input from multiple individuals. By aggregating the opinions of multiple users, the present disclosure allows for the development of a detailed understanding regarding which portions of a network model are valid in the views of multiple individuals, and which portions of a network model require further investigation. In certain aspects, the systems and methods of the present disclosure provide a computerized method for curating a network model. The computerized method includes providing, by a computer system including a communications port and at least one computer processor in communication with at least one non-transitory computer readable medium storing at least one electronic database comprising data representative of an initial network model and elements of the initial network model. The initial network model includes a plurality of nodes interconnected with a plurality of edges, each edge being representative of a causal relationship between two connected nodes. User actions are requested from a plurality of users, the user actions being directed to an element of the network model. An element of a network model can be an edge, a node or an item of information associated with an edge, a node or a portion of the model. Then, a score is assigned to each element of the network model based on the user actions received for the respective element, and verified elemen...",
  "date_published": "20160630",
  "title": "SYSTEMS AND METHODS FOR CROWD-VERIFICATION OF BIOLOGICAL NETWORKS",
  "ipcr_labels": [
    "G06N306",
    "G06N308"
  ],
  "_processing_info": {
    "original_size": 114133,
    "optimized_size": 3595,
    "reduction_percent": 96.85
  }
}