{
  "decision": "REJECTED",
  "application_number": "14906657",
  "date_published": "20160623",
  "date_produced": "20160608",
  "title": "NOTIFICATION DISPLAY",
  "filing_date": "20160121",
  "inventor_list": [
    {
      "inventor_name_last": "SONG",
      "inventor_name_first": "KI-BOK",
      "inventor_city": "HOUSTON",
      "inventor_state": "TX",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "CHEN",
      "inventor_name_first": "ERIC",
      "inventor_city": "HOUSTON",
      "inventor_state": "TX",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "PATRICK",
      "inventor_name_first": "CHAD PARIS",
      "inventor_city": "HOUSTON",
      "inventor_state": "TX",
      "inventor_country": "US"
    }
  ],
  "ipcr_labels": [
    "G06F30481",
    "G06F30488"
  ],
  "main_ipcr_label": "G06F30481",
  "summary": "<SOH> BRIEF DESCRIPTION OF THE DRAWINGS <EOH>The present application may be more fully appreciated in connection with the following detailed description taken in conjunction with the accompanying drawings, in which like reference characters refer to like parts throughout, and in which: FIG. 1 illustrates an example of a computing device including a display member and an accessory member to display notifications; FIG. 2A illustrates examples of notifications that are displayed by an accessory display of the accessory member of FIG. 1 ; FIG. 2B illustrates an example of the accessory display of the accessory member of FIG. 1 displaying notifications in response to a finger swipe; and FIG. 3 illustrates an example of an accessory member for a computing device that includes a keyboard on a front side and a connector on a bottom side to removably connect to the computing device. detailed-description description=\"Detailed Description\" end=\"lead\"?",
  "patent_number": "None",
  "abstract": "A protective cover for a computing device in accordance with an example includes a front side and a back side. The back side includes a display area to display notifications to a user when the protective cover is placed over the computing device. A connector at a bottom portion of the protective cover removably connects to the computing device.",
  "publication_number": "US20160179294A1-20160623",
  "_processing_info": {
    "original_size": 22559,
    "optimized_size": 2115,
    "reduction_percent": 90.62
  }
}