{
  "date_produced": "20160511",
  "publication_number": "US20160148097A1-20160526",
  "main_ipcr_label": "G06N502",
  "decision": "PENDING",
  "application_number": "14903362",
  "inventor_list": [
    {
      "inventor_name_last": "GENOVA, III",
      "inventor_name_first": "Michael Angelo",
      "inventor_city": "New York",
      "inventor_state": "NY",
      "inventor_country": "US"
    }
  ],
  "abstract": "Methods and systems are provided for managing knowledge. Users of a knowledge management (KM) service or system may post questions, provide answers or search for answers via a user interface. For a given question, users may collectively construct and refine an answer hierarchy that may include multiple answer paths or solutions to the same question. To this end, users may add, remove and/or modify nodes of the answer hierarchy. The nodes may be of predefined types such as Step, Fork, and Goto. In addition, users may interact with a particular node and provide or modify content specific to individual nodes of the answer hierarchy such as attachments, questions, comments, or references. Given an answer hierarchy, users may select different answer paths or solutions comprising a subset of nodes in the answer hierarchy, for example, based on user-specific fact patterns or requirements.",
  "filing_date": "20160107",
  "patent_number": "None",
  "summary": "<SOH> SUMMARY OF THE INVENTION <EOH>Methods and systems are provided for managing knowledge. According to an aspect of the present invention, a computer-implemented method for managing knowledge is provided. The method is under the control of one or more computer systems configured with executable instructions and comprises: receiving, via a user interface, a question from a first user; and providing, via the user interface, an answer hierarchy corresponding to the question, the answer hierarchy generated at least in part on responses from one or more other users different from the first user and comprising a plurality of nodes each associated with a predefined node type. In some embodiments, the answer hierarchy represents an aggregate answer to the question. In some embodiments, each node in the answer hierarchy represents a step in a solution to the question. In some embodiments, the predefined node type is selected from a group comprising a Step, Fork, or Goto node type. In some embodiments, the plurality of nodes includes at least a Fork node with two or more branches. In some embodiments, the Fork node represents a decision point among two or more solutions corresponding to the two or more branches. In some embodiments, at least one of the plurality of nodes is associated with node-specific information. In some embodiments, the node-specific information includes at least one of a comment, a question, a reference, or an attachment. In some embodiments, providing the answer hierarchy includes allowing the one or more users to add, remove, or edit at least one node of the plurality of nodes. In some embodiments, editing the at least one node includes adding, removing, or editing node-specific information associated with the at least one node. In some embodiments, the answer hierarchy provides at least two distinct solutions to the question. In some embodiments, the method further comprises allowing the first user to select, via the user interface, a user-specific...",
  "date_published": "20160526",
  "title": "SYSTEMS AND METHODS FOR KNOWLEDGE MANAGEMENT",
  "ipcr_labels": [
    "G06N502",
    "G06F30484"
  ],
  "_processing_info": {
    "original_size": 193987,
    "optimized_size": 3452,
    "reduction_percent": 98.22
  }
}