{
  "decision": "PENDING",
  "application_number": "14913394",
  "date_published": "20160714",
  "date_produced": "20160628",
  "title": "ONE-CLICK REPUTATION ADJUSTMENT",
  "filing_date": "20160222",
  "inventor_list": [
    {
      "inventor_name_last": "Smith",
      "inventor_name_first": "Christopher",
      "inventor_city": "Sherwood",
      "inventor_state": "OR",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Hanson, II",
      "inventor_name_first": "Don R.",
      "inventor_city": "Portland",
      "inventor_state": "OR",
      "inventor_country": "US"
    }
  ],
  "ipcr_labels": [
    "H04L2906",
    "G06F1730"
  ],
  "main_ipcr_label": "H04L2906",
  "summary": "<SOH> BRIEF DESCRIPTION OF THE DRAWINGS <EOH>The present disclosure is best understood from the following detailed description when read with the accompanying FIGUREs. It is emphasized that, in accordance with the standard practice in the industry, various features are not drawn to scale and are used for illustration purposes only. In fact, the dimensions of the various features may be arbitrarily increased or reduced for clarity of discussion. FIG. 1 is a network diagram of a context-aware network with DXL capability according to one or more examples of the present specification. FIG. 1A is an example where a domain master is a joint threat intelligence (JTI) server according to one or more examples of the present specification. FIG. 1B is a network diagram of select elements and a context-aware network according to one or more examples of the present specification. FIG. 2 is a network diagram disclosing a distributed architecture according to one or more examples of the present specification. FIG. 3 is a network diagram of an example DXL network operating across a traditional enterprise boundary according to one or more examples of the present specification. FIG. 4 is a network diagram of a context-aware network 400 according to one or more examples of the present specification. FIG. 5 is a block diagram of a DXL broker according to one or more examples of the present specification. FIG. 6 is a block diagram of a CIM server according to one or more examples of the present specification. FIG. 7 is a block diagram of a domain master 160 according to one or more examples of the present specification. FIG. 8 is a block diagram of a client according to one or more examples of the present specification. FIG. 9 is a flow diagram illustrating evaluation of an object in a hierarchical manner according to one or more examples of the present specification. FIG. 10 is a flow diagram of a method of performed by an client 120 according to one or more examples of the present spe...",
  "patent_number": "None",
  "abstract": "In an example, there is disclosed a monolithic reputation update on a data exchange layer (DXL). According to one embodiment, designating a set of objects as good or bad can be achieved via a single administrative action by leveraging persistent client initiated connections to the DXL framework. This may enable communication of the reputation updates across a heterogeneous infrastructure, including systems potentially unreachable by the server, such as those behind a firewall or NAT.",
  "publication_number": "US20160205073A1-20160714",
  "_processing_info": {
    "original_size": 83604,
    "optimized_size": 3175,
    "reduction_percent": 96.2
  }
}