{
  "decision": "REJECTED",
  "application_number": "14915647",
  "date_published": "20160922",
  "date_produced": "20160908",
  "title": "METHOD OF ROTATING A PICTURE WITH A MOBILE TERMINAL AND MOBILE TERMINAL",
  "filing_date": "20160301",
  "inventor_list": [
    {
      "inventor_name_last": "TIAN",
      "inventor_name_first": "Hongqi",
      "inventor_city": "Shenzhen, Guangdong",
      "inventor_state": "",
      "inventor_country": "CN"
    },
    {
      "inventor_name_last": "FENG",
      "inventor_name_first": "Jihong",
      "inventor_city": "Shenzhen, Guangdong",
      "inventor_state": "",
      "inventor_country": "CN"
    },
    {
      "inventor_name_last": "MENG",
      "inventor_name_first": "Lulu",
      "inventor_city": "Shenzhen, Guangdong",
      "inventor_state": "",
      "inventor_country": "CN"
    }
  ],
  "ipcr_labels": [
    "G06F30484",
    "G06T360",
    "G06T300"
  ],
  "main_ipcr_label": "G06F30484",
  "summary": "<SOH> SUMMARY OF THE DISCLOSURE <EOH>A primary technical problem to be addressed by the present disclosure is to provide a method of rotating a picture with a smart terminal and a smart terminal, capable of quickly rotating the picture to the desired angle of the user and thus enhancing the user experience. To address the aforementioned technical problem, a technical solution adopted by the present disclosure follows as below: to provide a method of rotating a picture with a smart terminal, the method comprising: detecting, by the smart terminal, that a touch operation applied on a picture displayed on a screen of the smart terminal comprises at least two touch points, and, when a trajectory of each of the at least two touch points is an arc, determining the touch operation to be an operation of rotating the picture; determining a rotation angle of the touch operation, based on the trajectories of the at least two touch points; and rotating, synchronously, the picture in accordance with a rotation direction of the trajectories and the rotation angle. The method may further comprise, before the step of rotating synchronously the picture in accordance with the rotation direction of the trajectories and the rotation angle: determining whether the rotation angle exceeds a threshold angle value; when the rotation angle exceeds the threshold angle value, synchronously rotating the picture in accordance with the rotation direction of the trajectories and the rotation angle. The method may further comprise, after the step of when the rotation angle exceeds the threshold angle value, synchronously rotating the picture in accordance with the rotation direction of the rotation action and the rotation angle: determining, among a plurality of preset angles, a first preset angle which has a minimum absolute value of difference with the rotation angle after the synchronous rotation, and rotating the picture to a position the first preset angle. The plurality of preset angles may c...",
  "patent_number": "None",
  "abstract": "A method and a smart terminal for rotating a picture are disclosed. The method includes steps of: detecting, by the smart terminal, that a touch operation applied on the picture displayed on a screen of the smart terminal includes at least two touch points, and, when a trajectory of each of the at least two touch points is an arc, determining the touch operation to be an operation of rotating the picture, and rotating synchronously the picture in accordance with the rotation direction of the trajectories and the rotation angle. By the aforementioned means, in the present disclosure the picture can be quickly rotated to the desired angle of the user, thereby enhancing the user experience.",
  "publication_number": "US20160274768A1-20160922",
  "_processing_info": {
    "original_size": 61998,
    "optimized_size": 3593,
    "reduction_percent": 94.2
  }
}