{
  "decision": "ACCEPTED",
  "application_number": "14910629",
  "date_published": "20160623",
  "date_produced": "20160608",
  "title": "CAPACITIVE TOUCH SYSTEM",
  "filing_date": "20160205",
  "inventor_list": [
    {
      "inventor_name_last": "BALLAN",
      "inventor_name_first": "Hussein",
      "inventor_city": "St-Legier",
      "inventor_state": "",
      "inventor_country": "CH"
    },
    {
      "inventor_name_last": "BAUSER",
      "inventor_name_first": "Philippe",
      "inventor_city": "Divonne-les-Bain",
      "inventor_state": "",
      "inventor_country": "FR"
    }
  ],
  "ipcr_labels": [
    "G06F3044",
    "G06F3038",
    "G06F3041",
    "G06F30354"
  ],
  "main_ipcr_label": "G06F3044",
  "summary": "<SOH> BRIEF SUMMARY OF THE INVENTION <EOH>According to the invention, this aim is achieved by means of a capacitive touch system and a method for a capacitive touch system according to the appended claims. The capacitive touch system according to the invention comprises: an active stylus, this active stylus comprising an oscillator configured so as to continuously emit a signal, a capacitive touch device configured to be in a reset phase, followed by a finger touch sensing phase, different from this reset phase, finger touches being sensed exclusively during this finger touch sensing phase. Advantageously the capacitive touch device is configured to sense the signal from the active stylus during the reset phase. Advantageously the capacitive touch device is configured to sense the signal from the active stylus exclusively during the reset phase. In the context of the present invention, the expression “continuously emits a signal” means that, once powered and not in stand-by mode, the active stylus transmits a signal without interruption, at least when in operation above a capacitive touch device. As discussed, the detection of the finger touches relies on the use of relatively large signal swings initiated by the charge drivers 203 and processed by the charge sensors 204 . These activities happen during dedicated time slots, during which the useful stylus signal is difficult to differentiate from the normal finger touch charge conversion outputs. An advantageous aspect of the present invention consists in avoiding these dedicated time slots for processing the stylus signal. In other words the charge sense amplifier is configured so as to sense the possible presence of one or more fingers on the capacitive touch device during a finger touch sensing phase (or mode) and to sense the signal from an active stylus in a reset phase (or mode) wherein finger touches are not sensed. In this reset phase (or mode) the input of the charge sensor amplifier of the charge sensor is...",
  "patent_number": "9933904",
  "abstract": "The invention concerns a capacitive touch system comprising: an active stylus (800) configured so as to continuously emit a signal a capacitive touch device (200) configured to be in a reset phase (1000), followed by a finger touch sensing phase (2000), the finger touches being sensed exclusively during the finger touch sensing phase (2000). The capacitive touch device (200) is configured to sense the signal from the active stylus (800) during the reset phase (1000). The capacitive touch device (200) comprises at least one charge sensor (208, 213) comprising a charge sensor amplifier (305) comprising an input (CSi) and an output (csaout), and a switch (Sw1) between this input (CSi) and this output (csaout). The charge sensor amplifier (305) is arranged for conveying the signal of the active stylus (800) through a non-zero resistance value (Ron) of the switch (Sw1) during the reset phase (1000).",
  "publication_number": "US20160179249A1-20160623",
  "_processing_info": {
    "original_size": 57161,
    "optimized_size": 3625,
    "reduction_percent": 93.66
  }
}