{
  "decision": "PENDING",
  "application_number": "14910279",
  "date_published": "20160623",
  "date_produced": "20160608",
  "title": "INFORMATION DISPLAY APPARATUS",
  "filing_date": "20160205",
  "inventor_list": [
    {
      "inventor_name_last": "ANDO",
      "inventor_name_first": "Hiroshi",
      "inventor_city": "Kariya-city",
      "inventor_state": "",
      "inventor_country": "JP"
    },
    {
      "inventor_name_last": "KASHIWADA",
      "inventor_name_first": "Shinji",
      "inventor_city": "Kariya-city",
      "inventor_state": "",
      "inventor_country": "JP"
    }
  ],
  "ipcr_labels": [
    "G02B2701",
    "G06K900",
    "B60R100",
    "H04N931"
  ],
  "main_ipcr_label": "G02B2701",
  "summary": "<SOH> SUMMARY OF INVENTION <EOH>Generally, a moving body such as an automobile has a limited installation space for an information display apparatus, so that the information display apparatus is desired to be smaller. However, with the information display apparatus described in Patent Literature 1, it is necessary to use two image projectors to form an image at each of different distances from the driver, so that there is a problem that the device configuration is increased in size. In other words, with the conventional information display apparatus, it is difficult to form virtual images at different distances from the driver without causing an increase in size of the device configuration. An object of the present disclosure is to enable an information display apparatus to form virtual images at different distances from a driver without causing an increase in size of the device configuration. The present disclosure relates to an information display apparatus that reflects light representing information off a projection target, thereby displays the information as a virtual image. The information display apparatus related to an aspect of the present disclosure includes a projector, an image forming device and a focus adjusting device. The projector projects the light representing the information. With regard to the image forming device, at least two image forming devices, to which the light emitted from the projector is projected, that are disposed on an optical path from the projector to the projection target. In addition, at least one of the at least two image forming devices is disposed at a distance from the projector different from a distance between the projector and remaining of the at least two image forming devices. The focus adjusting device adjusts a focal length of one optical system disposed on an optical path from the projector to each of the at least two image forming devices such that the light emitted from the projector is in focus at each of the at ...",
  "patent_number": "None",
  "abstract": "An information display apparatus reflects light representing information off a projection target to display the information as a virtual image, and includes a projector, at least two image forming devices and a focus adjusting device. The projector projects the light representing information. The image forming devices, to which the light from the projector is projected, are on an optical path from the projector to the projection target. At least one of the image forming devices is at a distance from the projector different from that of other image forming devices. The focus adjusting device adjusts a focal length of one optical system on an optical path from the projector to each of the image forming devices such that the light from the projector is in focus at each of the image forming devices. An image of information on each of the image forming devices is reflected off the projection target.",
  "publication_number": "US20160178902A1-20160623",
  "_processing_info": {
    "original_size": 66664,
    "optimized_size": 3609,
    "reduction_percent": 94.59
  }
}