{
  "decision": "PENDING",
  "application_number": "14915493",
  "date_published": "20160721",
  "date_produced": "20160706",
  "title": "SYSTEM AND METHOD FOR RACK MOUNTABLE MODULAR DC POWER UNIT",
  "filing_date": "20160229",
  "inventor_list": [
    {
      "inventor_name_last": "WILCOX",
      "inventor_name_first": "Eric",
      "inventor_city": "Cedar Park",
      "inventor_state": "TX",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "KIPPLEY",
      "inventor_name_first": "Bob",
      "inventor_city": "Eagan",
      "inventor_state": "MN",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "SCHNEIDER",
      "inventor_name_first": "Matthew",
      "inventor_city": "Jersey City",
      "inventor_state": "NJ",
      "inventor_country": "US"
    }
  ],
  "ipcr_labels": [
    "G06F130"
  ],
  "main_ipcr_label": "G06F130",
  "summary": "<SOH> SUMMARY <EOH>In one aspect the present disclosure relates to a modular power unit having a form factor enabling mounting in at least one of a plurality of component locations of an equipment rack. The modular power unit provides DC power to a DC bus of the equipment rack. The modular power unit may have a chassis defining a plurality of slots into which a plurality of DC power supplies may be inserted. An AC input module may be used for receiving AC power from an external AC power source. A plurality of independent, modular DC power supplies, each having a form factor enabling insertion and mounting in one of the slots of the chassis, may be mounted in the chassis. A controller may be in communication with the DC power supplies and housed within the chassis. A DC bus housed within the chassis communicates with the DC power supplies and supplies DC output power from the DC power supplies to a separate DC bus housed within the equipment rack. In another aspect the present disclosure relates to a modular power unit having a form factor enabling mounting in one or more of a plurality of component locations of an equipment rack. The modular power unit provides direct current (DC) power to a DC bus of the equipment rack which is supplying DC power to one or more equipment components mounted in other ones of the component locations of the equipment rack. The modular power unit may comprise a chassis defining a plurality of parallel arranged slots into which a plurality of independent DC power supplies may be inserted. An alternating current (AC) module may be disposed within the chassis for receiving AC power from an external AC power source. A plurality of independent, modular DC power supplies may be included which have a common form factor enabling insertion and mounting in any one of the slots of the chassis. The modular DC power supplies may include at least one rectifier module. A controller may be in communication with the plurality of DC power supplies and ho...",
  "patent_number": "None",
  "abstract": "The present disclosure relates to a modular DC power unit having a form factor enabling mounting in at least one of a plurality of component locations of an equipment rack. The modular DC power unit provides DC power to a DC bus of the equipment rack. The modular DC power unit may have a chassis defining a plurality of slots into which a plurality of DC power supplies may be inserted. An AC input module may be used for receiving AC power from an external AC power source. A plurality of independent, modular DC power supplies, each having a form factor enabling insertion and mounting in one of the slots of the chassis, may be mounted in the chassis. A controller may be in communication with the DC power supplies and housed within the chassis. A DC bus housed within the chassis communicates with the DC power supplies and supplies DC output power from the DC power supplies to the separate DC bus housed within the equipment rack.",
  "publication_number": "US20160209901A1-20160721",
  "_processing_info": {
    "original_size": 61135,
    "optimized_size": 3778,
    "reduction_percent": 93.82
  }
}