{
  "decision": "REJECTED",
  "application_number": "14912614",
  "date_published": "20160721",
  "date_produced": "20160706",
  "title": "NESTING METHOD AND APPARATUS",
  "filing_date": "20160218",
  "inventor_list": [
    {
      "inventor_name_last": "VAN DEN BRANDEN",
      "inventor_name_first": "Kurt",
      "inventor_city": "Mortsel",
      "inventor_state": "",
      "inventor_country": "BE"
    }
  ],
  "ipcr_labels": [
    "G06F312"
  ],
  "main_ipcr_label": "G06F312",
  "summary": "<SOH> SUMMARY OF THE INVENTION <EOH>There has been room for improvement in the prior art for nesting content of print jobs wherein the content extension areas partial overlaps. This improvement makes it possible to solve erroneous nested print jobs, wherein the content extension areas partial overlaps, still to produce by printing and finishing. It is also a method to improve automatic nesting methods to reduce substrate waste and enhance the production timings of print jobs when the automatic nesting method is based on the content area of the print jobs and not on the content extension area because the method solves partial overlap of content extension areas between print jobs. A preferred embodiment of the nesting method, performed by a processing apparatus, comprising the steps of obtaining a first and second print job wherein the first print job has a first content area (CT 1 ) ( 12 ), defined by a first content path and a first content extension area (CTE 1 ) ( 11 ), defined by a first content extension path and wherein the second print job has a second content area (CT 2 ) ( 22 ), defined by a second content path and a second content extension area (CTE 2 ) ( 21 ), defined by a second content extension path and wherein the first content extension area (CTE 1 ) ( 11 ) has a partial overlap with the second content extension area (CTE 2 ) ( 21 ); and determining a first intersection area (J) ( 50 ) between (i) the first content extension area (CTE 1 ) ( 11 ) minus the second content extension area (CTE 2 ) plus the first content area (CT 1 ) ( 12 ) and; (ii) the first content extension area (CTE 1 ) ( 11 ) minus the second content area (CT 2 ) ( 22 ) plus the first content area (CT 1 ) ( 12 ); and replacing the first content extension area (CTE 1 ) ( 11 ) with a third content extension area (CTE 3 ) ( 31 ) and the second content extension area (CTE 2 ) ( 21 ) with a fourth content extension area (CTE 4 ) ( 41 ); and characterized that the ratio between (A) the su...",
  "patent_number": "None",
  "abstract": "A processing apparatus performs a nesting method by solving partial overlap in content extension areas of print jobs after nesting. The nesting method replaces the content extension areas of nested print jobs which have a partial overlap with new content extension areas to reduce substrate waste and enhance the production timings.",
  "publication_number": "US20160210088A1-20160721",
  "_processing_info": {
    "original_size": 111382,
    "optimized_size": 2853,
    "reduction_percent": 97.44
  }
}