{
  "decision": "PENDING",
  "application_number": "14917768",
  "date_published": "20160804",
  "date_produced": "20160720",
  "title": "SELECTIVELY-ENABLED BACK-UP POWER",
  "filing_date": "20160309",
  "inventor_list": [
    {
      "inventor_name_last": "Nguyen",
      "inventor_name_first": "Hai Ngoc",
      "inventor_city": "Spring",
      "inventor_state": "TX",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Wang",
      "inventor_name_first": "Han",
      "inventor_city": "Sugar Land",
      "inventor_state": "TX",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Raymond",
      "inventor_name_first": "Patrick A.",
      "inventor_city": "Houston",
      "inventor_state": "TX",
      "inventor_country": "US"
    }
  ],
  "ipcr_labels": [
    "G06F130",
    "G06F128"
  ],
  "main_ipcr_label": "G06F130",
  "summary": "<SOH> BRIEF DESCRIPTION OF THE DRAWINGS <EOH>The detailed description section references the drawings, wherein: FIG. 1 is a block diagram of an example back-up power apparatus including a back-up power control module to selectively-enable the output of back-up power; FIG. 2 is a block diagram of an example system including a back-up power subsystem including a back-up power control module to selectively-enable the output of back-up power; and FIG. 3 - FIG. 8 are flowcharts of example methods for selectively enabling the output of back-up power by a back-up power apparatus; all in which various embodiments may be implemented detailed-description description=\"Detailed Description\" end=\"lead\"?",
  "patent_number": "None",
  "abstract": "Described are examples of back-up power apparatuses and systems including such back-up power apparatuses. An example may include a battery module, and a back-up power control module to determine a back-up power demand of a host device and selectively enable an output of power from the battery module to the host device if the battery module has a power capacity greater than the back-up power demand.",
  "publication_number": "US20160224088A1-20160804",
  "_processing_info": {
    "original_size": 31960,
    "optimized_size": 1926,
    "reduction_percent": 93.97
  }
}