{
  "decision": "PENDING",
  "application_number": "14917945",
  "date_published": "20160728",
  "date_produced": "20160713",
  "title": "Proteomics Analysis and Discovery through DNA and RNA Sequencing, Systems and Methods",
  "filing_date": "20160309",
  "inventor_list": [
    {
      "inventor_name_last": "Rabizadeh",
      "inventor_name_first": "Shahrooz",
      "inventor_city": "Los Angeles",
      "inventor_state": "CA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Soon-Shiong",
      "inventor_name_first": "Patrick",
      "inventor_city": "Culver City",
      "inventor_state": "CA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Benz",
      "inventor_name_first": "Stephen Charles",
      "inventor_city": "Santa Cruz",
      "inventor_state": "CA",
      "inventor_country": "US"
    }
  ],
  "ipcr_labels": [
    "C12Q168",
    "G06F1922"
  ],
  "main_ipcr_label": "C12Q168",
  "summary": "<SOH> SUMMARY OF THE INVENTION <EOH>The inventive subject matter provides apparatus, systems and methods in which a plurality of genetic markers are identified by sequencing of DNA, RNA, and/or cDNA obtained from a sample, and associated with a tumor or neoplasm by comparison to a catalog of known mutations and their frequency of association with neoplasms. In particular a specific mutation in FGFR3 and a specific mutation in TP53 and their association with breast cancer is identified. This association can be determined without comparison of such sequence data to sequences derived from non-neoplastic tissue, in particular non-neoplastic tissue from the same subject. Such a plurality of markers can have diagnostic and/or prognostic utility in diagnostic applications for tumor or neoplasm identification or susceptibility. One embodiment of the inventive concept is a method of identifying an individual that is susceptible to breast cancer by obtaining a tissue sample from the individual, performing a genetic analysis, and identifying mutations in the FGFR3 gene at the position corresponding to amino acid 249 and at the position in the TP53 gene corresponding to amino acid 272. This identification is made without reference to a second tissue sample taken from the individual. The genomic analysis can be a sequence analysis of genomic DNA, mRNA, and/or a cDNA transcript of mRNA from which at least one intron has been excised. In a preferred embodiment of the inventive concept, the FGFR3 mutation is an S249C mutation. In another preferred embodiment the TP53 mutation is a V272M mutation. Identification of both of these genetic markers indicates that the individual has developed and/or is susceptible to developing breast cancer. Another embodiment of the inventive concept is a method of identifying a tissue sample as having originated from a breast cancer or neoplasm. A tissue sample is obtained from the suspect tissue of an individual, and a genetic analysis is performed. ...",
  "patent_number": "None",
  "abstract": "Specific mutations of FGFR3 (S249C) and of TP53 (V272M) are identified as being characteristic of breast cancer, and of having utility in diagnosis and prognosis of an individual with breast cancer. Systems and methods useful for identification of such mutations are also presented.",
  "publication_number": "US20160215350A1-20160728",
  "_processing_info": {
    "original_size": 43934,
    "optimized_size": 3185,
    "reduction_percent": 92.75
  }
}