{
  "decision": "PENDING",
  "application_number": "14917912",
  "date_published": "20160728",
  "date_produced": "20160713",
  "title": "METHOD AND APPARATUS FOR MISALIGNMENT BETWEEN DEVICE AND PEDESTRIAN USING VISION",
  "filing_date": "20160309",
  "inventor_list": [
    {
      "inventor_name_last": "Kazemipur",
      "inventor_name_first": "Bashir",
      "inventor_city": "Calgary",
      "inventor_state": "",
      "inventor_country": "CA"
    },
    {
      "inventor_name_last": "Syed",
      "inventor_name_first": "Zainab",
      "inventor_city": "Calgary",
      "inventor_state": "",
      "inventor_country": "CA"
    },
    {
      "inventor_name_last": "Georgy",
      "inventor_name_first": "Jacques",
      "inventor_city": "Calgary",
      "inventor_state": "",
      "inventor_country": "CA"
    },
    {
      "inventor_name_last": "El-Sheimy",
      "inventor_name_first": "Naser",
      "inventor_city": "Calgary",
      "inventor_state": "",
      "inventor_country": "CA"
    }
  ],
  "ipcr_labels": [
    "G01C2116",
    "G06T720"
  ],
  "main_ipcr_label": "G01C2116",
  "summary": "<SOH> SUMMARY <EOH>The present disclosure relates to a method and apparatus for determining the misalignment between a device and a pedestrian, wherein the pedestrian can carry, hold, or use the device in different orientations in a constrained or unconstrained manner, and wherein the device includes an optical sensor or camera. The optical sensors have a corresponding frame for the optical sensors' axes. The misalignment between the device and the pedestrian corresponds to the misalignment between the frame of the optical sensor or camera in the device and the frame of the pedestrian. The present method and apparatus can work whether in the presence or in the absence of navigational information updates (such as, for example, Global Navigation Satellite System (GNSS) or WiFi positioning). The present method and apparatus can work with various types of walkers with their different gaits and speeds. It can work with slow walking, normal walking or fast walking. Also, it can work with various types of runners with their different gaits and speeds. The present method and apparatus can work with different device usages and orientations with respect to the pedestrian. For the purposes of this specification, the different usages and orientations of the device are defined as “device use cases”. The use cases can include, for example: (i) handheld with all the different possible orientations including compass, texting portrait, texting landscape, or any arbitrary orientation (including any roll, pitch and heading); (ii) hand dangling (also called hand swinging) in any orientation whether horizontal or vertical, and in various types of dangling including very light, light, normal, or strong swinging; (iii) ear, which means the pedestrian holds the device on or near his ear for listening/talking in any orientation including horizontal, vertical or tilted. In all device usages and orientations, the present method can work with any roll, pitch, and azimuth (heading) angles of th...",
  "patent_number": "None",
  "abstract": "The present disclosure relates to a method and apparatus for determining the misalignment between a device and a pedestrian, wherein the pedestrian can carry, hold, or use the device in different orientations in a constrained or unconstrained manner, and wherein the device includes an optical sensor or camera. The optical sensors have a corresponding frame for the optical sensors' axes. The misalignment between the device and the pedestrian means the misalignment between the frame of the optical sensor assembly or camera in the device and the frame of the pedestrian. The present method and apparatus can work whether in the presence or in the absence of absolute navigational information updates (such as, for example, Global Navigation Satellite System (GNSS) or WiFi positioning).",
  "publication_number": "US20160216118A1-20160728",
  "_processing_info": {
    "original_size": 93869,
    "optimized_size": 3810,
    "reduction_percent": 95.94
  }
}