{
  "date_produced": "20160628",
  "publication_number": "US20160203404A1-20160714",
  "main_ipcr_label": "G06N504",
  "decision": "PENDING",
  "application_number": "14917074",
  "inventor_list": [
    {
      "inventor_name_last": "Cherkasova",
      "inventor_name_first": "Ludmila",
      "inventor_city": "Sunnyvale",
      "inventor_state": "CA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Gupta",
      "inventor_name_first": "Chetan Kumar",
      "inventor_city": "San Mateo",
      "inventor_state": "CA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Simitsis",
      "inventor_name_first": "Alkiviadis",
      "inventor_city": "Santa Clara",
      "inventor_state": "CA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Wang",
      "inventor_name_first": "Jianqiang",
      "inventor_city": "Palo Alto",
      "inventor_state": "CA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Wilkinson",
      "inventor_name_first": "William K.",
      "inventor_city": "San Mateo",
      "inventor_state": "CA",
      "inventor_country": "US"
    }
  ],
  "abstract": "Example embodiments relate to predicting execution times of concurrent queries. In example embodiments, historical data is iteratively generated for a machine learning model by varying a concurrency level of query executions in a database, determining a query execution plan for a pending concurrent query, extracting query features from the query execution plan, and executing the pending concurrent query to determine a query execution time. The machine learning model may then be created based on the query features, variation in the concurrency level, and the query execution time. The machine learning model is used to generate an execution schedule for production queries, where the execution schedule satisfies service level agreements of the production queries.",
  "filing_date": "20160307",
  "patent_number": "None",
  "summary": "<SOH> BRIEF DESCRIPTION OF THE DRAWINGS <EOH>The drawing detailed description references the drawings, wherein: FIG. 1 is a block diagram of an example computing device for predicting execution times of concurrent queries; FIG. 2 is a block diagram of an example computing device in communication with a database for predicting execution times of concurrent queries; FIG. 3 is a flowchart of an example method for execution by a computing device for predicting execution times of concurrent queries; FIG. 4 is a flowchart of an example method for execution by a computing device for generating historic data and then predicting execution times of concurrent queries in production; FIG. 5 is a flowchart of an example workflow for creating a machine learning model for predicting execution times of concurrent queries; and FIG. 6 is a diagram of an example query execution plan. detailed-description description=\"Detailed Description\" end=\"lead\"?",
  "date_published": "20160714",
  "title": "PREDICTING EXECUTION TIMES OF CONCURRENT QUERIES",
  "ipcr_labels": [
    "G06N504",
    "G06N9900"
  ],
  "_processing_info": {
    "original_size": 38834,
    "optimized_size": 2878,
    "reduction_percent": 92.59
  }
}