{
  "decision": "PENDING",
  "application_number": "14916483",
  "date_published": "20160707",
  "date_produced": "20160622",
  "title": "METHOD OF AND SYSTEM FOR GAMING",
  "filing_date": "20160303",
  "inventor_list": [
    {
      "inventor_name_last": "LECH",
      "inventor_name_first": "Janusz",
      "inventor_city": "Gumpoldskirchen",
      "inventor_state": "",
      "inventor_country": "AT"
    }
  ],
  "ipcr_labels": [
    "G06Q2036",
    "G06Q2040"
  ],
  "main_ipcr_label": "G06Q2036",
  "summary": "<SOH> SUMMARY OF THE INVENTION <EOH>This invention provides systems and methods for true cashless gaming experience respectively gaming experience without involving any items to be carried or applied by the user by utilizing biometric user recognition and a single electronic wallet (e-wallet) environment. According to the invention a gaming system is provided comprising a gaming server, and a plurality of user terminals, the gaming server and the gaming machines being connected via a network; the gaming server providing a database to store a plurality of records, each record having an account number as a key value; each of the gaming machines comprising a biometric interface for requesting a user's biometric data for storing with the account; and means for handling e-wallet cash information of the user; and wherein at least one user terminal is adapted as a cash out terminal to provide cash payout of the users e-wallet to the user upon authentication by means of the biometric interface and the stored biometric data. Ideally a software program is introduced and stored on the gaming machine, or on a network server, to enable the gaming machine to utilize biometric and e-wallet features. The software program may include firmware. In one embodiment, the gaming device may also include at least one payment device in communication with the processor. A payment device such as a payment acceptor may include a note, ticket or bill acceptor wherein the player inserts paper money, a ticket, or voucher and a coin slot where the player inserts money, coins, or tokens. In other embodiments, payment devices such as readers or validators for credit cards, debit cards or credit slips may accept payment. In one embodiment, a player may insert an identification card into a card reader of the gaming device wherein the identification card may be a smart card comprising a programmed microchip and a biometric (fingerprint) sensor. In another embodiment, a player may carry a portable device...",
  "patent_number": "None",
  "abstract": "A gaming system having a gaming server, and a plurality of user terminals, the gaming server and the gaming machines being connected via a network. The gaming server providing a database to store a plurality of records, each record having an account number as a key value; each of the gaming machines including a biometric interface for requesting a user's biometric data for storing with the account. A system is provided for handling e-wallet cash information of the user. Wherein at least one user terminal is adapted as a cash out terminal to provide cash payout of the users e-wallet to the user upon authentication by way of the biometric interface and the stored biometric data.",
  "publication_number": "US20160196551A1-20160707",
  "_processing_info": {
    "original_size": 32741,
    "optimized_size": 3221,
    "reduction_percent": 90.16
  }
}