{
  "date_produced": "20160628",
  "publication_number": "US20160203401A1-20160714",
  "main_ipcr_label": "G06N3063",
  "decision": "PENDING",
  "application_number": "14910984",
  "inventor_list": [
    {
      "inventor_name_last": "DURANTON",
      "inventor_name_first": "Marc",
      "inventor_city": "ORSAY",
      "inventor_state": "",
      "inventor_country": "FR"
    },
    {
      "inventor_name_last": "PHILIPPE",
      "inventor_name_first": "Jean-Marc",
      "inventor_city": "GIF-SUR-YVETTE",
      "inventor_state": "",
      "inventor_country": "FR"
    },
    {
      "inventor_name_last": "PAINDAVOINE",
      "inventor_name_first": "Michel",
      "inventor_city": "PLOMBIERES LES DIJON",
      "inventor_state": "",
      "inventor_country": "FR"
    }
  ],
  "abstract": "An implementation of neural networks on silicon for the processing of various signals comprises multidimensional signals such as images. The efficient implementation on silicon of a complete processing chain for the signal via the approach using neural networks is provided. The circuit comprises at least: a series of neuro-blocks grouped together in branches composed of a group of neuro-blocks and a broadcasting bus, the neuro-blocks connected to the broadcasting bus; a routing unit connected to the broadcasting bus of the branches, carrying out the routing and broadcasting of data to and from the branches; a transformation module connected to the routing unit via an internal bus and designed to be connected at the input of the circuit to an external databus, the module carrying out the transformation of input data into serial coded data. The processing operations internal to the circuit are carried out according to a serial communications protocol.",
  "filing_date": "20160208",
  "patent_number": "None",
  "summary": "",
  "date_published": "20160714",
  "title": "ELECTRONIC CIRCUIT, IN PARTICULAR CAPABLE OF IMPLEMENTING A NEURAL NETWORK, AND NEURAL SYSTEM",
  "ipcr_labels": [
    "G06N3063"
  ],
  "_processing_info": {
    "original_size": 36072,
    "optimized_size": 1854,
    "reduction_percent": 94.86
  }
}