{
  "decision": "ACCEPTED",
  "application_number": "14916179",
  "date_published": "20161103",
  "date_produced": "20161019",
  "title": "Method and Apparatus for Modulating Haptic Feedback",
  "filing_date": "20160302",
  "inventor_list": [
    {
      "inventor_name_last": "Long",
      "inventor_name_first": "Benjamin John Oliver",
      "inventor_city": "Bristol",
      "inventor_state": "",
      "inventor_country": "GB"
    },
    {
      "inventor_name_last": "Carter",
      "inventor_name_first": "Thomas Andrew",
      "inventor_city": "Bristol",
      "inventor_state": "",
      "inventor_country": "GB"
    },
    {
      "inventor_name_last": "Subramanian",
      "inventor_name_first": "Sriram",
      "inventor_city": "Bristol",
      "inventor_state": "",
      "inventor_country": "GB"
    }
  ],
  "ipcr_labels": [
    "G06F301",
    "G08B600"
  ],
  "main_ipcr_label": "G06F301",
  "summary": "<SOH> SUMMARY OF THE INVENTION <EOH>The present invention provides, according to a first aspect, a method of creating haptic feedback using ultrasound comprising the steps of: generating a plurality of ultrasound waves with a common focal point using a phased array of ultrasound transducers, the common focal point being a haptic feedback point, modulating the generation of the ultrasound waves using a waveform selected to produce little or no audible sound at the haptic feedback point. The method may comprise the step of generating a plurality of common focal points, each common focal point being a haptic feedback point. The production of little or no audible sound at a haptic feedback point is dependent on both the loudness of any sound produced, together with the frequency at which any sound is produced. A small amount of audible sound may be produced, and considered acceptable. The acceptability of the sound produced by the creation of haptic feedback may be dependent on the background noise audible at the haptic feedback point. In a noisy environment, the acceptable level of sound produced at the haptic feedback point may be greater than the acceptable level of sound produced in a quiet environment. Therefore, the intended use of the haptic feedback system creating the haptic feedback and the environment in which the system is located will determine the acceptable level of sound production. At high intensities, ultrasound becomes non-linear. This non-linear behaviour allows the creation of haptic feedback but also causes the audible sound produced in haptic feedback systems. An example of the effect of the non-linearity of ultrasound waves is utilising the effect to create highly directive audible sound with parametric speakers. The sound is produced due to the second derivative of the p 2 term of the Westervelt equation. ∇ 2  p + δ c 0 4  ∂ 3  p ∂ t 3 + β ρ 0  c 0 4  ∂ 2  p 2 ∂ t 2 - 1 c 0 2  ∂ 2  p ∂ t 2 = 0 ( Eq .  1 ) Where p is the sound pressure, ...",
  "patent_number": "9958943",
  "abstract": "The present invention concerns a method and apparatus for the modulation of an acoustic field for providing tactile sensations. A method of creating haptic feedback using ultrasound is provided. The method comprises the steps of generating a plurality of ultrasound waves with a common focal point using a phased array of ultrasound transducers, the common focal point being a haptic feedback point, and modulating the generation of the ultrasound waves using a waveform selected to produce little or no audible sound at the haptic feedback point.",
  "publication_number": "US20160320843A1-20161103",
  "_processing_info": {
    "original_size": 37946,
    "optimized_size": 3503,
    "reduction_percent": 90.77
  }
}