{
  "date_produced": "20160622",
  "publication_number": "US20160196489A1-20160707",
  "main_ipcr_label": "G06N3067",
  "decision": "PENDING",
  "application_number": "14916127",
  "inventor_list": [
    {
      "inventor_name_last": "GUILLANNEUF",
      "inventor_name_first": "FREDERIC ALEXANDRE",
      "inventor_city": "EINDHOVEN",
      "inventor_state": "",
      "inventor_country": "NL"
    },
    {
      "inventor_name_last": "KRIJN",
      "inventor_name_first": "MARCELLINUS PETRUS CAROLUS MICHAEL",
      "inventor_city": "EINDHOVEN",
      "inventor_state": "",
      "inventor_country": "NL"
    }
  ],
  "abstract": "The present invention relates to an optical device (101, 201, 305). The present invention may be implemented as optical artificial neurons. The optical device comprises an optically transmissive light-receiving device (102) which may be a photodiode, an optically transmissive light-emitting device (104, 304) such as a light-emitting diode, an optically transmissive processor (103) comprising a memory storage device (106). The light-emitting device and the light-receiving device are electrically connected to the processor which is configured to control the light-emitting device to emit an optical signal (307, 313) based on a first optical signal received by the light-receiving device. The optical device comprises an address which is transmitted with the optical signal. The address of may be recognized by the processor when processing a received optical signal and is used by the processor to determine to control the light-emitting device to emit an optical signal or not.",
  "filing_date": "20160302",
  "patent_number": "None",
  "summary": "<SOH> SUMMARY OF THE INVENTION <EOH>In view of the above-mentioned and other drawbacks of the prior art, a general object of the present invention is to provide an optical device with more flexible communication between two or more optical devices. Such optical devices may be implemented as optical artificial neurons. According to a first aspect of the invention there is provided an optical device comprising: an optically transmissive light-emitting device; an optically transmissive light-receiving device; and an optically transmissive control unit electrically connected to the light-emitting device and to the light-receiving device; wherein the control unit is configured to control the light-emitting device to emit an optical signal based on at least one optical signal received by the light-receiving device. An optically transmissive component is a component that may allow for at least enough of an optical signal to pass through a material of the component such that the optical signal may accurately be received by the light-receiving device. Optically transmissive may be e.g. transparent, semi-transparent, translucent, or combinations thereof. The processing unit determines to control the light-emitting device to emit an optical signal based on properties of optical signals received by the light-receiving device of the optical device. The present invention is based on the realization that by using components made from optically transmissive materials, a light-emitting device arranged in the optical device may emit optical signals in several directions which enables communication with more than one other light-receiving device. With such an optical device, the components arranged therein may communicate with other optical devices through optical signals which will not be obstructed by the optically transmissive components of the optical devices. The invention enables flexibility in designing a structure and in the layout of an optical device which is independent of ...",
  "date_published": "20160707",
  "title": "ARTIFICIAL NEURON",
  "ipcr_labels": [
    "G06N3067"
  ],
  "_processing_info": {
    "original_size": 41032,
    "optimized_size": 3678,
    "reduction_percent": 91.04
  }
}