{
  "date_produced": "20160628",
  "publication_number": "US20160203402A1-20160714",
  "main_ipcr_label": "G06N502",
  "decision": "PENDING",
  "application_number": "14916698",
  "inventor_list": [
    {
      "inventor_name_last": "Hanlon",
      "inventor_name_first": "Robert Paul",
      "inventor_city": "Stroudsburg",
      "inventor_state": "PA",
      "inventor_country": "US"
    }
  ],
  "abstract": "Client decision-making behavioral preferences for evaluating or coping with unknown outcomes (risk temperament or “RT”) and absorbing information (preference typology or “PT”) during decision-making events are identified and classified by processing client responses to questions. Behavioral preferences are classified and stored in a behavior-influenced decision-making data set (BDDS). The simulator also receives an objective decision-making data set (ODDS) of factually objective inputs. The simulator combines and triangulates the PT and RT information contained in the BDSS with the ODDS and derives a new data set of resultant output goals (OGDS). The transformed OGDS output is displayed as a triangulation of the simulator's RT, PT, and ODDS, with a balanced OGDS displayed as a bubble or spirit level. Out of balance status identifies deviation from intended outcome. OGDS decision-making tools can be recursively combined as modular blocks to create decision-making tools for other desired...",
  "filing_date": "20160304",
  "patent_number": "None",
  "summary": "<SOH> SUMMARY <EOH>A simulator identifies and classifies a client's decision-making behavioral preferences, moods, or attitudes for coping with unknown outcomes by and absorbing information, by processing client responses to sets of questions, including psychologically validated open-ended questions. The simulator generates a reusable, modular client behavior-influenced decision-making data set (BDDS), which classifies the client's individual behavioral preferences for evaluating unknown outcomes and absorbing information during decision-making events. The BDDS is stored for subsequent use in present or future client treatment planning. The simulator also receives an objective decision-making data set (ODDS) of factually objective decision-making inputs. The simulator combines the psychological and behavioral preference criteria information in the BDSS with the factually objective information in the ODDS and derives a new transformed data set of resultant output goals (OGDS). The simulator's OGDS facilitates preparation of future actions and tasks that are tailored to achieve the client's desired outcome. In some embodiments the transformed OGDS output is displayed as a triangulation of the simulator's RT, PT and ODDS. In some embodiments, a balanced OGDS is displayed as a triangulated bubble or spirit level between the RT, PT, and ODDS. Displacement of the bubble indicator out of the center alerts the client that actual conditions are deviating from the desired outcome, so that corrective action can be evaluated and implemented. OGDS decision-making tools can be combined recursively as modular blocks, in order to create new decision-making tools for other desired outcomes. Visual displays are enhanced, through application of interactive video game and game design techniques (“gamification”), to engage and motivate clients to devise and monitor their goals. The gamification interactive display concepts tap into basic desires and needs of the user-client emotional im...",
  "date_published": "20160714",
  "title": "Simulation System And Method For Integrating Client Behavioral Preferences Within Decision-Based Simulation Scenarios",
  "ipcr_labels": [
    "G06N502",
    "G06Q1006"
  ],
  "_processing_info": {
    "original_size": 131189,
    "optimized_size": 3658,
    "reduction_percent": 97.21
  }
}