{
  "date_produced": "20160713",
  "publication_number": "US20160217393A1-20160728",
  "main_ipcr_label": "G06N9900",
  "decision": "PENDING",
  "application_number": "14916302",
  "inventor_list": [
    {
      "inventor_name_last": "Yu",
      "inventor_name_first": "Xiaofeng",
      "inventor_city": "Beijing",
      "inventor_state": "",
      "inventor_country": "CN"
    },
    {
      "inventor_name_last": "Chen",
      "inventor_name_first": "Shimin",
      "inventor_city": "Beijing",
      "inventor_state": "",
      "inventor_country": "CN"
    }
  ],
  "abstract": "Information extraction from observed data may be performed. First parameter weights and second parameter weights of a joint discriminative probability distribution may be determined. The joint discriminative probability distribution may be over first variables and second variables and may be conditioned on the observed data. The second variables may be modeled by first-order logic formulas. The first variables may be based on the first parameter weights, and the second variables may be based on the second parameter weights. A first likely output of the first variables based on the first parameter weights and a second likely output of the second variables based on the second parameter weights may be determined.",
  "filing_date": "20160303",
  "patent_number": "None",
  "summary": "<SOH> BRIEF DESCRIPTION OF THE DRAWINGS <EOH>Some examples are described with respect to the following figures: FIG. 1 is a flow diagram illustrating a method of information extraction from observed data according to some examples; FIG. 2 is a simplified illustration of an information extraction system according to some examples; FIG. 3 is a flow diagram illustrating a method of information extraction from observed data according to some examples; and FIG. 4 is a graphical representation of a joint discriminative probability distribution according to an example. detailed-description description=\"Detailed Description\" end=\"lead\"?",
  "date_published": "20160728",
  "title": "INFORMATION EXTRACTION",
  "ipcr_labels": [
    "G06N9900",
    "G06N700"
  ],
  "_processing_info": {
    "original_size": 38936,
    "optimized_size": 2015,
    "reduction_percent": 94.82
  }
}