{
  "date_produced": "20170621",
  "publication_number": "US20170193384A1-20170706",
  "main_ipcr_label": "G06N700",
  "decision": "PENDING",
  "application_number": "14989502",
  "inventor_list": [
    {
      "inventor_name_last": "MUDALIGE",
      "inventor_name_first": "UPALI P.",
      "inventor_city": "OAKLAND TOWNSHIP",
      "inventor_state": "MI",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "ELVITIGALA",
      "inventor_name_first": "THANURA RANMAL",
      "inventor_city": "HERSHEY",
      "inventor_state": "PA",
      "inventor_country": "US"
    }
  ],
  "abstract": "A system and method for determining whether a driver of a host vehicle intends to make a left or right turn with a certain level of confidence. The method obtains a plurality of turning cues that identify external parameters around the host vehicle and/or define operating conditions of the host vehicle, and determines a confidence level that the host vehicle will make a left or right turn based on the turning cues, where determining the confidence level includes weighting each of the cues based on current vehicle operating conditions.",
  "filing_date": "20160106",
  "patent_number": "None",
  "summary": "<SOH> SUMMARY OF THE INVENTION <EOH>The present disclosure describes a system and method for determining whether a driver of a host vehicle intends to make a left or right turn with a certain level of confidence. The method obtains a plurality of turning cues that identify external parameters around the host vehicle and/or define operating conditions of the host vehicle, and determines a confidence level that the host vehicle will make a left or right turn based on the turning cues, where determining the confidence level includes weighting each of the cues based on current driver operating conditions. Additional features of the present invention will become apparent from the following description and appended claims, taken in conjunction with the accompanying drawings.",
  "date_published": "20170706",
  "title": "DETERMINING DRIVER INTENTION AT TRAFFIC INTERSECTIONS FOR AUTOMOTIVE CRASH AVOIDANCE",
  "ipcr_labels": [
    "G06N700"
  ],
  "_processing_info": {
    "original_size": 60024,
    "optimized_size": 2057,
    "reduction_percent": 96.57
  }
}