{
  "date_produced": "20160622",
  "publication_number": "US20160196495A1-20160707",
  "main_ipcr_label": "G06N504",
  "decision": "PENDING",
  "application_number": "14989251",
  "inventor_list": [
    {
      "inventor_name_last": "Butte",
      "inventor_name_first": "Gordon",
      "inventor_city": "Sarasota",
      "inventor_state": "FL",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Thorne",
      "inventor_name_first": "Sarah",
      "inventor_city": "Ontario",
      "inventor_state": "",
      "inventor_country": "CA"
    },
    {
      "inventor_name_last": "Fischhoff",
      "inventor_name_first": "Baruch",
      "inventor_city": "Pittsburgh",
      "inventor_state": "PA",
      "inventor_country": "US"
    }
  ],
  "abstract": "A mental modeling method and system may include providing at least one expert model, the at least one expert model including an analytical framework that summarizes subject matter expert-level knowledge. At least one mental model of at least one individual that summarizes subject matter individual-level knowledge is provided. The at least one expert model is modified based on the at least one mental model to provide at least one updated expert model.",
  "filing_date": "20160106",
  "patent_number": "None",
  "summary": "<SOH> SUMMARY OF THE INVENTION <EOH>Generally, provided is a mental modeling method and system that addresses or overcomes some or all of the deficiencies and drawbacks associated with existing knowledge and information modeling methods and systems for purposes of addressing the complex psychological processes of judgment, decision making, and behavior using communications of all kinds. An expert models/mental models approach to address challenges presented by lay-people's understanding of complex issues and processes, such as making key decisions and understanding and managing probability, is provided by a mental modeling method and system according to example embodiments. To change people's beliefs and behaviors, one must understand and change their mental models. Mental models can be addressed through communications in order to better inform people's decision making and sustainably change key attitudes, beliefs, and behaviors. Mental models must be addressed through precisely targeted strategies and communications that are tailored to the key decisions confronting people. Preferably, provided is a mental modeling method and system that provides a faster, more efficient modeling process. Preferably, provided is a mental modeling method and system that creates data-rich functional models for more useful and consistent application within and across an organization. Preferably, provided is a mental modeling method and system that enables linking of models, merging of models, and embedding information and data within the functional models in various forms including multimedia forms. Preferably, provided is a mental modeling method and system that provides a structure for mental models that is based at least partly on a knowledge/current understanding component, a knowledge gaps (consequential) component, a misunderstandings (consequential) component, a priorities component, and a trust and competence criteria component. According to a preferred and non-limiting embodi...",
  "date_published": "20160707",
  "title": "Mental Modeling Method And System",
  "ipcr_labels": [
    "G06N504",
    "G06N9900"
  ],
  "_processing_info": {
    "original_size": 80758,
    "optimized_size": 3279,
    "reduction_percent": 95.94
  }
}