{
  "date_produced": "20170621",
  "publication_number": "US20170193383A1-20170706",
  "main_ipcr_label": "G06N700",
  "decision": "PENDING",
  "application_number": "14988763",
  "inventor_list": [
    {
      "inventor_name_last": "Limonard",
      "inventor_name_first": "Lior",
      "inventor_city": "Nesher",
      "inventor_state": "",
      "inventor_country": "IL"
    },
    {
      "inventor_name_last": "Mashkif",
      "inventor_name_first": "Nir",
      "inventor_city": "Ein Carmel",
      "inventor_state": "",
      "inventor_country": "IL"
    },
    {
      "inventor_name_last": "Wasserkrug",
      "inventor_name_first": "Segev E.",
      "inventor_city": "Haifa",
      "inventor_state": "",
      "inventor_country": "IL"
    },
    {
      "inventor_name_last": "Zadorojniy",
      "inventor_name_first": "Alexander",
      "inventor_city": "Haifa",
      "inventor_state": "",
      "inventor_country": "IL"
    },
    {
      "inventor_name_last": "Zeltyn",
      "inventor_name_first": "Sergey",
      "inventor_city": "Haifa",
      "inventor_state": "",
      "inventor_country": "IL"
    }
  ],
  "abstract": "Method, apparatus and product for utilizing stochastic controller to provide user-controlled notification rate of wearable-based events. The method comprises obtaining events issued by a module based on analysis of multiple sensor readings of one or more sensors of a wearable device. The method further comprises determining by a stochastic controller whether to provide an alert to a user based on the events and based on a user preference, wherein the user preference is indicative of a desired notification rate of the user, wherein the stochastic controller comprises a stochastic model of an environment. Based on such determination, alerts are outputted to the user.",
  "filing_date": "20160106",
  "patent_number": "None",
  "summary": "<SOH> BRIEF SUMMARY <EOH>One exemplary embodiment of the disclosed subject matter is a computer-implemented method comprising: obtaining events issued by a module based on analysis of multiple sensor readings of one or more sensors of a wearable device; determining by a stochastic controller whether to provide an alert to a user based on the events and based on a user preference, wherein the user preference is indicative of a desired notification rate of the user, wherein the stochastic controller comprises a stochastic model of an environment; and outputting alerts to the user based on said determining. Another exemplary embodiment of the disclosed subject matter is a computerized apparatus having a processor, the processor being adapted to perform the steps of: obtaining events issued by a module based on analysis of multiple sensor readings of one or more sensors of a wearable device; determining by a stochastic controller whether to provide an alert to a user based on the events and based on a user preference, wherein the user preference is indicative of a desired notification rate of the user, wherein the stochastic controller comprises a stochastic model of an environment; and outputting alerts to the user based on said determining. Yet another exemplary embodiment of the disclosed subject matter is a computer program product comprising a computer readable storage medium retaining program instructions, which program instructions when read by a processor, cause the processor to perform a method comprising: obtaining events issued by a module based on analysis of multiple sensor readings of one or more sensors of a wearable device; determining by a stochastic controller whether to provide an alert to a user based on the events and based on a user preference, wherein the user preference is indicative of a desired notification rate of the user, wherein the stochastic controller comprises a stochastic model of an environment; and outputting alerts to the user based...",
  "date_published": "20170706",
  "title": "UTILIZING STOCHASTIC CONTROLLER TO PROVIDE USER-CONTROLLED NOTIFICATION RATE OF WEARABLE-BASED EVENTS",
  "ipcr_labels": [
    "G06N700",
    "G06F954",
    "G08B2118"
  ],
  "_processing_info": {
    "original_size": 42597,
    "optimized_size": 3861,
    "reduction_percent": 90.94
  }
}