{
  "date_produced": "20160413",
  "publication_number": "US20160117608A1-20160428",
  "main_ipcr_label": "G06N9900",
  "decision": "PENDING",
  "application_number": "14987234",
  "inventor_list": [
    {
      "inventor_name_last": "Ludlow",
      "inventor_name_first": "Stephen",
      "inventor_city": "Montreal",
      "inventor_state": "",
      "inventor_country": "CA"
    },
    {
      "inventor_name_last": "Pettigrew",
      "inventor_name_first": "Steve",
      "inventor_city": "Montreal",
      "inventor_state": "",
      "inventor_country": "CA"
    },
    {
      "inventor_name_last": "Dowgailenko",
      "inventor_name_first": "Alex",
      "inventor_city": "Montreal",
      "inventor_state": "",
      "inventor_country": "CA"
    },
    {
      "inventor_name_last": "Deligia",
      "inventor_name_first": "Agostino",
      "inventor_city": "Montreal",
      "inventor_state": "",
      "inventor_country": "CA"
    },
    {
      "inventor_name_last": "Giguere",
      "inventor_name_first": "Isabelle",
      "inventor_city": "Montreal",
      "inventor_state": "",
      "inventor_country": "CA"
    }
  ],
  "abstract": "A reconfigurable automatic document-classification system and method provides classification metrics to a user and enables the user to reconfigure the classification model. The user can refine the classification model by adding or removing exemplars, creating, editing or deleting rules, or performing other such adjustments to the classification model. This technology enhances the overall transparency and defensibility of the auto-classification process.",
  "filing_date": "20160104",
  "patent_number": "None",
  "summary": "<SOH> SUMMARY <EOH>The inventive subject matter provides methods, systems, and computer-readable media for auto-classifying digital content by providing dynamic user feedback that enables the user to adjust the classification algorithm to achieve more optimal classification results. One aspect of the inventive subject matter includes a computer-implemented method of automatically classifying digital content, the method comprising creating a classification model based on one or more selected documents that have been identified as exemplars, displaying metrics for a plurality of other documents that have been classified using the classification model, and receiving user input to reconfigure the classification model. Another aspect of the inventive subject matter includes a computer-readable medium comprising programmed instructions in code which, when loaded into a memory and executed by a processor of a computing device, causes the computing device to create a classification model based on one or more selected documents that have been identified as exemplars, display metrics for a plurality of other documents that have been classified using the classification model, and receive user input to reconfigure the classification model. Yet a further aspect of the inventive subject matter includes an auto-classification system (or automatic document classification system) comprising a processor coupled to a memory for creating a classification model based on one or more selected documents that have been identified as exemplars and a display for displaying metrics for a plurality of other documents that have been classified using the classification model and for receiving user input to configure the classification model. A further aspect of the inventive subject matter includes a computer-implemented method of automatically classifying digital content that entails generating a classification model based on one or more selected documents that have been identified as exemplars,...",
  "date_published": "20160428",
  "title": "Reconfigurable Model for Auto-Classification System and Method",
  "ipcr_labels": [
    "G06N9900",
    "G06F1730"
  ],
  "_processing_info": {
    "original_size": 59592,
    "optimized_size": 3607,
    "reduction_percent": 93.95
  }
}