{
  "decision": "REJECTED",
  "application_number": "14987540",
  "date_published": "20160707",
  "date_produced": "20160622",
  "title": "SYSTEM AND METHOD FOR PROVIDING A REFERRAL NETWORK IN A SOCIAL NETWORKING ENVIRONMENT",
  "filing_date": "20160104",
  "inventor_list": [
    {
      "inventor_name_last": "MacLaughlin",
      "inventor_name_first": "Edwin John",
      "inventor_city": "Manhattan Beach",
      "inventor_state": "CA",
      "inventor_country": "US"
    }
  ],
  "ipcr_labels": [
    "G06Q5000",
    "H04L2908"
  ],
  "main_ipcr_label": "G06Q5000",
  "summary": "<SOH> BRIEF DESCRIPTION OF THE DRAWINGS <EOH>FIG. 1 illustrates a system for providing a referral network in a social networking environment, according to one or more embodiments. FIG. 2 illustrates a method for enabling a business to establish referral links with participants of a social network, according to one or more embodiments. FIG. 3 illustrates a method for performing referral searching, according to an embodiment. FIG. 4 illustrates a search result that is generated for a user seeking to locate a business, in accordance with various embodiments described herein. FIG. 5 illustrates a personal directory page that can be maintained for a participant of system 100 , according to one or more embodiments. FIG. 6 illustrates a method for implementing a multilevel affiliate program, under an embodiment. detailed-description description=\"Detailed Description\" end=\"lead\"?",
  "patent_number": "None",
  "abstract": "A user-content generated network is provided for presenting business listings, as well as commentary and reviews of businesses, by participants of the network. In an embodiment, businesses can participate in the network and receive referrals from members of the network. The network can track and monitor referrals that individual businesses receive as a mechanism for promoting the business to other users in the network's user base.",
  "publication_number": "US20160196620A1-20160707",
  "_processing_info": {
    "original_size": 84321,
    "optimized_size": 1923,
    "reduction_percent": 97.72
  }
}