{
  "decision": "ACCEPTED",
  "application_number": "14987055",
  "date_published": "20170706",
  "date_produced": "20170621",
  "title": "DETECTION AND AUTOMATIC TRANSFER OF STANDALONE SYSTEM DUMPS",
  "filing_date": "20160104",
  "inventor_list": [
    {
      "inventor_name_last": "Abrams",
      "inventor_name_first": "Robert M.",
      "inventor_city": "Wappinger Falls",
      "inventor_state": "NY",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Jones",
      "inventor_name_first": "Nicholas R.",
      "inventor_city": "Poughkeepsie",
      "inventor_state": "NY",
      "inventor_country": "US"
    }
  ],
  "ipcr_labels": [
    "G06F1107"
  ],
  "main_ipcr_label": "G06F1107",
  "summary": "<SOH> SUMMARY <EOH>According to an embodiment, a computer implemented method for transferring standalone dump data of a system to a diagnosis system includes detecting a creation of a multi-volume standalone dump dataset. The computer implemented method also includes, in response to detecting the creation, creating an entry in a list of standalone dump datasets, the entry corresponding to the multi-volume standalone dump dataset created. The computer implemented method also includes detecting a change in data stored in the multi-volume standalone dump dataset; and in response to detecting the change, updating the corresponding entry in the list of standalone dump datasets, and generating a sequential standalone dump based on the multi-volume standalone dump dataset. The computer implemented method also includes alerting the diagnosis system of the sequential standalone dump. The computer implemented method also includes transferring the sequential standalone dump for access by the diagnosis system. According to another embodiment, a system for transferring standalone dump data to a diagnosis system includes a memory; and a processor. The processor detects a creation of a multi-volume standalone dump dataset. The processor, in response to detecting the creation, creates an entry in a list of standalone dump datasets, the entry corresponding to the multi-volume standalone dump dataset created. The processor also detects a change in data stored in the multi-volume standalone dump dataset. The processor also updates the corresponding entry in the list of standalone dump datasets. The processor also generates a sequential standalone dump based on the multi-volume standalone dump dataset. The processor also alerts the diagnosis system of the sequential standalone dump. The processor also transfers the sequential standalone dump for access by the diagnosis system. According to another embodiment, a computer program product for transferring standalone dump data to a diagnos...",
  "patent_number": "10002040",
  "abstract": "Technical solutions are described for transferring standalone dump data of a system to a diagnosis system. An example method includes detecting a creation of a multi-volume standalone dump dataset. The method also includes, in response to detecting the creation, creating an entry in a list of standalone dump datasets, the entry corresponding to the multi-volume standalone dump dataset created. The method also includes detecting a change in data stored in the multi-volume standalone dump dataset; and in response to detecting the change, updating the corresponding entry in the list of standalone dump datasets, and generating a sequential standalone dump based on the multi-volume standalone dump dataset. The method also includes alerting the diagnosis system of the sequential standalone dump. The method also includes transferring the sequential standalone dump for access by the diagnosis system.",
  "publication_number": "US20170192831A1-20170706",
  "_processing_info": {
    "original_size": 68421,
    "optimized_size": 3623,
    "reduction_percent": 94.7
  }
}