{
  "decision": "PENDING",
  "application_number": "14989698",
  "date_published": "20161006",
  "date_produced": "20160921",
  "title": "Remote Embedded Device Update Platform Apparatuses, Methods and Systems",
  "filing_date": "20160106",
  "inventor_list": [
    {
      "inventor_name_last": "Searle",
      "inventor_name_first": "Mark Douglas",
      "inventor_city": "Wokingham",
      "inventor_state": "",
      "inventor_country": "GB"
    },
    {
      "inventor_name_last": "Griffin",
      "inventor_name_first": "Owen James",
      "inventor_city": "Reading",
      "inventor_state": "",
      "inventor_country": "GB"
    },
    {
      "inventor_name_last": "Kempf",
      "inventor_name_first": "Robert Franz Klaus",
      "inventor_city": "Eggolsheim",
      "inventor_state": "",
      "inventor_country": "DE"
    }
  ],
  "ipcr_labels": [
    "G06F944"
  ],
  "main_ipcr_label": "G06F944",
  "summary": "<SOH> BRIEF DESCRIPTION OF THE DRAWINGS <EOH>Appendices and/or drawings illustrating various, non-limiting, example, innovative aspects of the Remote Embedded Device Update Platform Apparatuses, Methods and Systems (hereinafter “REDUP”) disclosure, include: FIG. 1 shows an exemplary architecture for the REDUP; FIG. 2 shows an exemplary workflow for the REDUP; FIG. 3 shows a datagraph diagram illustrating embodiments of a data flow for the REDUP; FIG. 4 shows a logic flow diagram illustrating embodiments of a device segment determining (DSD) component for the REDUP; FIG. 5 shows a logic flow diagram illustrating embodiments of an update download administering (UDA) component for the REDUP; FIG. 6 shows a logic flow diagram illustrating embodiments of a package download administering (PDA) component for the REDUP; FIG. 7 shows a logic flow diagram illustrating embodiments of an update installation administering (UTA) component for the REDUP; FIG. 8 shows an exemplary model for the REDUP; FIG. 9 shows an exemplary architecture for the REDUP; FIG. 10 shows an exemplary model for the REDUP; FIG. 11 shows an exemplary architecture for the REDUP; FIG. 12 shows an exemplary architecture for the REDUP; FIG. 13 shows an exemplary architecture for the REDUP; FIG. 14 shows a logic flow diagram illustrating embodiments of a product segment configuring (PSC) component for the REDUP; FIG. 15 shows an exemplary architecture for the REDUP; FIG. 16 shows an exemplary architecture for the REDUP; FIG. 17 shows a screenshot diagram illustrating embodiments of the REDUP; FIG. 18 shows a screenshot diagram illustrating embodiments of the REDUP; FIG. 19 shows a logic flow diagram illustrating embodiments of an update package configuring (UPC) component for the REDUP; FIG. 20 shows an exemplary architecture for the REDUP; FIG. 21 shows an exemplary model for the REDUP; FIG. 22 shows an exemplary model for the REDUP; FIG. 23 shows a screenshot diagram illustrating embodiments of the REDUP; F...",
  "patent_number": "None",
  "abstract": "The Remote Embedded Device Update Platform Apparatuses, Methods and Systems (“REDUP”) transforms telemetry inputs via REDUP components into remote embedded updates outputs. The REDUP may include a memory and processor with instructions to: obtain a remote embedded device connection request message from a remote embedded device and analyze the message to determine a version of embedded instructions on the remote embedded device. With that, the REDUP may determine if other remote embedded devices similar to the remote embedded device have provided request messages by searching a remote embedded device connection request message database. This allows the REDUP to determine if a potential issue requiring updates on the remote embedded device exists. With that, the REDUP may determine and provide an update for the remote embedded device.",
  "publication_number": "US20160291940A1-20161006",
  "_processing_info": {
    "original_size": 601424,
    "optimized_size": 3733,
    "reduction_percent": 99.38
  }
}