{
  "decision": "ACCEPTED",
  "application_number": "14988877",
  "date_published": "20160428",
  "date_produced": "20160413",
  "title": "SYSTEM AND METHOD FOR COMPLIANCE BASED AUTOMATION",
  "filing_date": "20160106",
  "inventor_list": [
    {
      "inventor_name_last": "Kakhandiki",
      "inventor_name_first": "Abhijit",
      "inventor_city": "San Jose",
      "inventor_state": "CA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Gunapu",
      "inventor_name_first": "Sridhar",
      "inventor_city": "Santa Clara",
      "inventor_state": "CA",
      "inventor_country": "US"
    }
  ],
  "ipcr_labels": [
    "H04L2906",
    "G06F944",
    "G06F2157",
    "G06F9445",
    "H04L2908"
  ],
  "main_ipcr_label": "H04L2906",
  "summary": "<SOH> SUMMARY OF THE INVENTION <EOH>The disclosed invention includes a computer method for creating software on a first computer to be executed on one or more remote computers including the steps of: A. (1) employing in the first computer remote access technology to access and update software on one or more remote computers; (2) determining a status of the one or more remote computers; (3) utilizing the status to create one or more automation profiles for execution in one or more remote computers; B. negotiating between the first computer and the one or more remote computers, a highest level protocol for the one or more remote computer compliance boundaries required to access an automation controller in the one or more remote computers; C. (1) creating in the first computer a set of execution files having one or more nested tasks for deployment; (2) appending a light weight play engine to the execution files; (3) delivering the executable files to the one or more remote computer automation controllers using a remote access technology; D. (1) executing in the one or more remote computers the light weight play engine having appended execution files; (2) reading the execution task files; and (3) updating the one or more remote computers. In another embodiment of the invention is a computer method for creating a portable unit on a first computer to be executed on one or more remote computers including the steps of (a) performing automation updates on one or more remote computers, while adhering to one or more remote computers compliance requirements; and (b) enabling the one or more remote computers to define compliance boundaries using a rules-based compliance firewall; and (c) enabling the first computer, subject to the compliance boundaries, to create one or more adapters that enable automated applications to be executed on the one or more remote computers; and (d) incorporating the one or more adapters into the communication protocols of the first computer and the o...",
  "patent_number": "9954819",
  "abstract": "This invention generally relates to a process and computer code for enabling users to create adapters that enable application automation processes that allow customers to define compliance boundaries using a rules-based compliance firewall for their service providers and allow service providers to perform automation on customer machines remotely while adhering to customer's compliance requirements.",
  "publication_number": "US20160119285A1-20160428",
  "_processing_info": {
    "original_size": 40012,
    "optimized_size": 3146,
    "reduction_percent": 92.14
  }
}