{
  "decision": "ACCEPTED",
  "application_number": "14988748",
  "date_published": "20160512",
  "date_produced": "20160427",
  "title": "TOUCH DEVICE AND FABRICATION METHOD THEREOF",
  "filing_date": "20160106",
  "inventor_list": [
    {
      "inventor_name_last": "Lee",
      "inventor_name_first": "Yuh-Wen",
      "inventor_city": "Hsinchu",
      "inventor_state": "",
      "inventor_country": "TW"
    },
    {
      "inventor_name_last": "Hsia",
      "inventor_name_first": "Hsiang-Lung",
      "inventor_city": "Changhua",
      "inventor_state": "",
      "inventor_country": "TW"
    },
    {
      "inventor_name_last": "Xie",
      "inventor_name_first": "Yanjun",
      "inventor_city": "Wuhan",
      "inventor_state": "",
      "inventor_country": "CN"
    },
    {
      "inventor_name_last": "Chen",
      "inventor_name_first": "Feng",
      "inventor_city": "Xiamen",
      "inventor_state": "",
      "inventor_country": "CN"
    },
    {
      "inventor_name_last": "Lin",
      "inventor_name_first": "Fengming",
      "inventor_city": "Fuzhou",
      "inventor_state": "",
      "inventor_country": "CN"
    },
    {
      "inventor_name_last": "Xu",
      "inventor_name_first": "Xianbin",
      "inventor_city": "Xiamen",
      "inventor_state": "",
      "inventor_country": "CN"
    },
    {
      "inventor_name_last": "Ruan",
      "inventor_name_first": "Keming",
      "inventor_city": "Quanzhou",
      "inventor_state": "",
      "inventor_country": "CN"
    }
  ],
  "ipcr_labels": [
    "G06F3044",
    "G06F3041"
  ],
  "main_ipcr_label": "G06F3044",
  "summary": "<SOH> SUMMARY OF THE INVENTION <EOH>According to an embodiment of the present disclosure, a signal transmission line layer, which is located on shading layer and sensing electrode layer, is electrically connected by changing the formation order of the sensing electrode layer and the shading layer, and then, a conductive layer is perforated through the shading layer. This overcomes the problem of resistance of the foregoing traditional touch device thereby making the touch device easy to float, and increasing the touch detecting precision. According to an embodiment of the present disclosure, a touch device has a sensing area and a peripheral area surrounding the sensing area. The touch device comprises :a sensing electrode layer extending from the sensing area to the peripheral area; a first shading layer disposed on the peripheral area and overlaying the sensing electrode layer that is disposed on the peripheral area, wherein the first shading layer has a through hole to expose a part of the sensing electrode layer that is disposed on the peripheral area; a signal transmission line layer disposed on the first shading layer without covering the through hole; and a conductive layer filled in the though hole of the first shading layer until the through hole is overflowing with the conductive layer and is electrically connecting the sensing electrode layer to the signal transmission line layer. According to the fabrication method of the touch device provided by another embodiment of the present disclosure, the touch device has a sensing area and a peripheral area surrounding the sensing area, the method comprising: forming a sensing electrode layer extending from the sensing area to the peripheral area; forming a first shading layer having a through hole on the peripheral area to overlay the sensing electrode layer that is disposed on the peripheral area and to expose a part of the sensing electrode layer that is disposed on the peripheral area by the through hole; for...",
  "patent_number": "9665230",
  "abstract": "The present disclosure relates to a touch technology, and more particularly to a touch device and a fabrication method thereof. The touch device comprises a sensing area and a peripheral area. The touch device further comprises a sensing electrode layer, a shading layer, a signal transmission line layer, and a conductive layer. The sensing electrode layer extends from the sensing area to the peripheral area. The shading layer is disposed on the peripheral area to overlay the sensing electrode layer and has a through hole to expose a portion of the sensing electrode layer. The signal transmission line layer is disposed on the shading layer and does not cover the through hole. The conductive layer fills the through hole and electrically connects the sensing electrode layer. In addition, a fabrication, method of a touch device is also provided.",
  "publication_number": "US20160132157A1-20160512",
  "_processing_info": {
    "original_size": 39986,
    "optimized_size": 4242,
    "reduction_percent": 89.39
  }
}