{
  "decision": "ACCEPTED",
  "application_number": "14988932",
  "date_published": "20160428",
  "date_produced": "20160413",
  "title": "METHOD AND SYSTEM FOR DISTRIBUTING MEDIA CONTENT",
  "filing_date": "20160106",
  "inventor_list": [
    {
      "inventor_name_last": "BROWN",
      "inventor_name_first": "WILLIAM A.",
      "inventor_city": "Canton",
      "inventor_state": "GA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "HILL",
      "inventor_name_first": "N. PETER",
      "inventor_city": "ATLANTA",
      "inventor_state": "GA",
      "inventor_country": "US"
    }
  ],
  "ipcr_labels": [
    "H04N2145",
    "H04N7173",
    "H04N21488",
    "H04N2181",
    "G06F2110",
    "H04N21235",
    "H04N5445",
    "H04N21482",
    "H04N21472",
    "H04N21643",
    "H04N2161",
    "G06F30482",
    "H04N214627"
  ],
  "main_ipcr_label": "H04N2145",
  "summary": "<SOH> BRIEF DESCRIPTION OF THE DRAWINGS <EOH>FIGS. 1-4 depict illustrative embodiments of communication systems that provide media services; FIG. 5 depicts an illustrative embodiment of a portal interacting with at least one of the communication systems of FIGS. 1-4 ; FIG. 6 depicts an illustrative embodiment of a communication device utilized in the communication systems of FIGS. 1-4 ; FIG. 7 depicts an illustrative method operating in portions of the communication systems of FIGS. 1-4 ; FIGS. 8-13 depict illustrative embodiments of the method of FIG. 7 ; and FIG. 14 is a diagrammatic representation of a machine in the form of a computer system within which a set of instructions, when executed, may cause the machine to perform any one or more of the methodologies discussed herein. detailed-description description=\"Detailed Description\" end=\"lead\"?",
  "patent_number": "9924225",
  "abstract": "Aspects of the subject disclosure may include, for example, receiving from a communication system media content with metadata, recording the media content, detecting in the metadata a description of the media content correlating with a preference profile, presenting a first prompt requesting an acceptance or rejection of the media content, presenting a second prompt requesting a selection from a plurality of communication devices to direct in whole or in part the media content thereto, detecting the selection from the plurality of communication devices, and transmitting in whole or in part the media content to the selected communication device. Other embodiments are disclosed.",
  "publication_number": "US20160119676A1-20160428",
  "_processing_info": {
    "original_size": 65199,
    "optimized_size": 2386,
    "reduction_percent": 96.34
  }
}