{
  "decision": "REJECTED",
  "application_number": "14986886",
  "date_published": "20160707",
  "date_produced": "20160622",
  "title": "ELECTRONIC COMBINATION LOCK USING FIELDS WITH POSITION INDICATORS",
  "filing_date": "20160104",
  "inventor_list": [
    {
      "inventor_name_last": "Tomasik",
      "inventor_name_first": "Kristin F.",
      "inventor_city": "Las Vegas",
      "inventor_state": "NV",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Sanders",
      "inventor_name_first": "Geoffrey R.",
      "inventor_city": "Las Vegas",
      "inventor_state": "NV",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Holske",
      "inventor_name_first": "Jonathan C.",
      "inventor_city": "Las Vegas",
      "inventor_state": "NV",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Egan",
      "inventor_name_first": "Devin M.",
      "inventor_city": "Las Vegas",
      "inventor_state": "NV",
      "inventor_country": "US"
    }
  ],
  "ipcr_labels": [
    "G06F2131",
    "G06F2145"
  ],
  "main_ipcr_label": "G06F2131",
  "summary": "<SOH> SUMMARY <EOH>Provided herein are embodiments of methods and systems of user authentication using an electronic combination lock which includes manipulation fields with positional indicators. In an embodiment, a method is provided using an electronic combination lock with one or more fields common to multiple position indicators such that a user may enter codes without removing a code input implement such as a finger or stylus from a touch screen. The use of fields rather than standardized alphanumeric buttons may help reduce unauthorized access by mental deduction means such as guessing or determining alphanumeric combinations as well as physical means such as identifying or measuring natural finger oils on buttons so as to physically deduce combinations. Other systems, devices, methods, features and advantages of the subject matter described herein will be or will become apparent to one with skill in the art upon examination of the following figures and detailed description. It is intended that all such additional systems, devices, methods, features and advantages be included within this description, be within the scope of the subject matter described herein, and be protected by the accompanying claims. In no way should the features of the example embodiments be construed as limiting the appended claims, absent express recitation of those features in the claims.",
  "patent_number": "None",
  "abstract": "Systems and methods are provided for authenticating users using an electronic combination lock. More specifically, systems and methods are provided for authenticating users using an electronic combination lock by setting a passcode by manipulating a field including selecting multiple indicators in the field in a particular sequence and requiring an accessing user at a later time to repeat the sequence.",
  "publication_number": "US20160196416A1-20160707",
  "_processing_info": {
    "original_size": 45917,
    "optimized_size": 2819,
    "reduction_percent": 93.86
  }
}