{
  "decision": "ACCEPTED",
  "application_number": "14989948",
  "date_published": "20160428",
  "date_produced": "20160413",
  "title": "IMAGE PICKUP MODULE MANUFACTURING METHOD, AND IMAGE PICKUP MODULE MANUFACTURING DEVICE",
  "filing_date": "20160107",
  "inventor_list": [
    {
      "inventor_name_last": "FUJINAMI",
      "inventor_name_first": "Tatsuya",
      "inventor_city": "Saitama-shi",
      "inventor_state": "",
      "inventor_country": "JP"
    },
    {
      "inventor_name_last": "MITSUYASU",
      "inventor_name_first": "Takashi",
      "inventor_city": "Saitama-shi",
      "inventor_state": "",
      "inventor_country": "JP"
    }
  ],
  "ipcr_labels": [
    "H01L27146",
    "H04N1700",
    "G06T700"
  ],
  "main_ipcr_label": "H01L27146",
  "summary": "<SOH> SUMMARY OF THE INVENTION <EOH>An image pickup element unit and a lens unit are movable in, for example, three directions orthogonal to each other in an image pickup module that includes an AF mechanism and an optical image blur correction mechanism. For this reason, in a step of adjusting the positions of the lens unit and the image pickup element unit, a lens of the lens unit is moved in the direction of gravity due to the influence of gravity. In the case where the lens unit and the image pickup element unit are aligned with each other in a state in which the lens is moved due to the gravity, the lens unit and the image pickup element unit are aligned with each other in a state different from an actual use state. For this reason, there is a possibility that the quality of an image to be picked up may deteriorate. The invention has been made in consideration of the above-mentioned circumstances, and an object of the invention is to provide an image pickup module manufacturing method and an image pickup module manufacturing device that can pick up a high-quality image by simply and accurately aligning an image pickup element unit with a lens unit even though the image pickup element unit and the lens unit are to be aligned with each other when a lens is moved due to gravity. According to the invention, there is provided a method of manufacturing an image pickup module including a lens unit that includes a lens group and an image pickup element unit that is fixed to the lens unit and includes an image pickup element for picking up an image of a subject through the lens group. The lens unit includes a first lens drive unit that moves at least a part of lenses of the lens group in a first direction extending along an optical axis of the lens group and second and third lens drive units that move at least a part of lenses of the lens group in second and third directions, which are orthogonal to the optical axis of the lens group, respectively; and the image pickup ...",
  "patent_number": "10020342",
  "abstract": "A manufacturing device holds a lens unit on a Z axis that is orthogonal to a chart surface of a measurement chart, holds an image pickup element unit on the Z axis, picks up an image of the measurement chart by an image pickup element while changing a Z-axis direction position of the image pickup element unit held on the Z axis in a state in which current is applied to a second lens drive unit and a third lens drive unit of the lens unit held on the Z axis, adjusts the position and a tilt of the image pickup element unit relative to the lens unit on the basis of image pickup signals that are obtained in the case where the image of the measurement chart is picked up, and fixes the image pickup element unit to the lens unit.",
  "publication_number": "US20160118435A1-20160428",
  "_processing_info": {
    "original_size": 84268,
    "optimized_size": 3493,
    "reduction_percent": 95.85
  }
}