{
  "decision": "REJECTED",
  "application_number": "14992312",
  "date_published": "20160505",
  "date_produced": "20160420",
  "title": "Method And System For Organizing Electronic Messages Using Eye-Gaze Technology",
  "filing_date": "20160111",
  "inventor_list": [
    {
      "inventor_name_last": "Singh",
      "inventor_name_first": "Mona",
      "inventor_city": "Cary",
      "inventor_state": "NC",
      "inventor_country": "US"
    }
  ],
  "ipcr_labels": [
    "G06F301",
    "G06F30482",
    "H04W412"
  ],
  "main_ipcr_label": "G06F301",
  "summary": "<SOH> SUMMARY <EOH>A method for organizing messages received and transmitted between at least two computer systems over a network and a system and non-transitory computer readable medium configured to implement the method are described. In one aspect, the method includes displaying, by a first computer system, a plurality of messages that have been previously received. Each one of the plurality of messages is associated with one of a plurality of gaze areas. Where a user is gazing as the user is composing an outgoing message on a first computer system is tracked. During a composition time period in which the user is composing the outgoing message, for each displayed message of the plurality of displayed messages that the user's gaze dwells on, a number of times the user's gaze dwells on the displayed message after the user's gaze is directed away from the displayed message is determined. After composition of the outgoing message is complete, a relevance rating for each of the plurality of the gaze areas based on the number of times the user's gaze dwells on the displayed message associated with the gaze area is determined. Based on at least one of the relevance ratings for the one or more of the plurality of gaze areas, at least one displayed message that is related to the outgoing message is identified. An identifier for at least one of the at least one displayed message that is related to the outgoing message is associated with the outgoing message.",
  "patent_number": "None",
  "abstract": "Organizing messages received and transmitted over a network is described. In one aspect, a method includes tracking where a user is gazing as the user is composing a message in a computer system; during a composition time period in which the user is composing the message, determining a number of times the user's gaze dwells on a displayed message of a plurality of displayed messages after the user's gaze is directed away from the message, determining a relevance rating for he gaze areas, each gaze area associated with one of the messages based on the number of times the user's gaze dwells on the associated message; identifying, based on at least one of the relevance ratings, at least one displayed message related to the outgoing message; and associating with the outgoing message an identifier for at least one of the at least one displayed message related to the outgoing message.",
  "publication_number": "US20160124507A1-20160505",
  "_processing_info": {
    "original_size": 60357,
    "optimized_size": 2947,
    "reduction_percent": 95.12
  }
}