{
  "decision": "PENDING",
  "application_number": "14993846",
  "date_published": "20170601",
  "date_produced": "20170517",
  "title": "METHODS AND SYSTEMS FOR IDENTIFYING RISKS AND ASSOCIATED ROOT CAUSES IN SUPPLY CHAIN NETWORKS",
  "filing_date": "20160112",
  "inventor_list": [
    {
      "inventor_name_last": "Karuppasamy",
      "inventor_name_first": "Selvakuberan",
      "inventor_city": "Chennai",
      "inventor_state": "",
      "inventor_country": "IN"
    }
  ],
  "ipcr_labels": [
    "G06Q1006"
  ],
  "main_ipcr_label": "G06Q1006",
  "summary": "<SOH> SUMMARY <EOH>In one embodiment, a method of identifying root causes in a supply chain network is disclosed. The method includes receiving, via a risk analyzing device, a user query; performing, via the risk analyzing device, natural language processing and text analysis on the user query to derive contextually relevant keywords from the user query; categorizing, via the risk analyzing device, the contextually relevant keywords into a risk category selected from a plurality of risk categories; identifying, via the risk analyzing device, a risk in the supply chain network based on the contextually relevant keywords and the risk category; and detecting, via the risk analyzing device, a root cause from amongst a plurality of root causes associated with the risk using a causal analysis algorithm. In another embodiment, a system for identifying root causes in a supply chain network is disclosed. The system includes at least one processors and a computer-readable medium. The computer-readable medium stores instructions that, when executed by the at least one processor, cause the at least one processor to perform operations that include receiving, via a risk analyzing device, a user query; performing, via the risk analyzing device, natural language processing and text analysis on the user query to derive contextually relevant keywords from the user query; categorizing, via the risk analyzing device, the contextually relevant keywords into a risk category selected from a plurality of risk categories; identifying, via the risk analyzing device, a risk in the supply chain network based on the contextually relevant keywords and the risk category; and detecting, via the risk analyzing device, a root cause from amongst a plurality of root causes associated with the risk using a causal analysis algorithm. In yet another embodiment, a non-transitory computer-readable storage medium for rationalizing a portfolio of assets is disclosed, which when executed by a computing device...",
  "patent_number": "None",
  "abstract": "This disclosure relates generally to supply chain networks and more particularly to methods and systems for identifying risks and associated root causes in supply chain networks. In one embodiment, the method includes receiving, via a risk analyzing device, a user query; performing, via the risk analyzing device, natural language processing and text analysis on the user query to derive contextually relevant keywords from the user query; categorizing, via the risk analyzing device, the contextually relevant keywords into a risk category selected from a plurality of risk categories; identifying, via the risk analyzing device, a risk in the supply chain network based on the contextually relevant keywords and the risk category; and detecting, via the risk analyzing device, a root cause from amongst a plurality of root causes associated with the risk using a causal analysis.",
  "publication_number": "US20170154286A1-20170601",
  "_processing_info": {
    "original_size": 45490,
    "optimized_size": 3473,
    "reduction_percent": 92.37
  }
}