{
  "decision": "REJECTED",
  "application_number": "14992083",
  "date_published": "20170713",
  "date_produced": "20170627",
  "title": "METHOD TO CUSTOMIZE A SCREEN APPEARANCE OF A TELEVISION (TV) SET",
  "filing_date": "20160111",
  "inventor_list": [
    {
      "inventor_name_last": "Mutchnik",
      "inventor_name_first": "Michael",
      "inventor_city": "Montreal",
      "inventor_state": "",
      "inventor_country": "CA"
    },
    {
      "inventor_name_last": "Mutchnik",
      "inventor_name_first": "Andrey",
      "inventor_city": "Montreal",
      "inventor_state": "",
      "inventor_country": "CA"
    }
  ],
  "ipcr_labels": [
    "H04N21431",
    "G06F30482",
    "H04N2145",
    "H04N212543",
    "H04N2181"
  ],
  "main_ipcr_label": "H04N21431",
  "summary": "<SOH> BRIEF SUMMARY OF THE INVENTION <EOH>To achieve above mentioned objects, the method to customize a screen appearance of a television (TV) set, described in the present specification of the invention, provides a user with the decor-appearance on the screen of the TV set according to a personal preference of the user. The method comprises following: providing by a TV service provider at least one decor-channel, which includes at least one decor-appearance; offering the decor-channel to the user as a product; transmitting this at least one decor-channel to at least one TV station; allowing to the user an opportunity to choose the screen decor-appearance from the decor-channel; and providing the decor-appearance on the screen of the television (TV) set according to a personal preference of the user. The decor-channel could be transmitted as the product according to a contract between the user and the TV service provider, or free of charge as a bonus or an additional product. The decor-channel may be included in a portfolio of different channels providing by the TV service provider, as well. In the environment of the present invention, the decor-channel could be provided as a selected program during activation of the television (TV) set. The invention permits, when the decor-channel includes at least one decor-collection, each decor-collection could contain at least two decor-appearances. In this embodiment the method comprise the step of allowing the user with an opportunity to choose the screen decor-appearance from the chosen decor-collection of the decor-channel and to adjust the screen of the TV station with at least one decor-appearance according to the personal preference of the user. In the context of the present invention, the decor-appearances could be shifted by the TV service provider or by the user from the same or different decor-collections. The displayed decor-appearances can also be shifted in an adjust timeframe. The method, according to the presen...",
  "patent_number": "None",
  "abstract": "A method to customize a screen of a television (TV) set as a decor-appearance via providing by a TV service provider at least one decor-channel with at least one decor-appearance, offering the decor-channel to the user, allowing to the user an opportunity to choose the decor-appearance of the screen of the television (TV) set according to a personal preference of a user. The decor-channel could be transmitted as a product, according to a contract between the user and the TV service provider, or as a free of charge.",
  "publication_number": "US20170201789A1-20170713",
  "_processing_info": {
    "original_size": 28058,
    "optimized_size": 3275,
    "reduction_percent": 88.33
  }
}