{
  "date_produced": "20170427",
  "publication_number": "US20170132518A1-20170511",
  "main_ipcr_label": "G06N502",
  "decision": "PENDING",
  "application_number": "14992278",
  "inventor_list": [
    {
      "inventor_name_last": "Kitada",
      "inventor_name_first": "Hiroshi",
      "inventor_city": "Tuckahoe",
      "inventor_state": "NY",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Nelson",
      "inventor_name_first": "Steven A.",
      "inventor_city": "San Jose",
      "inventor_state": "CA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Wong",
      "inventor_name_first": "Lana",
      "inventor_city": "Belleville",
      "inventor_state": "NJ",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Arora",
      "inventor_name_first": "Charchit",
      "inventor_city": "Sunnyvale",
      "inventor_state": "CA",
      "inventor_country": "US"
    }
  ],
  "abstract": "Techniques related to electronic meeting intelligence are disclosed. An apparatus receives audio/video data including first meeting content data for an electronic meeting that includes multiple participants. The apparatus extracts the first meeting content data from the audio/video data. The apparatus generates meeting content metadata based on analyzing the first meeting content data. The apparatus includes the meeting content metadata in a report of the electronic meeting. If the apparatus determines that the audio/video data includes a cue for the apparatus to intervene in the electronic meeting, the apparatus generates intervention data including second meeting content data that is different from the first meeting content data. During the electronic meeting, the apparatus sends the intervention data to one or more nodes associated with at least one participant of the multiple participants.",
  "filing_date": "20160111",
  "patent_number": "None",
  "summary": "<SOH> SUMMARY <EOH>An apparatus includes one or more processors and one or more computer-readable media storing instructions which, when processed by the one or more processors cause the apparatus to receive audio/video data for an electronic meeting that includes multiple participants. The instructions further cause the apparatus to extract meeting content data from the audio/video data. Further, the instructions cause the apparatus to generate meeting content metadata based on analyzing the meeting content data. Still further, the instructions cause the apparatus to include at least part of the meeting content metadata in a report of the electronic meeting.",
  "date_published": "20170511",
  "title": "Electronic Meeting Intelligence",
  "ipcr_labels": [
    "G06N502",
    "G06Q1006",
    "G06F1730"
  ],
  "_processing_info": {
    "original_size": 60476,
    "optimized_size": 2555,
    "reduction_percent": 95.78
  }
}