{
  "date_produced": "20160810",
  "publication_number": "US20160247086A1-20160825",
  "main_ipcr_label": "G06N708",
  "decision": "REJECTED",
  "application_number": "14999338",
  "inventor_list": [
    {
      "inventor_name_last": "Walker",
      "inventor_name_first": "Reginald L.",
      "inventor_city": "Los Angeles",
      "inventor_state": "CA",
      "inventor_country": "US"
    }
  ],
  "abstract": "A method for discovering, locating, indexing, ranking, and clustering multimedia service providers using hierarchical communication topologies resulting in the retrieval of multimedia files by optimizing parameter sets to efficiently retrieve multimedia files. The method creates a plurity of individual parameter sets, the parameter sets comprising information sharing object parameters for describing structures, search query sets, and dynamic search spaces to be optimized and setting the population of individuals as a population of memes. The parameter sets are initially created using a hierarchical ordering based on the priority and diversity of data transmissions to build and extend individual router tables for a plurity of servers by said client machines.",
  "filing_date": "20160425",
  "patent_number": "None",
  "summary": "<SOH> SUMMARY OF THE INVENTION <EOH>The invention is a system and methods for discovering, locating, indexing, ranking, and clustering multimedia service providers using hybrid search strategies and the stochastic optimization techniques of evolutionary computation (EC) by using a hierarchical ordering based on the priority and diversity of data transmissions to build and extend individual router tables in order to derive one-stage, two-stage, and three-stage neighbor clusters. These stochastic optimization techniques form the basis of a regulatory mechanism for sharing information document clustering and ranking which leads to the migration of multimedia files between multimedia indexers. The iterative application of these mechanisms improves the subclustering of multimedia files in distributive applications leading to disjoint nodes for chosen sets of search queries. According to the invention there is provided a multimedia resource discovery and retrieval system comprising: a. Decentralized retrieval of multimedia files located throughout a local area network (LAN), and a wide area network (WAN) combine adaptive solutions achieved by the various the stochastic optimization agents of multimedia resource discovery and retrieval system to the network routing problem coupled with one or more information retrieval problems. The objectives are to achieved: 1) maximization of resource utilization and of overall LAN throughput, and 2) minimization of rejected request packets and guarantee quality of service (QoS). The network routing procedure requires shortest path routing that minimizes “hops” between the source and randomly chosen Internet service providers (ISPs). Factors that must be considered are connection requirements (end-to-end delay, delay variation, mean rate) and network conditions, and b. Real-time system constraints that require timeliness and correctness of periodic tasks, sporadic tasks, and aperiodic tasks executed by the stochastic optimization agents...",
  "date_published": "20160825",
  "title": "Method for a system that discovers, locates, indexes, ranks, and clusters multimedia service providers using hierarchical communication topologies",
  "ipcr_labels": [
    "G06N708",
    "H04L2906",
    "G06N312"
  ],
  "_processing_info": {
    "original_size": 48593,
    "optimized_size": 3443,
    "reduction_percent": 92.91
  }
}