{
  "date_produced": "20170627",
  "publication_number": "US20170200079A1-20170713",
  "main_ipcr_label": "G06N308",
  "decision": "PENDING",
  "application_number": "14994940",
  "inventor_list": [
    {
      "inventor_name_last": "Amir",
      "inventor_name_first": "Arnon",
      "inventor_city": "Santa Clara",
      "inventor_state": "CA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Jimeno Yepes",
      "inventor_name_first": "Antonio J.",
      "inventor_city": "Victoria",
      "inventor_state": "",
      "inventor_country": "AU"
    },
    {
      "inventor_name_last": "Tang",
      "inventor_name_first": "Jianbin",
      "inventor_city": "Victoria",
      "inventor_state": "",
      "inventor_country": "AU"
    }
  ],
  "abstract": "Weighted population code in neuromorphic systems is provided. According to an embodiment, a plurality of input values is received. For each of the plurality of values, a plurality of spikes is generated. Each of the plurality of spikes has an associated weight. A consumption time is determined for each of the plurality of spikes. Each of the plurality of spikes is sent for consumption at its consumption time.",
  "filing_date": "20160113",
  "patent_number": "None",
  "summary": "<SOH> BRIEF SUMMARY <EOH>According to an embodiment of the present invention, a method of and computer program product for generation of stochastic spike patterns are provided. A plurality of input values is received. For each of the plurality of values, a plurality of spikes is generated. Each of the plurality of spikes has an associated weight. A consumption time is determined for each of the plurality of spikes. Each of the plurality of spikes is sent for consumption at its consumption time. According to another embodiment of the present invention, a method of and computer program product for generation of stochastic spike patterns are provided. A first plurality of spikes is received at a first neuromorphic system. The first plurality of spikes encodes a first value according to a first encoding. A second plurality of spikes is generated from the first plurality of spikes. The second plurality of spikes encodes the first value according to a second encoding. The second plurality of spikes is provided to a second neuromorphic system. According to another embodiment of the present invention, a method of and computer program product for generation of stochastic spike patterns are provided. A first plurality of spikes is received at a neuromorphic system. The first plurality of spikes encodes a first value according to a first encoding. A plurality of sets of spikes is generated from the first plurality of spikes. Each of the plurality of sets of spikes encodes the first value according to a second encoding. Each of the plurality of sets of spikes is provided to one of a plurality of classifiers in the neuromorphic system. According to another embodiment of the present invention, a system for generation of stochastic spike patterns are provided. A neuromorphic network is provided. The neuromorphic network includes a plurality of input axons and a plurality of stochastic neurons connected thereto. An encoder is operatively coupled to the plurality of input axons. The...",
  "date_published": "20170713",
  "title": "EFFICIENT GENERATION OF STOCHASTIC SPIKE PATTERNS IN CORE-BASED NEUROMORPHIC SYSTEMS",
  "ipcr_labels": [
    "G06N308",
    "G06N304",
    "G06N3063"
  ],
  "_processing_info": {
    "original_size": 61931,
    "optimized_size": 3304,
    "reduction_percent": 94.67
  }
}