{
  "date_produced": "20160831",
  "publication_number": "US20160267382A1-20160915",
  "main_ipcr_label": "G06N502",
  "decision": "PENDING",
  "application_number": "14994522",
  "inventor_list": [
    {
      "inventor_name_last": "SULLIVAN",
      "inventor_name_first": "James R.",
      "inventor_city": "St. Augustine",
      "inventor_state": "FL",
      "inventor_country": "US"
    }
  ],
  "abstract": "A method of analyzing a color image is disclosed. The color image depicts subject matter of particular interest and/or relevant to solving a given problem. The color image is comprised of image pixels comprising image pixel data. The method is comprised of storing hypothesis decision output information in multi-dimensional color look-up tables; for each pixel of the color image, using the multi-dimensional color look-up tables to produce logic decision output information; grouping the logic decision output information statistically to produce logic decision output information; combining logic decision output information into statistical hypothesis decisions for the color image; and applying the statistical hypothesis decisions to perform an action on the subject matter of the image directed to produce a decision regarding the problem of interest. The problem of interest may be a medical, space or oceanographic exploration, intelligence, forensic, counterfeiting, agricultural, meteorolo...",
  "filing_date": "20160113",
  "patent_number": "None",
  "summary": "<SOH> SUMMARY <EOH>The present invention meets this need by providing methods of analyzing digital color images and making analysis-based decisions; and additionally, methods of performing an action to solve a problem, the problem solving action based upon the analysis of digital color images performed according to the image analysis methods. In certain embodiments, the image analysis methods may be used in lieu of visual inspection by a human, and a human-generated decision. In a broad aspect of the invention, a computer implemented method is provided, which may be in lieu of human visual inspection and decision making, in which an image is analyzed, and a decision is generated based upon the analysis of the image. The decision may subsequently be put into action, i.e., an action is taken on the subject matter of the image, or related to the subject matter of the image. The action may be directed to solving a problem related to the subject matter of the image. In general, the analysis of the image is preceded by an analysis of a problem that may be addressed using image analysis. Decisions that may be made to solve the problem, or otherwise address the problem such as acting on an opportunity resulting from the existence of the problem, are identified and decision criteria and/or specifications are defined. The decision criteria and/or specifications are translated into decision making information, including hypothesis decision output information. In one aspect of the invention, the hypothesis decision output information is stored in multi-dimensional color look-up tables. The multi-dimensional color look-up tables may be used to analyze an image or a plurality of images, such as a video or movie. Subsequently, a decision may be generated, and an action taken as described above. The image analysis is performed by a computer. The decision generation may also be performed by the computer. The action may also be implemented and controlled by the computer. In that mann...",
  "date_published": "20160915",
  "title": "METHODS AND DEVICES FOR ANALYSIS OF DIGITAL COLOR IMAGES AND METHODS OF APPLYING COLOR IMAGE ANALYSIS",
  "ipcr_labels": [
    "G06N502",
    "G06T740",
    "G06T700"
  ],
  "_processing_info": {
    "original_size": 150979,
    "optimized_size": 3623,
    "reduction_percent": 97.6
  }
}