{
  "date_produced": "20160720",
  "publication_number": "US20160224890A1-20160804",
  "main_ipcr_label": "G06N3063",
  "decision": "ACCEPTED",
  "application_number": "14990721",
  "inventor_list": [
    {
      "inventor_name_last": "Friedman",
      "inventor_name_first": "Daniel J.",
      "inventor_city": "Sleepy Hollow",
      "inventor_state": "NY",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Kim",
      "inventor_name_first": "Seongwon",
      "inventor_city": "Old Tappan",
      "inventor_state": "NJ",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Lam",
      "inventor_name_first": "Chung H.",
      "inventor_city": "Peekskill",
      "inventor_state": "NY",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Modha",
      "inventor_name_first": "Dharmendra S.",
      "inventor_city": "San Jose",
      "inventor_state": "CA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Rajendran",
      "inventor_name_first": "Bipin",
      "inventor_city": "White Plains",
      "inventor_state": "NY",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Tierno",
      "inventor_name_first": "Jose A.",
      "inventor_city": "Stamford",
      "inventor_state": "CT",
      "inventor_country": "US"
    }
  ],
  "abstract": "Embodiments of the invention relate to a neuromorphic network for producing spike-timing dependent plasticity. The neuromorphic network includes a plurality of electronic neurons and an interconnect circuit coupled for interconnecting the plurality of electronic neurons. The interconnect circuit includes plural synaptic devices for interconnecting the electronic neurons via axon paths, dendrite paths and membrane paths. Each synaptic device includes a variable state resistor and a transistor device with a gate terminal, a source terminal and a drain terminal, wherein the drain terminal is connected in series with a first terminal of the variable state resistor. The source terminal of the transistor device is connected to an axon path, the gate terminal of the transistor device is connected to a membrane path and a second terminal of the variable state resistor is connected to a dendrite path, such that each synaptic device is coupled between a first axon path and a first dendrite path,...",
  "filing_date": "20160107",
  "patent_number": "9946969",
  "summary": "<SOH> BRIEF SUMMARY <EOH>Embodiments of the invention provide a neuromorphic network for producing spike-timing dependent plasticity. The neuromorphic network includes a plurality of electronic neurons and an interconnect circuit coupled for interconnecting the plurality of electronic neurons. The interconnect circuit includes plural synaptic devices for interconnecting the electronic neurons via axon paths, dendrite paths and membrane paths. Each synaptic device includes a variable state resistor and a transistor device with a gate terminal, a source terminal and a drain terminal, wherein the drain terminal is connected in series with a first terminal of the variable state resistor. The source terminal of the transistor device is connected to an axon path, the gate terminal of the transistor device is connected to a membrane path and a second terminal of the variable state resistor is connected to a dendrite path, such that each synaptic device is coupled between a first axon path and a first dendrite path, and between a first membrane path and said first dendrite path. A timing controller generates a timing signal for controlling phased operation of the electronic neurons. The timing signal provides a sequence of phases, wherein activity of each electronic neuron is confined to said phases such that the synaptic devices provide spike-timing dependent plasticity based on the activity of the electronic neurons in a time phased fashion. In another embodiment, the invention provides a probabilistic asynchronous neuromorphic network for producing spike-timing dependent plasticity. The network comprises a plurality of electronic neurons and an interconnect circuit coupled to the plurality of electronic neurons to interconnect the plurality of electronic neurons. The interconnect circuit comprises a plurality of axons and a plurality of dendrites such that the axons and dendrites are orthogonal to one another. The interconnect circuit further comprises plural synaptic de...",
  "date_published": "20160804",
  "title": "PRODUCING SPIKE-TIMING DEPENDENT PLASTICITY IN A NEUROMORPHIC NETWORK UTILIZING PHASE CHANGE SYNAPTIC DEVICES",
  "ipcr_labels": [
    "G06N3063",
    "G06N308",
    "G06N304"
  ],
  "_processing_info": {
    "original_size": 99160,
    "optimized_size": 4382,
    "reduction_percent": 95.58
  }
}