{
  "decision": "PENDING",
  "application_number": "14992892",
  "date_published": "20160707",
  "date_produced": "20160622",
  "title": "SYSTEMS AND METHODS FOR INSURANCE BASED UPON CHARACTERISTICS OF A COLLISION DETECTION SYSTEM",
  "filing_date": "20160111",
  "inventor_list": [
    {
      "inventor_name_last": "Hagelstein",
      "inventor_name_first": "Peter L.",
      "inventor_city": "Carlisle",
      "inventor_state": "MA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Hagen",
      "inventor_name_first": "Jeffrey John",
      "inventor_city": "Plymouth",
      "inventor_state": "MN",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Hyde",
      "inventor_name_first": "Roderick A.",
      "inventor_city": "Redmond",
      "inventor_state": "WA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Kare",
      "inventor_name_first": "Jordin T.",
      "inventor_city": "San Jose",
      "inventor_state": "CA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Wood",
      "inventor_name_first": "Victoria Y.H.",
      "inventor_city": "Livermore",
      "inventor_state": "CA",
      "inventor_country": "US"
    }
  ],
  "ipcr_labels": [
    "G06Q4008",
    "G06F30481"
  ],
  "main_ipcr_label": "G06Q4008",
  "summary": "<SOH> SUMMARY <EOH>One or more properties of an insurance policy may be based, at least in part, upon a characteristic of a collision detection system of a vehicle. As used herein, a collision detection system refers to any system for detecting a potential collision between a vehicle and another object, such as one or more vehicles, road hazards, obstructions, pedestrians, animals, or the like. An “insurance policy” refers to risk-transference contract between an insurer and an insured (policy provider and policy holder) in which the insurer agrees to satisfy qualifying claims brought by the insured. An insurance policy may include, but is not limited to, one or more of: a vehicle insurance policy, a health insurance policy, a life insurance policy, a disability insurance policy, a workers' compensation insurance policy, a group insurance policy, or the like. The “insurer” may be any entity responsible for satisfying claims under the insurance policy, and may include an agent of the insurer (e.g., employee, independent contractor, or other authorized entity), an underwriter, a re-insurer, or the like. As used herein, an insurance policy may pertain to any asset or entity including, but not limited to: a vehicle, a fleet of vehicles, an operator of a vehicle, a passenger of a vehicle, an owner of a vehicle, an entity having a security interest in a vehicle, an entity having a relationship with an operator, a passenger, and/or an owner of the vehicle (e.g., an employer of the vehicle operator), and so on. As used herein, a “property” of an insurance policy includes, but is not limited to, one or more of: a term of the insurance policy, eligibility for coverage under the insurance policy, a premium of the insurance policy, a coverage amount of the insurance policy, a deductible of the insurance policy, a rider of the insurance policy, a limitation of the insurance policy, a coverage scope of the insurance policy, the coverage of a particular event under the insurance p...",
  "patent_number": "None",
  "abstract": "A property of an insurance policy may be determined, at least in part, upon characteristics of a vehicle collision detection system. The characteristics may pertain to any capability, configuration, and/or operating state of the collision detection system (and/or vehicle). For example, a property of the insurance policy may be based upon whether the collision detection system is configured to take automatic collision avoidance actions in response to detecting a potential collision and/or whether the automatic collision avoidance actions can be overridden by the operator of the vehicle. The property of the insurance policy may be dynamic, and may be updated in response to changes to the collision detection system and/or the real-time operating state thereof. The coverage of particular events may be based upon characteristics of the collision detection system and/or vehicle at the time the event occurred.",
  "publication_number": "US20160196612A1-20160707",
  "_processing_info": {
    "original_size": 97461,
    "optimized_size": 4145,
    "reduction_percent": 95.75
  }
}