{
  "decision": "PENDING",
  "application_number": "14995879",
  "date_published": "20160512",
  "date_produced": "20160427",
  "title": "Patient-to-Patient Communities",
  "filing_date": "20160114",
  "inventor_list": [
    {
      "inventor_name_last": "Hussam",
      "inventor_name_first": "Ali Adel",
      "inventor_city": "Columbia",
      "inventor_state": "MO",
      "inventor_country": "US"
    }
  ],
  "ipcr_labels": [
    "G06F1900",
    "G06F1730",
    "G06Q5000"
  ],
  "main_ipcr_label": "G06F1900",
  "summary": "<SOH> SUMMARY <EOH>In general, an online patient community system is described. A online patient community allows users whom either are contemplating a medical procedure or have already undergone a medical procedure to locate other users that are similarly situated. In an example, a user that has undergone a hip-replacement surgery can locate other users that have undergone the same surgery. The online patient community system also allows users to track their recovery and the recovery of other users. In an example, the online patient community system may allow users to keep a recovery log of their day-to-day progress, which can be shared with other users that are also recovering from similar procedures. Users of the online patient community system can also compare their progress either pre- or post-procedure with the progress of others. In an example, this can include, among other things, a particular user of the online patient community system viewing logs of other users that are progressing more favorably than the particular user so that the particular user may choose to alter their regimen. In one aspect of the present disclosure, a computer-implemented method include receiving, by a processing device and from a client device associated with a requesting user of an online patient community, a request to search for other users who are associated with at least a threshold level of similarity to the requesting user; accessing information indicative of a patient profile of the requesting user; determining, based on contents of the patient profile, one or more attributes of the requesting user; searching a data repository for information indicative of a user associated with one or more attributes corresponding to at least one of the one or more attributes of the requesting user; identifying, based on searching, a user associated with one or more attributes corresponding to at least one of the one or more attributes of the requesting user; determining that the one or m...",
  "patent_number": "None",
  "abstract": "A computer-implemented method includes receiving a request to search for other users who are associated with at least a threshold level of similarity to the requesting user; accessing information indicative of a patient profile of the requesting user; determining one or more attributes of the requesting user; searching a data repository for information indicative of a user associated with one or more attributes corresponding to at least one of the one or more attributes of the requesting user; identifying, based on searching, a user associated with one or more attributes corresponding to at least one of the one or more attributes of the requesting user; determining that the one or more corresponding attributes of the identified user satisfy the threshold level of similarity; and transmitting information indicative of the identified user, with the transmitted information specifying the identified user as being a peer of the requesting user.",
  "publication_number": "US20160132647A1-20160512",
  "_processing_info": {
    "original_size": 98615,
    "optimized_size": 3499,
    "reduction_percent": 96.45
  }
}