{
  "decision": "PENDING",
  "application_number": "14996185",
  "date_published": "20160512",
  "date_produced": "20160427",
  "title": "REAL-TIME PAYMENTS THROUGH FINANCIAL INSTITUTION",
  "filing_date": "20160114",
  "inventor_list": [
    {
      "inventor_name_last": "Fridman",
      "inventor_name_first": "Arkady",
      "inventor_city": "Twain Harte",
      "inventor_state": "CA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Amalraj",
      "inventor_name_first": "Peter",
      "inventor_city": "San Jose",
      "inventor_state": "CA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Narain",
      "inventor_name_first": "Mamta",
      "inventor_city": "Fremont",
      "inventor_state": "CA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Wilson",
      "inventor_name_first": "Katherine",
      "inventor_city": "Campbell",
      "inventor_state": "CA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Schatt",
      "inventor_name_first": "Daniel",
      "inventor_city": "San Mateo",
      "inventor_state": "CA",
      "inventor_country": "US"
    }
  ],
  "ipcr_labels": [
    "G06Q2040",
    "G06Q2010"
  ],
  "main_ipcr_label": "G06Q2040",
  "summary": "<SOH> SUMMARY <EOH>In one embodiment of the present invention, a service or payment provider, such as PayPal, uses bank rails to enable a bank customer to send real-time payments through the bank site by simply entering a recipient identifier, such as an email address, mobile number, or other easily shareable identifier. The bank has an account with the payment provider. Thus, when the customer sends a payment through the bank, the payment provider transmits the payment to the recipient through the bank's payment provider account. The bank debits the amount from the user's bank account. The sender does not have to have an account with the payment provider, just an account with the bank. A user having an account with the payment provider can also make a payment to a user with a bank account, but no account with the payment provider. In this situation, the payee may get a notice that funds are waiting and to open an account to retrieve the funds. Thus, the payer and payee are not required to both have an account with the payment provider in order to make a person to person (P2P) payment. In other embodiments, the payment provider may utilize a user's bank information to make purchases, add the bank as a funding source, and confirm or authenticate the user. For example, the payment provider may authenticate or confirm a user through the bank instead of random deposit or other means, utilizing bidirectional rails with the bank. Also, using bank rails, if a user wishes to make a payment through an account with the payment provider, but the account does not have enough funds to cover the payment amount, the payment provider can see what the user has in a bank account. If adequate funds are available, a hold may be put on those funds. The payment provider can then approve the payment, with funds being pulled from the user's bank account through the bank's payment provider account and into the user's payment provider account. Other uses include the ability for insurance com...",
  "patent_number": "None",
  "abstract": "A payment provider uses bank rails to enable a bank customer to send real-time payments through the bank site by simply entering a recipient identifier, such as an email address or mobile number. The bank has an account with the payment provider. Thus, when the customer sends a payment through the bank, the payment provider transmits the payment to the recipient through the bank's payment provider account. The bank debits the amount from the user's bank account or from a third party, in which case the bank makes a payment to the third party. The sender does not have to have an account with the payment provider, just an account with the bank.",
  "publication_number": "US20160132884A1-20160512",
  "_processing_info": {
    "original_size": 66242,
    "optimized_size": 3789,
    "reduction_percent": 94.28
  }
}