{
  "decision": "PENDING",
  "application_number": "14994679",
  "date_published": "20160714",
  "date_produced": "20160628",
  "title": "SYSTEMS AND METHODS FOR MICRODONATIONS DERIVED FROM A CAPTURED RECEIPT IMAGE",
  "filing_date": "20160113",
  "inventor_list": [
    {
      "inventor_name_last": "TOMSA",
      "inventor_name_first": "Andra",
      "inventor_city": "Bronx",
      "inventor_state": "NY",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "CHAWLA",
      "inventor_name_first": "Rameet Singh",
      "inventor_city": "New York",
      "inventor_state": "NY",
      "inventor_country": "US"
    }
  ],
  "ipcr_labels": [
    "G06Q3002",
    "G06Q2010",
    "G06Q2022"
  ],
  "main_ipcr_label": "G06Q3002",
  "summary": "<SOH> SUMMARY OF THE EMBODIMENTS <EOH>The present invention provides for a method for collecting microdonations, comprising the steps of: providing an internet-enabled computing device comprising: a memory, for holding a set of computer-readable instructions, a processor, operatively connected to said memory, said processor configured to execute said set of computer-readable instructions, an image capture device in electronic communication with said processor; linking, a user financial account with a user account; calculating, by said processor, a monetary value for a transaction taken from a statement from said user financial account; calculating, by said processor, a monetary difference between the monetary value and the next largest whole dollar amount; sending, by said processor, the monetary difference to a designated financial account. In some embodiments, the designated financial account belongs to a charitable organization, and in others it belongs to an individual. Preferably, the monetary difference is less than $1.00. In alternative embodiments, the method of the present invention, further comprises the steps of: associating, by said processor, said monetary difference with a user account; adding, said monetary difference to a balance in said user account; determining, by said processor, a reward level to connect with said user account, wherein said determination is directly proportional to said balance. Preferably, the balance is reset on a preset interval. Additionally, the method of the present invention may also comprise the steps of determining, by said processor, an impact level of said user account, wherein said impact level corresponds to said balance, and the number of monetary differences added to said balance over a predetermined amount of time and/or providing, a redemption mechanism to said user account, wherein said redemption mechanism allows a user account to be credited with at least one reward, wherein said at least one reward correspond...",
  "patent_number": "None",
  "abstract": "A system and method for collecting microdonations of provided. Specifically, the system and its method of use provide a user with an easy way to scan and document the contents of a receipt, calculate the dollar amount necessary to bring the total to an integer amount, and facilitating the transfer of this dollar amount to at least one charity of a user's choice. In some instances, the system is also capable of generating these microdonations within a software application without the use of a paper receipt.",
  "publication_number": "US20160203526A1-20160714",
  "_processing_info": {
    "original_size": 54977,
    "optimized_size": 3248,
    "reduction_percent": 94.09
  }
}