{
  "decision": "REJECTED",
  "application_number": "14990114",
  "date_published": "20160707",
  "date_produced": "20160622",
  "title": "USER INTERACTION DEVICE",
  "filing_date": "20160107",
  "inventor_list": [
    {
      "inventor_name_last": "Martindale",
      "inventor_name_first": "Melanie",
      "inventor_city": "Merseyside",
      "inventor_state": "",
      "inventor_country": "GB"
    }
  ],
  "ipcr_labels": [
    "G06F30354"
  ],
  "main_ipcr_label": "G06F30354",
  "summary": "<SOH> SUMMARY <EOH>With a view to mitigating the foregoing disadvantages, the present system provides a user interaction device comprising, in various embodiments, an elongate outer casing having an axis, a chassis located within the outer casing, a switch having electrical contacts supported by the chassis, and a nib movable relative to the chassis and serving to close the switch when axially displaced towards the chassis, wherein the nib is attached to the chassis by means of an axially compressible resilient element of which a first end is anchored to the chassis and a second end is anchored to the nib, and wherein movement of the nib in a direction transverse to the axis of the outer casing is constrained by the resilient element. In various embodiments, the nib need not be, and preferably is not, guided by any element that passes through a hole in the outer casing or the chassis. Instead, it is constrained to move generally axially, preferably solely, by the resilient element that biases the nib into the open position of the switch and that also serves to prevent the nib from separating from the chassis. This construction avoids the risk of the nib, or any part attached to it, becoming jammed against a surface intended to guide and constrain its axial movement. In some embodiments, it is advantageous for the resilient element to be of a design that tends to centre the nib on the axis of the casing as the nib is depressed. A single helical spring does not fulfil this criterion as it tends to buckle while it is being compressed. In preferred embodiments, the resilient element may be constructed as a wave spring. Alternative suitable resilient elements may be formed by resilient bellows or concentric oppositely-handed helical springs. Conveniently, in various embodiments, the end of the resilient element may be integrally formed with a screw thread to engage with a mating thread in the nib in order to anchor the nib to the resilient element and allow removal of th...",
  "patent_number": "None",
  "abstract": "A user interaction device, in particular an electronic pen, is disclosed which comprises an elongate outer casing (112) having an axis, a chassis (114) located within the outer casing, a switch having electrical contacts (130) supported by the chassis, and a nib (116) movable relative to the chassis (114) and serving to close the switch when axially displaced towards the chassis (114). In the invention, the nib (116) is attached to the chassis (114) by means of an axially compressible resilient element (144) of which a first end (142) is anchored to the chassis (114) and a second end (146) is anchored to the nib (116), and movement of the nib (116) in a direction transverse to the axis of the outer casing (112) is constrained by the resilient element (144).",
  "publication_number": "US20160195945A1-20160707",
  "_processing_info": {
    "original_size": 20524,
    "optimized_size": 3288,
    "reduction_percent": 83.98
  }
}