{
  "decision": "REJECTED",
  "application_number": "14998573",
  "date_published": "20170126",
  "date_produced": "20170110",
  "title": "Multi-media platform",
  "filing_date": "20160119",
  "inventor_list": [
    {
      "inventor_name_last": "Glasgow",
      "inventor_name_first": "Dane",
      "inventor_city": "Los Altos",
      "inventor_state": "CA",
      "inventor_country": "US"
    }
  ],
  "ipcr_labels": [
    "G06F30484",
    "G06F1730"
  ],
  "main_ipcr_label": "G06F30484",
  "summary": "<SOH> BRIEF DESCRIPTION OF THE FIGURES <EOH>FIG. 1 illustrates a collaboration network according to example embodiments of the present invention. FIG. 2 illustrates a creation platform according to example embodiments of the present invention. FIG. 3 illustrates a creation process according to example embodiments of the present invention. FIG. 4 illustrates a collaboration process according to example embodiments of the present invention. FIG. 5 illustrates a collaboration network according to example embodiments of the present invention. FIG. 6 illustrates an application according to example embodiments of the present invention. FIG. 7 illustrates creation modules according to example embodiments of the present invention. FIG. 8 illustrates a review process according to example embodiments of the present invention. FIG. 9 illustrates a creation analytics module according to example embodiments of the present invention. FIG. 10 illustrates a portion of the creation platform according to example embodiments of the present invention. FIG. 11 illustrates multimedia development according to example embodiments of the present invention. FIG. 12 illustrates storyline development according to example embodiments of the present invention. FIG. 13 illustrates creative process according to example embodiments of the present invention. FIG. 14 illustrates a user interface display on a user device, according to example embodiments of the present invention. FIG. 15 illustrates a page of digital content having graphic elements, according to example embodiments of the present invention. FIG. 16 illustrates an example of supplemental options mapped to a storyline, according to example embodiments of the present invention. FIG. 17 illustrates an augmented reality module, according to example embodiments of the present invention. FIG. 18 illustrates a collaboration process, according to example embodiments of the present invention. detailed-description description=\"Detailed Descripti...",
  "patent_number": "None",
  "abstract": "A multi-media platform for creation of digital and other content. A creation platform connects distributed creators and reviewers to provide extrinsic and intrinsic feedback information to the creator. Analysis of consumption of digital content during the creation process is provided.",
  "publication_number": "US20170024095A1-20170126",
  "_processing_info": {
    "original_size": 113988,
    "optimized_size": 2811,
    "reduction_percent": 97.53
  }
}