{
  "date_produced": "20160427",
  "publication_number": "US20160132770A1-20160512",
  "main_ipcr_label": "G06N312",
  "decision": "PENDING",
  "application_number": "14996034",
  "inventor_list": [
    {
      "inventor_name_last": "Cantin",
      "inventor_name_first": "Jason F.",
      "inventor_city": "Round Rock",
      "inventor_state": "TX",
      "inventor_country": "US"
    }
  ],
  "abstract": "After beginning an evaluation of a first generation of a first plurality of candidate solutions and prior to completion of the evaluation, a system can determine a first plurality of tournament participants from the first plurality of candidate solutions The system may determine whether each of the first plurality of tournament participants have been evaluated. In response to determining each of the first plurality of tournament participants have been evaluated the system can determine a first one or more winners of the tournament and determine whether a first quantity of the first one or more winners is above a predefined threshold. In response to determining the first quantity is above a predefined threshold, the system can determine a second generation of a second plurality of candidate solutions, the second plurality of candidate solutions based, at least in part, on the first one or more winners.",
  "filing_date": "20160114",
  "patent_number": "None",
  "summary": "<SOH> SUMMARY <EOH>Embodiments of the inventive subject matter include early construction of candidate solutions. While at least one candidate solution of a first generation of candidate solutions remains to be evaluated in accordance with a fitness function for an optimization problem, a plurality of candidate solutions is selected from the first generation of candidate solutions to participate in a tournament. It is determined whether each of the plurality of candidate solutions selected to participate in the tournament have been evaluated in accordance with the fitness function. If all have been evaluated, then one or more winners of the tournament are selected from the plurality of candidate solutions of the first generation of candidate solutions. A candidate solution of a second generation of candidate solutions is created with the selected one or more winners of the tournament in accordance with a genetic operator.",
  "date_published": "20160512",
  "title": "EARLY GENERATION OF INDIVIDUALS TO ACCELERATE GENETIC ALGORITHMS",
  "ipcr_labels": [
    "G06N312"
  ],
  "_processing_info": {
    "original_size": 81475,
    "optimized_size": 2402,
    "reduction_percent": 97.05
  }
}