{
  "decision": "ACCEPTED",
  "application_number": "14995992",
  "date_published": "20160721",
  "date_produced": "20160706",
  "title": "SYSTEM AND METHODS FOR OBTAINING DIGITAL MULTIMEDIA FILES FROM A SERVER BASED ON OPTICALLY SCANNED DIGITAL RIGHTS MANAGEMENT INFORMATION TAG IMPRINTED ON A STORE PURCHASED COMPACT MULTIMEDIA DISK",
  "filing_date": "20160114",
  "inventor_list": [
    {
      "inventor_name_last": "Ortiz",
      "inventor_name_first": "Sofia A.",
      "inventor_city": "Albuquerque",
      "inventor_state": "NM",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Ortiz",
      "inventor_name_first": "Sharon G.",
      "inventor_city": "Albuquerque",
      "inventor_state": "NM",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Ortiz",
      "inventor_name_first": "Luis M.",
      "inventor_city": "Albuquerque",
      "inventor_state": "NM",
      "inventor_country": "US"
    }
  ],
  "ipcr_labels": [
    "G06F2162",
    "G06K710"
  ],
  "main_ipcr_label": "G06F2162",
  "summary": "<SOH> SUMMARY OF EMBODIMENTS <EOH>In order to overcome the limitations currently existing in the art, the present inventors provide systems and methods for obtaining digital multimedia files from a server after optically reading a scannable digital rights management information tag imprinted on a store-purchased items (e.g., compact disk, greeting card) and utilizing the tag to authenticate rights bestowed upon on the user so that the user can obtain digital files for the media from a vendor's remote server (e.g., iTunes store, Google Play Store, Amazon) for processing by a digital rights management service (e.g., iTunes™, Google Play™, etc.), and that are accessible by and associated with the user, wherein the user can obtain and render the media via the digital rights management service on a device operated by the user (e.g., portable devices, a smartphone, a tablet computer, or a laptop computer). It is also a feature of the present invention to enable a purchaser and licensee thereby of media to provide it as a gift to another person once purchased using the digital rights management service. Gift cards are often provided as gifts but merely provide the recipient with a dollar amount (credit) to spend with a vendor. Instead, in accordance with features of the present invention, the purchaser can customize an arrangement of media (e.g., songs and pictures) and provide it as a gift to the recipient via a unique code (e.g., barcode or QR code) that can be imprinted on a greeting card (e.g., birthday card), or associated with a gift card, or that can also be obtained from the vendor electronically during a transaction with its server. The recipient can then enjoy media that was custom arranged by the initial purchase and gift-giver. Rights to digital media (e.g., music or videos) can be purchased and then transferred to a recipient as a gift for their use. But if the recipient already had rights to some of the media provided in the arrangement (e.g., duplicate of so...",
  "patent_number": "9959396",
  "abstract": "System and methods for obtaining digital multimedia files from a server based on optically scanned digital rights management information tag imprinted on physical media is described. A greeting card or gift card can be provided with indicia containing a code printed thereon. Then the code can be optically scanned by client device. The code can then be provided by the client device to a remote server for retrieval of multimedia files identified by the code if the code authorizes multimedia file retrieval from the remote server by the client device. Then the client device retrieves multimedia files identified by the code from the remote server following authorization of multimedia file retrieval by the remote server based on the code.",
  "publication_number": "US20160210466A1-20160721",
  "_processing_info": {
    "original_size": 19036,
    "optimized_size": 3756,
    "reduction_percent": 80.27
  }
}