{
  "decision": "PENDING",
  "application_number": "14991617",
  "date_published": "20160505",
  "date_produced": "20160420",
  "title": "NETWORKED COMPUTER SYSTEM AND COMPUTER IMPLEMENTED METHODS FOR PROVIDING AN ONLINE AUCTION WEBPAGE WITH SKILL-BASED GAME",
  "filing_date": "20160108",
  "inventor_list": [
    {
      "inventor_name_last": "Randel",
      "inventor_name_first": "Michael D.",
      "inventor_city": "Acworth",
      "inventor_state": "GA",
      "inventor_country": "US"
    }
  ],
  "ipcr_labels": [
    "G06Q3008",
    "A63F13792",
    "H04L2908"
  ],
  "main_ipcr_label": "G06Q3008",
  "summary": "<SOH> SUMMARY OF THE INVENTION <EOH>The invention is generally directed to networked computer systems and computer implemented methods for generating and providing online auction webpages to users. In one aspect of the invention, a networked computer system for providing a webpage to a user via the World Wide Web is provided. The system includes a database and a computer server that includes a processor that is coupled to a memory device. The database includes a webpage list including a plurality of host webpage data records and an auction list including a plurality of auction items. Each host webpage data record includes a host webpage identifier associated with a host webpage and visual webpage design elements associated with the corresponding host webpage. The computer server processor is programmed to receive from a web browser of a user computing device a participation request including a signal indicating activation of an auction webpage link being displayed in a host webpage. The signal includes a host webpage identifier. The processor is programmed to access the database, determine a host webpage data record associated with the received host webpage identifier, and retrieve the visual webpage design elements included with the determined host webpage data record. The processor is also programmed to display an online auction including generating and displaying an auction webpage on the user computing device via the web browser. The auction webpage includes the retrieved visual webpage design elements associated with the host webpage and a plurality of auction items. The processor receives from the web browser a signal indicating a bid request from the user including a selected auction item and a bid unit, generates and displays a skill-based game to the user via the user computing device in response to the received bid request, receives a skill input from the user and determines an outcome of the skill-based game as a function of the received skill input, and ...",
  "patent_number": "None",
  "abstract": "A networked computer system for providing a webpage to a user is described herein. The networked computer system includes a database and a computer server that includes a processor that is coupled to a memory device. The database includes a webpage list including a plurality of host webpage records and an auction list including a plurality of auction items. The computer server receives a participation request from a web browser, accesses the database, and generates an auction webpage. The computer server receives a signal indicating a bid request from the user, generates a skill-based game to the user, receives a skill input from the user, determines an outcome of the skill-based game based on the skill input, and generates a bid associated with the received bid request based on the outcome of the skill-based game.",
  "publication_number": "US20160125521A1-20160505",
  "_processing_info": {
    "original_size": 188304,
    "optimized_size": 3464,
    "reduction_percent": 98.16
  }
}