{
  "decision": "PENDING",
  "application_number": "14998898",
  "date_published": "20160908",
  "date_produced": "20160824",
  "title": "Micro trusted network",
  "filing_date": "20160301",
  "inventor_list": [
    {
      "inventor_name_last": "Tan",
      "inventor_name_first": "Sizhe",
      "inventor_city": "Berkeley",
      "inventor_state": "CA",
      "inventor_country": "US"
    }
  ],
  "ipcr_labels": [
    "G06Q2038",
    "H04L914",
    "G06Q2034",
    "G06Q2006",
    "G06Q2024",
    "H04L930",
    "H04L932"
  ],
  "main_ipcr_label": "G06Q2038",
  "summary": "<SOH> BRIEF DESCRIPTION OF THE DRAWINGS <EOH>Non-limiting and non-exhaustive embodiments of the present invention are described with reference to the following figures, wherein like reference numerals refer to like parts throughout the various views unless otherwise specified. FIG. 1A shows an exemplary embedded picture already embedded with a payload. FIG. 1B shows an exemplary payload embedded in the embedded picture. FIG. 2A shows the embedded picture partitioned into a plurality of areas. FIG. 2B shows the embedded picture partitioned into two areas. FIG. 2C shows the embedded picture having areas arbitrarily shaped and located. FIG. 3 shows a first payload and a second payload in the embedded picture. FIG. 4 shows a block diagram of an initiation process of micro trusted network between participants A and B. FIG. 5 shows a block diagram of a validation process of micro trusted network between participants A and B. FIG. 6 shows an embedded picture being a digital credit card. FIG. 7 shows a block diagram of a validation process of digital credit card to a holder by an issuer. FIG. 8 shows a block diagram of a validation process of digital credit card to a holder and a merchant by an issuer. FIG. 9 shows an embedded picture being a digital ID card. FIG. 10 shows a block diagram of a validation process of digital ID card to a holder by an issuer. FIG. 11 shows a block diagram of a validation process of digital ID card to a holder and a third party by an issuer. FIG. 12 shows an embedded picture being a digital currency note. FIG. 13 shows a block diagram of a validation process of digital currency note to an owner of a current digital currency note by two traders. FIG. 14A shows a block diagram of a process of transferring digital currency note from the owner of the current digital currency note to an owner of a new digital currency note. FIG. 14B shows continuation of FIG. 14A . FIG. 15 shows a current digital currency note and a new digital currency note. detail...",
  "patent_number": "None",
  "abstract": "An embedded picture can be embedded with secret embedded payloads. A method is disclosed for performing trusted binding between a first participant and a second participant based on RSA cryptosystem using the embedded picture having a first area assigned to the first participant for a first secret embedded payload, and a second area assigned to the second participant for a second secret embedded payload. Multiple payloads may be embedded in the embedded picture by multiple participants. Each payload can only be encrypted and decrypted by its corresponding participant. Multiple participants may form a trusted network, in the network each participant can be recognized and validated digitally. Accordingly, various activities such as transaction of digital credit card, verification of digital identification (ID) card, transaction of digital currency note may be performed using the trusted network",
  "publication_number": "US20160260093A1-20160908",
  "_processing_info": {
    "original_size": 36369,
    "optimized_size": 3481,
    "reduction_percent": 90.43
  }
}