{
  "date_produced": "20160420",
  "publication_number": "US20160125300A1-20160505",
  "main_ipcr_label": "G06N504",
  "decision": "PENDING",
  "application_number": "14994519",
  "inventor_list": [
    {
      "inventor_name_last": "Patil",
      "inventor_name_first": "Dhanurjay A.S.",
      "inventor_city": "Atherton",
      "inventor_state": "CA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Jastrebski",
      "inventor_name_first": "Grahame Andrew",
      "inventor_city": "San Jose",
      "inventor_state": "CA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Miller",
      "inventor_name_first": "Allison E.",
      "inventor_city": "Mountain View",
      "inventor_state": "CA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Riccomini",
      "inventor_name_first": "Chris",
      "inventor_city": "Saratoga",
      "inventor_state": "CA",
      "inventor_country": "US"
    }
  ],
  "abstract": "In some example embodiments, a system and method are provided for graph pattern analysis. In example embodiments, pattern data of a primary network that includes data relating to relationships between entities are received. A reference matrix comprising a plurality of secondary network determined based on the pattern data of the primary network is generated A graphical display of the primary network and the reference matrix are displayed on a user interface. A selection of a secondary network from the plurality of secondary networks of the reference matrix is received. The selected secondary network has similar matching characteristics with at least a portion of the primary network. In response to the selection, the primary network is classified as a classification type related to the selected secondary network.",
  "filing_date": "20160113",
  "patent_number": "None",
  "summary": "<SOH> BRIEF DESCRIPTION OF THE DRAWINGS <EOH>Some embodiments are illustrated by way of example and not limitation in the figures of the accompanying drawings in which: FIG. 1 is a diagram of a system, according to an example embodiment, illustrating the generation and display of pattern data. FIG. 2 is a diagram of a Graphical User Interface (GUI), according to an example embodiment, displaying the pattern data (e.g., a primary network) and various secondary networks here displayed in a reference matrix. FIG. 3 is a GUI, according to an example embodiment, displaying a primary network and, additionally, various secondary networks wherein this primary network relates, more generally, to purchaser networks. FIG. 4 is a diagram of a GUI, according to an example embodiment, containing popup information relating to a particular selected secondary network. FIG. 5 is a block diagram of a computer system, according to an example embodiment, used to generate a reference matrix as it may appear within a GUI. FIG. 6 is a dual stream flowchart illustrating a method, according to an example embodiment, used to generate a reference matrix as it may appear within a GUI. FIG. 7 is a flowchart illustrating a method, according to an example embodiment, used to execute an operation that selects an Artificial Intelligence (A.I.) algorithm, or combinations of A.I. algorithms. FIG. 8 is a flowchart illustrating a method, according to an example embodiment, used to execute an operation that parses pattern data and extracts certain characteristics relating to the pattern data so as to generate a pattern characteristic set. FIG. 9 is a flowchart illustrating a method, according to an example embodiment, used to execute an operation that retrieves the A.I. algorithms and executes an A.I. engine. FIG. 10 is a flowchart illustrating a method, according to an example embodiment, used to execute an operation that generates a matrix such as the reference matrix using the A.I. generated dataset. ...",
  "date_published": "20160505",
  "title": "SYSTEM AND METHOD FOR GRAPH PATTERN ANALYSIS",
  "ipcr_labels": [
    "G06N504",
    "G06N9900",
    "G06N700"
  ],
  "_processing_info": {
    "original_size": 62837,
    "optimized_size": 3846,
    "reduction_percent": 93.88
  }
}