{
  "date_produced": "20170627",
  "publication_number": "US20170200084A1-20170713",
  "main_ipcr_label": "G06N504",
  "decision": "PENDING",
  "application_number": "14990094",
  "inventor_list": [
    {
      "inventor_name_last": "de Aguiar",
      "inventor_name_first": "Murilo Goncalves",
      "inventor_city": "Anerucaba",
      "inventor_state": "",
      "inventor_country": "BR"
    },
    {
      "inventor_name_last": "Elias",
      "inventor_name_first": "Guilherme Steinberger",
      "inventor_city": "Campinas",
      "inventor_state": "",
      "inventor_country": "BR"
    },
    {
      "inventor_name_last": "Paraiso",
      "inventor_name_first": "Marco Vinicius Landivar",
      "inventor_city": "Campinas",
      "inventor_state": "",
      "inventor_country": "BR"
    },
    {
      "inventor_name_last": "Tanada",
      "inventor_name_first": "Fabio Minoru",
      "inventor_city": "Campinas",
      "inventor_state": "",
      "inventor_country": "BR"
    },
    {
      "inventor_name_last": "Varga",
      "inventor_name_first": "Sergio",
      "inventor_city": "Campinas",
      "inventor_state": "",
      "inventor_country": "BR"
    }
  ],
  "abstract": "A system, method and program product for recommending a network resource provider to a resource consumer. An interactive recommendation engine for determining a recommendation of a network resource provider is provide and includes: a requirements collection manager that collects a set of requirements for an organization and includes: a query management system that provides an interactive platform for implementing a natural language dialog with a user; and a semantic analysis system that analyzes inputs from the user to identify requirements and formulate outputs to the user; a provider data curation manager that curates structured and unstructured provider information into a provider knowledgebase; and a decision analytics system that analyzes the set of requirements and provider knowledgebase to identify a recommended resource provider.",
  "filing_date": "20160107",
  "patent_number": "None",
  "summary": "<SOH> SUMMARY <EOH>Aspects of the disclosure provide a solution for advising organizations on the selection of cloud providers and solution models based on a number of variables. The variables include not only technical requirements and budgets, but also factors such as business needs, historical trending, and value add offerings. The approach includes the use of a semantic analysis of non-structured input from the organization as well as structured information, such as service and cost models, from available providers. A first aspect discloses an interactive recommendation engine for recommending a network resource provider, comprising: a requirements collection manager that collects a set of requirements for an organization and includes: a query management system that provides an interactive platform for implementing a natural language dialog with a user; and a semantic analysis system that analyzes inputs from the user to identify requirements and formulate outputs to the user; a provider data curation manager that curates structured and unstructured provider information into a provider knowledgebase; and a decision analytics system that analyzes the set of requirements and provider knowledgebase to identify a recommended resource provider. A second aspect discloses a computer program product stored on a computer readable storage medium, which when executed by a computing system, recommends a network resource provider, comprising: programming instructions that collect a set of requirements from an organization and includes: programming instructions that provide an interactive platform for implementing a natural language dialog with a user; programming instructions that analyze inputs from the user to identify requirements and formulate outputs to the user; programming instructions that curate structured and unstructured provider information into a provider knowledgebase; and programming instructions that analyze the set of requirements and provider knowledgebase ...",
  "date_published": "20170713",
  "title": "SEMANTIC ANALYSIS NETWORK RESOURCE PROVIDER RECOMMENDATION SYSTEM",
  "ipcr_labels": [
    "G06N504"
  ],
  "_processing_info": {
    "original_size": 46228,
    "optimized_size": 4027,
    "reduction_percent": 91.29
  }
}