{
  "decision": "ACCEPTED",
  "application_number": "14992980",
  "date_published": "20160505",
  "date_produced": "20160420",
  "title": "PREVENTING PERSISTENT STORAGE OF CRYPTOGRAPHIC INFORMATION USING SIGNALING",
  "filing_date": "20160111",
  "inventor_list": [
    {
      "inventor_name_last": "Cignetti",
      "inventor_name_first": "Todd Lawrence",
      "inventor_city": "Auburn",
      "inventor_state": "VA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Brandwine",
      "inventor_name_first": "Eric Jason",
      "inventor_city": "Haymarket",
      "inventor_state": "VA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Fitzgerald",
      "inventor_name_first": "Robert Eric",
      "inventor_city": "Herndon",
      "inventor_state": "VA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Doane",
      "inventor_name_first": "Andrew J.",
      "inventor_city": "Vienna",
      "inventor_state": "VA",
      "inventor_country": "US"
    }
  ],
  "ipcr_labels": [
    "H04L2906",
    "G06F9455",
    "G06F948"
  ],
  "main_ipcr_label": "H04L2906",
  "summary": "<SOH> BRIEF DESCRIPTION OF THE DRAWINGS <EOH>Various embodiments in accordance with the present disclosure will be described with reference to the drawings, in which: FIG. 1 shows a diagram illustrating various aspects of the present disclosure; FIG. 2 shows a diagram illustrating various aspects of the present disclosure; FIG. 3 shows an illustrative example of a device with which various embodiments can be practiced; FIG. 4 shows an illustrative example of a device with which various embodiments can be practiced; FIG. 5 shows a diagram illustrating various aspects of the present disclosure; FIG. 6 shows an illustrative example of a process for processing a request in accordance with at least one embodiment; FIG. 7 shows an illustrative example of a process for processing a request in accordance with at least one embodiment; FIG. 8 shows an illustrative example of a process for processing a request in accordance with at least one embodiment; FIG. 9 shows an illustrative example of a process for processing a request in accordance with at least one embodiment; FIG. 10 shows an illustrative example of a process for processing a request in accordance with at least one embodiment; and FIG. 11 illustrates an environment in which various embodiments can be implemented. detailed-description description=\"Detailed Description\" end=\"lead\"?",
  "patent_number": "9680808",
  "abstract": "Organizations maintain and generate large amounts of sensitive information using computer hardware resources and services of a service provider. Furthermore, there is a need to be able to delete large amounts of data securely and quickly by encrypting the data with a key and destroying the key. To ensure that information stored remotely is secured and capable of secure deletion, cryptographic keys used by the organization should be prevented from being persistently stored during serialization operations. Signaling methods are used to notify virtual machine instances of serialization events in order to prevent keying material from being stored persistently.",
  "publication_number": "US20160127336A1-20160505",
  "_processing_info": {
    "original_size": 85775,
    "optimized_size": 3068,
    "reduction_percent": 96.42
  }
}