{
  "date_produced": "20160420",
  "publication_number": "US20160125302A1-20160505",
  "main_ipcr_label": "G06N504",
  "decision": "ACCEPTED",
  "application_number": "14994635",
  "inventor_list": [
    {
      "inventor_name_last": "SANTOS",
      "inventor_name_first": "Eugene S.",
      "inventor_city": "Canfield",
      "inventor_state": "OH",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "SANTOS",
      "inventor_name_first": "Eunice E.",
      "inventor_city": "Canfield",
      "inventor_state": "OH",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "SANTOS",
      "inventor_name_first": "Evelyn W.",
      "inventor_city": "Canfield",
      "inventor_state": "OH",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "SANTOS, JR.",
      "inventor_name_first": "Eugene",
      "inventor_city": "Canfield",
      "inventor_state": "OH",
      "inventor_country": "US"
    }
  ],
  "abstract": "A knowledge-based system under uncertainties and/or incompleteness, referred to as augmented knowledge base (AKB) is provided, including constructing, reasoning, analyzing and applying AKBs by creating objects in the form E→A, where A is a rule in a knowledgebase and E is a set of evidences that supports the rule A. A reasoning scheme under uncertainties and/or incompleteness is provided as augmented reasoning (AR).",
  "filing_date": "20160113",
  "patent_number": "9679251",
  "summary": "<SOH> SUMMARY <EOH>According to embodiments of the invention, a new knowledge-based system under uncertainties and/or incompleteness, referred to as augmented knowledge base (AKB) is provided; and methods for constructing, reasoning, analyzing and applying AKBs are provided. In addition, a new method for reasoning under uncertainties and/or incompleteness is provided. This method will be referred to as augmented reasoning (AR). Advantages and powers of are described herein. According to an aspect of an embodiment, a method and apparatus are provided for representing a knowledge base by creating objects in the form E→A, where A is a rule in the knowledge base, and E is a set of evidences that supports the rule A; and determining, by deductive reasoning using the knowledge in the knowledge base and/or inducting or extracting new knowledge from the knowledge base; and constructing higher order knowledge bases to insure that the knowledge base is consistent. Such knowledge base will be referred to as augmented knowledge base. For example, a composite set of evidences G is computed, the composite set of evidences G is a combination of sets of evidences E in the knowledge base in support of a target rule L that is implied by a combination of rules in the knowledge base. These and other embodiments, together with other aspects and advantages which will be subsequently apparent, reside in the details of construction and operation as more fully hereinafter described and claimed, reference being had to the accompanying drawings forming a part hereof, wherein like numerals refer to like parts throughout.",
  "date_published": "20160505",
  "title": "AUGMENTED KNOWLEDGE BASE AND REASONING WITH UNCERTAINTIES AND/OR INCOMPLETENESS",
  "ipcr_labels": [
    "G06N504"
  ],
  "_processing_info": {
    "original_size": 151956,
    "optimized_size": 3069,
    "reduction_percent": 97.98
  }
}