{
  "decision": "ACCEPTED",
  "application_number": "14991494",
  "date_published": "20170713",
  "date_produced": "20170627",
  "title": "UNIVERSAL INKING SUPPORT",
  "filing_date": "20160108",
  "inventor_list": [
    {
      "inventor_name_last": "Rajasankar",
      "inventor_name_first": "Sushanth",
      "inventor_city": "Redmond",
      "inventor_state": "WA",
      "inventor_country": "US"
    }
  ],
  "ipcr_labels": [
    "G06F30484",
    "G06F30485",
    "G06F30354",
    "G09G5377",
    "G06T360",
    "G06T320",
    "G06T340",
    "G06F3041",
    "G06F30488",
    "G06F1724"
  ],
  "main_ipcr_label": "G06F30484",
  "summary": "<SOH> SUMMARY <EOH>Examples are disclosed for supporting the use of inking input applied to any application of a computing device, even if that application does not include native support of inking input. An example computing device includes a display configured to present a user interface, an input sensor configured to receive inking input to the user interface including one or more of pen input and hand-based input, a processor, and a storage device storing instructions executable by the processor to receive visual frames from an executing application indicating displayed content for the executing application, and present displayed ink on a first location of the display based at least on an inking input received via the input sensor. The instructions are further executable to detect a change in the displayed content for the executing application based at least on a comparison of two or more of the visual frames from the executing application, determine a second location of the displayed ink on the display based at least on the change in the displayed content, and present, via the display, the displayed ink in the second location of the display. This Summary is provided to introduce a selection of concepts in a simplified form that are further described below in the Detailed Description. This Summary is not intended to identify key features or essential features of the claimed subject matter, nor is it intended to be used to limit the scope of the claimed subject matter. Furthermore, the claimed subject matter is not limited to implementations that solve any or all disadvantages noted in any part of this disclosure.",
  "patent_number": "9904447",
  "abstract": "Examples are disclosed for using and tracking inking input applied to applications of a computing device. An example computing device includes a display, an input sensor configured to receive inking input, a processor, and a storage device storing instructions executable by the processor to receive visual frames from an executing application indicating displayed content for the executing application, and, present displayed ink on a first location of the display based at least on an inking input received via the input sensor. The instructions are further executable to detect a change in the displayed content for the executing application based at least on a comparison of two or more of the visual frames from the executing application, determine a second location of the displayed ink on the display based at least on the change in the displayed content, and present the displayed ink in the second location of the display.",
  "publication_number": "US20170199653A1-20170713",
  "_processing_info": {
    "original_size": 64457,
    "optimized_size": 3205,
    "reduction_percent": 95.03
  }
}