{
  "date_produced": "20160628",
  "publication_number": "US20160203408A1-20160714",
  "main_ipcr_label": "G06N700",
  "decision": "PENDING",
  "application_number": "14991711",
  "inventor_list": [
    {
      "inventor_name_last": "Shita",
      "inventor_name_first": "Mounir",
      "inventor_city": "Portland",
      "inventor_state": "OR",
      "inventor_country": "US"
    }
  ],
  "abstract": "Systems and methods for a cloud-based artificial intelligence engine are provided. In one embodiment, a graph engine identifies an intention based on a loop around one or more subnets, a personal cloud generates an intelligence report based on the identified intention, and a user device performs actions based on the intelligence report and a confidence level of nodes within the loop above a threshold. In this way, a user device may perform actions informed by a global intelligence that understands contextual information while maintaining privacy control.",
  "filing_date": "20160108",
  "patent_number": "None",
  "summary": "<SOH> BACKGROUND AND SUMMARY <EOH>Computerized personal assistants ostensibly programmed with artificial intelligence enable a user to use the features of a smart phone by voicing commands. However, such personal assistants rarely understand what is asked of them, let alone anticipate requests in real-time. In fact, much of the intelligent software may be considered sophisticated natural language processing systems connected to a search engine. Meanwhile, computer users generated 2.8 zettabytes of digital information in 2012, and this amount is projected to increase annually at an exponential rate. Some of this data may be used to train artificial intelligence algorithms for computerized personal assistants. However, even with a gargantuan amount of personal data, such algorithms struggle with identifying and understanding contextual information. Moreover, users are growing increasingly discontent with corporate and government surveillance of their personal data, and many users remain skeptical about the potential for technology to know everything about them. Users who create information using technology should be the rightful owners of their data. Thus, users need a way to assert ownership of their data and control how their data is used. The inventors have recognized the above issues and have devised several approaches to resolve them. In particular, systems and methods for a cloud-based artificial intelligence engine are provided. In one embodiment, a personal cloud may graphically model hard and soft data received from a user device, where graphical models comprise a network of nodes and links. The personal cloud may calculate an effective probability for each node of the network. Abstracted versions of the graphical models, or subnets, may be sent to a graph engine that connects a plurality of subnets from a plurality of personal clouds to each other. In some examples, a user may control security settings and permissions on the personal cloud to determine what ...",
  "date_published": "20160714",
  "title": "SYSTEMS AND METHODS FOR A CLOUD-BASED ARTIFICIAL INTELLIGENCE ENGINE",
  "ipcr_labels": [
    "G06N700",
    "H04L2908"
  ],
  "_processing_info": {
    "original_size": 69548,
    "optimized_size": 3127,
    "reduction_percent": 95.5
  }
}