{
  "date_produced": "20170301",
  "publication_number": "US20170076219A1-20170316",
  "main_ipcr_label": "G06N700",
  "decision": "PENDING",
  "application_number": "14997447",
  "inventor_list": [
    {
      "inventor_name_last": "Byrnes",
      "inventor_name_first": "John J.",
      "inventor_city": "Poway",
      "inventor_state": "CA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Frederickson",
      "inventor_name_first": "Clint",
      "inventor_city": "Helena",
      "inventor_state": "MT",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "McIntyre",
      "inventor_name_first": "Kyle J.",
      "inventor_city": "Montana City",
      "inventor_state": "MT",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Muezzinoglu",
      "inventor_name_first": "Tulay",
      "inventor_city": "San Diego",
      "inventor_state": "CA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Chow",
      "inventor_name_first": "Edmond D.",
      "inventor_city": "Encinitas",
      "inventor_state": "CA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Deans",
      "inventor_name_first": "William T.",
      "inventor_city": "Allentown",
      "inventor_state": "PA",
      "inventor_country": "US"
    }
  ],
  "abstract": "Systems and methods for forecasting the prominence of various attributes in a future subject matter area are disclosed. An attribute is determined based on inputs received by a computing system. A set of indicators is determined based on the attribute and features extracted from an existing document set. The prominence of the attribute in the existing document set is determined. A prominence estimate of the attribute in a future document set is determined.",
  "filing_date": "20160115",
  "patent_number": "None",
  "summary": "<SOH> BRIEF DESCRIPTION OF THE DRAWINGS <EOH>This disclosure is illustrated by way of example and not by way of limitation in the accompanying figures. The figures may, alone or in combination, illustrate one or more embodiments of the disclosure. Elements illustrated in the figures are not necessarily drawn to scale. Reference labels may be repeated among the figures to indicate corresponding or analogous elements. FIG. 1 is a simplified schematic diagram of at least one embodiment of an environment of a computing system comprising a prominence predictor subsystem as disclosed herein; FIG. 2 is a simplified schematic diagram of at least one embodiment of a modeler subsystem of the prominence predictor subsystem shown in FIG. 1 ; FIG. 3 is a simplified schematic diagram of at least one embodiment of a network modeler of the prominence predictor subsystem shown in FIG. 1 ; FIG. 4 is a simplified schematic diagram of at least one embodiment of an indicator generator of the prominence predictor subsystem shown in FIG. 1 ; FIG. 5 is a simplified schematic diagram of at least one embodiment of a prominence forecaster of the prominence predictor subsystem shown in FIG. 1 ; FIG. 6 is a simplified flow diagram of at least one embodiment of a method for estimating the prominence of an attribute in a document set executable by a computing system, such as the computing system of FIG. 1 ; FIG. 7 is a simplified block diagram of at least one embodiment of a computing environment in which the content analyzer subsystem of FIG. 1 may be implemented; and FIG. 8 is a simplified diagram of at least one embodiment of term tree. detailed-description description=\"Detailed Description\" end=\"lead\"?",
  "date_published": "20170316",
  "title": "PREDICTION OF FUTURE PROMINENCE ATTRIBUTES IN DATA SET",
  "ipcr_labels": [
    "G06N700",
    "G06N9900",
    "G06F1730"
  ],
  "_processing_info": {
    "original_size": 94762,
    "optimized_size": 3480,
    "reduction_percent": 96.33
  }
}