{
  "decision": "PENDING",
  "application_number": "14995253",
  "date_published": "20160804",
  "date_produced": "20160720",
  "title": "PROCESSING APPARATUS, MEMORY-CONTROLLING APPARATUS, AND CONTROL METHOD OF PROCESSING APPARATUS",
  "filing_date": "20160114",
  "inventor_list": [
    {
      "inventor_name_last": "NAKAMURA",
      "inventor_name_first": "Takeo",
      "inventor_city": "Kawasaki",
      "inventor_state": "",
      "inventor_country": "JP"
    }
  ],
  "ipcr_labels": [
    "G06F1110",
    "G06F306"
  ],
  "main_ipcr_label": "G06F1110",
  "summary": "<SOH> BRIEF DESCRIPTION OF DRAWINGS <EOH>FIG. 1 is a block diagram of a processing apparatus according to an embodiment of the present invention; FIG. 2 is a block diagram of a memory controller according to a first embodiment of the present invention; FIG. 3 is a diagram of an example of the storage state of data in a DIMM according to the first embodiment; FIG. 4 is a flowchart of a writing process of the data to be written in the DIMM by the memory controller according to the first embodiment; FIG. 5 is a flowchart of a reading process of the data to be read from the DIMM by the memory controller according to the first embodiment; FIG. 6 is a diagram of an example of the storage state of data in the DIMM according to a modification of the first embodiment; FIG. 7 is a block diagram a memory controller according to a second embodiment of the present invention; FIG. 8 is a flowchart of a reading process of the data to be read from a DIMM by the memory controller according to the second embodiment; FIG. 9 is a block diagram of a memory controller according to a third embodiment of the present invention; FIG. 10 is a diagram of an example of the storage state of data in a DIMM according to the third embodiment; and FIG. 11 is a block diagram of a memory controller according to a fourth embodiment of the present invention. detailed-description description=\"Detailed Description\" end=\"lead\"?",
  "patent_number": "None",
  "abstract": "In a processing apparatus according to an embodiment of the present invention, a central processing unit (CPU) outputs data, and a dual inline memory module (DIMM) includes a plurality of dynamic random access memories (DRAMs). Check bit generators generate error-checking codes for checking pieces of data output by the CPU, respectively. The check bit generators then add the generated error-checking codes to respective pieces of the data, thereby generating pieces or data with respective error-checking codes. A data-to-be-written selecting circuit splits each piece of the data with the respective error-checking codes generated by the cheek bit generators and stores a piece of the split data with the respective error-checking codes in a portion of corresponding one of the DRAMs.",
  "publication_number": "US20160224410A1-20160804",
  "_processing_info": {
    "original_size": 74416,
    "optimized_size": 2793,
    "reduction_percent": 96.25
  }
}