{
  "date_produced": "20170627",
  "publication_number": "US20170200093A1-20170713",
  "main_ipcr_label": "G06N9900",
  "decision": "PENDING",
  "application_number": "14995091",
  "inventor_list": [
    {
      "inventor_name_last": "Motahari Nezhad",
      "inventor_name_first": "Hamid Reza",
      "inventor_city": "San Jose",
      "inventor_state": "CA",
      "inventor_country": "US"
    }
  ],
  "abstract": "In one embodiment, a computer-implemented method for action-aware communication and conversation prioritization includes: identifying an importance of one or more parties to a communication or conversation; evaluating content of the communication or conversation to identify one or more features of the communication or conversation; assessing an importance of the content included in the communication or conversation based on one or more of the identified features; determining an urgency of the communication or conversation based on one or more of the identified features; and prioritizing the communication or conversation based at least in part on the importance of one or more of the parties, the importance of the content, and the urgency of the communication or conversation. The method is adaptive in a continuous manner based on user actions responsive to the communication or conversation. Related systems and computer program products are also disclosed.",
  "filing_date": "20160113",
  "patent_number": "None",
  "summary": "<SOH> SUMMARY <EOH>In one embodiment, a computer-implemented method for action-aware communication and conversation prioritization includes: identifying an importance of one or more parties to a communication or conversation; evaluating content of the communication or conversation to identify one or more features of the communication or conversation; assessing an importance of the content included in the communication or conversation based on one or more of the identified features; determining an urgency of the communication or conversation based on one or more of the identified features; and prioritizing the communication or conversation based at least in part on the importance of one or more of the parties, the importance of the content, and the urgency of the communication or conversation. In another embodiment, a computer program product is for action-aware prioritization of communications and conversations. The computer program product includes a computer readable storage medium having program instructions embodied therewith, and the program instructions are executable by a processor to cause the processor to: identify, using the processor, an importance of one or more parties to a communication or conversation; evaluate, using the processor, content of the communication or conversation to identify one or more features of the communication; assess, using the processor an importance of the content included in the communication or conversation based on one or more of the identified features; determine, using the processor an urgency of the communication or conversation based on one or more of the identified features; and prioritize, using the processor, the communication or conversation based at least in part on the importance of one or more of the parties, the importance of the content, and the urgency of the communication or conversation. In still another embodiment, a system for action-aware prioritization of communications and conversations includes a process...",
  "date_published": "20170713",
  "title": "ADAPTIVE, PERSONALIZED ACTION-AWARE COMMUNICATION AND CONVERSATION PRIORITIZATION",
  "ipcr_labels": [
    "G06N9900"
  ],
  "_processing_info": {
    "original_size": 150859,
    "optimized_size": 3551,
    "reduction_percent": 97.65
  }
}