{
  "date_produced": "20170705",
  "publication_number": "US20170206451A1-20170720",
  "main_ipcr_label": "G06N502",
  "decision": "PENDING",
  "application_number": "14995852",
  "inventor_list": [
    {
      "inventor_name_last": "Mahler",
      "inventor_name_first": "Paul Justin",
      "inventor_city": "San Francisco",
      "inventor_state": "CA",
      "inventor_country": "US"
    }
  ],
  "abstract": "Methods, systems, and apparatus, including computer programs encoded on computer storage media, for centralized management of predictive models. One of the methods includes receiving a plurality of model versions from respective teams within the organization. Each received model version is processed to generate a respective predictive model corresponding to the model version, including identifying one or more collections of training data specified by the model version, identifying one or more training engines specified by the model version, training, by the identified one or more training engines, a predictive model using the identified one or more collections of training data, computing one or more performance metrics for the predictive model, and associating the one or more performance metrics for the predictive model with the corresponding model version in the version repository.",
  "filing_date": "20160114",
  "patent_number": "None",
  "summary": "<SOH> SUMMARY <EOH>This specification describes a model maintenance system that provides for centralized management of predictive models generated by teams within an organization. Particular embodiments of the subject matter described in this specification can be implemented so as to realize one or more of the following advantages. Multiple teams within an organization and share and build on each other's work. This leads to decreased work duplication within the organization. Management within an organization can easily obtain data about which teams generate the best models, and underperforming teams can be encouraged to build off the work of better performing teams. A system can support automatic and consistent retraining of models that use a data collection that becomes obsolete. The details of one or more embodiments of the subject matter of this specification are set forth in the accompanying drawings and the description below. Other features, aspects, and advantages of the subject matter will become apparent from the description, the drawings, and the claims.",
  "date_published": "20170720",
  "title": "CENTRALIZED MANAGEMENT OF PREDICTIVE MODELS",
  "ipcr_labels": [
    "G06N502",
    "G06N9900"
  ],
  "_processing_info": {
    "original_size": 50491,
    "optimized_size": 2524,
    "reduction_percent": 95.0
  }
}