{
  "decision": "ACCEPTED",
  "application_number": "14995711",
  "date_published": "20160721",
  "date_produced": "20160706",
  "title": "CONVERTING DEVICE AND CONVERTING METHOD",
  "filing_date": "20160114",
  "inventor_list": [
    {
      "inventor_name_last": "KATAOKA",
      "inventor_name_first": "Masahiro",
      "inventor_city": "Kamakura",
      "inventor_state": "",
      "inventor_country": "JP"
    },
    {
      "inventor_name_last": "MIYASHITA",
      "inventor_name_first": "lsao",
      "inventor_city": "Shizuoka",
      "inventor_state": "",
      "inventor_country": "JP"
    },
    {
      "inventor_name_last": "KAWAMURA",
      "inventor_name_first": "Hiroyuki",
      "inventor_city": "Shizuoka",
      "inventor_state": "",
      "inventor_country": "JP"
    }
  ],
  "ipcr_labels": [
    "H03M730",
    "G06F1722"
  ],
  "main_ipcr_label": "H03M730",
  "summary": "<SOH> SUMMARY <EOH>According to an aspect of an embodiment, a non-transitory computer-readable recording medium stores therein a converting program. The converting program causes a computer to perform a process. The process includes inputting a compressed file in which character string data with a first character code is compressed by a unit of character string including a single character or a plurality of characters. The process includes converting compression information included in the compressed file into converted compression information, the compression information mapping each of compressed character string data in the compressed file to each of corresponding unit of character string with the first character code, thereby the converted compression information mapping each of the compressed character string data in the compressed file to each of the corresponding unit of character string with a second character code. The process includes generating a converted compression file from the converted compression information and each of the compressed character string data. The object and advantages of the invention will be realized and attained by means of the elements and combinations particularly pointed out in the claims. It is to be understood that both the foregoing general description and the following detailed description are exemplary and explanatory and are not restrictive of the invention, as claimed.",
  "patent_number": "9425821",
  "abstract": "An information processing apparatus receives a compressed file in which character string data with a first character code is compressed by a unit of character string including a single character or a plurality of characters. The information processing apparatus converts compression information included in the compressed file into converted compression information, the compression information mapping each of compressed character string data in the compressed file to each of corresponding unit of character string with the first character code, thereby the converted compression information mapping each of the compressed character string data in the compressed file to each of the corresponding unit of character string with a second character code. The information processing apparatus generates a converted compression file from the converted compression information and each of the compressed character string data.",
  "publication_number": "US20160211863A1-20160721",
  "_processing_info": {
    "original_size": 84824,
    "optimized_size": 3192,
    "reduction_percent": 96.24
  }
}