{
  "decision": "ACCEPTED",
  "application_number": "14993850",
  "date_published": "20160915",
  "date_produced": "20160831",
  "title": "SYSTEM AND METHOD FOR IDENTIFYING A GENUINE PRINTED DOCUMENT",
  "filing_date": "20160112",
  "inventor_list": [
    {
      "inventor_name_last": "Greene",
      "inventor_name_first": "Morton",
      "inventor_city": "Potomac Falls",
      "inventor_state": "VA",
      "inventor_country": "US"
    }
  ],
  "ipcr_labels": [
    "G06K714",
    "H04N132",
    "G07B100",
    "G06K700",
    "H04N100",
    "B42D25333",
    "G06K710",
    "G06K100"
  ],
  "main_ipcr_label": "G06K714",
  "summary": "<SOH> SUMMARY OF THE INVENTION <EOH>A method for verifying that a document is included in a document management system is disclosed. This method includes providing a document including a scan track of radio frequency readable information, radio frequency scanning the scan track with a scanner head no greater than 10 cm in width, generating document data dependently upon the radio frequency scanning, comparing the generated document data to stored document data, the stored document data generated dependently upon a prior radio frequency scanning of the scan track, and outputting an indication of the document being included in the document management system as determined by the comparing. A method for verifying that a document is included in a document management system is disclosed. This method includes providing a document including a scan track having scanner readable information, optically scanning the scan track with a scanner head no greater than 10 cm in width, generating document data dependently upon the optical scanning, comparing the generated document data to stored document data, the stored document data generated dependently upon a prior optical scan of the scan track, authenticating the document data using at least one radio frequency scan, outputting an indication of the document being included in the document management system as determined by the comparing and the authenticating, and the authenticating storing any variations in the generated document data as updated stored document data. A system for verifying that a document is included in a document management system is disclosed. The system includes a radio frequency document scanner including a scanner head no greater than 10 cm in width, a memory storing document verification data associated with the document, a computing system operatively connected to the radio frequency scanner and the memory, and computing system executable code accessible by the computing system and operative by the computi...",
  "patent_number": "9652651",
  "abstract": "A system and method for verifying that a document is included in a document management system is disclosed. This system and method includes scanning of a scan track of a document, generating document data dependently upon the scanning, comparing the generated document data to stored document data, the stored document data generated dependently upon a prior scanning of the scan track of the document, and outputting an indication of the document being included in the document management system as determined by the comparing.",
  "publication_number": "US20160267311A1-20160915",
  "_processing_info": {
    "original_size": 50213,
    "optimized_size": 3164,
    "reduction_percent": 93.7
  }
}