{
  "decision": "ACCEPTED",
  "application_number": "14996582",
  "date_published": "20160512",
  "date_produced": "20160427",
  "title": "GENERATING AND DELIVERING A WRAP PACKAGE OF CARDS INCLUDING CUSTOM CONTENT AND/OR SERVICES IN RESPONSE TO A VEHICLE DIAGNOSTIC SYSTEM TRIGGERED EVENT",
  "filing_date": "20160115",
  "inventor_list": [
    {
      "inventor_name_last": "GREENBERG",
      "inventor_name_first": "Eric H.",
      "inventor_city": "Ross",
      "inventor_state": "CA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "GARRIS",
      "inventor_name_first": "John M.",
      "inventor_city": "San Francisco",
      "inventor_state": "CA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "BHASIN",
      "inventor_name_first": "Kunal K.",
      "inventor_city": "San Francisco",
      "inventor_state": "CA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "FOSTER",
      "inventor_name_first": "Peter M.",
      "inventor_city": "Lafayette",
      "inventor_state": "CA",
      "inventor_country": "US"
    }
  ],
  "ipcr_labels": [
    "G07C500",
    "G06F30482",
    "G06F30484",
    "B60R16023"
  ],
  "main_ipcr_label": "G07C500",
  "summary": "<SOH> SUMMARY <EOH>Systems and methods for creating and delivering wrapped packages of cards are disclosed. With wrap packages, each card is selectively authored to include content such as (i) multi-media, (ii) application functionality and/or (iii) e-commerce related services. In addition, the cards are authored into one or more linear sequences. In optional embodiments, the content can further be authored to convey a “narrative” that unfolds as the cards are sequentially browsed in their linear order(s). Thus, when the wrap is consumed, the viewer experience is enhanced and is more engaging compared to other types of content delivery methods, such as web sites, PDFs, or applications, particularly on mobile devices. As a result, it is more likely that viewers will consume the media and partake in the functionality and/or services delivered through the wrap compared to the above-listed prior art content delivery types. In one non-exclusive embodiment, the system and method is directed to the creation and delivery of a wrap package “on the fly” in reply to a vehicle onboard diagnostic system triggered event. When a notice of the event is received, a wrap package, including custom content presented within a plurality of cards arranged in one or more linear sequences, is automatically authored. In various embodiments, the custom content encompasses, but is not limited to, one or more media types, application functionality and/or e-commerce related services. Once authored, a wrap descriptor for the wrap package is generated. The wrap descriptor includes a plurality of card descriptors, each card descriptor arranged to define content, a structure and a layout of an associated one of the cards respectively. The wrap descriptor is then delivered to a computing device associated with the identified driver and/or passenger(s) of the vehicle. When consumed, the computing device generates from the wrap descriptor a runtime instance of the wrap, including the custom content pre...",
  "patent_number": "9412208",
  "abstract": "Delivery of a wrap package “on the fly” in reply to a vehicle onboard diagnostic (OBD) system triggered event. When a notice of the event is received, a wrap package, including custom content presented within a plurality of cards arranged in one or more linear sequences, is automatically authored. The custom content encompasses, but is not limited to, one or more media types, application functionality and/or e-commerce related services. In one embodiment, the custom content pertains to a specific code generated by the OBD system that corresponds to the event. In another embodiment, the triggered event is an accident.",
  "publication_number": "US20160133062A1-20160512",
  "_processing_info": {
    "original_size": 360834,
    "optimized_size": 3788,
    "reduction_percent": 98.95
  }
}