{
  "date_produced": "20170705",
  "publication_number": "US20170206461A1-20170720",
  "main_ipcr_label": "G06N9900",
  "decision": "PENDING",
  "application_number": "14996918",
  "inventor_list": [
    {
      "inventor_name_last": "Friesen",
      "inventor_name_first": "Mark",
      "inventor_city": "Middleton",
      "inventor_state": "WI",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Eriksson",
      "inventor_name_first": "Mark",
      "inventor_city": "Madison",
      "inventor_state": "WI",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Coppersmith",
      "inventor_name_first": "Susan",
      "inventor_city": "Madison",
      "inventor_state": "WI",
      "inventor_country": "US"
    }
  ],
  "abstract": "A quantum computing system and method for performing quantum computation is provided. In some aspects, the system includes at least one charge qubit comprising a quantum dot assembly prepared with a symmetric charge distribution, wherein the symmetric charge distribution is configured to reduce a coupling between the charge qubit and a charge noise source. The system also includes a controller for controlling the at least one charge qubit to perform a quantum computation. The system further includes an output for providing a report generated using information obtained from the quantum computation performed.",
  "filing_date": "20160115",
  "patent_number": "None",
  "summary": "<SOH> SUMMARY OF THE INVENTION <EOH>The present disclosure overcomes the drawbacks of previous technologies by providing a quantum system and method for quantum computation. Specifically, in recognizing that electric field fluctuations are a strong source of decoherence in conventional charge qubits, which lead to reduced quantum information lifetimes, a novel charge qubit is therefore provided. As will be described, charge qubits implemented in quantum dot assemblies prepared with symmetric charge distributions substantially reduce dominant dipolar contributions to the dephasing caused by charge noise, thereby appreciably enhancing qubit coherence times in comparison to conventional charge qubits. In accordance with one aspect of the disclosure, a quantum computing system for performing quantum computation is provided. The system includes at least one charge qubit comprising a quantum dot assembly prepared with a symmetric charge distribution, wherein the symmetric charge distribution is configured to reduce a coupling between the charge qubit and a charge noise source. The system also includes a controller for controlling the at least one charge qubit to perform a quantum computation. The system further includes an output for providing a report generated using information obtained from the quantum computation performed. In accordance with one aspect of the disclosure, a method for performing quantum computation is provided. The method includes preparing at least one charge qubit comprising a quantum dot assembly with a symmetric charge distribution that is configured to reduce a coupling between the charge qubit and a charge noise source, and controlling the at least one charge qubit to perform a quantum computation. The method also includes performing a readout of the at least one charge qubit following the quantum computation. The method further includes generating a report using information obtained from the quantum computation performed. The foregoing and othe...",
  "date_published": "20170720",
  "title": "System and Method for Quantum Computation Using Symmetrical Charge Qubits",
  "ipcr_labels": [
    "G06N9900",
    "G06F1582"
  ],
  "_processing_info": {
    "original_size": 72577,
    "optimized_size": 3483,
    "reduction_percent": 95.2
  }
}