{
  "decision": "PENDING",
  "application_number": "15003224",
  "date_published": "20160602",
  "date_produced": "20160518",
  "title": "CONVERSION PATH PERFORMANCE MEASURES AND REPORTS",
  "filing_date": "20160121",
  "inventor_list": [
    {
      "inventor_name_last": "Hsiao",
      "inventor_name_first": "Sissie Ling-le",
      "inventor_city": "Santa Clara",
      "inventor_state": "CA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Cai",
      "inventor_name_first": "Chao",
      "inventor_city": "Santa Clara",
      "inventor_state": "CA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Ewald",
      "inventor_name_first": "Eric W.",
      "inventor_city": "Gilroy",
      "inventor_state": "CA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Tangney",
      "inventor_name_first": "Cameron M.",
      "inventor_city": "Sunnyvale",
      "inventor_state": "CA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Walker, II",
      "inventor_name_first": "Robert A.",
      "inventor_city": "San Francisco",
      "inventor_state": "CA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Tulsi",
      "inventor_name_first": "Japjit",
      "inventor_city": "Los Altos",
      "inventor_state": "CA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Lei",
      "inventor_name_first": "Ming",
      "inventor_city": "San Jose",
      "inventor_state": "CA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "He",
      "inventor_name_first": "Zhimin",
      "inventor_city": "Sunnyvale",
      "inventor_state": "CA",
      "inventor_country": "US"
    }
  ],
  "ipcr_labels": [
    "G06Q3002"
  ],
  "main_ipcr_label": "G06Q3002",
  "summary": "<SOH> SUMMARY <EOH>Content providers (e.g., advertisers) are provided reports that specify user interactions with content that is distributed to users for the content providers. In some implementations, the reports that are provided to a particular content provider specify conversion path performance measures that measure user interactions with content provided by the advertiser and that occurred prior to a conversion. For example, the conversion path performance measures can specify a total quantity of interactions between the advertiser's content and a user prior to the user performing an action that constitutes a conversion. In general, one innovative aspect of the subject matter described in this specification can be embodied in methods that include the actions of obtaining user interaction data for a plurality of conversions, where the user interaction data specify, for each of the conversions, user interactions with content items that are associated with one or more targeting keywords. The targeting keywords control distribution of the content items and the user interactions for each conversion are one or more presentations of content items during a conversion cycle for the conversion and zero or more user selections of the content items that occurred during the conversion cycle. The conversion cycle for each conversion is a period preceding a user interaction that constitutes a conversion. A first time at which each conversion occurred is determined. A reference user interaction that occurred prior to selection of a last selected content item is selected, where the last selected content item is a content item that was last selected prior to the conversion. A second time at which the reference user interaction occurred is determined. A time lag is computed for a content provider, where the time lag is a measure of time between the reference user interaction and the conversion. Data that cause presentation of the time lag are provided. Other embodiments of this...",
  "patent_number": "None",
  "abstract": "Methods, systems, and apparatus, including computer programs encoded on a computer storage medium, for providing conversion path performance measures and reports. In one aspect, user interaction data are obtained, were the user interaction data specify user interactions for a plurality of conversions. User interactions that are associated with each conversion are selected from the user interaction data, where the associated user interactions for each conversion are user interactions with a converting user during the conversion cycle for the conversion. Using the user interaction data for the selected user interactions, a quantity of user interactions that are associated with each conversion and occurred during the conversion cycle for the conversion are determined. In turn, conversion path performance measures are computed and reports specifying the conversion path performance measures are generated.",
  "publication_number": "US20160155143A1-20160602",
  "_processing_info": {
    "original_size": 401160,
    "optimized_size": 4489,
    "reduction_percent": 98.88
  }
}