{
  "date_produced": "20170412",
  "publication_number": "US20170116538A1-20170427",
  "main_ipcr_label": "G06N700",
  "decision": "PENDING",
  "application_number": "15007813",
  "inventor_list": [
    {
      "inventor_name_last": "Chee",
      "inventor_name_first": "Yi-Min",
      "inventor_city": "Yorktown Heights",
      "inventor_state": "NY",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Jagmohan",
      "inventor_name_first": "Ashish",
      "inventor_city": "Irvington",
      "inventor_state": "NY",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Luna",
      "inventor_name_first": "Pamela N.",
      "inventor_city": "HOUSTON",
      "inventor_state": "TX",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Ratakonda",
      "inventor_name_first": "Krishna C.",
      "inventor_city": "Yorktown Heights",
      "inventor_state": "NY",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Segal",
      "inventor_name_first": "Richard B.",
      "inventor_city": "Chappaqua",
      "inventor_state": "NY",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Sukaviriya",
      "inventor_name_first": "Piyawadee",
      "inventor_city": "White Plains",
      "inventor_state": "NY",
      "inventor_country": "US"
    }
  ],
  "abstract": "According to embodiments, methods, systems, and computer program products are provided for receiving one or more input compositions comprising one or more materials, assigning a material vector to each material, learning, for each of the input compositions, a composition vector based on the material vectors of the materials that form each composition, assigning predicted rating values having a confidence level to each of the composition vectors, selecting a composition to be rated based on the confidence levels, presenting the selected composition to be rated to a user, receiving a user rating for the composition to be rated; adjusting the predicted rating values and confidence levels of the composition vectors that have not been rated by the user, and generating a predictive model to predict a user's ratings for compositions when confidence levels of each composition vector is above a predetermined threshold value.",
  "filing_date": "20160127",
  "patent_number": "None",
  "summary": "<SOH> SUMMARY <EOH>According to embodiments, methods, systems, and computer program products are provided to learn a user's preferences regarding compositions, including receiving, by a processor, one or more input compositions, each input composition comprising one or more materials; assigning a material vector to each of the materials; learning for each of the one or more input compositions a composition vector based on the material vectors of the materials that form each composition; assigning a predicted rating value to each of the composition vectors, each predicted rating value having a confidence level; selecting a composition to be rated based on the confidence levels of the composition vectors; presenting the selected composition to be rated to a user; receiving a user rating for the composition to be rated; adjusting the predicted rating values and confidence levels of the composition vectors that have not been rated by the user; and generating a predictive model to predict a user's ratings for compositions when confidence levels of each composition vector is above a predetermined threshold value. Additional features and advantages are realized through the techniques of the present invention. Other embodiments and aspects of the invention are described in detail herein and are considered a part of the claimed invention. For a better understanding of the invention with the advantages and the features, refer to the description and to the drawings.",
  "date_published": "20170427",
  "title": "SYSTEM AND METHOD FOR IDENTIFYING COMPOSITION PREFERENCES",
  "ipcr_labels": [
    "G06N700",
    "G06N308",
    "G06N502"
  ],
  "_processing_info": {
    "original_size": 49293,
    "optimized_size": 3741,
    "reduction_percent": 92.41
  }
}