{
  "decision": "PENDING",
  "application_number": "15003273",
  "date_published": "20160602",
  "date_produced": "20160518",
  "title": "METHOD AND SYSTEM FOR AUTOMATIC DETECTION AND ANALYSIS OF MALWARE",
  "filing_date": "20160121",
  "inventor_list": [
    {
      "inventor_name_last": "Thomas",
      "inventor_name_first": "Ralph",
      "inventor_city": "Fredericksburg",
      "inventor_state": "VA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Ligh",
      "inventor_name_first": "Bruce Michael",
      "inventor_city": "Houston",
      "inventor_state": "TX",
      "inventor_country": "US"
    }
  ],
  "ipcr_labels": [
    "H04L2906",
    "G06F944",
    "G06F306"
  ],
  "main_ipcr_label": "H04L2906",
  "summary": "<SOH> SUMMARY <EOH>The present disclosure relates generally to computer networks. More specifically, the present disclosure relates to methods and systems for detecting and analyzing malware. The methods and techniques may be applied to a variety of computer networks and communications systems. A method is provided to receive a file for analysis, store a memory baseline for a system, and copy the file to the system. The file is executed on the system, the operation of the system is terminated, and a post-execution memory map of the system is stored. The memory baseline and the post-execution memory map are analyzed. As a result of the analysis, the method may determine that the file is infected with malware. Additional objects of the disclosure will be set forth in part in the description which follows, and in part will be obvious from the description, or may be learned by practice of embodiments consistent with the disclosure. It is to be understood that both the foregoing general description and the following detailed description are exemplary and explanatory only and are not restrictive of the application, as claimed. The accompanying drawings, which are incorporated in and constitute a part of this specification, illustrate embodiments of the application and together with the description, serve to explain the principles of the application subject matter.",
  "patent_number": "None",
  "abstract": "A method of detecting malicious software (malware) includes receiving a file and storing a memory baseline for a system. The method also includes copying the file to the system, executing the file on the system, terminating operation of the system, and storing a post-execution memory map. The method further includes analyzing the memory baseline and the post-execution memory map and determining that the file includes malware.",
  "publication_number": "US20160156658A1-20160602",
  "_processing_info": {
    "original_size": 121843,
    "optimized_size": 2538,
    "reduction_percent": 97.92
  }
}