{
  "decision": "PENDING",
  "application_number": "15005489",
  "date_published": "20160804",
  "date_produced": "20160720",
  "title": "REAL-TIME PROCESSING OF DATA STREAMS RECEIVED FROM INSTRUMENTED SOFTWARE",
  "filing_date": "20160125",
  "inventor_list": [
    {
      "inventor_name_last": "Liu",
      "inventor_name_first": "Phillip",
      "inventor_city": "Palo Alto",
      "inventor_state": "CA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Mukherji",
      "inventor_name_first": "Arijit",
      "inventor_city": "Fremont",
      "inventor_state": "CA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Raman",
      "inventor_name_first": "Rajesh",
      "inventor_city": "Palo Alto",
      "inventor_state": "CA",
      "inventor_country": "US"
    }
  ],
  "ipcr_labels": [
    "G06F1136"
  ],
  "main_ipcr_label": "G06F1136",
  "summary": "<SOH> SUMMARY <EOH>Described embodiments process data generated by instrumented software. Software developers often including code snippets for instrumenting the code in software being developed. An analysis system receives data streams generated by instrumented software executing on external systems. The analysis system performs analysis of the data streams received. The analysis system evaluates an expression using data values of the data streams over a plurality of time intervals. For example, the analysis system may aggregate data values of data streams for each time interval and send the result for presentation via a chart updated in real-time. The analysis system determines whether or not a data stream is considered for evaluation of the expression in a time interval based on the time of arrival of the data value during the time interval. The analysis system excludes data streams for which the data values arrive late during the time interval. The analysis system determines a maximum expected delay value for each data stream being processed. The analysis system excludes data values that fail to arrive before their maximum expected delay value during a time interval. Accordingly, the analysis system evaluates the expression for that time interval without considering these data streams. The analysis system sends the result of evaluation of the expression for each time interval for presentation. In some embodiments, the analysis system determines the maximum expected delay value based on delay of past data values of the data stream. For example, the analysis system may determine the maximum expected delay value for a data stream based on a moving average of a number of data values of the data stream. The analysis system updates the maximum expected delay value periodically, for example, for each time interval. In some embodiments, the analysis system further determines a failure threshold value for a data stream. If a data value of a data stream fails to arrive be...",
  "patent_number": "None",
  "abstract": "An analysis system receives data streams generated by instances of instrumented software executing on external systems. The analysis system evaluates an expression using data values of the data streams over a plurality of time intervals. For example, the analysis system may aggregate data values of data streams for each time interval. The analysis system determines whether or not a data stream is considered for a time interval based on when the data value arrives during the time interval. The analysis system determines a maximum expected delay value for each data stream being processed. The analysis system evaluates the expression using data values that arrive before their maximum expected delay values. The analysis system also determines a failure threshold value for a data stream. If a data value of a data stream fails to arrive before the failure threshold value, the analysis system marks the data stream as dead.",
  "publication_number": "US20160224459A1-20160804",
  "_processing_info": {
    "original_size": 75320,
    "optimized_size": 3783,
    "reduction_percent": 94.98
  }
}