{
  "date_produced": "20170713",
  "publication_number": "US20170213145A1-20170727",
  "main_ipcr_label": "G06N9900",
  "decision": "PENDING",
  "application_number": "15003633",
  "inventor_list": [
    {
      "inventor_name_last": "Pathak",
      "inventor_name_first": "Anupam",
      "inventor_city": "Los Altos Hills",
      "inventor_state": "CA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Shoeb",
      "inventor_name_first": "Ali",
      "inventor_city": "Mill Valley",
      "inventor_state": "CA",
      "inventor_country": "US"
    }
  ],
  "abstract": "A method predicts the fall risk of a user based on a machine learning model. The model is trained using data about the user, which may be from wearable sensors and depth sensors, manually input by the user, and received from other types of sources. Data about a population of users and data from structured tests completed by the user can also be used to train the model. The model uses features and motifs discovered based on the data that correlate to fall risk events to update fall risk scores and predictions. The user is provided a recommendation describing how the user can reduce a predicted fall risk for the user.",
  "filing_date": "20160121",
  "patent_number": "None",
  "summary": "<SOH> SUMMARY <EOH>A system is provided to determine fall risk including an adaptive model for automatically predicting the fall risk of a user. The system trains a model using machine learning techniques and various features including, but not limited to, user inputs (e.g., age, vision, use of assistive devices in walking, etc.), sensor data (e.g., data collected from sensors associated with the user), external source data (e.g., population data about fall risk of a population of users), and in some cases structured user tests (e.g., tests performed by the user occasionally over time to assess sway radius and other conditions of the user on that day). Sensor data can be recorded from depth sensors, microphones, depth sensors, and a variety of wearable sensors on the user. The wearable sensors can be in the form of a wristband, wristwatch, pendant of a necklace, or belt clip. Data may be uploaded and synchronized to a cloud server where the fall risk model is updated. A notification or other feedback generated from the system can be sent to the user, the user's caregivers and other health care providers, the user's family and friends, and the like. The notification or feedback may include the user's fall risk as well as recommendations regarding how the user can reduce the risk of falling.",
  "date_published": "20170727",
  "title": "ADAPTIVE MODEL-BASED SYSTEM TO AUTOMATICALLY QUANTIFY FALL RISK",
  "ipcr_labels": [
    "G06N9900",
    "G06N504",
    "G06N700"
  ],
  "_processing_info": {
    "original_size": 62690,
    "optimized_size": 2657,
    "reduction_percent": 95.76
  }
}