{
  "date_produced": "20160518",
  "publication_number": "US20160155052A1-20160602",
  "main_ipcr_label": "G06N502",
  "decision": "PENDING",
  "application_number": "15003121",
  "inventor_list": [
    {
      "inventor_name_last": "KOZLOSKI",
      "inventor_name_first": "James R.",
      "inventor_city": "New Fairfield",
      "inventor_state": "CT",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "MALKIN",
      "inventor_name_first": "Peter K.",
      "inventor_city": "Ardsley",
      "inventor_state": "NY",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "PICKOVER",
      "inventor_name_first": "Clifford A.",
      "inventor_city": "Yorktown Heights",
      "inventor_state": "NY",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "WEISZ",
      "inventor_name_first": "Justin D.",
      "inventor_city": "Stamford",
      "inventor_state": "CT",
      "inventor_country": "US"
    }
  ],
  "abstract": "Disclosed is a novel system and method for indicating a probability of errors in multimedia content. The system determines a user state or possible user distraction level. The user distraction level is indicated in the multimedia content. In one example, work is monitored being performed on the multimedia content. Distractions are identified while the work is being monitored. A probability of errors is calculated in at least one location of the multimedia content by on the distractions that have been identified. Annotations are used to indicate of the probability of errors. In another example, the calculating of probability includes using a function F(U,S,P) based on a combination of: i) a determination of user state (U), ii) a determination of sensitivity (S) of user input, and iii) a determination of user characteristics stored in a profile (P).",
  "filing_date": "20160121",
  "patent_number": "None",
  "summary": "<SOH> BRIEF SUMMARY <EOH>Disclosed is a system and method that automatically determines for indicating a probability of errors in multimedia content based on a user state. The user state is related to a possible user distraction level. This user detraction level is annotated in multimedia content being manipulated by the user. The distraction level may be indicated through a combination of annotations, sound, or haptic feedback. For example, colors may be used to annotate locations in text documents, such as computer code, during times in which the programmer was heavily distracted as determined by the user distraction level. Various considerations affect the nature of the indication of distraction level. A user profile and the “sensitivity” of a particular section of the multimedia content, such as, a field of text, or area of a drawing. In one example, work is monitored being performed by a user on the multimedia content. Distractions are identified while the work is being monitored. A probability of errors is calculated in at least one location of the multimedia content by on the distractions that have been identified. Annotations are used to indicate of the probability of errors. Multimedia content is broadly used to include text, sound, a 2-D picture, a 3-D picture, a 2-D video, a 3-D video, or a combination thereof. In another example, the calculating of probability includes using a function F(U,S,P) based on a combination of: i) a determination of user state (U), ii) a determination of sensitivity (S) of user input, and iii) a determination of user characteristics stored in a profile (P). Monitoring can include contemporaneous monitoring of pop-ups on a graphical user interface, instant messaging, e-mail, operation of telephone, detection of other people within an area, switching of windows on a graphical user interface, amount of elapsed time on a given task, ambient noise. Biometric contemporaneous monitoring can also include user eye-tracking, user typing ...",
  "date_published": "20160602",
  "title": "INDENTIFYING LOCATIONS OF POTENTIAL USER ERRORS DURING MANIPULATION OF MULTIMEDIA CONTENT",
  "ipcr_labels": [
    "G06N502",
    "G06N9900"
  ],
  "_processing_info": {
    "original_size": 53643,
    "optimized_size": 3923,
    "reduction_percent": 92.69
  }
}