{
  "date_produced": "20170713",
  "publication_number": "US20170213140A1-20170727",
  "main_ipcr_label": "G06N504",
  "decision": "ACCEPTED",
  "application_number": "15007727",
  "inventor_list": [
    {
      "inventor_name_last": "Ross",
      "inventor_name_first": "Mark A.",
      "inventor_city": "San Carlos",
      "inventor_state": "CA",
      "inventor_country": "US"
    }
  ],
  "abstract": "A wearable apparatus may include a sensor configured to identify a characteristic of the wearable apparatus. The wearable apparatus may also include an activity tracker configured to identify an activity of a tracked individual. The wearable apparatus may further include a memory. The wearable apparatus may include a processor operatively coupled to the memory. The processor may be configured to receive portable autonomous decision logic via a network and execute the portable autonomous decision logic. When executing the autonomous decision logic, the processor is configured to receive the characteristic via the sensor, receive the activity via the activity tracker; determine a state of the tracked individual based on at least one of the characteristic or the activity; and generate an output based on the state of the tracked individual.",
  "filing_date": "20160127",
  "patent_number": "9870533",
  "summary": "<SOH> SUMMARY <EOH>According to an aspect of an embodiment, a wearable apparatus may include a sensor configured to identify a characteristic of the wearable apparatus. The wearable apparatus may also include an activity tracker configured to identify a fitness activity of a user. The wearable apparatus may further include a memory. The wearable apparatus may include a processor operatively coupled to the memory. The processor may be configured to receive autonomous decision logic (which may be or may include one or more software modules) via a network and execute the autonomous decision logic. When executing the autonomous decision logic, the processor is configured to receive the motion characteristic via the sensor, receive the fitness activity via the activity tracker; determine a state of the user based on at least one of the motion characteristic or the fitness activity; and generating an output based on the state of the user. The object and advantages of the implementations will be realized and achieved at least by the elements, features, and combinations particularly pointed out in the claims. It is to be understood that both the foregoing general description and the following detailed description are given as examples and explanatory and are not restrictive of the invention, as claimed.",
  "date_published": "20170727",
  "title": "AUTONOMOUS DECISION LOGIC FOR A WEARABLE DEVICE",
  "ipcr_labels": [
    "G06N504",
    "G06F116"
  ],
  "_processing_info": {
    "original_size": 75764,
    "optimized_size": 2712,
    "reduction_percent": 96.42
  }
}