{
  "decision": "ACCEPTED",
  "application_number": "15006925",
  "date_published": "20160519",
  "date_produced": "20160504",
  "title": "Opt in System and Method",
  "filing_date": "20160126",
  "inventor_list": [
    {
      "inventor_name_last": "Maw",
      "inventor_name_first": "Brian Jeffrey",
      "inventor_city": "Belmont",
      "inventor_state": "CA",
      "inventor_country": "US"
    }
  ],
  "ipcr_labels": [
    "G06Q3002",
    "G06Q2040"
  ],
  "main_ipcr_label": "G06Q3002",
  "summary": "<SOH> SUMMARY OF THE DESCRIPTION <EOH>In some embodiments, a financial transaction system includes a computer readable storage medium and a processor in communication with the computer readable storage medium. The processor configured to receive a financial transaction request message from a payment device reader, and parse the financial transaction request message. The financial transaction request message including a cardholder response to an offer to enroll in a loyalty program of a commercial entity. The processor is further configured to store the cardholder response in the computer readable storage medium. In some embodiments, a system for use in performing a financial transaction includes a computer readable storage medium and a processor in communication with the computer readable storage medium. The processor is configured to receive data from a payment device, receive a cardholder's response to an offer to enroll in a loyalty program of a commercial entity, and transmit a financial transaction authorization request message. The financial transaction authorization message includes data representative of the cardholder's response and the data received from the payment device. In some embodiments, a method for performing a transaction includes receiving a financial transaction request message from a payment device reader and parsing the financial transaction request message. The financial transaction request message including a cardholder response to an offer to enroll in a loyalty program of a commercial entity. The method includes storing the cardholder response in the computer readable storage medium. In some embodiments, a method includes receiving data from a payment device, receiving a cardholder's response to an offer to enroll in a loyalty program of a commercial entity, and transmitting a financial transaction authorization request message. The financial transaction authorization message includes data representative of the cardholder's response and t...",
  "patent_number": "10007922",
  "abstract": "A financial transaction system includes a computer readable storage medium and a processor in communication with the computer readable storage medium. The processor is configured to receive a financial transaction request message from a payment device reader, and parse the financial transaction request message. The financial transaction request message includes a cardholder response to an offer to enroll in a loyalty program of a commercial entity. The processor is further configured to store the cardholder response in the computer readable storage medium.",
  "publication_number": "US20160140598A1-20160519",
  "_processing_info": {
    "original_size": 39906,
    "optimized_size": 3096,
    "reduction_percent": 92.24
  }
}