{
  "date_produced": "20160713",
  "publication_number": "US20160217371A1-20160728",
  "main_ipcr_label": "G06N312",
  "decision": "PENDING",
  "application_number": "15004868",
  "inventor_list": [
    {
      "inventor_name_last": "Leithiser",
      "inventor_name_first": "Robert",
      "inventor_city": "Corona",
      "inventor_state": "CA",
      "inventor_country": "US"
    }
  ],
  "abstract": "A universal problem resolution method and system implementing continuous improvement for problem solving that utilizes simulative processing of relational data sets associated with initial states, allowed transition states, and goal states for a problem. The framework autonomously generates and solves higher order problems to find sequences of operations necessary to transform state sequences derived from the lower-order transformation simulations recursively. The solutions yield increasingly higher-order abstractions that converge to generalization such that the unwinding of the higher order sequences back down to the original problem yields the exact sequence of steps for unsolved instances of the problem in linear time without the need for re-simulation. Cooperating agents analyze solution path determinations for problems including those concerning their own optimization. This spawns state transition rules generalizable to higher layers of abstraction resulting in new knowledge enab...",
  "filing_date": "20160122",
  "patent_number": "None",
  "summary": "<SOH> BRIEF SUMMARY OF THE INVENTION <EOH>The present invention is directed to a method, system and apparatus that satisfies the need for a problem solving system that supports not only general representation to support simulative solving, but provides discovery and application of solution patterns as the system encounters problems in an autonomous fashion that results in continuous improvement of the system without the need for ongoing human intervention. Various embodiments of the invention are directed to the methods, apparatus and system that provide a universal problem resolution framework (UPRF). UPRF constitutes a system and method for universal problem resolution with continuous improvement. The UPRF is a collection of constraints, processes and requirements for a design that fully supports generic representation of problems, generic pursuit of problem solutions and continuous improvement utilizing an overarching set of processing components without the need for modifications of the actual components for the solving system. These solving systems prescribe a set of constructs for relational problem representation that support simulation and solution discovery including higher order problem transformation. The UPRF described herein can be implemented on any sufficiently powerful processor, processors or computing system, as described herein in order to improve the overall ability of the processor to solve problems. Rather than take the focus of artificial intelligence, which has traditionally been on the development of specific algorithms or targeting specific domains, an apparatus, methods, and further embodiments are provided for the holistic process of learning and problem solving. A holistic process can function across all domains and is not limited to particular algorithms or applications. Many have attempted at distilling problem solving into software frameworks but a limitation of such approaches to date is the lack of a recursive feedback system that a...",
  "date_published": "20160728",
  "title": "Method and System for Universal Problem Resolution with Continuous Improvement",
  "ipcr_labels": [
    "G06N312",
    "G06N9900"
  ],
  "_processing_info": {
    "original_size": 196435,
    "optimized_size": 3582,
    "reduction_percent": 98.18
  }
}