{
  "decision": "PENDING",
  "application_number": "15001188",
  "date_published": "20170720",
  "date_produced": "20170705",
  "title": "SYSTEMS AND METHODS FOR USING A GYROSCOPE TO CHANGE THE RESISTANCE OF MOVING A VIRTUAL WEAPON",
  "filing_date": "20160119",
  "inventor_list": [
    {
      "inventor_name_last": "Goslin",
      "inventor_name_first": "Michael P.",
      "inventor_city": "Burbank",
      "inventor_state": "CA",
      "inventor_country": "US"
    }
  ],
  "ipcr_labels": [
    "A63H3300",
    "F41B1302",
    "G06F1750"
  ],
  "main_ipcr_label": "A63H3300",
  "summary": "<SOH> SUMMARY <EOH>This disclosure relates to using a gyroscope to change the resistance of moving a virtual weapon to simulate a feel of moving the virtual weapon. A feel of moving a virtual weapon may be simulated by determining a position and/or an orientation of a virtual blade of the virtual weapon, determining an overlay image comprising the virtual blade, where the virtual blade is placed within the overlay image according to the position and/or the orientation of the virtual blade, displaying the overlay image so that the virtual blade appears to be attached to the hilt, determining controls for a gyroscope based on the position and/or the orientation of the virtual blade, and operating the gyroscope in accordance with the controls for the gyroscope to provide resistance to changing the orientation of the hilt, wherein the resistance to changing the orientation of the hilt simulates the feel of moving the virtual weapon. A system configured to simulate a feel of moving a virtual weapon may include a display, an image sensor, a hilt, a motion and orientation sensor, a gyroscope, one or more processors, and/or other components. In some implementations, the system may include a speaker. In some implementations, the system may include a haptic generator. In some implementations, the image sensor and the one or more processors may be carried on the display, and the field of view of the image sensor may be a function of the position and the orientation of the display. The display may be configured to display an overlay image. In some implementations, the display may include one or more of a head-mounted display, an optical head-mounted display, a see-through display, an optical see-through display, a video see-through display, a visor, eyeglasses, sunglasses, a smartphone, a tablet, a mobile device, a projector, and/or other displays. The image sensor may be configured to generate visual output signals conveying visual information within a field of view of the ima...",
  "patent_number": "None",
  "abstract": "This disclosure relates to systems and methods for using a gyroscope to change the resistance of moving a virtual weapon to simulate a feel of moving the virtual weapon. A feel of moving a virtual weapon may be simulated by determining a position and/or an orientation of a virtual blade of the virtual weapon, determining controls for a gyroscope based on the position and/or the orientation of the virtual blade, and operating the gyroscope in accordance with the controls for the gyroscope to provide resistance to changing the orientation of the hilt, wherein the resistance to changing the orientation of the hilt simulates the feel of moving the virtual weapon.",
  "publication_number": "US20170203225A1-20170720",
  "_processing_info": {
    "original_size": 80995,
    "optimized_size": 3277,
    "reduction_percent": 95.95
  }
}