{
  "date_produced": "20170125",
  "publication_number": "US20170039480A1-20170209",
  "main_ipcr_label": "G06N700",
  "decision": "PENDING",
  "application_number": "15007938",
  "inventor_list": [
    {
      "inventor_name_last": "Bitran",
      "inventor_name_first": "Hadas",
      "inventor_city": "Ramat Hasharon",
      "inventor_state": "",
      "inventor_country": "IL"
    },
    {
      "inventor_name_last": "Axelrod",
      "inventor_name_first": "Elinor",
      "inventor_city": "Hod Hasharon",
      "inventor_state": "",
      "inventor_country": "IL"
    },
    {
      "inventor_name_last": "Lavee",
      "inventor_name_first": "Gal",
      "inventor_city": "Tel Aviv",
      "inventor_state": "",
      "inventor_country": "IL"
    }
  ],
  "abstract": "Aspects of the technology described herein can analyze signal data from multiple computing devices to ascertain a user's exercise pattern. Understanding a user's exercise pattern can help reduce power usage by automatically turning physiological sensors on and off to coincide with the start and end of an exercise event. Exemplary computing devices that can provide signal data related to a user's exercise routine can include a mobile computing device (e.g., smart phone) that captures location signals and other contextual data and a wearable computing device (e.g., fitness tracker) that captures physiological characteristics of the user, such as heart rate, temperature, and movement. The signals captured by the multiple computing devices can be analyzed together to determine when an individual exercise event has occurred. The plurality of exercise events associated with a user or group of users can be analyzed to ascertain an exercise pattern.",
  "filing_date": "20160127",
  "patent_number": "None",
  "summary": "<SOH> SUMMARY <EOH>This Summary is provided to introduce a selection of concepts in a simplified form that are further described below in the Detailed Description. This Summary is not intended to identify key features or essential features of the claimed subject matter, nor is it intended to be used as an aid in determining the scope of the claimed subject matter. In various aspects, systems, methods, and computer-readable storage media are provided to improve a computing device's ability to accurately extract contextual features from signal data. Aspects of the technology described herein can analyze signal data from multiple computing devices to ascertain a user's exercise pattern. Understanding a user's exercise pattern can help reduce power usage by automatically turning components, such as physiological sensors, on and off to coincide with the start and end of an exercise event (including a predicted, future exercise event). Exemplary computing devices that can provide signal data related to a user's exercise routine can include a mobile computing device (e.g., smart phone) that captures location signals and other contextual data and a wearable computing device (e.g., fitness tracker) that captures physiological characteristics of the user, such as heart rate, temperature, and movement. The signals captured by the multiple computing devices can be analyzed together to determine when an individual exercise event has occurred. The plurality of exercise events associated with a user or group of users can be analyzed to ascertain an exercise pattern. The exercise pattern and associated context can then be used to generate exercise-related experiences for the user.",
  "date_published": "20170209",
  "title": "Workout Pattern Detection",
  "ipcr_labels": [
    "G06N700",
    "G06N504",
    "G06N9900",
    "A61B5024",
    "A61B501",
    "A61B511",
    "G06F1730",
    "A63B2400"
  ],
  "_processing_info": {
    "original_size": 125002,
    "optimized_size": 3531,
    "reduction_percent": 97.18
  }
}