{
  "decision": "ACCEPTED",
  "application_number": "15006499",
  "date_published": "20160804",
  "date_produced": "20160720",
  "title": "PRINTER AND CONTROL CIRCUIT",
  "filing_date": "20160126",
  "inventor_list": [
    {
      "inventor_name_last": "JIMBO",
      "inventor_name_first": "Seiichi",
      "inventor_city": "Chiba-shi",
      "inventor_state": "",
      "inventor_country": "JP"
    }
  ],
  "ipcr_labels": [
    "G06F126",
    "G06F132",
    "B41J2938"
  ],
  "main_ipcr_label": "G06F126",
  "summary": "<SOH> SUMMARY OF THE INVENTION <EOH>A printer according to one aspect of the present invention is connected to an external host device and a peripheral device. The printer comprises: a power generation circuit configured to supply a preset drive voltage required for an operation of the peripheral device to the peripheral; a drive circuit configured to operate the peripheral device with the drive voltage in response to input of a drive signal; a control circuit configured to output the drive signal to the drive circuit to operate the drive circuit only in a preset drive period during which the drive circuit operates; and a communication circuit connected to the control circuit and configured to receive data input from the external host device. In the printer according to one aspect of the present invention, the control circuit determines the drive voltage generated by the power generation circuit in response to input of a start instruction for starting an operation of the peripheral device from the external host device and outputs a voltage designation signal indicating the drive voltage to the power generation circuit. The control circuit determines a preset rise time that elapses before a supply voltage supplied to the peripheral device becomes the drive voltage from an initial value, outputs a power generation signal to the power generation circuit, and controls the power generation circuit to start supply of the supply voltage to the peripheral device. The control circuit measures a time that elapses before the supply voltage becomes the drive voltage and outputs the drive signal to the drive circuit at start timing of the drive period when the measured time becomes the rise time. The control circuit stops output of the voltage designation signal, the power generation signal, and the drive signal at finish timing of the drive period. The printer according to one aspect of the present invention, wherein the drive period, the start instruction, the drive voltage de...",
  "patent_number": "9778716",
  "abstract": "A printer connected to an external host device and a peripheral device, the printer comprising: a power generation circuit configured to supply a preset drive voltage required for an operation of the peripheral device to the peripheral; a drive circuit configured to operate the peripheral device with the drive voltage in response to input of a drive signal; a control circuit configured to output the drive signal to the drive circuit to operate the drive circuit only in a preset drive period during which the drive circuit operates; and a communication circuit connected to the control circuit and configured to receive data input from the external host device.",
  "publication_number": "US20160224084A1-20160804",
  "_processing_info": {
    "original_size": 46733,
    "optimized_size": 3206,
    "reduction_percent": 93.14
  }
}