{
  "decision": "PENDING",
  "application_number": "15004918",
  "date_published": "20170727",
  "date_produced": "20170713",
  "title": "System And Method Of Providing Firm Cash Offers For Uninspected Assets",
  "filing_date": "20160123",
  "inventor_list": [
    {
      "inventor_name_last": "Carlton",
      "inventor_name_first": "Kurt",
      "inventor_city": "Irving",
      "inventor_state": "TX",
      "inventor_country": "US"
    }
  ],
  "ipcr_labels": [
    "G06Q5016",
    "G06Q3004",
    "G06Q3002"
  ],
  "main_ipcr_label": "G06Q5016",
  "summary": "<SOH> SUMMARY OF THE DISCLOSURE <EOH>In an embodiment, a method of providing firm cash offers for uninspected assets is provided. The method comprises a computer generating and transmitting an offer to purchase an uninspected asset, the offer comprising a range of contingent purchase prices based on results of a future inspection of the asset, the computer determining the contingent purchase prices using an at least one algorithm, and one of the contingent purchase prices becoming a firm cash purchase price upon completion of the inspection. The method also comprises the computer receiving an acceptance of the offer, the acceptance agreeing to sell the asset for the firm purchase price to be determined based on the results of the inspection. The method also comprises the computer closing, upon completion of the inspection, purchase of the asset at the firm purchase price determined based on the inspection. The method also comprises the computer, based on proceeds realized during subsequent liquidation of the asset, refining the at least one algorithm. In an embodiment, a system of providing firm cash offers for uninspected assets is provided. The system comprises a processor, a memory, and an application stored in the memory that, when executed on the processor generates and transmits an offer to purchase an uninspected asset, the offer comprising a range of contingent purchase prices based on results of a future inspection of the asset, the contingent purchase prices determined using an at least one algorithm, and one of the contingent purchase prices becoming a firm cash purchase price upon completion of the inspection. The system also receives an acceptance of the offer, the acceptance agreeing to sell the asset for the firm purchase price to be determined based on the results of the inspection. The system also closes, upon completion of the inspection, purchase of the asset at the firm purchase price determined based on the inspection. The system also, based at ...",
  "patent_number": "None",
  "abstract": "A method of providing firm cash offers for uninspected assets is provided. The method comprises a computer generating and transmitting an offer to purchase an uninspected asset, the offer comprising a range of contingent purchase prices based on results of a future inspection of the asset, the computer determining the contingent purchase prices using at least one algorithm, and one of the contingent purchase prices becoming a firm cash purchase price upon completion of the inspection. The method also comprises the computer receiving acceptance of the offer, the acceptance agreeing to sell the asset for the firm purchase price determined based on results of the inspection. The method also comprises the computer closing, upon completion of the inspection, purchase of the asset at the firm purchase price determined based on the inspection and further, based on proceeds realized during subsequent liquidation of the asset, refining the at least one algorithm.",
  "publication_number": "US20170213304A1-20170727",
  "_processing_info": {
    "original_size": 35613,
    "optimized_size": 3549,
    "reduction_percent": 90.03
  }
}