{
  "date_produced": "20160713",
  "publication_number": "US20160217394A1-20160728",
  "main_ipcr_label": "G06N9900",
  "decision": "PENDING",
  "application_number": "15002392",
  "inventor_list": [
    {
      "inventor_name_last": "SILBERMAN",
      "inventor_name_first": "Karen Sue",
      "inventor_city": "Glendale",
      "inventor_state": "CA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "HELM-STEVENS",
      "inventor_name_first": "Roxanne Elizabeth",
      "inventor_city": "West Covina",
      "inventor_state": "CA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "KHUDAVERDYAN",
      "inventor_name_first": "Dana Louise",
      "inventor_city": "Glendale",
      "inventor_state": "CA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "FALL",
      "inventor_name_first": "John Randy",
      "inventor_city": "San Gabriel",
      "inventor_state": "CA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "KHUDAVERDYAN",
      "inventor_name_first": "David Sevak",
      "inventor_city": "Glendale",
      "inventor_state": "CA",
      "inventor_country": "US"
    }
  ],
  "abstract": "A method for improving a profile analysis of an interpretive framework stored in a memory may include producing and displaying visual stimuli on a computerized device to test visual and visual motor responses of an individual subject in response to the displayed visual stimuli. The method may also include classifying and categorizing digitally measured visual and visual motor responses of the individual subject to the displayed visual stimuli. The method may further include continually modifying parameters of the profile analysis of the interpretive framework corresponding to at least one condition based at least in part on an item analysis corresponding to a pattern of performance determined during the classifying and categorizing of the digitally measured visual and visual motor responses of the individual subject.",
  "filing_date": "20160120",
  "patent_number": "None",
  "summary": "<SOH> SUMMARY <EOH>A method for improving a profile analysis of an interpretive framework stored in a memory may include producing and displaying visual stimuli on a computerized device to test visual and visual motor responses of an individual subject in response to the displayed visual stimuli. The method may also include classifying and categorizing digitally measured visual and visual motor responses of the individual subject to the displayed visual stimuli. The method may further include continually modifying parameters of the profile analysis of the interpretive framework corresponding to at least one condition based at least in part on an item analysis corresponding to a pattern of performance determined during the classifying and categorizing of the digitally measured visual and visual motor responses of the individual subject. A method for a diagnostic profile analysis of an individual subject according to an interpretive framework stored in a memory may include digitally measuring visual and visual motor responses of the individual subject to visual stimuli displayed using a computerized device. The method may also include generating an item analysis corresponding to a pattern of performance determined from the digitally measured visual and visual motor responses of the individual subject. The method may further include providing an assessment of the individual subject based at least in part on a score of a condition correlation function corresponding to the item analysis of the pattern of performance determined from the digitally measured visual and visual motor responses of the individual subject. An apparatus configured to improve a profile analysis of an interpretive framework, the apparatus may include a display, a memory configured to store the interpretive framework, and a processor(s) coupled to the display and the memory. The processor(s) may be configured to produce and to show visual stimuli on the display to test visual and visual motor respons...",
  "date_published": "20160728",
  "title": "METHOD AND APPARATUS FOR IMPROVING A PROFILE ANALYSIS OF AN INTERPRETIVE FRAMEWORK BASED ON DIGITAL MEASUREMENT OF THE PRODUCTION OF AND RESPONSES TO VISUAL STIMULI",
  "ipcr_labels": [
    "G06N9900"
  ],
  "_processing_info": {
    "original_size": 86615,
    "optimized_size": 4119,
    "reduction_percent": 95.24
  }
}