{
  "date_produced": "20160713",
  "publication_number": "US20160217379A1-20160728",
  "main_ipcr_label": "G06N504",
  "decision": "PENDING",
  "application_number": "15007975",
  "inventor_list": [
    {
      "inventor_name_last": "Patri",
      "inventor_name_first": "Om Prasad",
      "inventor_city": "Los Angeles",
      "inventor_state": "CA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Panangadan",
      "inventor_name_first": "Anand V.",
      "inventor_city": "Los Angeles",
      "inventor_state": "CA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Chelmis",
      "inventor_name_first": "Charalampos",
      "inventor_city": "Los Angeles",
      "inventor_state": "CA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Reyna, JR.",
      "inventor_name_first": "Nabor",
      "inventor_city": "Houston",
      "inventor_state": "TX",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "McKee",
      "inventor_name_first": "Randall G.",
      "inventor_city": "Katy",
      "inventor_state": "TX",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Prasanna",
      "inventor_name_first": "Viktor K.",
      "inventor_city": "Los Angeles",
      "inventor_state": "CA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Kannan",
      "inventor_name_first": "Rajgopal",
      "inventor_city": "Los Angeles",
      "inventor_state": "CA",
      "inventor_country": "US"
    }
  ],
  "abstract": "A method for predicting a failure of oilfield equipment based on univariate time series includes providing training data by a sensor. A training data stream comprising the training data is received by a preprocessor. The method further includes extracting training data segments and identifying each training data segment of the training data segments as corresponding to a normal operational state of the first oilfield equipment or a failed state of the first oilfield equipment. The method also includes generating a shapelet-based decision tree and receiving a test data stream from a sensor of second oilfield equipment. The method further includes determining, based on the shapelet-based decision tree, whether one or more test data segments extracted from the test data stream predict a failure of the second oilfield equipment.",
  "filing_date": "20160127",
  "patent_number": "None",
  "summary": "<SOH> SUMMARY <EOH>The present disclosure relates to detection and prediction of oilfield equipment failure. In an example embodiment, a method for predicting a failure of oilfield equipment based on univariate time series includes providing, by a sensor of first oilfield equipment, training data, where a training data stream comprising the training data is received by a preprocessor. The method further includes extracting, by the preprocessor, training data segments from one or more portions of the training data stream generated prior to the first oilfield equipment failing to operate normally. Portions of the training data in the one or more portions of the training data stream were sampled at a regular sampling rate. The method also includes identifying each training data segment of the training data segments as corresponding to a normal operational state of the first oilfield equipment or a failed state of the first oilfield equipment, where the failed state of the first oilfield equipment corresponds to the oilfield equipment failing to operate normally. The method also includes generating, by a processor, a shapelet-based decision tree, wherein generating the shapelet-based decision tree includes extracting one or more time series shapelets from one or more training data segments of the training data segments. The method further includes receiving a test data stream from a sensor of second oilfield equipment. The method further includes determining by the processor, based on the shapelet-based decision tree, whether one or more test data segments extracted from the test data stream predict a failure of the second oilfield equipment. In another example embodiment, a system for predicting a failure of oilfield equipment based on univariate time series includes a data storage device to store and provide a training data stream generated by a sensor of first oilfield equipment. The system further includes a preprocessor to extract training data segments from one or...",
  "date_published": "20160728",
  "title": "Shapelet-Based Oilfield Equipment Failure Prediction and Detection",
  "ipcr_labels": [
    "G06N504",
    "G06N9900"
  ],
  "_processing_info": {
    "original_size": 100886,
    "optimized_size": 4315,
    "reduction_percent": 95.72
  }
}