{
  "date_produced": "20170713",
  "publication_number": "US20170213137A1-20170727",
  "main_ipcr_label": "G06N504",
  "decision": "PENDING",
  "application_number": "15006007",
  "inventor_list": [
    {
      "inventor_name_last": "Geller",
      "inventor_name_first": "Benjamin M.",
      "inventor_city": "Hermosa Beach",
      "inventor_state": "CA",
      "inventor_country": "US"
    }
  ],
  "abstract": "A system for determining current and potential ranges of a vehicle includes a sensor that is used to detect energy data corresponding to an amount of energy remaining in the vehicle, such as fuel in a gasoline engine or fuel cell or a state of charge (SOC) of a battery. The system also includes a processor that can determine a current range of the vehicle in at least one direction based on a current status of the vehicle and the remaining energy levels. The processor can also determine a potential range of the vehicle that can be achieved if at least one user-controllable factor is changed from the current status of the vehicle. The system also includes an output device for outputting the current range of the vehicle and the potential range of the vehicle. The system may show fuel and/or recharging stations within the current and potential ranges.",
  "filing_date": "20160125",
  "patent_number": "None",
  "summary": "<SOH> SUMMARY <EOH>Described herein is a system for determining current and potential ranges of a vehicle. The system includes a sensor that is used to detect energy data that corresponds to an amount of energy remaining in the vehicle, such as a remaining SOC of a battery or amount of fuel in a fuel tank. The system also includes a processor that can determine a current range of the vehicle in at least one direction based on a current status of the vehicle and the amount of remaining energy. The processor can also determine a potential range of the vehicle that can be achieved if at least one user-controllable factor is changed from the current status of the vehicle. The system also includes an output device for outputting the current range of the vehicle and the potential range of the vehicle. Also described is a system for determining a range of a vehicle. The system includes an energy sensor configured to detect energy data corresponding to an amount of energy stored in the vehicle. The system also includes an efficiency sensor configured to detect efficiency data corresponding to current energy efficiency of the vehicle. The system also includes a memory configured to store a driver history including driver efficiency data corresponding to at least one user-controllable factor. The system also includes an input/output port configured to receive efficiency data corresponding to an environment of the vehicle. The system also includes a processor coupled to the energy sensor, the efficiency sensor, the memory and the input/output port and configured to predict a current range of the vehicle based on the amount of energy stored in the vehicle, the detected efficiency data, the driver efficiency data and the received efficiency data. Also described is a method for determining current and potential ranges of a vehicle. The method includes detecting, by a sensor, a stored amount of energy remaining in the vehicle. The method also includes determining, by a processor, ...",
  "date_published": "20170727",
  "title": "SYSTEMS AND METHODS FOR PREDICTING CURRENT AND POTENTIAL RANGES OF VEHICLES BASED ON LEARNED DRIVER BEHAVIOR",
  "ipcr_labels": [
    "G06N504",
    "G01C2134"
  ],
  "_processing_info": {
    "original_size": 56504,
    "optimized_size": 3477,
    "reduction_percent": 93.85
  }
}