{
  "date_produced": "20161130",
  "publication_number": "US20160364648A1-20161215",
  "main_ipcr_label": "G06N504",
  "decision": "PENDING",
  "application_number": "15002180",
  "inventor_list": [
    {
      "inventor_name_last": "Du",
      "inventor_name_first": "Yinuo",
      "inventor_city": "Palm Beach Gardens",
      "inventor_state": "FL",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Kirby",
      "inventor_name_first": "Andrew Wright",
      "inventor_city": "Jupiter",
      "inventor_state": "FL",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Meranda",
      "inventor_name_first": "Adam David",
      "inventor_city": "Jupiter",
      "inventor_state": "FL",
      "inventor_country": "US"
    }
  ],
  "abstract": "A system and method is disclosed for using AMI smart meter messaging types and data mining decision trees to determine if local equipment failure is present. The system and method may be used to predict impending failure based upon smart meter message behaviors and to create proactive investigation tickets. The predictions models may be generated from a big database of smart meter messaging and customer outage reports. The system and method can be applied to detect failures of higher level device equipment and may be incorporated into customer service processes. The system and method may also be used to determine customer owned equipment failures for referral to electricians.",
  "filing_date": "20160120",
  "patent_number": "None",
  "summary": "<SOH> SUMMARY <EOH>The following presents a simplified summary of the disclosure in order to provide a basic understanding of some aspects of the disclosure. This summary is not an extensive overview of the disclosure. It is intended to neither identify key or critical elements of the disclosure nor delineate the scope of the system and method disclosed herein. Its sole purpose is to present some concepts of the disclosure in a simplified form as a prelude to the more detailed description that is presented later. The system and method of the present disclosure generally relate to the use of AMI messaging types and data mining decision trees to determine if local equipment failure is present. The system and method may be used to predict impending failure and to create proactive investigation tickets. The system and method can be applied to detect failures of higher level device equipment and may be incorporated into customer service processes (troubleshooting during first customer contact). Further, the system and method may also be used to determine customer owned equipment failures for referral to electricians (inside the premises trouble). The following description and the annexed drawings set forth in detail certain illustrative aspects of the disclosure. These aspects are indicative, however, of but a few of the various ways in which the principles of the system and method disclosed herein may be employed and the system and method disclosed herein is intended to include all such aspects and their equivalents. Other advantages and novel features of the system and method disclosed herein will become apparent from the following detailed description of the system and method disclosed herein when considered in conjunction with the drawings.",
  "date_published": "20161215",
  "title": "OUTAGE PREVENTION IN AN ELECTRIC POWER DISTRIBUTION GRID USING SMART METER MESSAGING",
  "ipcr_labels": [
    "G06N504",
    "G06N700",
    "G06N9900",
    "G06Q5006"
  ],
  "_processing_info": {
    "original_size": 83364,
    "optimized_size": 3363,
    "reduction_percent": 95.97
  }
}