{
  "decision": "PENDING",
  "application_number": "15001219",
  "date_published": "20160519",
  "date_produced": "20160504",
  "title": "METHODS AND APPARATUS FOR USER-CUSTOMIZED ZONE FORMATION IN GEOGRAPHICALLY-BASED EVENT SCHEDULING",
  "filing_date": "20160119",
  "inventor_list": [
    {
      "inventor_name_last": "Schultz",
      "inventor_name_first": "Gary Allen",
      "inventor_city": "Tigard",
      "inventor_state": "OR",
      "inventor_country": "US"
    }
  ],
  "ipcr_labels": [
    "G06Q1010",
    "G06Q5016"
  ],
  "main_ipcr_label": "G06Q1010",
  "summary": "<SOH> SUMMARY <EOH>According to the present teachings in one or more aspects, methods and apparatus are provided to streamline event scheduling and facilitate commerce and interpersonal exchanges in a geographic region, for example, by customizing formation of zones as partitions of the geographic region, assigning time slots to the zones, and scheduling similar events with venues (e.g., where the events are to take place) in the zones based on the zones' assigned time slots. Interpersonal exchanges can include, for example, exchanges of tangible goods, intangible goods, service, knowledge, performance, support, and the like, between two or more participants. Exemplary embodiments of the present teachings include an automated event scheduling system that schedules similar events in a geographic region based on geographic locations of the events' venues. The automated event scheduling system can obtain parameters provided by users and, based on the user-provided parameters, provide and partition the geographic region into discrete, user-customized zones. Users can be individuals or agents of organizations authorized to create, modify, remove, and/or manage one or more geographic regions or zones within the geographic regions, examples of which include the automated event scheduling system's administrators, authorized event organizers or managers, authorized event brokers or brokerages, and the like. Subsequent to zone formation, the automated event scheduling system can assign one or more time slots to each of the zones, and the events with venues located in each zone are scheduled for the time slots assigned to that zone. In doing so, exemplary embodiments of the present teachings provide an innovative way of conveniently connecting participants in various types of events, such as buyers and sellers, renters and landlords, lessees and lessors, consumers and providers of goods or services, audiences and performers, etc., based on a geographic proximity of the events'...",
  "patent_number": "None",
  "abstract": "Methods and apparatus are provided to streamline event scheduling and facilitate commerce and interpersonal exchanges by providing and scheduling related events in user-customized zones in a geographic region. An automated event scheduling system obtains a geographic region, provides a zone request that specifies the geographic region to a remote user device, receives user-provided parameters from the remote user device, and divides the geographic region into zones based on the user-provided parameters. The automated event scheduling system can then provide a set of zone assignments that assigns the zones to the time slots, and transmits the set of zone assignments to the remote user device, which activates a scheduling client running on the remote user device to display, via a user interface, the set of zone assignments and enable a modification of the set of zone assignments.",
  "publication_number": "US20160140510A1-20160519",
  "_processing_info": {
    "original_size": 91426,
    "optimized_size": 3492,
    "reduction_percent": 96.18
  }
}