{
  "date_produced": "20170713",
  "publication_number": "US20170213141A1-20170727",
  "main_ipcr_label": "G06N700",
  "decision": "PENDING",
  "application_number": "15004820",
  "inventor_list": [
    {
      "inventor_name_last": "Xu",
      "inventor_name_first": "Lijuan",
      "inventor_city": "Foster City",
      "inventor_state": "CA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Xu",
      "inventor_name_first": "Ying",
      "inventor_city": "Boston",
      "inventor_state": "MA",
      "inventor_country": "US"
    }
  ],
  "abstract": "A method for determining national crop yields during the growing season may be accomplished using a server computer system that receives, via a network, agricultural data records that are used to forecast a national crop yield for a particular year. Within the server computer system weather index calculation instructions receive one or more agricultural data records that represent observed agricultural data points for a specific geo-location at a specific time. The observed agricultural data points include, but are not limited to, observed temperature records, soil moisture records, and precipitation records for the specific geo-location. The weather index calculation instructions then calculate one or more weather index values from the one or more agricultural data records. Weather index values represent crop stress that may affect the crop yield of particular plants. The weather index values are then compiled into one or more geo-specific weather indices for one or more geo-locations...",
  "filing_date": "20160122",
  "patent_number": "None",
  "summary": "<SOH> BRIEF DESCRIPTION OF THE DRAWINGS <EOH>In the drawings: FIG. 1 illustrates an example computer system that is configured to perform the functions described herein, shown in a field environment with other apparatus with which the system may interoperate. FIG. 2 illustrates two views of an example logical organization of sets of instructions in main memory when an example mobile application is loaded for execution. FIG. 3 illustrates a programmed process by which the agricultural intelligence computer system generates one or more preconfigured agronomic models using agronomic data provided by one or more external data sources. FIG. 4 is a block diagram that illustrates a computer system upon which an embodiment of the invention may be implemented. FIG. 5 is a flow diagram that depicts a process for determining a national crop yield for a specified year. FIG. 6 depicts the process of determining whether uniform regression parameters or varying regression parameters are calculated. FIG. 7 illustrates an example embodiment of corn growth stages. FIG. 8 illustrates an example chart where growing degree days define the start different phenological development stages. FIG. 9 depicts an example embodiment of a timeline view for data entry. FIG. 10 depicts an example embodiment of a spreadsheet view for data entry. detailed-description description=\"Detailed Description\" end=\"lead\"?",
  "date_published": "20170727",
  "title": "FORECASTING NATIONAL CROP YIELD DURING THE GROWING SEASON USING WEATHER INDICES",
  "ipcr_labels": [
    "G06N700",
    "G06F1730"
  ],
  "_processing_info": {
    "original_size": 141783,
    "optimized_size": 3120,
    "reduction_percent": 97.8
  }
}