{
  "date_produced": "20170323",
  "publication_number": "US20170098152A1-20170406",
  "main_ipcr_label": "G06N302",
  "decision": "PENDING",
  "application_number": "15002172",
  "inventor_list": [
    {
      "inventor_name_last": "Kerr",
      "inventor_name_first": "Bernard James",
      "inventor_city": "Sausalito",
      "inventor_state": "CA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Lin",
      "inventor_name_first": "Zhe",
      "inventor_city": "Fremont",
      "inventor_state": "CA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Reynolds",
      "inventor_name_first": "Patrick",
      "inventor_city": "San Francisco",
      "inventor_state": "CA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Faieta",
      "inventor_name_first": "Baldo",
      "inventor_city": "San Francisco",
      "inventor_state": "CA",
      "inventor_country": "US"
    }
  ],
  "abstract": "In various implementations, one or more specific attributes found in an image can be modified utilizing one or more specific attributes found in another image. Machine learning, deep neural networks, and other computer vision techniques can be utilized to extract attributes of images, such as color, composition, font, style, and texture from one or more images. A user may modify at least one of these attributes in a first image based on the attribute(s) of another image and initiate a visual-based search using the modified image.",
  "filing_date": "20160120",
  "patent_number": "None",
  "summary": "<SOH> SUMMARY <EOH>This summary is provided to introduce a selection of concepts in a simplified form that are further described below in the Detailed Description. This summary is not intended to identify key features or essential features of the claimed subject matter, nor is it intended to be used as an aid in determining the scope of the claimed subject matter. Embodiments of the present invention are directed to modifying one or more specific attributes found in an image. More specifically, in embodiments of the present invention, machine learning, deep neural networks, and other computer vision techniques can be utilized to extract attributes of images, such as color, composition, font, style, and texture from one or more images. A user may modify at least one of these attributes in a first image based on the attribute(s) of another image and initiate a visual-based search using the modified image. In this way, the user is able to modify an image to include a desired attribute that is not inherent to the image without having to perform a search for images that include all of the desired attributes.",
  "date_published": "20170406",
  "title": "MODIFYING AT LEAST ONE ATTRIBUTE OF AN IMAGE WITH AT LEAST ONE ATTRIBUTE EXTRACTED FROM ANOTHER IMAGE",
  "ipcr_labels": [
    "G06N302",
    "G06F30484",
    "G06F1730"
  ],
  "_processing_info": {
    "original_size": 69774,
    "optimized_size": 2715,
    "reduction_percent": 96.11
  }
}