{
  "decision": "PENDING",
  "application_number": "15006163",
  "date_published": "20170727",
  "date_produced": "20170713",
  "title": "Entity Arrangement By Shape Input",
  "filing_date": "20160126",
  "inventor_list": [
    {
      "inventor_name_last": "Cao",
      "inventor_name_first": "Qifeng",
      "inventor_city": "Tokyo",
      "inventor_state": "",
      "inventor_country": "JP"
    },
    {
      "inventor_name_last": "Ishikawa",
      "inventor_name_first": "Shunsuke",
      "inventor_city": "Tokyo",
      "inventor_state": "",
      "inventor_country": "JP"
    },
    {
      "inventor_name_last": "Nitta",
      "inventor_name_first": "Keisuke",
      "inventor_city": "Koshigaya",
      "inventor_state": "",
      "inventor_country": "JP"
    },
    {
      "inventor_name_last": "Nomura",
      "inventor_name_first": "Yuka",
      "inventor_city": "Tokyo",
      "inventor_state": "",
      "inventor_country": "JP"
    }
  ],
  "ipcr_labels": [
    "G06F30482",
    "G06F30484"
  ],
  "main_ipcr_label": "G06F30482",
  "summary": "<SOH> SUMMARY <EOH>Embodiments of the present invention include a method, computer program product, and computer system for arranging entities by shape input. In an embodiment of the present invention, a figure is received, where the figure is created by a user. One or more entities are received in the figure. In response to receiving the one or more entities in the figure, the one or more entities are arranged in the figure according to a protocol. This embodiment provides the advantage of organizing entities of a document anywhere in the document that a user creates a figure, allowing for effective visualization of the entities being manipulated based on any shape created by the user as well as the remaining entities of the document, as opposed to displaying the entities being manipulated on top of, or overlapping, the remaining entities of the document. In an embodiment of the present invention, a first entity is received in a figure. The first entity includes a first text content. A second entity is received in the figure. The second entity includes a second text content. A relatedness between the first text content and the second text content is determined. In response to receiving the second entity in the figure, the first entity and the second entity are arranged in the figure based on the relatedness. By displaying entities with similar text contents near one another, this embodiment provides the advantage of organizing entities of a document in a manner that allows for more efficient manipulation of the entities (e.g., annotation of the entities, which is a manipulation closely connected the text contents of the entities), as opposed to displaying the entities in the locations in which they are received from a user without further manipulation. In an embodiment of the present invention, an organizational protocol is associated with each shape of multiple shapes based on dimensional features of each shape. In response to receiving an entity, an option to pro...",
  "patent_number": "None",
  "abstract": "In an embodiment of the present invention, a figure is received, where the figure is created by a user. One or more entities are received in the figure. In response to receiving the one or more entities in the figure, the one or more entities are arranged in the figure according to a protocol.",
  "publication_number": "US20170212642A1-20170727",
  "_processing_info": {
    "original_size": 59419,
    "optimized_size": 3253,
    "reduction_percent": 94.53
  }
}