{
  "decision": "PENDING",
  "application_number": "15005173",
  "date_published": "20160519",
  "date_produced": "20160504",
  "title": "SYSTEMS AND METHODS OF NOTIFYING A PATIENT TO TAKE MEDICATION",
  "filing_date": "20160125",
  "inventor_list": [
    {
      "inventor_name_last": "Ramsdell",
      "inventor_name_first": "Scott W.",
      "inventor_city": "Charlotte",
      "inventor_state": "NC",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Waxenberg",
      "inventor_name_first": "Susan A.",
      "inventor_city": "New York",
      "inventor_state": "NY",
      "inventor_country": "US"
    }
  ],
  "ipcr_labels": [
    "G06F1900",
    "H04L500",
    "H04L2908",
    "H04L1258"
  ],
  "main_ipcr_label": "G06F1900",
  "summary": "<SOH> DETAILED DESCRIPTION AND FURTHER SUMMARY OF EMBODIMENTS <EOH>The disclosure of U.S. patent application Ser. No. 13/875,597 filed May 2, 2013 entitled SYSTEMS AND METHODS OF NOTIFYING A PATIENT TO TAKE MEDICATION is hereby incorporated herein by reference in its entirety. Systems and methods are disclosed for scheduling and sending notifications to, and receiving acknowledgements from, patients regarding specific health care events, such as the taking of medications at scheduled times and in prescribed dosages. The disclosed systems and methods can direct a patient to take their prescribed dosages of medication at scheduled times based on a schedule of medications prepared for the patient by a health care provider, a caregiver, or any other suitable individual, and enable the patient to provide acknowledgements of having taken their prescribed dosages of medication, thereby improving overall health care outcomes. The disclosed systems and methods also allow the patient to receive such directives to take medication, as well as send acknowledgements of having taken the medication, using a set top box connected to a television set, a mobile device such as a mobile phone, and/or a patient notification device such as a wireless pendant, thereby allowing desired improvements in health care outcomes to be achieved with an increased level of convenience. FIG. 1 depicts an exemplary environment 100 in which an illustrative embodiment of a patient notification system 102 may be employed, in accordance with the present application. As shown in FIG. 1 , the patient notification system 102 includes a scheduling server 104 , an authentication server 106 , a notification server 110 , and an account information database 108 . The scheduling server 104 is communicably connectable, via the Internet and/or a wired or wireless telecommunications network 112 , to at least one computerized health care provider device 114 , such as a smartphone, a desktop computer, a laptop computer,...",
  "patent_number": "None",
  "abstract": "Systems and methods of scheduling and sending notifications to, and receiving acknowledgements from, patients regarding specific health care events, such as the taking of medications at scheduled times and in prescribed dosages. By directing a patient to take their prescribed dosages of medication at scheduled times based on a schedule of medications prepared for the patient by a health care provider, a caregiver, etc., and enabling the patient to provide acknowledgements of having taken their prescribed dosages of medication, improved health care outcomes can be achieved. Further, by allowing the patient to receive such directives to take their medication, as well as to send such acknowledgements, using a set top box connected to a television set, a mobile device such as a mobile phone, and/or a patient notification device such as a wireless pendant, desired improvements in health care outcomes can be achieved with an increased level of convenience.",
  "publication_number": "US20160140308A1-20160519",
  "_processing_info": {
    "original_size": 86149,
    "optimized_size": 3706,
    "reduction_percent": 95.7
  }
}