{
  "decision": "PENDING",
  "application_number": "15001022",
  "date_published": "20170720",
  "date_produced": "20170705",
  "title": "GESTURE AMBIGUITY DETERMINATION AND RESOLUTION",
  "filing_date": "20160119",
  "inventor_list": [
    {
      "inventor_name_last": "Nicholson",
      "inventor_name_first": "John Weldon",
      "inventor_city": "Cary",
      "inventor_state": "NC",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Zhang",
      "inventor_name_first": "Jianbang",
      "inventor_city": "Cary",
      "inventor_state": "NC",
      "inventor_country": "US"
    }
  ],
  "ipcr_labels": [
    "G06F301",
    "G06K900"
  ],
  "main_ipcr_label": "G06F301",
  "summary": "<SOH> BRIEF SUMMARY <EOH>An apparatus for gesture ambiguity determination and resolution is disclosed. A method and computer program product also perform the functions of the apparatus. The apparatus may include an input device that receives a user-input gesture, a display device, a processor, and a memory that stores code executable by the processor, the code causing the processor to determine whether user-input gesture is an ambiguous gesture, present a set of candidates gestures corresponding to the user-input gesture, in response to the user-input gesture being ambiguous gesture, and resolve the ambiguous gesture based on user input. In certain embodiments, the processor may further magnify an area encompassing the ambiguous gesture, wherein presenting the set of candidate gestures includes displaying the set of candidates gestures within the magnified area. Magnifying the area encompassing the ambiguous gesture may include selecting an amount of magnification based on one of a size of the user-input gesture and a size of content associated with the user-input gesture. In some embodiments, determining whether a user-input gesture is an ambiguous gesture includes determining based on one of a size of the user-input gesture and a size of content associated with the user-input gesture. In other embodiments, determining whether he a user-input gesture is an ambiguous gesture may include determining a recognition confidence level for the user-input gesture and identifying the user-input gesture as an ambiguous gesture in response to the recognition confidence level being below a threshold level. In some embodiments, presenting the set of candidate gestures includes overlaying the candidate gestures on content associated with the user-input gesture. Further, resolving the ambiguous gesture based on user input may include receiving a user selection of an overlaid candidate gesture. The memory may further include code executable by the processor to mark the ambiguous ge...",
  "patent_number": "None",
  "abstract": "Systems, apparatuses, methods, and program products are disclosed. An apparatus may include a processor configured to determine whether a user-input gesture is an ambiguous gesture, present a set of candidate gestures corresponding to the user-input gesture, in response to the user-input gesture being an ambiguous gesture, and resolve the ambiguous gesture based on user-input. The processor may magnify an area around the ambiguous gesture, wherein presenting the set of candidate gestures includes displaying the candidate gestures within the magnified area. The apparatus may include a memory that stores code executable by the processor. The apparatus may also include an input device that receives a user-input gesture and a display device.",
  "publication_number": "US20170205888A1-20170720",
  "_processing_info": {
    "original_size": 93218,
    "optimized_size": 3439,
    "reduction_percent": 96.31
  }
}