{
  "date_produced": "20160810",
  "publication_number": "US20160247077A1-20160825",
  "main_ipcr_label": "G06N504",
  "decision": "PENDING",
  "application_number": "15005117",
  "inventor_list": [
    {
      "inventor_name_last": "SINGHAL",
      "inventor_name_first": "Bibhore",
      "inventor_city": "Noida",
      "inventor_state": "",
      "inventor_country": "IN"
    },
    {
      "inventor_name_last": "GUPTA",
      "inventor_name_first": "Yogesh",
      "inventor_city": "Noida",
      "inventor_state": "",
      "inventor_country": "IN"
    }
  ],
  "abstract": "System and method for processing a raw data is disclosed. The system is configured to identifying a pattern using a plurality of datasets selected from the raw data. Further, the system is configured to fetching a first set of data patterns associated with a first set of historical visualizations. The system further identifies a second set of data patterns from the first set of data patterns by matching the pattern with the first set of data patterns. Furthermore, the system is configured to identify a second set of historical visualizations associated with the second set of data patterns from the first set of historical visualizations. Further, the system is configured to represent the raw data graphically for predictive analysis based on at least one historical visualization selected from the second set of historical visualizations.",
  "filing_date": "20160125",
  "patent_number": "None",
  "summary": "<SOH> SUMMARY <EOH>This summary is provided to introduce aspects related to systems and methods for processing raw data and the aspects are further described below in the detailed description. In one implementation, a method for processing a raw data is disclosed. Initially, a pattern is identified by a processor from the raw data, wherein the patterns is identified using a plurality of datasets selected from the raw data. In the next step, a first set of data patterns associated with a first set of historical visualizations are fetched from an online repository by the processor. Further, a second set of data patterns applicable to the plurality of datasets is identified by the processor, by matching the pattern with the first set of data patterns, wherein the second set of data patterns is a sub set of the first set of data patterns. In the next step, a second set of historical visualizations associated with the second set of data patterns is identified from the first set of historical visualizations by the processor. Further, the raw data is represented graphically by the processor for predictive analysis based on at least one historical visualization, wherein the at least one historical visualization is selected from the second set of historical visualizations. In one implementation, a system for processing a raw data is disclosed. The system includes a memory and a processor coupled to the memory, wherein the processor is configured to identifying a pattern using a plurality of datasets selected from the raw data. Further, the processor is configured to fetching a first set of data patterns associated with a first set of historical visualizations. The processor further identifies a second set of data patterns applicable to the plurality of datasets by matching the pattern with the first set of data patterns, wherein the second set of data patterns is a sub set of the first set of data patterns. Furthermore, the processor is configured to identify a second set of...",
  "date_published": "20160825",
  "title": "SYSTEM AND METHOD FOR PROCESSING RAW DATA",
  "ipcr_labels": [
    "G06N504"
  ],
  "_processing_info": {
    "original_size": 39853,
    "optimized_size": 3512,
    "reduction_percent": 91.19
  }
}