{
  "date_produced": "20170705",
  "publication_number": "US20170206456A1-20170720",
  "main_ipcr_label": "G06N700",
  "decision": "PENDING",
  "application_number": "15000157",
  "inventor_list": [
    {
      "inventor_name_last": "Stumbo",
      "inventor_name_first": "William K.",
      "inventor_city": "Fairport",
      "inventor_state": "NY",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Rizzolo",
      "inventor_name_first": "Charles D.",
      "inventor_city": "Fairport",
      "inventor_state": "NY",
      "inventor_country": "US"
    }
  ],
  "abstract": "A system and a method for estimating readiness for passing an associated summative assessment includes, after receiving test results for at least one test, generating a score Cn for each concept tested on the test. Using the score, the system computes a probability of mastery p(Mn) of the at least one concept and associates the probability of mastery p(Mn) as a prior for updating the probability after receiving future test results. The system iteratively updates the probability of mastery p(Mn) of the at least one concept after each test using for the new test score and the prior.",
  "filing_date": "20160119",
  "patent_number": "None",
  "summary": "<SOH> BRIEF DESCRIPTION <EOH>A first embodiment of the disclosure relates to a method for estimating readiness for passing an associated summative assessment. The method includes receiving test results for at least one test administered before the associated summative assessment. Each test is coded with information corresponding to at least one concept being assessed by the each test. The method also includes generating a score of the at least one concept for each of the tests. Using the score generated for the first test, the method includes computing a probability of mastery of the at least one concept. The method includes associating the probability of mastery as a prior. The method further includes updating the probability of mastery of the at least one concept for at least a second test using the prior and the score corresponding to the at least a second test. The method also includes providing a user with the probability of mastery at an associated output device. Another embodiment of the disclosure relates to a system for estimating readiness for passing an associated summative assessment. The system comprises a processor and a non-transitory computer readable memory storing instructions that are executable by the processor. The system receives test results for at least one test administered before the associated summative assessment. Each test is coded with information corresponding to at least one concept being assessed by the each test. The system generates a score of the at least one concept for each of the tests. Using the score generated for a first test, the system computes a probability of mastery of the at least one concept. The system associates the probability of mastery as a prior. Using the prior, the system updates the probability of mastery of the at least one concept for at least a second test using the score corresponding to the at least a second test. The system provides a user with the probability of mastery at an associated output device. ...",
  "date_published": "20170720",
  "title": "ASSESSMENT PERFORMANCE PREDICTION",
  "ipcr_labels": [
    "G06N700",
    "G09B1900",
    "G06F1718"
  ],
  "_processing_info": {
    "original_size": 55990,
    "optimized_size": 3287,
    "reduction_percent": 94.13
  }
}