{
  "decision": "ACCEPTED",
  "application_number": "15018829",
  "date_published": "20160609",
  "date_produced": "20160525",
  "title": "Systems And Methods For Power Supply Configuration And Control",
  "filing_date": "20160208",
  "inventor_list": [
    {
      "inventor_name_last": "Rahardjo",
      "inventor_name_first": "Johan",
      "inventor_city": "Austin",
      "inventor_state": "TX",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Das",
      "inventor_name_first": "Girish",
      "inventor_city": "Round Rock",
      "inventor_state": "TX",
      "inventor_country": "US"
    }
  ],
  "ipcr_labels": [
    "G06F132"
  ],
  "main_ipcr_label": "G06F132",
  "summary": "<SOH> SUMMARY OF THE INVENTION <EOH>Disclosed herein are systems and methods for controlling information handling system power supply based on current system power policy such as current system load power need and/or based on current system load power capping information, e.g., to optimize power supply efficiency based on current system load power need and/or based on current system load power capping information. The disclosed systems and methods may be advantageously implemented in one embodiment to improve power use efficiency for information handling system applications in which a power supply unit (PSU) has a power delivery capability that is overprovisioned relative to the power-consuming system load component/s of an information handling system. In one exemplary embodiment, the disclosed systems and methods may be implemented with an overprovisioned PSU that is employed in combination with power-capping capability for a configuration of one or more power-consuming system load components of an information handling system. An overprovisioned PSU capability includes a system configuration in which one or more PSU's are provided for the system that each have a maximum power supply capacity that is higher or much higher than the total maximum power consumption of the system load component/s, or alternatively that is higher or much higher than the total combined power-capped power consumption of the system load component/s. In one embodiment, an overprovisioned PSU capability may be intentionally provided for an information handling system in order to ensure sufficient power supply capacity exists to supply power for existing (e.g., original) power-consuming system load component/s together with additional power-consuming system load component/s later added to the system, and/or to power upgraded power-consuming system load component/s having higher power consumption rate than the existing (e.g., original) power-consuming system load component/s. Examples of additi...",
  "patent_number": "9904351",
  "abstract": "Systems and methods are disclosed that may be used for controlling information handling system power supply based on current system power policy such as current system load power need and/or based on current system load power capping information. The disclosed systems and methods may be so implemented to improve power use efficiency for information handling system applications in which a power supply unit (PSU) has a power delivery capability that is overprovisioned relative to the power-consuming system load component/s of an information handling system.",
  "publication_number": "US20160162018A1-20160609",
  "_processing_info": {
    "original_size": 72405,
    "optimized_size": 3259,
    "reduction_percent": 95.5
  }
}