{
  "date_produced": "20170329",
  "publication_number": "US20170103299A1-20170413",
  "main_ipcr_label": "G06N304",
  "decision": "PENDING",
  "application_number": "15017597",
  "inventor_list": [
    {
      "inventor_name_last": "Aydonat",
      "inventor_name_first": "Utku",
      "inventor_city": "Toronto",
      "inventor_state": "",
      "inventor_country": "CA"
    },
    {
      "inventor_name_last": "Chiu",
      "inventor_name_first": "Gordon Raymond",
      "inventor_city": "North York",
      "inventor_state": "",
      "inventor_country": "CA"
    },
    {
      "inventor_name_last": "Ling",
      "inventor_name_first": "Andrew Chaang",
      "inventor_city": "Toronto",
      "inventor_state": "",
      "inventor_country": "CA"
    }
  ],
  "abstract": "A method for implementing a convolutional neural network (CNN) accelerator on a target includes utilizing one or more processing elements to implement a standard convolution layer. A configuration of the CNN accelerator is modified to change a data flow between components on the CNN accelerator. The one or more processing elements is utilized to implement a fully connected layer in response to the change in the data flow.",
  "filing_date": "20160206",
  "patent_number": "None",
  "summary": "<SOH> SUMMARY <EOH>According to an embodiment of the present invention, a methodology for designing and implementing a convolutional neural network (CNN) accelerator is disclosed. The methodology utilizes an electronic design automation (EDA) tool that generates a design for the CNN accelerator in response to features of a CNN accelerator which may include characteristics and parameters of the CNN accelerator specified by a user, and available resources on a target selected by the user. The target may include one or more target devices of one or more types. The EDA tool assigns resources on the target to implement the CNN accelerator to achieve high performance. For example, resources on the target are assigned to implement appropriately sized buffers to handle the types and sizes of images to be processed by the CNN accelerator. Resources on the target are also assigned to implement the appropriate types and number of computation units, such as processing elements, to support the type of filters and layers applied by the CNN accelerator. The EDA tool also generates a sequencer unit that is programmed to coordinate the transmission of data to appropriate computation units in order to time multiplex computations on the computation units. According to an embodiment of the present invention, a range of characteristics may be specified by the user to allow the CNN accelerator to execute a plurality of CNN algorithms. In this embodiment, one or more configurable status registers (CSRs) are implemented to allow a user to configure the target to support specified characteristics required for executing one of the plurality of CNN algorithms at runtime, after the CNN accelerator is programmed on the target. When implemented on an field programmable gate array (FPGA), the CSRs effectively allow runtime configuration of the CNN accelerator. This facilitates an FPGA overlay targeted at CNN applications. According to an embodiment of the present invention, a method for implement...",
  "date_published": "20170413",
  "title": "Method and Apparatus for Implementing Layers on a Convolutional Neural Network Accelerator",
  "ipcr_labels": [
    "G06N304"
  ],
  "_processing_info": {
    "original_size": 72574,
    "optimized_size": 3299,
    "reduction_percent": 95.45
  }
}