{
  "decision": "PENDING",
  "application_number": "15010019",
  "date_published": "20170803",
  "date_produced": "20170719",
  "title": "METHOD AND SYSTEM FOR DIGITAL CURRENCY CREATION AND MARKETING",
  "filing_date": "20160129",
  "inventor_list": [
    {
      "inventor_name_last": "GAZETOV",
      "inventor_name_first": "Rafael",
      "inventor_city": "Visaginas",
      "inventor_state": "",
      "inventor_country": "LT"
    },
    {
      "inventor_name_last": "SARIPOVA",
      "inventor_name_first": "Marina",
      "inventor_city": "Visaginas",
      "inventor_state": "",
      "inventor_country": "LT"
    },
    {
      "inventor_name_last": "SILINAS",
      "inventor_name_first": "Andrejus",
      "inventor_city": "Vilnius",
      "inventor_state": "",
      "inventor_country": "LT"
    }
  ],
  "ipcr_labels": [
    "G06Q2006"
  ],
  "main_ipcr_label": "G06Q2006",
  "summary": "<SOH> SUMMARY OF THE INVENTION <EOH>The present invention relates to a new generation of digital currency which appeared at the junction of the Internet, telecommunications technologies and certain activities or actions of human. The present invention reveals both a method and a system which allows to actor/user to create cryptocurrency by making certain activities or actions, which can be authentic measured and verified using smartphone or other telecommunication devices. The present invention allows to create two kind of universal cryptocurrency, namely: cryptocurrency/time, based on a time during which the activities or actions were performed and cryptocurrency/quantity, based on the amount/quantity of performed activities or actions. Thus, the present invention converts amount of a time during which activities or actions were performed into the cryptocurrency/time and also converts amount of activities or actions which were performed into the cryptocurrency/quantity. The present invention comprises: identification of actor/user; making certain activities or actions by the actor/user; the achievement of certain amount of a time during which were performed activities or actions; the achievement of certain amount/quantity of performed activities or actions; authentic measurement and verification of amount of a time during which were performed activities or actions; authentic measurement and verification of the amount/quantity of performed activities or actions; the calculation and charging of cryptocurrency/time based on a lime during which the activities or actions were performed to the personal wallet or account of the actor/user; the calculation and charging of cryptocurrency/quantity based on amount/quantity of performed activities or actions to the personal wallet or account of the actor/user. In accordance with the invention, creation of cryptocurrency/time, based on a time during which the activities or actions were performed, includes: identification of act...",
  "patent_number": "None",
  "abstract": "A method and system which allow an actor/user to create new cryptocurrency, designed to motivate people to an active lifestyle in various fields by making certain activities or actions, which can be measured and verified using smartphones or other telecommunication devices. The method creates two kinds of universal cryptocurrency, namely: cryptocurrency/time, based on a time during which the activities or actions were performed and cryptocurrency/quantity, based on the amount/quantity of performed activities or actions. The method converts amount of time during which activities/actions were performed into the cryptocurrency/time and also converts amount of activities/actions which were performed into the cryptocurrency/quantity. Thus, a cryptocurrency/time and a cryptocurrency/quantity are parts of a new single digital currency under the preliminary name: “CRYPTonFly” as the abbreviation of words “creation cryptocurrency on the fly”, which empowers each individual a freedom and ability...",
  "publication_number": "US20170221021A1-20170803",
  "_processing_info": {
    "original_size": 26791,
    "optimized_size": 3867,
    "reduction_percent": 85.57
  }
}