{
  "date_produced": "20161122",
  "publication_number": "US20160358068A1-20161208",
  "main_ipcr_label": "G06N308",
  "decision": "PENDING",
  "application_number": "15014686",
  "inventor_list": [
    {
      "inventor_name_last": "Brothers",
      "inventor_name_first": "John W.",
      "inventor_city": "Calistoga",
      "inventor_state": "CA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Lee",
      "inventor_name_first": "Joohoon",
      "inventor_city": "East Palo Alto",
      "inventor_state": "CA",
      "inventor_country": "US"
    }
  ],
  "abstract": "Reducing computations in a neural network may include determining a group including a plurality of convolution kernels of a convolution stage of a neural network. The convolution kernels of the group are similar to one another. A base convolution kernel for the group may be determined. Scaling factors for a plurality of input feature maps processed by the group may be calculated. The convolution stage of the neural network may be modified to calculate a composite input feature map using the scaling factors and apply the base convolution kernel to the composite input feature map.",
  "filing_date": "20160203",
  "patent_number": "None",
  "summary": "<SOH> SUMMARY <EOH>One embodiment may include a method. The method may include determining a group including a plurality of convolution kernels of a convolution stage of a neural network. The convolution kernels of the group are similar to one another. The method may include determining a base convolution kernel for the group and determining scaling factors for a plurality of input feature maps processed by the group. The method may also include modifying the convolution stage to calculate a composite input feature map using the scaling factors and apply the base convolution kernel to the composite input feature map. Another embodiment may include a system. The system may include a processor programmed to initiate executable operations. The executable operations may include determining a group including a plurality of convolution kernels of a convolution stage of a neural network. The convolution kernels of the group are similar to one another. The executable operations may include determining a base convolution kernel for the group and determining scaling factors for a plurality of input feature maps processed by the group. The executable operations may also include modifying the convolution stage to calculate a composite input feature map using the scaling factors and apply the base convolution kernel to the composite input feature map. Another embodiment may include a non-transitory computer-readable storage medium having instructions stored thereon which, when executed by a processor, perform a method. The method may include determining a group including a plurality of convolution kernels of a convolution stage of a neural network. The convolution kernels of the group are similar to one another. The method may include determining a base convolution kernel for the group and determining scaling factors for a plurality of input feature maps processed by the group. The method may also include modifying the convolution stage to calculate a composite input feature map...",
  "date_published": "20161208",
  "title": "REDUCING COMPUTATIONS IN A NEURAL NETWORK",
  "ipcr_labels": [
    "G06N308",
    "G06N9900"
  ],
  "_processing_info": {
    "original_size": 80937,
    "optimized_size": 3280,
    "reduction_percent": 95.95
  }
}