{
  "decision": "ACCEPTED",
  "application_number": "15019500",
  "date_published": "20160602",
  "date_produced": "20160518",
  "title": "BIOMETRIC MATCHING TECHNOLOGY",
  "filing_date": "20160209",
  "inventor_list": [
    {
      "inventor_name_last": "Tiwari",
      "inventor_name_first": "Abhinav",
      "inventor_city": "Uttar Pradesh",
      "inventor_state": "",
      "inventor_country": "IN"
    },
    {
      "inventor_name_last": "Paul",
      "inventor_name_first": "Sanjoy",
      "inventor_city": "Bangalore",
      "inventor_state": "",
      "inventor_country": "IN"
    }
  ],
  "ipcr_labels": [
    "G06K900",
    "G06K938",
    "G06K968",
    "G06K962"
  ],
  "main_ipcr_label": "G06K900",
  "summary": "<SOH> SUMMARY <EOH>In one aspect, a system includes at least one processor and at least one memory coupled to the at least one processor having stored thereon instructions which, when executed by the at least one processor, causes the at least one processor to perform operations. The operations include managing a watch list that includes sorted biometric data for persons in the watch list and associations to additional biometric data for persons in the watch list and accessing multiple images of a potential suspect. The operations also include controlling parallel pre-processing of the multiple images of the potential suspect, determining an image of the potential suspect to use in matching against the watch list based on the pre-processing, and using the determined image of the potential suspect to search the sorted biometric data included in the watch list. The operations further include identifying a subset of persons from the watch list based on the search of the sorted biometric data included in the watch list and controlling parallel analysis of the determined image of the potential suspect against biometric data associated with the subset of persons in the watch list. In addition, the operations include determining whether the potential suspect matches a person in the watch list based on the parallel analysis of the determined image of the potential suspect against biometric data associated with the subset of persons in the watch list and outputting a result based on the determination of whether the potential suspect matches a person in the watch list. In another aspect, a method may include one or more of the operations described above. In yet another aspect, a computer-readable storage medium may be operable to cause a processor to perform one or more of the operations described above. Implementations may include one or more of the following features. For example, the operations may include maintaining numeric index values for persons in the watch list sort...",
  "patent_number": "9390338",
  "abstract": "Biometric matching technology, in which a watch list is managed, multiple images of a potential suspect are accessed, and parallel pre-processing of the multiple images is controlled. Based on the pre-processing, an image of the potential suspect to use in matching against the watch list is determined and the determined image is used to search sorted biometric data included in the watch list. A subset of persons from the watch list is identified based on the search and parallel analysis of the determined image of the potential suspect against detailed biometric data associated with the subset of persons in the watch list is controlled. Based on the parallel analysis, it is determined whether the potential suspect matches a person in the watch list and a result is outputted based on the determination.",
  "publication_number": "US20160155007A1-20160602",
  "_processing_info": {
    "original_size": 212401,
    "optimized_size": 3512,
    "reduction_percent": 98.35
  }
}