{
  "decision": "PENDING",
  "application_number": "15015466",
  "date_published": "20161103",
  "date_produced": "20161019",
  "title": "MEMORY DEVICE THAT PERFORMS GARBAGE COLLECTION",
  "filing_date": "20160204",
  "inventor_list": [
    {
      "inventor_name_last": "JINZENJI",
      "inventor_name_first": "Akihide",
      "inventor_city": "Inagi Tokyo",
      "inventor_state": "",
      "inventor_country": "JP"
    },
    {
      "inventor_name_last": "UEKI",
      "inventor_name_first": "Katsuhiko",
      "inventor_city": "Katsushika Tokyo",
      "inventor_state": "",
      "inventor_country": "JP"
    }
  ],
  "ipcr_labels": [
    "G06F1202"
  ],
  "main_ipcr_label": "G06F1202",
  "summary": "<SOH> BRIEF DESCRIPTION OF THE DRAWINGS <EOH>FIG. 1 is a perspective view of an information processing system according to a first embodiment. FIG. 2 is a block diagram of a memory system according to the first embodiment. FIG. 3 illustrates an equivalent circuit of block A of a NAND memory of the memory system in FIG. 2 . FIG. 4A illustrates data structure of a first block list stored in a buffer of the memory system according to the first embodiment. FIG. 4B illustrates data structure of a second block list stored in the buffer. FIG. 5 is a flowchart of generating and updating processing of the second block list according to the first embodiment. FIG. 6 is a flowchart of garbage collection processing according to the first embodiment. FIG. 7 schematically illustrates a step (S 22 ) of the garbage collection processing according to the first embodiment. FIG. 8 schematically illustrates a step (S 26 ) of the garbage collection processing according to the first embodiment. FIG. 9 is a timing chart illustrating a relationship between a processing time and latency of the garbage collection processing according to the first embodiment. FIG. 10 illustrates data structure of a second block list according to a second embodiment. FIG. 11 is a flowchart of generating and updating processing of the second block list according to the second embodiment. FIG. 12 is a flowchart of garbage collection processing according to the second embodiment. FIG. 13 illustrates data structure of a second block list according to a third embodiment. FIG. 14 is a flowchart of generating and updating processing of the second block list according to the third embodiment. FIG. 15 illustrates data structure of a second block list according to a fourth embodiment. FIG. 16 is a flowchart of generating and updating processing of the second block list according to the fourth embodiment. detailed-description description=\"Detailed Description\" end=\"lead\"?",
  "patent_number": "None",
  "abstract": "A memory device includes a nonvolatile memory unit including a plurality of blocks, and a memory controller. The memory controller is configured to determine target blocks for garbage collection, and transfer valid data in the target blocks to another block during the garbage collection. The target blocks includes a first block that has a valid data ratio greater than zero and equal to or smaller than a predetermined value and a second block that has a valid data ratio greater than the predetermined value.",
  "publication_number": "US20160321172A1-20161103",
  "_processing_info": {
    "original_size": 53334,
    "optimized_size": 3154,
    "reduction_percent": 94.09
  }
}