{
  "decision": "ACCEPTED",
  "application_number": "15017230",
  "date_published": "20160630",
  "date_produced": "20160615",
  "title": "MOBILE WIRELESS HAND-HELD IDENTIFICATION SYSTEM AND METHOD FOR IDENTIFICATION",
  "filing_date": "20160205",
  "inventor_list": [
    {
      "inventor_name_last": "Mullin",
      "inventor_name_first": "Sean",
      "inventor_city": "Manomet",
      "inventor_state": "MA",
      "inventor_country": "US"
    }
  ],
  "ipcr_labels": [
    "G06K900",
    "H04N533",
    "H04N5225",
    "H04N544"
  ],
  "main_ipcr_label": "G06K900",
  "summary": "<SOH> SUMMARY OF THE INVENTION <EOH>The instant invention provides a biometric processing and communication system comprising a commercially available, handheld wireless communication device, such as an iPhone™, iPad™, Android™, or Blackberry™ mobile communication device, or other mobile communication device, and a dedicated biometric processing/data capture device piggybacked onto the communication device (iPhone™, iPad™, Android™, and Blackberry™ are trademarks of their respective owners). Associated software and processes enable the system, using commercially established wireless communication networks, to capture and process a digital image of a human biometric (fingerprint, iris, etc.) for transmission via a secure and encrypted internet connection to a central server. Additionally, the device includes at least one other data capture device which can read and capture at least one of a variety of other data types from a variety of different government issued credentials, such as passports, driver's licenses, green cards, visas and/or other identity cards. The biometric processing device of the system is designed to focus on the difficult task of capturing the highest possible quality image for encoding and comparison. The process intensive tasks of encoding the obtained image to a digital template an then comparing the encoded template to all of the reference templates are not completed on the handheld system. Rather, the handheld system uses the established and functional technologies of the wireless communication device for transmitting the obtained image to a back-end server system. At the server level, the back-end server system receives the image, encodes the image of the biometric to a unique digital template, and compares the template with templates stored in a database to verify the identity of an individual previously enrolled in the database. If a match is obtained, the server transmits the identification data back to the handheld system for display on...",
  "patent_number": "9507926",
  "abstract": "A mobile, wireless biometric identification system includes a biometric capture device which enables a smartphone, using a commercially established wireless communication networks, to capture a digital image of a human biometric (iris, fingerprint, etc.) for transmission to a central server. The biometric capture device captures a high quality image for encoding, while the overall system leverages the existing cellular communication network. The server receives the image, encodes the image to a biometric template, and compares the encoded template to reference templates stored in a database to identify the individual. Identification data is transmitted back to the smartphone device and displayed. Additionally, the device includes at least one other data capture device which can read, capture and transmit at least one of a variety of other data types from a variety of different government issued credentials, such as passports, driver's licenses, green cards, visas and/or other identity ...",
  "publication_number": "US20160188974A1-20160630",
  "_processing_info": {
    "original_size": 64578,
    "optimized_size": 3643,
    "reduction_percent": 94.36
  }
}