{
  "decision": "ACCEPTED",
  "application_number": "15017322",
  "date_published": "20161020",
  "date_produced": "20161005",
  "title": "CASE VIDEO LOG DATA GENERATING APPARATUS, CASE VIDEO PROCESSING SYSTEM, AND CASE VIDEO LOG DATA GENERATING METHOD",
  "filing_date": "20160205",
  "inventor_list": [
    {
      "inventor_name_last": "KOIDE",
      "inventor_name_first": "Youhei",
      "inventor_city": "Fukuoka",
      "inventor_state": "",
      "inventor_country": "JP"
    },
    {
      "inventor_name_last": "YOMOGIDA",
      "inventor_name_first": "Yasuo",
      "inventor_city": "Fukuoka",
      "inventor_state": "",
      "inventor_country": "JP"
    },
    {
      "inventor_name_last": "WANIGUCHI",
      "inventor_name_first": "Kazuya",
      "inventor_city": "Fukuoka",
      "inventor_state": "",
      "inventor_country": "JP"
    },
    {
      "inventor_name_last": "YOKOMITSU",
      "inventor_name_first": "Yasushi",
      "inventor_city": "Fukuoka",
      "inventor_state": "",
      "inventor_country": "JP"
    },
    {
      "inventor_name_last": "SHINOHARA",
      "inventor_name_first": "Toshiaki",
      "inventor_city": "Fukuoka",
      "inventor_state": "",
      "inventor_country": "JP"
    },
    {
      "inventor_name_last": "SEGUCHI",
      "inventor_name_first": "Hiroyuki",
      "inventor_city": "Osaka",
      "inventor_state": "",
      "inventor_country": "JP"
    }
  ],
  "ipcr_labels": [
    "G11B27031",
    "G11B2710",
    "G06T1140",
    "G06K900",
    "G06K920"
  ],
  "main_ipcr_label": "G11B27031",
  "summary": "<SOH> SUMMARY OF THE INVENTION <EOH>In order to solve such a problem, the present disclosure provides a case video log data generating apparatus, a case video processing system, and a case video log data generating method which are capable of appropriately recording a history of processing when the processing is performed on video data and easily recognizing contents of the performed processing. The present disclosure provides a case video log data generating apparatus that generates log data regarding processing of video data related to a case, the case video log data generating apparatus including a processor, and a memory. In cooperation with the memory, the processor generates log data including a processing time and processing contents, as data indicating a history of each of processes including input of video data recorded in a storage of a case video management system, image processing including a masking process to be performed on the video data, and output of the video data, at the time of performing processing on the video data, and records the log data in the case video management system in association with the processed video data. According to the present disclosure, it is possible to appropriately record a history of processing when the processing is performed on video data and to easily recognize contents of the performed processing.",
  "patent_number": "10026448",
  "abstract": "A log generator generates log data including a processing time and processing contents, as data indicating a history of each of processes including input of video data recorded in a storage of a case video management system by a video input unit, image processing including a masking process to be performed on the video data by an image processor, and output of the video data by an encoder and a video output unit, at the time of performing processing for the video data, and records the log data in the case video management system in association with the processed video data.",
  "publication_number": "US20160307597A1-20161020",
  "_processing_info": {
    "original_size": 62788,
    "optimized_size": 3328,
    "reduction_percent": 94.7
  }
}