{
  "date_produced": "20160525",
  "publication_number": "US20160162792A1-20160609",
  "main_ipcr_label": "G06N504",
  "decision": "PENDING",
  "application_number": "15019595",
  "inventor_list": [
    {
      "inventor_name_last": "Lu",
      "inventor_name_first": "Jie",
      "inventor_city": "Hawthorne",
      "inventor_state": "NY",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Boston",
      "inventor_name_first": "Jeffrey S.",
      "inventor_city": "Wappingers Falls",
      "inventor_state": "NY",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Coden",
      "inventor_name_first": "Anni R.",
      "inventor_city": "Bronx",
      "inventor_state": "NY",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Lai",
      "inventor_name_first": "Jennifer",
      "inventor_city": "Garrison",
      "inventor_state": "NY",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Pan",
      "inventor_name_first": "Shimei",
      "inventor_city": "Armonk",
      "inventor_state": "NY",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Topkara",
      "inventor_name_first": "Mercan",
      "inventor_city": "Scarsdale",
      "inventor_state": "NY",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Wen",
      "inventor_name_first": "Zhen",
      "inventor_city": "Springfield",
      "inventor_state": "NJ",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Wood",
      "inventor_name_first": "Stephen P.",
      "inventor_city": "Thornwood",
      "inventor_state": "NY",
      "inventor_country": "US"
    }
  ],
  "abstract": "A system includes a user model module that generates a plurality of topic-specific user knowledge models for each user of a plurality of users, each topic-specific user knowledge model representing a level of knowledge possessed by a respective user on a single topic from a set of globally defined topics shared among the plurality of users, a expertise model building module that generates a plurality of topic-specific expert knowledge models, each topic-specific expert knowledge model representing an aggregate level of knowledge possessed by a plurality of expert users on a single topic from a set of globally defined topics shared among the plurality of users, and a processor of a computer that executes instructions for comparing the topic-specific user knowledge model of the first user with the topic-specific expert knowledge model for a respective topic to determine a distance between a user knowledge level and an aggregate expert knowledge level for the topic.",
  "filing_date": "20160209",
  "patent_number": "None",
  "summary": "<SOH> SUMMARY OF THE INVENTION <EOH>In view of the foregoing and other exemplary problems, drawbacks, and disadvantages of the conventional methods and structures, an exemplary feature of the present invention is to provide learning systems, methods and computer program products that are customizable, able to provide feedback regarding a comparison between an expertise of an individual learner and that of their target level of expertise, and able to detect potential experts for a set of users. A first aspect of the present disclosure allows for an expedited increase on a number of expert users within an enterprise. Activities of users who are wishing to become experts in a topic may be analyzed and a recommendation of activities may be proposed based on the activities of experts for that topic, thereby expediting a user's ability to engage in the same activities of an expert. As a result, when compared to conventional technologies, this aspect of the present disclosure allows for a faster acceleration of expertise within an enterprise. A second exemplary aspect of the present disclosure allows user who are emerging experts to be ascertained based on their activities. Similarly, emerging topics to be ascertained and, as a result, a user or an enterprise can to respond more quickly to changing market needs. A third exemplary aspect of the present disclosure facilitates expertise ramp-up through the use of user modeling and expertise modeling. The content and activities associated with a given user is analyzed and updated based on available information from various sources (e.g. employee learning tools, online social business tools, paper and patent databases, organizational structure, and other information repositories) to create a user model of topics in which this user is well versed. Further, the expertise model for a given topic may be created by aggregating individual user models of identified experts on given topic. A user's distance and path to the target level...",
  "date_published": "20160609",
  "title": "SYSTEMS, METHODS, AND COMPUTER PROGRAM PRODUCTS FOR EXPEDITING EXPERTISE",
  "ipcr_labels": [
    "G06N504"
  ],
  "_processing_info": {
    "original_size": 81358,
    "optimized_size": 4559,
    "reduction_percent": 94.4
  }
}