{
  "decision": "ACCEPTED",
  "application_number": "15018192",
  "date_published": "20160602",
  "date_produced": "20160518",
  "title": "Forward Depth Display",
  "filing_date": "20160208",
  "inventor_list": [
    {
      "inventor_name_last": "Steward",
      "inventor_name_first": "Lucas Dale",
      "inventor_city": "Broken Arrow",
      "inventor_state": "OK",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Scott",
      "inventor_name_first": "John",
      "inventor_city": "Auckland",
      "inventor_state": "",
      "inventor_country": "NZ"
    }
  ],
  "ipcr_labels": [
    "G01C2100",
    "G06T1100",
    "G06T1120"
  ],
  "main_ipcr_label": "G01C2100",
  "summary": "<SOH> SUMMARY <EOH>Described herein are implementations of various technologies for analyzing a bathymetric chart to determine depths at a plurality of locations in front of a vessel. In one implementation, a non-transitory computer-readable medium having stored thereon computer-executable instructions which, when executed by a computer, cause the computer to perform various actions. The actions may include receiving a location and heading of a vessel. The actions may include retrieving a bathymetric chart corresponding to the location. The actions may include analyzing the bathymetric chart, location and heading to determine depths at a plurality of locations in front of the vessel. The actions may also include displaying the depths. Described herein are also implementations of various technologies for analyzing a bathymetric chart to determine depths at a plurality of locations in front of a vessel and displaying a warning if at least one of the depths is less than a minimum depth. In one implementation, a non-transitory computer-readable medium having stored thereon computer-executable instructions which, when executed by a computer, cause the computer to perform various actions. The actions may include receiving a location and heading of a vessel. The actions may include receiving a minimum depth. The actions may include retrieving a bathymetric chart corresponding to the location. The actions may include analyzing the bathymetric chart, location and heading to determine depths at a plurality of locations in front of the vessel. The actions may include comparing the depths to the minimum depth. The actions may also include displaying a warning if at least one of the depths is less than the minimum depth. Described herein are also implementations of various technologies for an apparatus for displaying marine electronic navigation data. The apparatus includes one or more processors, a screen, and a memory. The memory has a plurality of executable instructions. Whe...",
  "patent_number": "9829321",
  "abstract": "Various implementations described herein are directed to an apparatus for displaying marine electronic navigation data. The apparatus comprises one or more processors, a screen configured to display marine data, and a memory having a plurality of executable instructions. The executable instructions, when executed by the one or more processors, may cause the one or more processors to determine a location of a vessel and at least one of a heading or a projected direction of travel of the vessel, retrieve a bathymetric chart corresponding to the location, analyze the bathymetric chart, the location, and the at least one heading or projected direction of travel of the vessel to determine a plurality of depths that each correspond to one of a plurality of locations corresponding to the heading or the projected direction of travel of the vessel, and display the plurality of depths on the screen.",
  "publication_number": "US20160153785A1-20160602",
  "_processing_info": {
    "original_size": 49021,
    "optimized_size": 3591,
    "reduction_percent": 92.67
  }
}