{
  "decision": "PENDING",
  "application_number": "15012198",
  "date_published": "20160811",
  "date_produced": "20160727",
  "title": "RADIATION DIAGNOSIS APPARATUS",
  "filing_date": "20160201",
  "inventor_list": [
    {
      "inventor_name_last": "OHISHI",
      "inventor_name_first": "Satoru",
      "inventor_city": "Otawara",
      "inventor_state": "",
      "inventor_country": "JP"
    }
  ],
  "ipcr_labels": [
    "G06T700",
    "A61B600",
    "G06T1100",
    "A61B603"
  ],
  "main_ipcr_label": "G06T700",
  "summary": "<SOH> BRIEF DESCRIPTION OF THE DRAWINGS <EOH>FIG. 1 is a block diagram of an exemplary configuration of an X-ray diagnosis apparatus according to a first embodiment; FIG. 2 is a flowchart of an exemplary procedure in a process performed by the X-ray diagnosis apparatus according to the first embodiment; FIG. 3 is a first drawing for explaining the first embodiment; FIG. 4 is a flowchart of a procedure in a reconstructing process performed by a three-dimensional reconstructing unit according to the first embodiment; FIG. 5A is a second drawing for explaining the first embodiment; FIG. 5B is a third drawing for explaining the first embodiment; FIG. 6 is a drawing for explaining a modification example of the first embodiment; FIG. 7 is a block diagram of an exemplary configuration of an X-ray CT apparatus according to a second embodiment; FIG. 8 is a drawing for explaining a reconstructing process performed by the X-ray CT apparatus according to the second embodiment; FIG. 9 is a drawing for explaining a reconstructing process performed by an X-ray CT apparatus according to another embodiment; and FIG. 10 is a block diagram of an exemplary configuration of a Single Photon Emission Computed Tomography (SPECT) apparatus according to yet another embodiment. detailed-description description=\"Detailed Description\" end=\"lead\"?",
  "patent_number": "None",
  "abstract": "A radiation diagnosis apparatus according to an embodiment includes reconstructing circuitry. The reconstructing circuitry reconstructs three-dimensional medical agent distribution images in a time series from a group of acquired images acquired in the presence of a medical agent by an imaging system from directions in a range that makes it possible to reconstruct three-dimensional images of a subject, by performing an iterative reconstruction process that uses at least one selected from between spatial continuity of the medical agent and temporal continuity of the concentration of the medical agent as a constraint condition.",
  "publication_number": "US20160232661A1-20160811",
  "_processing_info": {
    "original_size": 96110,
    "optimized_size": 2521,
    "reduction_percent": 97.38
  }
}