{
  "decision": "ACCEPTED",
  "application_number": "15018604",
  "date_published": "20160602",
  "date_produced": "20160518",
  "title": "MONITORING CAMERA AND MONITORING CAMERA CONTROL METHOD",
  "filing_date": "20160208",
  "inventor_list": [
    {
      "inventor_name_last": "Mori",
      "inventor_name_first": "Yuuichiro",
      "inventor_city": "Kanagawa",
      "inventor_state": "",
      "inventor_country": "JP"
    },
    {
      "inventor_name_last": "Nakamura",
      "inventor_name_first": "Yasuji",
      "inventor_city": "Kanagawa",
      "inventor_state": "",
      "inventor_country": "JP"
    },
    {
      "inventor_name_last": "Higuchi",
      "inventor_name_first": "Kazutaka",
      "inventor_city": "Kanagawa",
      "inventor_state": "",
      "inventor_country": "JP"
    },
    {
      "inventor_name_last": "Ouyabu",
      "inventor_name_first": "Satoru",
      "inventor_city": "Kanagawa",
      "inventor_state": "",
      "inventor_country": "JP"
    }
  ],
  "ipcr_labels": [
    "G08B13196",
    "H04N514",
    "G06K900",
    "H04N718"
  ],
  "main_ipcr_label": "G08B13196",
  "summary": "<SOH> BRIEF DESCRIPTION OF THE DRAWINGS <EOH>FIG. 1 is a block diagram showing a schematic configuration of a monitoring camera of an embodiment of the present invention. FIGS. 2A to 2D are views for describing a difference between a case where the monitoring camera shown in FIG. 1 produces an alarm and a case where no alarm is produced. FIG. 3 is a timing chart for describing operation of the monitoring camera shown in FIG. 1 . FIG. 4 is a block diagram showing a schematic configuration of a monitoring camera system equipped with the plurality of monitoring cameras shown in FIG. 1 . FIG. 5 is a view for describing drawbacks in a related-art monitoring camera. detailed-description description=\"Detailed Description\" end=\"lead\"?",
  "patent_number": "9437089",
  "abstract": "An image signal processing DSP subjects an image captured by an imaging element having a zoom lens to image processing for identifying a tracking target. In accordance with zoom information generated by the image signal processing DSP, the main CPU controls the zoom lens and controls a turn table that moves the imaging element in panning and tilting directions in accordance with pan and tilt information, to track the tracking target. During tracking of the tracking target, a determination is made, from information about movements of the tracking target generated by the image signal processing DSP, as to whether or not the target to be tracked has intruded the inside of the area from the outside. In a case where the target has intruded the inside of a preset area from the outside, an alarm command is produced when the target continually remains in the area for; e.g., one second.",
  "publication_number": "US20160155307A1-20160602",
  "_processing_info": {
    "original_size": 34845,
    "optimized_size": 2646,
    "reduction_percent": 92.41
  }
}