{
  "date_produced": "20170524",
  "publication_number": "US20170161635A1-20170608",
  "main_ipcr_label": "G06N9900",
  "decision": "PENDING",
  "application_number": "15015044",
  "inventor_list": [
    {
      "inventor_name_last": "OONO",
      "inventor_name_first": "Kenta",
      "inventor_city": "Tokyo",
      "inventor_state": "",
      "inventor_country": "JP"
    },
    {
      "inventor_name_last": "CLAYTON",
      "inventor_name_first": "Justin",
      "inventor_city": "San Mateo",
      "inventor_state": "CA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "OTA",
      "inventor_name_first": "Nobuyuki",
      "inventor_city": "San Mateo",
      "inventor_state": "CA",
      "inventor_country": "US"
    }
  ],
  "abstract": "In various embodiments, the systems and methods described herein relate to generative models. The generative models may be trained using machine learning approaches, with training sets comprising chemical compounds and biological or chemical information that relate to the chemical compounds. Deep learning architectures may be used. In various embodiments, the generative models are used to generate chemical compounds that have desired characteristics, e.g. activity against a selected target. The generative models may be used to generate chemical compounds that satisfy multiple requirements.",
  "filing_date": "20160203",
  "patent_number": "None",
  "summary": "<SOH> SUMMARY OF THE INVENTION <EOH>In a first aspect, the methods and systems described herein relate to a computer system for generation of chemical compound representations. The system may comprise a probabilistic autoencoder. The probabilistic autoencoder may comprise a probabilistic encoder configured to encode chemical compound fingerprints as latent variables; a probabilistic decoder configured to decode latent representations and generate random variables over values of fingerprint elements; and/or one or more sampling modules configured to sample from a latent variable or a random variable. The system may be trained by feeding it chemical compound fingerprints and training labels associated with the chemical compound fingerprints and generating reconstructions of chemical compound fingerprints, wherein the system's training is constrained by the reconstruction error. The reconstruction error may comprise the negative likelihood that an encoded chemical compound representation is drawn from the random variable generated by the probabilistic decoder. The system may be trained to optimize, for example to minimize, the reconstruction error. In some embodiments, the training is constrained by a loss function comprising the reconstruction error and a regularization error. The probabilistic autoencoder may be trained to learn to approximate an encoding distribution. The regularization error may comprise a penalty associated with the complexity of the encoding distribution. The training may comprise minimizing the loss function. In some embodiments, the training labels comprise one or more label elements having predetermined values. In some embodiments, the system is configured to receive a target label comprising one or more label elements and generate chemical compound fingerprints that satisfy a specified value for each of the one or more label elements. In some embodiments, the training labels do not comprise the target label. In some embodiments, each chemical...",
  "date_published": "20170608",
  "title": "GENERATIVE MACHINE LEARNING SYSTEMS FOR DRUG DESIGN",
  "ipcr_labels": [
    "G06N9900",
    "G06N700"
  ],
  "_processing_info": {
    "original_size": 173694,
    "optimized_size": 3434,
    "reduction_percent": 98.02
  }
}