{
  "date_produced": "20170726",
  "publication_number": "US20170228650A1-20170810",
  "main_ipcr_label": "G06N504",
  "decision": "PENDING",
  "application_number": "15018411",
  "inventor_list": [
    {
      "inventor_name_last": "Fu",
      "inventor_name_first": "Yanjie",
      "inventor_city": "Harrison",
      "inventor_state": "NJ",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Parthasarathy",
      "inventor_name_first": "Srinivasan",
      "inventor_city": "Yonkers",
      "inventor_state": "NY",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Turaga",
      "inventor_name_first": "Deepak",
      "inventor_city": "Elmsford",
      "inventor_state": "NY",
      "inventor_country": "US"
    }
  ],
  "abstract": "A computer program product is provided for estimating algorithm run times given parameters of the algorithm, specifications of an architecture on which the algorithm will execute and dimensions of a data set which will be input into the algorithm. The computer program product includes instructions to cause a processing circuit to create training data sets, generate run time data of executions of instances of the algorithm on the architecture for each training data set, identify model-usable features, generate a map of the model-usable features to an expression of the run time data and iteratively tuning the model-usable features toward improving map accuracy until a target map accuracy is achieved, develop a predictive model based on iteratively tuned versions of the model-usable features and estimate a run time of an execution of the algorithm on a new data set and on a new architecture using the predictive model.",
  "filing_date": "20160208",
  "patent_number": "None",
  "summary": "<SOH> SUMMARY <EOH>According to an embodiment of the present invention, a computer program product is provided for estimating algorithm run times given parameters of the algorithm, specifications of an architecture on which the algorithm will execute and dimensions of a data set which will be input into the algorithm. The computer program product includes a computer readable storage medium having program instructions embodied therewith. The program instructions are readable and executable by a processing circuit to cause the processing circuit to create training data sets, generate run time data associated with respective executions of parameterized instances of the algorithm on the architecture for each of the training data sets, identify model-usable features from factorized polynomial expansions of the dimensions of the data set, the parameters of the algorithm and the specifications of the architecture, generate a map of the model-usable features to an expression of the run time data, iteratively tune the model-usable features toward improving an accuracy of the map until a target accuracy is achieved, develop a predictive model based on iteratively tuned versions of the model-usable features and estimate a run time of an execution of the algorithm on a new data set and on a new architecture using the predictive model. According to another embodiment of the present invention, a computing system is provided for estimating algorithm run times given parameters of the algorithm, specifications of an architecture on which the algorithm will execute and dimensions of a data set which will be input into the algorithm. The computing system includes a computer readable storage medium having instructions stored thereon that are executable by a processing circuit to cause the processing circuit to create training data sets, generate run time data associated with respective executions of parameterized instances of the algorithm on the architecture for each of the training d...",
  "date_published": "20170810",
  "title": "ESTIMATING ANALYTIC EXECUTION TIMES",
  "ipcr_labels": [
    "G06N504",
    "G06N9900"
  ],
  "_processing_info": {
    "original_size": 44317,
    "optimized_size": 3761,
    "reduction_percent": 91.51
  }
}