{
  "decision": "PENDING",
  "application_number": "15019941",
  "date_published": "20161208",
  "date_produced": "20161122",
  "title": "SYSTEM AND METHOD OF AN IMPROVED LINE CARD DESIGN",
  "filing_date": "20160209",
  "inventor_list": [
    {
      "inventor_name_last": "Lubivy",
      "inventor_name_first": "Alexander",
      "inventor_city": "San Jose",
      "inventor_state": "CA",
      "inventor_country": "US"
    }
  ],
  "ipcr_labels": [
    "G06F1340",
    "G06F1336"
  ],
  "main_ipcr_label": "G06F1340",
  "summary": "<SOH> SUMMARY OF THE DESCRIPTION <EOH>A method and apparatus of a network element that includes a line card without retitmers between an ASIC and either a network connector or mid-plane connector is described. In an exemplary embodiment, the network element includes a line card coupled to a fabric card. The line card includes a plurality of mid-place connectors, a plurality of network connectors, and a plurality of application-specific integrated circuits (ASICs). In addition, one of plurality the mid-plane connectors couple the line card with the fabric card. Furthermore, the plurality of network connectors is to communicate data with devices coupled to the network element and each of the plurality of ASICs is to process the data. The line card further is configured such that each of the of plurality of ASICs is coupled to each of the plurality of mid-plane connectors by a different mid-plane connector—ASIC path without boosting a signal on that path and each of the plurality of ASICs is further coupled to each of the plurality of network connectors by a different network connector—ASIC path without boosting a signal on that path. In another embodiment, a method of manufacturing a line card is described. In an exemplary embodiment, the method couples a plurality of mid-plane connectors to a line card printed circuit board (PCB). The method further couples a plurality of network connectors to the line card PCB. In addition, the method places a plurality of ASICs on the line card PCB where each of plurality of ASICs is placed close enough to each of the plurality of mid-plane connectors such that a mid-plane ASIC path can be laid out without boosting a signal on that mid-plane ASIC path and each of the plurality of ASICs is further close enough to each of the plurality of network connectors such that a network connector ASIC path can be laid out without boosting a signal on that network connector ASIC path. In a further embodiment, a line card is described. In an exe...",
  "patent_number": "None",
  "abstract": "A method and apparatus of a network element that includes a line card without retimers between an ASIC and either a network connector or mid-plane connector is described. In an exemplary embodiment, the network element includes a line card coupled to a fabric card. The line card includes a plurality of mid-place connectors, a plurality of network connectors, and a plurality of application-specific integrated circuits (ASICs). In addition, one of plurality the mid-plane connectors couple the line card with the fabric card. Furthermore, the plurality of network connectors to communicate data with devices coupled to the network element and each of the plurality of ASICs process the data. The line card further is configured such that each of the of plurality of ASICs is coupled to each of the plurality of mid-plane connectors by a different mid-plane connector—ASIC path without boosting a signal on that path and each of the plurality of ASICs is further coupled to each of the plurality of ...",
  "publication_number": "US20160357694A1-20161208",
  "_processing_info": {
    "original_size": 43008,
    "optimized_size": 3572,
    "reduction_percent": 91.69
  }
}