{
  "date_produced": "20170719",
  "publication_number": "US20170220950A1-20170803",
  "main_ipcr_label": "G06N9900",
  "decision": "PENDING",
  "application_number": "15010439",
  "inventor_list": [
    {
      "inventor_name_last": "Byron",
      "inventor_name_first": "Donna K.",
      "inventor_city": "Petersham",
      "inventor_state": "MA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Seabolt",
      "inventor_name_first": "Edward E.",
      "inventor_city": "Georgetown",
      "inventor_state": "TX",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Winkler",
      "inventor_name_first": "Timothy P.",
      "inventor_city": "Clinton",
      "inventor_state": "MA",
      "inventor_country": "US"
    }
  ],
  "abstract": "A method, computer program product and computer system are provided. A processor identifies a plurality of numeric expressions in a text corpus associated with a type of item. A processor generates a plurality of feature vectors corresponding to the identified plurality of numeric expressions. A processor identifies one or more common features of the plurality of feature vectors. A processor generates one or more rules for representing numeric quantities of the type of item based, at least in part, on the one or more common features of the plurality of feature vectors.",
  "filing_date": "20160129",
  "patent_number": "None",
  "summary": "<SOH> SUMMARY <EOH>Embodiments of the present invention provide a method, system, and program product to generate rules for representations of numeric values for items. A processor identifies a plurality of numeric expressions in a text corpus associated with a type of item. A processor generates a plurality of feature vectors corresponding to the identified plurality of numeric expressions. A processor identifies one or more common features of the plurality of feature vectors. A processor generates one or more rules for representing numeric quantities of the type of item based, at least in part, on the one or more common features of the plurality of feature vectors.",
  "date_published": "20170803",
  "title": "NUMERICAL EXPRESSION ANALYSIS",
  "ipcr_labels": [
    "G06N9900",
    "G06F1727"
  ],
  "_processing_info": {
    "original_size": 50634,
    "optimized_size": 2082,
    "reduction_percent": 95.89
  }
}