{
  "decision": "ACCEPTED",
  "application_number": "15019042",
  "date_published": "20160811",
  "date_produced": "20160727",
  "title": "ELECTRONIC APPARATUS",
  "filing_date": "20160209",
  "inventor_list": [
    {
      "inventor_name_last": "OGASAWARA",
      "inventor_name_first": "Yoshiyasu",
      "inventor_city": "Kyoto-shi",
      "inventor_state": "",
      "inventor_country": "JP"
    },
    {
      "inventor_name_last": "OSAWA",
      "inventor_name_first": "Kazuyoshi",
      "inventor_city": "Otsu-shi",
      "inventor_state": "",
      "inventor_country": "JP"
    }
  ],
  "ipcr_labels": [
    "G06F300",
    "H04N5232",
    "H04N533",
    "G06F301"
  ],
  "main_ipcr_label": "G06F300",
  "summary": "<SOH> BACKGROUND AND SUMMARY <EOH>Hitherto, there is a portable game apparatus including a display and a camera provided behind the display. In such a conventional game apparatus, a captured image can be obtained by the camera, and an image based on a result of analysis of the obtained image can be displayed on the display. However, in the above conventional apparatus, an image captured in a back surface direction of the display by using the camera is displayed on the display, and thus there is room for improvement in that a captured image from a camera which captures an image in another direction is displayed so as to be easily viewable by a user. Therefore, an object of the exemplary embodiments is to provide an electronic apparatus capable of displaying an image from a camera, which captures an image in a predetermined direction, such that the image is easily viewable by a user. In the exemplary embodiments, in order to attain the object described above, the following configuration examples are exemplified. A system according to an embodiment includes a camera, an acquiring section, a display controller, and a processor. The camera captures an image in a side surface direction of the system. The acquiring section acquires an input image captured by the camera. The display controller displays an image obtained by inclining a subject indicated by the input image acquired by the acquiring section in a predetermined direction, on a display section. The processor performs a predetermined application process on the basis of the input image acquired by the acquiring section. According to the above, when displaying, on the display section, an image of the subject captured by the camera which captures an image in the side surface direction, the image of the subject can be displayed so as to be inclined in the predetermined direction, so that, for example, a display that is easily viewable by a user can be performed. In another configuration, the display controller may dis...",
  "patent_number": "9804667",
  "abstract": "An exemplary portable electronic apparatus includes a display provided at a front surface thereof and an infrared camera provided at a side surface thereof. A contour image indicating a contour of a hand of a user included in an image captured by the infrared camera, and a guide frame image indicating a region smaller than an imaging range of the infrared camera, are displayed on the display in perspective form such that the images are obliquely viewed images. Accordingly, it is made easy for the user to recognize the position of the hand in a side surface direction of the portable electronic apparatus, and thus the user can put their hand within a range suitable for a gesture input.",
  "publication_number": "US20160231807A1-20160811",
  "_processing_info": {
    "original_size": 160330,
    "optimized_size": 3389,
    "reduction_percent": 97.89
  }
}