{
  "date_produced": "20170719",
  "publication_number": "US20170220946A1-20170803",
  "main_ipcr_label": "G06N700",
  "decision": "PENDING",
  "application_number": "15013791",
  "inventor_list": [
    {
      "inventor_name_last": "Thielen",
      "inventor_name_first": "Shane Ray",
      "inventor_city": "Bennington",
      "inventor_state": "NE",
      "inventor_country": "US"
    }
  ],
  "abstract": "A centralized computer system estimates a failure probability to print a 3D model by analyzing the 3D model to identify certain predetermined features and receive an indication of print failure. Based on correlated analyses and indications of success or failure received by a sample of users printing various 3D models having different combinations of features, the centralized computer system produces and maintains a data structure of features and success rates. Subsequently, the centralized computer system may receive a 3D model analysis, compare the 3D model analysis to the data structure to determine an estimated success probability, and report the estimated success probability to the user that submitted the 3D model.",
  "filing_date": "20160202",
  "patent_number": "None",
  "summary": "<SOH> SUMMARY <EOH>In one aspect, embodiments of the inventive concepts disclosed herein are directed to a method for estimating a success probability by analyzing a 3D model to identify certain predetermined features and receive an indication of print success. A centralized computer system receives the analysis and whether or not the 3D model successfully printed. Based on correlated analyses and indications of success or failure received by a sample of users printing various 3D models having different combinations of features, the centralized computer system produces and maintains a data structure of features and success rates. Subsequently, the centralized computer system may receive a 3D model analysis, compare the 3D model analysis to the data structure to determine an estimated success probability, and report the estimated success probability to the user that submitted the 3D model. In a further aspect, the centralized computer system may further track print medium features such as the type of plastic filament, additional additives that alter features of the plastic filament, print temperature, etc., and features of the 3D printer. It is to be understood that both the foregoing general description and the following detailed description are exemplary and explanatory only and should not restrict the scope of the claims. The accompanying drawings, which are incorporated in and constitute a part of the specification, illustrate exemplary embodiments of the inventive concepts disclosed herein and together with the general description, serve to explain the principles.",
  "date_published": "20170803",
  "title": "ADDITIVE PRINT SUCCESS PROBABILITY ESTIMATION",
  "ipcr_labels": [
    "G06N700",
    "B33Y5000",
    "B33Y3000",
    "B29C6700"
  ],
  "_processing_info": {
    "original_size": 33065,
    "optimized_size": 2894,
    "reduction_percent": 91.25
  }
}