{
  "decision": "PENDING",
  "application_number": "15013635",
  "date_published": "20170803",
  "date_produced": "20170719",
  "title": "Volatility Based Cursor Tethering",
  "filing_date": "20160202",
  "inventor_list": [
    {
      "inventor_name_last": "Burns",
      "inventor_name_first": "Aaron",
      "inventor_city": "Newcastle",
      "inventor_state": "WA",
      "inventor_country": "US"
    }
  ],
  "ipcr_labels": [
    "G06F30346",
    "G02B2701"
  ],
  "main_ipcr_label": "G06F30346",
  "summary": "<SOH> SUMMARY <EOH>Certain embodiments described herein relate to volatility based cursor tethering. When one person moves their cursor being displayed in a three-dimensional image, there may be a significant change in the location of the cursor in other displays that show the three-dimensional image from a different viewpoint. Therefore, the others may not be able to easily follow the cursor's movement. An embodiment includes an apparatus comprising a near-eye, see-through display and logic configured in communication with the near-eye, see-through display. The logic is configured to display a three-dimensional image in the near-eye, see-through display such that it appears to be located in a real world environment. The logic is further configured to display a cursor at a position in the three-dimensional image from a viewpoint of a location of the apparatus. The cursor has a depth position in another viewpoint of the three-dimensional image from a different location. The logic is configured change an appearance of a tether linked to the cursor in response to depth position changes of the cursor from the other viewpoint. This Summary is provided to introduce a selection of concepts in a simplified form that are further described below in the Detailed Description. This Summary is not intended to identify key features or essential features of the claimed subject matter, nor is it intended to be used as an aid in determining the scope of the claimed subject matter.",
  "patent_number": "None",
  "abstract": "Modifying a tether linked to a cursor based on depth volatility of the cursor is disclosed. Multiple displays show a three-dimensional image that seems to be at the same real world location regardless of the location of the display. One person operates a cursor in the three-dimensional image. Volatility of depth of the cursor from the viewpoint of the cursor operator is tracked. The appearance of the tether is changed in other displays in response to the depth volatility. The tether may include a line from the cursor towards the cursor operator. The tether is not necessarily displayed all of the time so as to not obscure the view of the three-dimensional image. When there is not any depth volatility for some time, the tether is not displayed. In response to high depth volatility, the tether may be displayed as a long line from the cursor.",
  "publication_number": "US20170220134A1-20170803",
  "_processing_info": {
    "original_size": 78768,
    "optimized_size": 2870,
    "reduction_percent": 96.36
  }
}