{
  "decision": "PENDING",
  "application_number": "15016026",
  "date_published": "20170810",
  "date_produced": "20170726",
  "title": "STEREO RANGE WITH LIDAR CORRECTION",
  "filing_date": "20160204",
  "inventor_list": [
    {
      "inventor_name_last": "Lane",
      "inventor_name_first": "Richard N.",
      "inventor_city": "Westford",
      "inventor_state": "MA",
      "inventor_country": "US"
    }
  ],
  "ipcr_labels": [
    "G01S1702",
    "G06T700",
    "H04N1302",
    "G01S1708",
    "G01S7481"
  ],
  "main_ipcr_label": "G01S1702",
  "summary": "<SOH> SUMMARY OF THE INVENTION <EOH>An apparatus for determining a distance to a target area includes an imaging system configured to provide at least two images of a target area. The images are associated with different imaging axes. A Lidar system includes at least one laser configured to direct an optical beam to the target area and an optical detection system is configured to receive a portion of the optical beam from the target area and establish a distance to the target area based on the received portion. The laser system can be configured to scan a portion of the target area based on the at least two images from the imaging system. The imaging system can include a camera configured to produce a first image associated with a first axis at a first time and a second image associated with a second axis at a second time. The apparatus can further include a processor coupled to the imaging system and laser system connected to a memory, wherein the memory includes instructions recorded thereon that, when read by the processor, cause the processor to receive the at least two images of the target area, receive the portion of the laser beam from the target area and provide the distance to the target area. The memory can include instructions recorded thereon that, when read by the image processor, cause the processor to provide a depth map of at least a portion of the target area based on the at least two images and the portion of the laser beam received. The laser can be configured to direct a focused optical beam to the target area. The laser system can be configured to scan the laser beam over the target area and establish distance estimates associated with a plurality of locations in the target area. A method for determining a distance to a target area includes receiving two images of a target area wherein the two images are taken at different imaging axes for stereo imaging. The method also includes co-aligning an optical beam from a Lidar system to the target area...",
  "patent_number": "None",
  "abstract": "An apparatus for determining a distance to a target area includes an imaging system configured to provide at least two images of a target area. The images are associated with different imaging axes. A Lidar system including at least one laser is configured to direct an optical beam to the target and an optical detection system configured to receive a portion of the optical beam from the target area and establish a distance to the target area based on the received portion.",
  "publication_number": "US20170227642A1-20170810",
  "_processing_info": {
    "original_size": 26908,
    "optimized_size": 3049,
    "reduction_percent": 88.67
  }
}