{
  "date_produced": "20160511",
  "publication_number": "US20160148107A1-20160526",
  "main_ipcr_label": "G06N504",
  "decision": "PENDING",
  "application_number": "15012109",
  "inventor_list": [
    {
      "inventor_name_last": "Pariyani",
      "inventor_name_first": "Ankur",
      "inventor_city": "Philadelphia",
      "inventor_state": "PA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Bespalov",
      "inventor_name_first": "Dmitriy",
      "inventor_city": "Philadelphia",
      "inventor_state": "PA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Oktem",
      "inventor_name_first": "Ulku G.",
      "inventor_city": "Philadelphia",
      "inventor_state": "PA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Cielak",
      "inventor_name_first": "Luis",
      "inventor_city": "Philadelphia",
      "inventor_state": "PA",
      "inventor_country": "US"
    }
  ],
  "abstract": "The dynamic risk analyzer (DRA) provided by the present invention periodically assesses real-time or historic process data, or both, associated with an operations site, such as a manufacturing, production, or processing facility, including a plant's operations, and identifies hidden near-misses of such operation, when in real time the process data appears otherwise normal. DRA assesses the process data in a manner that enables operating personnel including management at a facility to have a comprehensive understanding of the risk status and changes in both alarm and non-alarm based process variables. The hidden process near-miss data may be analyzed alone or in combination with other process data and/or data resulting from prior near-miss situations to permit strategic action to be taken to reduce or avert the occurrence of adverse incidents or catastrophic failure of a facility operation.",
  "filing_date": "20160201",
  "patent_number": "None",
  "summary": "<SOH> BRIEF DESCRIPTION OF THE FIGURES <EOH>The description discloses the invention that is illustrated with reference to the accompanying figures to advise one of ordinary skill in the art of the characteristics and benefits of the invention. In the various views of the figures, like reference characters designate like or similar parts, whereby: FIG. 1 shows a DRA system of the present invention. FIG. 2 shows a DRA system within a secured network with no remote access where connectivity with the OPC server allows the DRA system to obtain continuous process data, as it gets measured and channeled out, without requiring any direct communication with the industrial controls system (such as DCS, SCADA, or PLC devices). FIG. 3 shows a petal chart for parameter P indicating its 7 values over 7 time periods (days) where the value of P for March-5 is equal to r, which is indicated by the petal with length r. FIGS. 4A, 4B, 4C show a presentation of a variation of parameter P over 7 consecutive time intervals on the petal chart ( FIG. 4A ) having a comparative distinct visual advantage over a bar chart ( FIG. 4B ), and line chart ( FIG. 4C ) showing. detailed-description description=\"Detailed Description\" end=\"lead\"?",
  "date_published": "20160526",
  "title": "Dynamic Prediction of Risk Levels for Manufacturing Operations through Leading Risk Indicators: Dynamic Risk Analyzer Engine",
  "ipcr_labels": [
    "G06N504"
  ],
  "_processing_info": {
    "original_size": 36150,
    "optimized_size": 3198,
    "reduction_percent": 91.15
  }
}