{
  "decision": "ACCEPTED",
  "application_number": "15016564",
  "date_published": "20160811",
  "date_produced": "20160727",
  "title": "METHODS AND SYSTEMS FOR DETERMINING OPTICAL REGIONS OF INTEREST",
  "filing_date": "20160205",
  "inventor_list": [
    {
      "inventor_name_last": "Chu",
      "inventor_name_first": "Yong",
      "inventor_city": "Castro Valley",
      "inventor_state": "CA",
      "inventor_country": "US"
    }
  ],
  "ipcr_labels": [
    "G01N2176",
    "G06K900",
    "G01N2177",
    "G06K932"
  ],
  "main_ipcr_label": "G01N2176",
  "summary": "<SOH> SUMMARY OF THE INVENTION <EOH>The present teachings relate to a method and system for determining a Region of Interest (ROI) for one or more biological samples in a laboratory instrument. In an embodiment of the present invention, the method comprises an optical system capable of imaging florescence emission from a plurality of sample wells. An initial ROI, its center location and size can be estimated from the fluorescence detected from each well. From this information the average size of the ROIs can be determined and global gridding models can be derived to better locate each of the ROIs. The global gridding models can then be applied to the ROIs to improve the precision of the ROI center locations. Sample wells not originally providing fluorescence ROIs can be recovered through the use of mapping functions. The radius of each ROI can then be adjusted to improve the signal-to-noise ratio of the optical system. In another embodiment, each sample well contains a biological sample. In another embodiment, each biological sample is excited by a light source. In another embodiment, the biological sample fluoresces at a predetermined wavelength in response to the excitation. In another embodiment, the fluorescence is detected by the optical system. In another embodiment, the biological samples comprise spectrally distinguishable dyes. In another embodiment, the global gridding models comprise comparing the center-to-center distance between ROIs to grid co-ordinates of a well plate layout to determine an X and Y grid co-ordinate for each ROI. In another embodiment, mapping functions are determined and applied to the X and Y co-ordinates for each ROI to map each co-ordinate to the center of each ROI. According to various embodiments a system for calibrating region of interest (ROI) locations is presented. The system can comprise a computer system comprising at least one processor and at least one computer-readable medium. The system can further comprise at least one...",
  "patent_number": "9945788",
  "abstract": "The present teachings relate to a method and system for determining Regions of Interest (ROI) for one or more biological samples in a laboratory instrument. The method can include an optical system capable of imaging florescence emission from a plurality of sample wells. An initial ROI, its center location and size can be estimated from the fluorescence detected from each well. From this information the average size of the ROIs can be determined and global gridding models can be derived to better locate each of the ROIs. The global gridding models can then be applied to the ROIs to improve the precision of the ROI center locations. Sample wells not originally providing fluorescence ROIs can be recovered through the use of mapping functions. The radius of each ROI can then be adjusted to improve the signal-to-noise ratio of the optical system.",
  "publication_number": "US20160231250A1-20160811",
  "_processing_info": {
    "original_size": 44365,
    "optimized_size": 3445,
    "reduction_percent": 92.23
  }
}