{
  "decision": "ACCEPTED",
  "application_number": "15012527",
  "date_published": "20160526",
  "date_produced": "20160511",
  "title": "SYSTEM AND METHOD FOR VIRTUAL DISPLAYS",
  "filing_date": "20160201",
  "inventor_list": [
    {
      "inventor_name_last": "Wright",
      "inventor_name_first": "Christopher P.",
      "inventor_city": "Cupertino",
      "inventor_state": "CA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Dyke",
      "inventor_name_first": "Kenneth C.",
      "inventor_city": "Los Altos",
      "inventor_state": "CA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Fard",
      "inventor_name_first": "Assana M.",
      "inventor_city": "Sunnyvale",
      "inventor_state": "CA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Costa",
      "inventor_name_first": "Thomas W.",
      "inventor_city": "Nevada City",
      "inventor_state": "CA",
      "inventor_country": "US"
    }
  ],
  "ipcr_labels": [
    "G06F314",
    "H04L2908",
    "G06F30484"
  ],
  "main_ipcr_label": "G06F314",
  "summary": "<SOH> SUMMARY <EOH>An operating system creates one or more virtual display interfaces for communication of display data and user input events between the application layer and one or more virtual display devices. The one or more virtual display devices are display devices (which may be physical display devices or display devices merely simulated in software) not physically connected to the computing system managed by the operating system. One or more applications are executed in an application layer. At least one of the one or more applications communicates display data to and receives user input events from at least one of the one or more display devices using at least one of the display interfaces. At least one other of the one or more applications communicates display data to and receives user input events from at least one of the one or more virtual display devices using at least one of the one or more virtual display interfaces.",
  "patent_number": "9489165",
  "abstract": "An operating system creates one or more virtual display interfaces for communication of display data and user input events between the application layer and one or more virtual display devices. The one or more virtual display devices are not physically connected to the computing system managed by the operating system. One or more applications are executed in an application layer. At least one of the one or more applications communicates display data to and receives user input events from at least one of the one or more display devices using at least one of the display interfaces. At least one other of the one or more applications communicates display data to and receives user input events from at least one of the one or more virtual display devices using at least one of the one or more virtual display interfaces.",
  "publication_number": "US20160147494A1-20160526",
  "_processing_info": {
    "original_size": 88419,
    "optimized_size": 2780,
    "reduction_percent": 96.86
  }
}