{
  "decision": "ACCEPTED",
  "application_number": "15014277",
  "date_published": "20161006",
  "date_produced": "20160921",
  "title": "TRACE PATTERN FOR TOUCH-SENSING APPLICATION",
  "filing_date": "20160203",
  "inventor_list": [
    {
      "inventor_name_last": "Peng",
      "inventor_name_first": "Tao",
      "inventor_city": "Starkville",
      "inventor_state": "MS",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Weng",
      "inventor_name_first": "Xiaoping",
      "inventor_city": "Shanghai",
      "inventor_state": "",
      "inventor_country": "CN"
    },
    {
      "inventor_name_last": "Shao",
      "inventor_name_first": "Dangdang",
      "inventor_city": "San Jose",
      "inventor_state": "CA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Deng",
      "inventor_name_first": "Yingzhu(Eileen)",
      "inventor_city": "San Jose",
      "inventor_state": "",
      "inventor_country": "US"
    }
  ],
  "ipcr_labels": [
    "G06F3044"
  ],
  "main_ipcr_label": "G06F3044",
  "summary": "<SOH> BRIEF DESCRIPTION OF THE DRAWINGS <EOH>The present disclosure is illustrated by way of example, and not by way of limitation, in the figures of the accompanying drawings. FIG. 1 is a block diagram illustrating an embodiment of an electronic system that processes touch sensor data. FIG. 2 is a block diagram illustrating an embodiment of an electronic system that processes touch sensor data. FIG. 3A illustrates an embodiment of a capacitive sensor array having a hollow diamond pattern. FIG. 3B illustrates an embodiment of a capacitive sensor array having a hollow diamond pattern. FIG. 3C illustrates an embodiment of a capacitive sensor array having a hollow diamond pattern. FIG. 4A illustrates an embodiment of a capacitive sensor array having a dual hollow Manhattan (DHM) pattern. FIG. 4B illustrates an embodiment of a capacitive sensor array having a dual hollow Manhattan (DHM) pattern. FIG. 4C illustrates a cross-section view of an embodiment of a capacitive sensor array having a dual hollow Manhattan (DHM) pattern. FIG. 4D illustrates a cross-section view of an embodiment of a capacitive sensor array having a dual hollow Manhattan (DHM) pattern. FIG. 4E illustrates an embodiment of a capacitive sensor array having a dual hollow Manhattan (DHM) pattern and ground planes. FIG. 4F illustrates an embodiment of a capacitive sensor array having a dual hollow Manhattan (DHM) pattern and additional traces. FIG. 5 illustrates an embodiment of a capacitive sensor array having a quad nested spiral pattern. FIG. 6 illustrates an embodiment of a capacitive sensor array having a interleaved trace pattern. detailed-description description=\"Detailed Description\" end=\"lead\"?",
  "patent_number": "9529485",
  "abstract": "One embodiment of a capacitive sensor array comprises a plurality of row sensor elements including a first row sensor element, a plurality of column sensor elements including a first column sensor element, and a plurality of unit cells, wherein a first unit cell contains an intersection between the first row sensor element and the first column sensor element, and wherein a ratio between 1) a boundary length between the first row sensor element and the first column sensor element within the first unit cell and 2) a perimeter of the first unit cell is greater than √{square root over (2)}/2.",
  "publication_number": "US20160291728A1-20161006",
  "_processing_info": {
    "original_size": 51554,
    "optimized_size": 3269,
    "reduction_percent": 93.66
  }
}