{
  "decision": "ACCEPTED",
  "application_number": "15011921",
  "date_published": "20160526",
  "date_produced": "20160511",
  "title": "GESTURE BASED INPUT SYSTEM IN A VEHICLE WITH HAPTIC FEEDBACK",
  "filing_date": "20160201",
  "inventor_list": [
    {
      "inventor_name_last": "Truong",
      "inventor_name_first": "Dat",
      "inventor_city": "San Jose",
      "inventor_state": "CA",
      "inventor_country": "US"
    }
  ],
  "ipcr_labels": [
    "B60W5016",
    "G06F116",
    "G06F300",
    "G06F316",
    "G06F301",
    "G06F30481"
  ],
  "main_ipcr_label": "B60W5016",
  "summary": "<SOH> SUMMARY OF THE INVENTION <EOH>Embodiments hereof are directed to vehicle haptic feedback systems. In some embodiments, the haptic feedback system includes a haptic actuator, a detection device, and a controller. In some embodiments, the haptic actuator is configured to provide haptic feedback to a vehicle driver. In some embodiments, the detection device is disposed in an interior of the vehicle and is configured to capture movements of the vehicle driver and output data representing the movements made by the vehicle driver. In some embodiments, the controller is coupled to the detection device and is configured to receive a signal from the detection device indicative of the movements. The controller is also coupled to a haptic effect feedback system. In some embodiments, based on the signal indicative of the movements, the controller is configured to send a signal to select a haptic effect from an effect table and is configured to send a signal to the haptic actuator to provide the selected haptic effect. In some embodiments, the haptic actuator is coupled to at least one of a driver's seat, a steering wheel, a driver's seat belt, and/or an object that is wearable by the vehicle driver. Embodiments hereof are also directed to a method for providing haptic feedback to a driver of a vehicle. In some embodiments, the method includes tracking movements of a driver of the vehicle to detect a particular movement by the driver from a table of movements, selecting a haptic effect from a table of effects based on the detected movement, and providing the haptic effect to the driver through a haptic actuator. In some embodiments, the haptic actuator is coupled to at least one of a driver's seat, a steering wheel, a driver's seat belt, and/or an object that is wearable by the vehicle driver.",
  "patent_number": "9718477",
  "abstract": "A vehicle haptic feedback system includes a haptic actuator, a detection device, and a controller. The haptic actuator is configured to provide haptic feedback to a vehicle driver. The detection device is disposed in an interior of the vehicle and is configured to capture movements of the vehicle driver and output data representing the movements. The controller is coupled to the detection device and is configured to receive a signal from the detection device indicative of the movements. The controller is also coupled to a haptic effect feedback system. Based on the signal, the controller is configured to send a signal to select a haptic effect from an effect table and is configured to send a signal to the haptic actuator to provide the selected haptic effect. The haptic actuator is coupled to a driver's seat, a steering wheel, a driver's seat belt, and/or an object wearable by the driver.",
  "publication_number": "US20160144868A1-20160526",
  "_processing_info": {
    "original_size": 54288,
    "optimized_size": 3323,
    "reduction_percent": 93.88
  }
}