{
  "date_produced": "20170214",
  "publication_number": "US20170061278A1-20170302",
  "main_ipcr_label": "G06N3063",
  "decision": "PENDING",
  "application_number": "15012523",
  "inventor_list": [
    {
      "inventor_name_last": "LEE",
      "inventor_name_first": "Hyung-Dong",
      "inventor_city": "Icheon",
      "inventor_state": "",
      "inventor_country": "KR"
    }
  ],
  "abstract": "A neuromorphic device may include: first to N-th row lines; first to M-th column lines; first to N-th first neuron circuits coupled to the first to N-th row lines, respectively; first to M-th second neuron circuits coupled to the first to M-th column lines, respectively; a plurality of synapses positioned at intersections of the first to N-th row lines and the first to M-th column lines, respectively, each of the plurality of synapses comprising a variable resistance element and a first transistor which are coupled in series, wherein N and M are natural numbers equal to or larger than two; and a t-th gate line to which gates of first transistors coupled to a t-th column line among the first to M-th column lines are coupled, wherein t is a natural number ranging from 1 to M.",
  "filing_date": "20160201",
  "patent_number": "None",
  "summary": "<SOH> SUMMARY <EOH>Various embodiments are directed to a synapse and a neuromorphic device including the same, which are capable of improving a learning operation and pattern recognition. In an embodiment, a neuromorphic device may include: first to N-th row lines; first to M-th column lines; first to N-th first neuron circuits coupled to the first to N-th row lines, respectively; first to M-th second neuron circuits coupled to the first to M-th column lines, respectively; a plurality of synapses positioned at intersections of the first to N-th row lines and the first to M-th column lines, respectively, each of the plurality of synapses comprising a variable resistance element and a first transistor which are coupled in series, wherein N and M are natural numbers equal to or larger than two; and a t-th gate line to which gates of first transistors coupled to a t-th column line among the first to M-th column lines are coupled, wherein t is a natural number ranging from 1 to M. Implementations of the above neuromorphic device may include one or more the following. When the t-th column line is a column line having learned specific data, the t-th gate line is driven to turn off the first transistors coupled to the t-th column line during a learning operation of a u-th column line, wherein u is a natural number ranging from 1 to M and is not equal to t. During the learning process of the u-th column line, the t-th column line is in a floating state. During the learning process of the u-th column line, a u-th gate line is driven to turn on first transistors coupled to the u-th column line. The t-th gate line has the same extension direction as the t-th column line. The neuromorphic device further comprising a gate control circuit coupled to the t-th gate line, wherein a t-th second neuron circuit coupled to the t-th column line and the gate control circuit coupled to the t-th gate line are positioned in opposite sides with respect to the plurality of synapses in the exten...",
  "date_published": "20170302",
  "title": "SYNAPSE AND NEUROMORPHIC DEVICE INCLUDING THE SAME",
  "ipcr_labels": [
    "G06N3063",
    "G06N308"
  ],
  "_processing_info": {
    "original_size": 52860,
    "optimized_size": 3332,
    "reduction_percent": 93.7
  }
}