{
  "decision": "ACCEPTED",
  "application_number": "15016163",
  "date_published": "20160602",
  "date_produced": "20160518",
  "title": "WEARABLE DEVICE AS A PAYMENT VEHICLE",
  "filing_date": "20160204",
  "inventor_list": [
    {
      "inventor_name_last": "Hanson",
      "inventor_name_first": "Carrie Anne",
      "inventor_city": "Charlotte",
      "inventor_state": "NC",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Grigg",
      "inventor_name_first": "David M.",
      "inventor_city": "Rock Hill",
      "inventor_state": "SC",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Starbuck",
      "inventor_name_first": "Richard Andrew",
      "inventor_city": "Walnut Creek",
      "inventor_state": "CA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Jones",
      "inventor_name_first": "Alicia C.",
      "inventor_city": "Fort Mill",
      "inventor_state": "SC",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Longfellow",
      "inventor_name_first": "Audrey L.",
      "inventor_city": "Oak Hill",
      "inventor_state": "VA",
      "inventor_country": "US"
    }
  ],
  "ipcr_labels": [
    "G06Q2032",
    "G06Q2010",
    "G06K1907",
    "G06Q2040"
  ],
  "main_ipcr_label": "G06Q2032",
  "summary": "<SOH> BRIEF SUMMARY <EOH>The present invention is directed to a system for facilitating a financial transaction utilizing a wearable device as a payment vehicle. The wearable device (e.g., a bracelet, a ring, a watch, glasses, or the like) includes readable indicia (e.g., a quick response (QR) code, a scannable bar code, or the like) that are configured to be read by a mobile communication device (e.g., a smart phone, a computing device, a point of sale (POS) terminal, or the like). A user is enabled, via an application associated with the mobile communication device, to assign one or more financial payment accounts to the readable indicia so that the user may use the wearable device as payment in lieu of a credit card, debit card, or the like. The user may further configure limits (e.g., spending limits, purchase amount limits, limits on purchase type or category, or the like) of various types for each account, wearable device, and readable indicia. The system also tracks spending behavior for user review and analysis. In some embodiments, a system is configured to facilitate a financial transaction using a wearable device as a payment vehicle. The system comprises the wearable device, which comprises a wearable article, wherein the wearable article comprises one or more features securing the wearable article to a person or an item associated with the person, and a portion comprising at least one machine-readable indicia, wherein the at least one machine-readable indicia, when successfully read, provides payment information for facilitating the financial transaction. The system also comprises a mobile communication device that comprises a memory, a processor, and a module stored in memory, executable by the processor. The mobile communication device is configured to read the at least one readable indicia associated with the wearable device, receive a first user input that assigns the at least one readable indicia to a financial payment account, and receive a second...",
  "patent_number": "9390415",
  "abstract": "The present invention is directed to apparatuses, methods, and computer-program products for a multipurpose wearable device that is associated with one or more financial accounts wherein, in use, the wearable device is configured to facilitate a financial transaction using at least one of the one or more financial accounts. The wearable device comprises: a wearable article, wherein the wearable article comprises one or more features securing the wearable article to a person or an item associated with the person; and a portion comprising a machine-readable indicia, wherein the machine-readable indicia, when successfully read, provides payment information for conducting a financial transaction.",
  "publication_number": "US20160155116A1-20160602",
  "_processing_info": {
    "original_size": 156775,
    "optimized_size": 3883,
    "reduction_percent": 97.52
  }
}