{
  "decision": "PENDING",
  "application_number": "15013766",
  "date_published": "20160804",
  "date_produced": "20160720",
  "title": "ADAPTIVE INTELLIGENT SYSTEMS AND/OR METHODS FOR DEVELOPING AND MATCHING PROFILES TO FURTHER IDENTIFY AND/OR QUALIFY PATTERNS ASSOCIATED WITH INDEPENDENTLY-VERIFIED INDIVIDUALS",
  "filing_date": "20160202",
  "inventor_list": [
    {
      "inventor_name_last": "TISO",
      "inventor_name_first": "Christopher M.",
      "inventor_city": "New York",
      "inventor_state": "NY",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "KAREN",
      "inventor_name_first": "Ari",
      "inventor_city": "Potomac",
      "inventor_state": "MD",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "PORT",
      "inventor_name_first": "Darren",
      "inventor_city": "Short Hills",
      "inventor_state": "NJ",
      "inventor_country": "US"
    }
  ],
  "ipcr_labels": [
    "G06Q4002"
  ],
  "main_ipcr_label": "G06Q4002",
  "summary": "<SOH> BACKGROUND AND SUMMARY <EOH>New rules crafted by the Consumer Financial Protection Bureau in January 2014, imposed new and unpredictable risks for lenders of money and made it substantially more difficult for even financially-sound consumers to obtain the financing essential to purchase or refinance a home. Mortgage loans are divided into two types: Qualified and Non-Qualified Mortgages. Qualified mortgage loans, or QM loans as they are often called, are granted a safe harbor from liability under the “Ability to Repay” (“ATR”) laws, whereas Non-QM (NonQM) loans are subject to new and unpredictable liabilities that can impact lenders for as long as 29 years after the loan is closed. Thus, although the NonQM market is expected to reach US $600 billion by the end of 2017, because of the increased risk exposure associated with this type of loan, many financial institutions, including banks, refrain from making these loans, even when the borrower is adequately qualified. The end result is that very few lenders are willing to make NonQM loans, which represent approximately 15% of the mortgages made today. Although one would think NonQM loans must, by their very nature, have substantially more risk to warrant their disfavored status, many (if not most) NonQM loans involve well-qualified and established buyers whose circumstances fall outside the predetermined government qualifications. As such, those who are self-employed, those relying upon savings/inheritance, those who have sufficient income but require lower down-payments, those with large amounts of discretionary income but higher debt to income ratios, among others, may often find themselves unable to borrow money for a home purchase—even though their risk of defaulting is as low as, or even lower than, those meeting the criteria for a qualified mortgage. Lenders are often hesitant to capitalize on the opportunities that come with providing NonQM loans because, in their view, the risk of litigation outweighs th...",
  "patent_number": "None",
  "abstract": "Certain example embodiments relate to techniques for adaptively and intelligently identifying and/or qualifying patterns associated with individuals who are independently certified in accordance with independent verification rules (e.g., for repaying a loan). Based on received first information related to the borrower, educational modules and verification questions are determined. Second information related to the borrower is received, based upon responses provided by the borrower in real-time, to questions presented. Questions are determined dynamically, based upon the first information and responses collected thus far. During collection, the borrower is provided access to educational modules, selectively, based upon the first information and responses thus far collected. Based upon the first and second information, a ratio of residual income to average gross income for the borrower is determined and evaluated based upon rules associating the two. Based upon the evaluating, a risk sta...",
  "publication_number": "US20160225079A1-20160804",
  "_processing_info": {
    "original_size": 93435,
    "optimized_size": 3987,
    "reduction_percent": 95.73
  }
}