{
  "decision": "ACCEPTED",
  "application_number": "15010633",
  "date_published": "20160526",
  "date_produced": "20160511",
  "title": "SYSTEM AND METHOD FOR ENHANCING USER ACCESSIBILITY IN A VIRTUAL UNIVERSE",
  "filing_date": "20160129",
  "inventor_list": [
    {
      "inventor_name_last": "HAMILTON, II",
      "inventor_name_first": "Rick A.",
      "inventor_city": "Charlottesville",
      "inventor_state": "VA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "KANEVSKY",
      "inventor_name_first": "Dimitri",
      "inventor_city": "Ossining",
      "inventor_state": "NY",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "KENDZIERSKI",
      "inventor_name_first": "Michael D.",
      "inventor_city": "New York",
      "inventor_state": "NY",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "PICKOVER",
      "inventor_name_first": "Clifford A.",
      "inventor_city": "Yorktown Heights",
      "inventor_state": "NY",
      "inventor_country": "US"
    }
  ],
  "ipcr_labels": [
    "G06F30484"
  ],
  "main_ipcr_label": "G06F30484",
  "summary": "<SOH> SUMMARY OF THE INVENTION <EOH>In a first aspect of the invention, a system comprises an assignment engine configured to assign an accessibility unit to an item within a virtual universe and a detection engine configured to detect a triggering event, which triggers the accessibility unit. The system also comprises an accessibility action engine configured to provide at least one of information and an action to a user when the accessibility unit is triggered. In another aspect of the invention, a computer implemented method for enhancing accessibility in a virtual universe comprises adding an accessibility tag to a user's avatar and assigning an accessibility unit to an item. The computer implemented method also comprises determining whether the accessibility unit is triggered and providing one or more of an action and information if the accessibility unit is triggered. In another aspect of the invention, a computer program product comprising a computer usable medium having readable program code embodied in the medium is provided. The computer program product includes at least one component operable to: associate an accessibility tag with a disabled user's avatar; assign an accessibility unit to an item in a virtual universe; determine whether the accessibility unit is triggered; and provide an action or information to the disabled user if the accessibility unit is triggered. In yet another aspect of the invention, a method for enhancing accessibility in a virtual universe, comprises providing a computer infrastructure being operable to: assign an accessibility tag to an avatar profile; assign one or more accessibility units to an item; ascertain whether at least one of the one or more accessibility units is triggered; and provide an action or information if the accessibility unit is triggered.",
  "patent_number": "9785884",
  "abstract": "A system and method to enhance user accessibility in a virtual universe and, in particular, to enhance user accessibility by providing information and/or actions to users participating in the virtual universe. The system comprises an assignment engine configured to assign an accessibility unit to an item within a virtual universe and a detection engine configured to detect a triggering event, which triggers the accessibility unit. The system also comprises an accessibility action engine configured to provide at least one of information and an action to a user when the accessibility unit is triggered.",
  "publication_number": "US20160147431A1-20160526",
  "_processing_info": {
    "original_size": 44164,
    "optimized_size": 3480,
    "reduction_percent": 92.12
  }
}