{
  "date_produced": "20160720",
  "publication_number": "US20160224893A1-20160804",
  "main_ipcr_label": "G06N502",
  "decision": "PENDING",
  "application_number": "15022870",
  "inventor_list": [
    {
      "inventor_name_last": "Parker, Jr.",
      "inventor_name_first": "Charles T.",
      "inventor_city": "East Lansing",
      "inventor_state": "MI",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Garrity",
      "inventor_name_first": "George M.",
      "inventor_city": "Okemos",
      "inventor_state": "MI",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Krdzavac",
      "inventor_name_first": "Nenad",
      "inventor_city": "East Landsing",
      "inventor_state": "MI",
      "inventor_country": "US"
    }
  ],
  "abstract": "A method for establishing semantic equivalence between a plurality of concepts including: providing an Orthogonal Semantic Equivalence Map in which first, second, and third extensional concept models are related; selecting or de-selecting a concept in the first concept model; selecting or deselecting a (relation, concept) pair representing an intensional relation from a concept in the first concept model to a concept in the second concept model over a concept in the third concept model; determining a subset of intensional relations from the selected concepts in the first concept model to concepts in the second concept model; determining a set of concepts from the first concept model that are related to concepts in the second concept model over the selected (relation, concept) pairs; and determining the narrowest common extension of the set of concepts from the first, second, or third concept models that are related over the selected intensional relations.",
  "filing_date": "20160317",
  "patent_number": "None",
  "summary": "<SOH> SUMMARY <EOH>Disclosed are systems and methods for processing information encoded in both intensional and extensional knowledge organization systems using Orthogonal Semantic Equivalence Maps, data structures capable of transforming qualitative and quantitative data over orthogonal relations between three or more concept models. Concept adapters and concept filters based on Orthogonal Semantic Equivalence Maps extend the applications to data translation and concept indexing. The method, computer-based system and applications of Orthogonal Semantic Equivalence Maps are herein described and claimed. Orthogonal Semantic Equivalence Mapping (OSEM) is a method for deriving precise meanings of terms and producing precise concept relations over multiple technical vocabularies and imputed concepts. Semantic Equivalence is established via construction of imputed concepts, which circumscribe other concepts in whole (via concept aggregation) or in part (via concept division). Imputed concepts do not necessarily map to any previously described, labeled, or named concepts. Optionally, terms and numeric data may be functionally mapped into concepts represented in an Orthogonal Semantic Equivalence Map. OSEM is generally applicable, at any level of abstraction, for assigning definitions to concepts, for providing hooks for queries, axioms, rules, functions, templates, constraints, and for bridging the fields of text-mining, data-mining, and ontologies. In one embodiment, a method for establishing semantic equivalence between a plurality of concepts. The method includes the steps of: providing an Orthogonal Semantic Equivalence Map in which first, second, and third extensional concept models are related to one another such that the second concept model is orthogonal to the first concept model and the third extensional concept model is distinct from the first and second concept models, wherein each concept from the first concept model has an intensional relation to one concept...",
  "date_published": "20160804",
  "title": "SYSTEMS AND METHODS FOR ESTABLISHING SEMANTIC EQUIVALENCE BETWEEN CONCEPTS",
  "ipcr_labels": [
    "G06N502",
    "G06F1730"
  ],
  "_processing_info": {
    "original_size": 103583,
    "optimized_size": 3856,
    "reduction_percent": 96.28
  }
}