{
  "date_produced": "20160810",
  "publication_number": "US20160247082A1-20160825",
  "main_ipcr_label": "G06N700",
  "decision": "PENDING",
  "application_number": "15027135",
  "inventor_list": [
    {
      "inventor_name_last": "Stehling",
      "inventor_name_first": "Sammy J.",
      "inventor_city": "Monmouth",
      "inventor_state": "IL",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Fasano",
      "inventor_name_first": "Christopher G.",
      "inventor_city": "Monmouth",
      "inventor_state": "IL",
      "inventor_country": "US"
    }
  ],
  "abstract": "Various agronomic technologies are described, including a computer-implemented method for forecasting crop yield and an agronomic web portal including determining an expected yield at a first time, determining a growth function representing how the expected crop yield changes over time and based at least in part on an intrinsic yield function and the growth function, determining an expected yield at a second time, wherein the second time is later than the first time.",
  "filing_date": "20160404",
  "patent_number": "None",
  "summary": "<SOH> SUMMARY <EOH>The Summary is provided to introduce a selection of concepts in a simplified form that are further described below in the Detailed Description. The Summary is not intended to identify key features or essential features of the claimed subject matter, nor is it intended to be used to limit the scope of the claimed subject matter. An embodiment can be a method for forecasting crop yield, the method comprising: determining an expected yield at a first time; determining a growth function representing how the expected crop yield changes over time; and based at least in part on an intrinsic yield function and the growth function, determining an expected yield at a second time, wherein the second time is later than the first time. An embodiment can be one or more computer-readable storage media storing computer-executable instructions that, when executed, perform a method for forecasting crop yield, the method comprising: receiving at least one of environmental data or cultural farming practice data for one or more fields growing a crop of a crop type; and constructing a location-specific growth function that estimates a change in an expected crop yield over time for the one or more fields growing the crop of the crop type, the growth function based on the at least one of environmental data or cultural farming practice data. An embodiment can be one or more computer-readable storage media storing computer-executable instructions that, when executed, perform a method for forecasting crop yield, the method comprising: generating a yield trajectory for each of a plurality of locations in a field or group of fields, the respective yield trajectories representing an expected yield as a function of time for a set of environmental factors and cultural farming practices, the respective yield trajectories generated by: determining an intrinsic yield function for the location, the intrinsic yield function representing a yield determined from a set of empirical obse...",
  "date_published": "20160825",
  "title": "Crop Model and Prediction Analytics System",
  "ipcr_labels": [
    "G06N700",
    "A01G100"
  ],
  "_processing_info": {
    "original_size": 153587,
    "optimized_size": 3170,
    "reduction_percent": 97.94
  }
}