{
  "decision": "PENDING",
  "application_number": "15028898",
  "date_published": "20160908",
  "date_produced": "20160824",
  "title": "A Wearable sports timing tag assembly",
  "filing_date": "20160412",
  "inventor_list": [
    {
      "inventor_name_last": "Van Rens",
      "inventor_name_first": "Bas Jan Emile",
      "inventor_city": "Haarlem",
      "inventor_state": "",
      "inventor_country": "NL"
    },
    {
      "inventor_name_last": "Willemse",
      "inventor_name_first": "Jeroen Johan",
      "inventor_city": "Haarlem",
      "inventor_state": "",
      "inventor_country": "NL"
    },
    {
      "inventor_name_last": "Verwoerd",
      "inventor_name_first": "Adriaan Klaas",
      "inventor_city": "Haarlen",
      "inventor_state": "",
      "inventor_country": "NL"
    }
  ],
  "ipcr_labels": [
    "G06K710",
    "G07C124"
  ],
  "main_ipcr_label": "G06K710",
  "summary": "<SOH> SUMMARY OF THE INVENTION <EOH>This Summary and the Abstract herein are provided to introduce a selection of concepts in a simplified form that are further described below in the Detailed Description. This Summary and the Abstract are not intended to identify key features or essential features of the claimed subject matter, nor are they intended to be used as an aid in determining the scope of the claimed subject matter. The claimed subject matter is not limited to implementations that solve any or all disadvantages noted in the background. In a first aspect the invention may relate to a wearable sport timing tag assembly comprising at least a first and second tag, preferably UHF tags, more preferably UHF tags comprising a monopole, dipole or quadrupole antenna, for transmitting data associated with the wearer of the tag assembly to at least one detection antenna, wherein the tag assembly comprises means for attaching the tag assembly to at least a body part or clothing of the wearer, wherein when attached to said body or clothing the main signal transmission direction of said first tag being in a first direction; and, the main signal transmission direction of said second tag being in a second direction which is different from said first direction. Hence, when using a conventional sports timing tag, the direction sensitivity of a tag in combination with the very small backscattered signal and the strong detuning due to the presence of the body of the participant increases the risk that participants that pass or cross the RFID reader are not detected by the detection antenna. The sports timing tag assembly elevates this problem by positioning multiple UHF tags on a flexible substrate of a predetermined spacer thickness, e.g. a wearable or attachable band, such that—when worn by the athlete—the main transmission direction of the backscattered signals is different for at least part of the different tags. The sports timing tag assembly ensures detection of particip...",
  "patent_number": "None",
  "abstract": "A wearable sport timing tag assembly comprising at least a first and second tag is described for transmitting data associated with the wearer of the tag assembly to at least one detection antenna, wherein the tag assembly comprises means for attaching the tag assembly to at least a body part or clothing of the wearer, wherein when attached to said body or clothing the main signal transmission direction of said first tag being in a first direction; and, the main signal transmission direction of said second tag being in a second direction which is different from said first direction.",
  "publication_number": "US20160259952A1-20160908",
  "_processing_info": {
    "original_size": 67012,
    "optimized_size": 3443,
    "reduction_percent": 94.86
  }
}