{
  "decision": "REJECTED",
  "application_number": "15028877",
  "date_published": "20161013",
  "date_produced": "20160928",
  "title": "COLOR TRANSFORMATION",
  "filing_date": "20160412",
  "inventor_list": [
    {
      "inventor_name_last": "Rius Rossell",
      "inventor_name_first": "Marti",
      "inventor_city": "Sant Cugat del Valles",
      "inventor_state": "",
      "inventor_country": "ES"
    },
    {
      "inventor_name_last": "Morovic",
      "inventor_name_first": "Jan",
      "inventor_city": "Colchester",
      "inventor_state": "",
      "inventor_country": "GB"
    },
    {
      "inventor_name_last": "Morovic",
      "inventor_name_first": "Peter",
      "inventor_city": "Sant Cugat del Valles",
      "inventor_state": "",
      "inventor_country": "ES"
    }
  ],
  "ipcr_labels": [
    "G06K1502",
    "H04N160"
  ],
  "main_ipcr_label": "G06K1502",
  "summary": "<SOH> BRIEF DESCRIPTION OF THE DRAWINGS <EOH>For a more complete understanding, reference is now made to the following description taken in conjunction with the accompanying drawings in which: FIG. 1 is a simplified schematic diagram of a color printing system according to an example; FIG. 2 is a simplified schematic diagram of an apparatus for calibrating a printing device according to an example; FIG. 3 is a flowchart of a method of calibrating a color printing device of an example; FIG. 4 is a flowchart of a method of calibrating a color printing device of FIG. 3 in more detail; FIG. 5 illustrates an example of defining a first gamut volume; FIGS. 6, 7 a and 7 b illustrate a representation of an example of creating the transformation function; FIG. 8 is an example of a first gamut of the printing elements; FIGS. 9 a and 9 b are examples of creating the transformation with a point outside of the gamut volume; and detailed-description description=\"Detailed Description\" end=\"lead\"?",
  "patent_number": "None",
  "abstract": "An example method of transforming colors for a printing device in accordance with the present disclosure is provided. The color printing device comprises a plurality of printing element, each printing element having an element gamut, represented in 3-D space associated therewith. The method comprises defining a first gamut volume in a 3-D space for the printing device, and transforming the defined first gamut volume into the element gamut to create a second gamut volume in 3-D space for the printing device.",
  "publication_number": "US20160300130A1-20161013",
  "_processing_info": {
    "original_size": 20633,
    "optimized_size": 2348,
    "reduction_percent": 88.62
  }
}