{
  "decision": "PENDING",
  "application_number": "15024100",
  "date_published": "20160811",
  "date_produced": "20160727",
  "title": "IDENTIFYING A TARGET TOUCH REGION OF A TOUCH-SENSITIVE SURFACE BASED ON AN IMAGE",
  "filing_date": "20160323",
  "inventor_list": [
    {
      "inventor_name_last": "Tretter",
      "inventor_name_first": "Daniel R",
      "inventor_city": "San Jose",
      "inventor_state": "CA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Kang",
      "inventor_name_first": "Jinman",
      "inventor_city": "San Diego",
      "inventor_state": "CA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Tan",
      "inventor_name_first": "Kar Han",
      "inventor_city": "Sunnyvale",
      "inventor_state": "CA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Hong",
      "inventor_name_first": "Wei",
      "inventor_city": "Sunnyvale",
      "inventor_state": "CA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Suggs",
      "inventor_name_first": "Bradley N",
      "inventor_city": "Sunnyvale",
      "inventor_state": "CA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Short",
      "inventor_name_first": "David Bradley",
      "inventor_city": "San Diego",
      "inventor_state": "CA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Sievert",
      "inventor_name_first": "Otto",
      "inventor_city": "Oceanside",
      "inventor_state": "CA",
      "inventor_country": "US"
    }
  ],
  "ipcr_labels": [
    "G06F3041",
    "G09G300",
    "G06T700",
    "G06F3042",
    "G06F30354"
  ],
  "main_ipcr_label": "G06F3041",
  "summary": "<SOH> BRIEF DESCRIPTION OF THE DRAWINGS <EOH>The following detailed description references the drawings, wherein: FIG. 1 is a schematic perspective view of an example computing system comprising a rejection engine; FIG. 2 is another schematic perspective view of the example computing system of FIG. 1 ; FIG. 3 is a schematic side view of the example computing system of FIG, 1 ; FIG. 4 is a schematic front view of the example computing system of FIG. 1 ; FIG. 5 is a schematic side view of the example computing system of FIG. 1 during an example operation; FIG. 6 is a schematic front view of the example computing system of FIG. 1 during another example operation; FIG. 7A is a schematic side view of the example computing system of FIG. 1 illustrating an example of image capturing; FIG, 7 B is a block diagram of an example of a portion of the computing system of FIG. 1 comprising the rejection engine; FIG. 7C is an example image of an object disposed over a touch-sensitive surface of a computing system; FIG. 7D is a block diagram of another example of a portion of the computing system of FIG. 1 comprising the rejection engine; FIG. 7E is another example image of an object disposed over a touch-sensitive   surface of a computing system; FIG. 7F is another example image of an object disposed over a touch-sensitive surface of a computing system; FIG. 8 is a block diagram of an example computing device to determine a target touch region; FIG. 9 is a flowchart of an example method for rejecting touch input; and FIG. 10 is a flowchart of an example method four identifying a target touch region. detailed-description description=\"Detailed Description\" end=\"lead\"?",
  "patent_number": "None",
  "abstract": "Examples disclosed herein relate to identifying a target touch region of a touch-sensitive surface based on an image. Examples include a touch input detected at a location of a touch-sensitive surface, an image representing an object disposed between a camera that captures the image and the touch-sensitive surface, identifying a target touch region of a touch-sensitive surface based on an image, and rejecting the detected touch input when the location of the detected touch input is not within any of the at least one identified target touch region of the touch-sensitive surface.",
  "publication_number": "US20160231862A1-20160811",
  "_processing_info": {
    "original_size": 89404,
    "optimized_size": 3763,
    "reduction_percent": 95.79
  }
}