{
  "date_produced": "20160803",
  "publication_number": "US20160239754A1-20160818",
  "main_ipcr_label": "G06N700",
  "decision": "PENDING",
  "application_number": "15024575",
  "inventor_list": [
    {
      "inventor_name_last": "Dursun",
      "inventor_name_first": "Serkan",
      "inventor_city": "Missouri City",
      "inventor_state": "TX",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Tuna",
      "inventor_name_first": "Tayfun",
      "inventor_city": "Houston",
      "inventor_state": "TX",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Duman",
      "inventor_name_first": "Kaan",
      "inventor_city": "Houston",
      "inventor_state": "TX",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Kellogg",
      "inventor_name_first": "Robert West",
      "inventor_city": "Richmond",
      "inventor_state": "TX",
      "inventor_country": "US"
    }
  ],
  "abstract": "Systems and methods for real-time risk prediction during drilling operations using real-time data from an uncompleted well, a trained coarse layer model and a trained fine layer model for each respective layer of the trained coarse layer model. In addition to using the systems and methods for real-time risk prediction, the systems and methods may also be used to monitor other uncompleted wells and to perform a statistical analysis of the duration of each risk level for the monitored well.",
  "filing_date": "20160324",
  "patent_number": "None",
  "summary": "<SOH> BRIEF DESCRIPTION OF THE DRAWINGS <EOH>The present disclosure is described below with references to the accompanying drawings in which like elements are referenced with like reference numerals, and in which: FIG. 1 is a flow diagram illustrating one embodiment of a method for implementing the present disclosure. FIG. 2 is a display illustrating an exemplary format for multiple attributes of the historical data input in step 104 of FIG. 1 . FIG. 3 is a display illustrating an exemplary format for the historical data segmented in step 106 of FIG. 1 . FIG. 4 is a display illustrating exemplary techniques for extracting one or more features representative of each respective historical data segment in step 110 of FIG. 1 . FIG. 5 is a display illustrating an exemplary coarse layer model and fine layer model defined in step 112 of FIG. 1 . FIG. 6 is a display illustrating an exemplary graphical user interface for monitoring the risk predicted in step 120 of FIG. 1 and managing the drilling operations for each uncompleted well. FIG. 7 is a block diagram illustrating one embodiment of a computer system for implementing the present disclosure. detailed-description description=\"Detailed Description\" end=\"lead\"?",
  "date_published": "20160818",
  "title": "Real-Time Risk Prediction During Drilling Operations",
  "ipcr_labels": [
    "G06N700",
    "G06F1716",
    "G06N9900"
  ],
  "_processing_info": {
    "original_size": 49843,
    "optimized_size": 2725,
    "reduction_percent": 94.53
  }
}