{
  "decision": "ACCEPTED",
  "application_number": "15026243",
  "date_published": "20160825",
  "date_produced": "20160810",
  "title": "TOUCH WINDOW AND DISPLAY INCLUDING THE SAME",
  "filing_date": "20160330",
  "inventor_list": [
    {
      "inventor_name_last": "LEE",
      "inventor_name_first": "Sang Young",
      "inventor_city": "Seoul",
      "inventor_state": "",
      "inventor_country": "KR"
    },
    {
      "inventor_name_last": "LEE",
      "inventor_name_first": "Tae Jin",
      "inventor_city": "Seoul",
      "inventor_state": "",
      "inventor_country": "KR"
    },
    {
      "inventor_name_last": "LIM",
      "inventor_name_first": "Hyun Seok",
      "inventor_city": "Seoul",
      "inventor_state": "",
      "inventor_country": "KR"
    },
    {
      "inventor_name_last": "MOON",
      "inventor_name_first": "Byung Youl",
      "inventor_city": "Seoul",
      "inventor_state": "",
      "inventor_country": "KR"
    }
  ],
  "ipcr_labels": [
    "G06F3041"
  ],
  "main_ipcr_label": "G06F3041",
  "summary": "<SOH> BRIEF DESCRIPTION OF DRAWINGS <EOH>FIG. 1 is a plan view schematically showing a touch window according to the embodiment. FIG. 2 is a plan view showing a touch window according to a first embodiment. FIGS. 3 to 6 are plan views showing the touch window according to another example of the first embodiment. FIG. 7 is a plan view showing a touch window according to a second embodiment. FIGS. 8 to 20 are plan views showing the touch window according to another example of the second embodiment. FIG. 21 is a plan view showing a touch window according to a third embodiment. FIGS. 22 to 25 are plan views showing a touch window according to another example of the third embodiment. FIG. 26 is a sectional view showing a touch window according to the third embodiment. FIGS. 27 to 28 are sectional views showing a touch device formed by assembling the touch window according to the embodiments with the touch panel. FIGS. 29 to 32 are sectional views showing examples of the touch device, to which the touch device according to the embodiments is applied. detailed-description description=\"Detailed Description\" end=\"lead\"?",
  "patent_number": "10007366",
  "abstract": "Disclosed is a touch window including a substrate, and a sensing electrode on the substrate. The sensing electrode comprises a plurality of sensing parts having directionalities different from each other.",
  "publication_number": "US20160246393A1-20160825",
  "_processing_info": {
    "original_size": 63793,
    "optimized_size": 2290,
    "reduction_percent": 96.41
  }
}