{
  "date_produced": "20160810",
  "publication_number": "US20160247090A1-20160825",
  "main_ipcr_label": "G06N9900",
  "decision": "PENDING",
  "application_number": "15027810",
  "inventor_list": [
    {
      "inventor_name_last": "Yu",
      "inventor_name_first": "Xiaofeng",
      "inventor_city": "Beijing",
      "inventor_state": "",
      "inventor_country": "CN"
    }
  ],
  "abstract": "Relationship extraction can include applying unsupervised relationship learning to a logic knowledge base and a plurality of entity groups recognized from a document to provide a probabilistic model. Relationship extraction can include performing joint inference on the probabilistic model to make simultaneous statistical judgments about a respective relationship between at least two entities in one of the plurality of entity groups. Relationship extraction can include extracting a relationship between at least two entities in one of the plurality of entity groups based on the joint inference.",
  "filing_date": "20160407",
  "patent_number": "None",
  "summary": "<SOH> BRIEF DESCRIPTION OF THE DRAWINGS <EOH>FIG. 1 illustrates a flow diagram of an example of relationship extraction according to the present disclosure. FIG. 2 illustrates a block diagram of an example of an implicit relationship according to the present disclosure. FIG. 3 illustrates a block diagram of an example of a computing device according to the present disclosure. FIG. 4 illustrates a block diagram of an example of a system for relationship extraction according to the present disclosure. FIG. 5 illustrates a flow diagram of an example of a method for relationship extraction according to the present disclosure, detailed-description description=\"Detailed Description\" end=\"lead\"?",
  "date_published": "20160825",
  "title": "RELATIONSHIP EXTRACTION",
  "ipcr_labels": [
    "G06N9900",
    "G06N700"
  ],
  "_processing_info": {
    "original_size": 45273,
    "optimized_size": 1816,
    "reduction_percent": 95.99
  }
}