{
  "decision": "PENDING",
  "application_number": "15023016",
  "date_published": "20160804",
  "date_produced": "20160720",
  "title": "PERSONALIZED INVESTMENT PORTFOLIO BUILDER AND INVESTMENT STRATEGY TESTER",
  "filing_date": "20160318",
  "inventor_list": [
    {
      "inventor_name_last": "Seitz",
      "inventor_name_first": "Michael W.",
      "inventor_city": "Houston",
      "inventor_state": "TX",
      "inventor_country": "US"
    }
  ],
  "ipcr_labels": [
    "G06Q4004"
  ],
  "main_ipcr_label": "G06Q4004",
  "summary": "<SOH> BRIEF DESCRIPTION OF THE DRAWINGS <EOH>FIG. 1 illustrates a screen titled “MiETF Vaults” showing hot buttons for the various vaults. FIG. 2 illustrates a screen titled “MiETF Vaults” requesting a system passcode used in the event a passcode to enter the vault is forgotten. FIG. 3 illustrates a screen titled “MiETF Vaults” for making first-time selections to name a vault, set an associated color for the vault, and to set a passcode for the vault. FIG. 4 illustrates a screen titled “MiETF Samples Vault” showing a preferred key code entry for opening this vault, with the same method being applicable for other vaults already set up. FIG. 5 illustrates a screen titled “MiETF Samples Vault” showing the portfolios in the vault after making a selection in FIG. 4 . FIG. 6 illustrates a screen titled “MiETF Examples Portfolio” showing a folder in the portfolio containing symbolic pages representing the baskets or MiETF assemblages of stocks after making a selection in FIG. 5 . FIG. 7 illustrates a screen titled “MiETF Examples Portfolio” showing a folder in the portfolio containing the baskets or MiETF assemblages of stocks after making a selection in FIG. 6 . FIG. 8 illustrates a screen titled “MiETF Samples Vault” setting forth steps for initiating a System Recovery in the event of a lost password. FIG. 9 illustrates a screen electronic display titled “MiETF Historical Performance” showing the graphical performance of a basket or MiETF assemblage of stocks against other graphs after making a selection in FIG. 6 . FIG. 10 illustrates a screen electronic display titled “MiETF Components” showing the components of a basket or MiEFT assemblage of stocks after making a selection shown in FIG. 6 . FIG. 11 illustrates a screen electronic display titled “MiETF Stock Sectors” showing hot buttons for accessing listings of individual stocks in a stock sector after making a selection in FIG. 10 . FIG. 12 illustrates a screen electronic display titled “MiETF Healthcare Component” ...",
  "patent_number": "None",
  "abstract": "The invention provides a method comprising (a) opening an ideas Vault, {b) creating an investment portfolio in the vault, (c) allocating an investment amount to the portfolio, (d) creating a basket in the portfolio, (e) allocating part of the investment amount to the basket, (f) selecting an investible for the basket, (g) repeating step (f) with different investibles to populate the basket, (h) apportioning the basket cash allocation between the investibles on a percentage basis, (i) repeating steps (d)-(h) to form different baskets, (j) reallocating cash between different baskets if desired, (k) moving the portfolio to the Serious Stuff Vault, (I) selecting a broker, (m) executing purchase of the portfolio, (n) broker moving the executed portfolio to user's Action Vault, and (ol user being able to make modifications by repeating steps (k)-(n) with an indication to the broker that the modified portfolio is to be a replacement.",
  "publication_number": "US20160225086A1-20160804",
  "_processing_info": {
    "original_size": 225917,
    "optimized_size": 3624,
    "reduction_percent": 98.4
  }
}