{
  "date_produced": "20160803",
  "publication_number": "US20160239746A1-20160818",
  "main_ipcr_label": "G06N504",
  "decision": "PENDING",
  "application_number": "15029765",
  "inventor_list": [
    {
      "inventor_name_last": "Yu",
      "inventor_name_first": "Hong",
      "inventor_city": "Shrewsbury",
      "inventor_state": "MA",
      "inventor_country": "US"
    }
  ],
  "abstract": "The present invention relates generally to identifying relationships between items. Certain embodiments of the present invention are configurable to identify the probability that a certain event will occur by identifying relationships between items. Certain embodiments of the present invention provide an improved supervised machine learning system.",
  "filing_date": "20160415",
  "patent_number": "None",
  "summary": "<SOH> SUMMARY OF THE INVENTION <EOH>Certain embodiments of the present invention are configured to automatically generate one or more hypothesis regarding information items. For example, in certain embodiments, the system and methods may be configured to identify two or more information items likely to have some relationship, such as interaction, correlation, or causation. For purposes of this application, an “information item” is any theory, segment, or discrete element forming or related to a subject. A “subject” may be a concept, construct, event, physical object—such as a miniscule physical object (that is a physical object widely accepted as being small in size such as a cell, molecule, or atomic particle), a large physical object (that is a physical object widely accepted as being large in size such as a country or the universe), or a medium physical object (that is a physical object widely accepted as being of a size that is not as small as a miniscule physical object or as large as a large physical object)—, a group of physical objects, an association between physical objects, or a separation of physical objects, to name a few. A novel hypothesis is defined as a relationship between any of the two subjects not yet discovered. Once a novel hypothesis is validated through one or more scientific experiments, it may be termed a known hypothesis or a known relation. The present invention is based on certain recognitions including that: 1) scientific knowledge discovery is a process by people (or authors), and therefore authors' behavior (e.g., productivity of the authors, authors' research field, authors' interaction with other domain-expert) impact new hypothesis generation; and 2) Research hypotheses (both new and known hypotheses) and hypothesis discovery follow the mathematic principal of an evolving network (e.g., a graph or a map). In one embodiment of a graph or map, a node may, for example, be a biomedical entity and the link between two nodes may be cons...",
  "date_published": "20160818",
  "title": "SYSTEM AND METHODS FOR PREDICITNG PROBABLE PROBABLE RELATIONSHIPS BETWEEN ITEMS",
  "ipcr_labels": [
    "G06N504",
    "G06N9900",
    "G06N700",
    "G06K962"
  ],
  "_processing_info": {
    "original_size": 74252,
    "optimized_size": 2977,
    "reduction_percent": 95.99
  }
}