{
  "decision": "PENDING",
  "application_number": "15032650",
  "date_published": "20160901",
  "date_produced": "20160817",
  "title": "INDICATING A TRAIT OF A CONTINUOUS DELIVERY PIPELINE",
  "filing_date": "20160428",
  "inventor_list": [
    {
      "inventor_name_last": "Shani",
      "inventor_name_first": "Inbar",
      "inventor_city": "Yehud",
      "inventor_state": "",
      "inventor_country": "IL"
    },
    {
      "inventor_name_last": "Reuven",
      "inventor_name_first": "Lior",
      "inventor_city": "Yehud",
      "inventor_state": "",
      "inventor_country": "IL"
    },
    {
      "inventor_name_last": "Nitsan",
      "inventor_name_first": "Amichai",
      "inventor_city": "Yehud",
      "inventor_state": "",
      "inventor_country": "IL"
    }
  ],
  "ipcr_labels": [
    "G06F944",
    "G06Q1006"
  ],
  "main_ipcr_label": "G06F944",
  "summary": "<SOH> BRIEF DESCRIPTION OF THE DRAWINGS <EOH>The following detailed description references the drawings, wherein: FIG. 1 is a block diagram of an example computing device to identify pipeline trait(s) of a continuous delivery (CD) pipeline satisfying query criteria; FIG. 2 is a block diagram of an example system to access pipeline characteristics for CD pipelines; FIG. 3 is a flowchart of an example method for outputting a report indicating identified traits including at least one of pipeline trait(s) and CD server trait(s) for a CD pipeline. detailed-description description=\"Detailed Description\" end=\"lead\"?",
  "patent_number": "None",
  "abstract": "Examples disclosed herein relate to indicating a trait of a continuous delivery pipeline. Examples include accessing, for each of a plurality of continuous delivery (CD) pipelines, respective pipeline characteristics previously collected by a collection engine of a CD server for at least one of the CD pipelines, and indicating a trait of the pipeline characteristics of at least one of the CD pipelines.",
  "publication_number": "US20160253172A1-20160901",
  "_processing_info": {
    "original_size": 62878,
    "optimized_size": 1848,
    "reduction_percent": 97.06
  }
}