{
  "decision": "PENDING",
  "application_number": "15035480",
  "date_published": "20161027",
  "date_produced": "20161012",
  "title": "WELLBORE THERMAL FLOW, STRESS AND WELL LOADING ANALYSIS WITH JET PUMP",
  "filing_date": "20160509",
  "inventor_list": [
    {
      "inventor_name_last": "GONZALES",
      "inventor_name_first": "Adolfo C.",
      "inventor_city": "Houston",
      "inventor_state": "TX",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "SAMUEL",
      "inventor_name_first": "Robello",
      "inventor_city": "Cypress",
      "inventor_state": "TX",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "KANG",
      "inventor_name_first": "Yongfeng",
      "inventor_city": "Katy",
      "inventor_state": "TX",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "LIU",
      "inventor_name_first": "Zhengchun",
      "inventor_city": "Sugar Land",
      "inventor_state": "TX",
      "inventor_country": "US"
    }
  ],
  "ipcr_labels": [
    "G06F1750",
    "E21B4312",
    "E21B4100"
  ],
  "main_ipcr_label": "G06F1750",
  "summary": "<SOH> BRIEF DESCRIPTION OF DRAWINGS <EOH>FIG. 1 is a schematic diagram of one of many embodiments of a well system having a jet pump according to the disclosure. FIG. 2 is a schematic diagram of another of many embodiments of a well system having a jet pump according to the disclosure. FIG. 3 is a chart illustrating pressure changes in one of many embodiments of a well system with and without a jet pump according to the disclosure. FIG. 4 is a chart illustrating temperature changes in one of many embodiments of a well system with and without a jet pump according to the disclosure. FIG. 5 is a flow diagram illustrating one of many embodiments of an analysis system and method according to the disclosure. FIG. 6 illustrates one of many embodiments of a user interface according to the disclosure. FIG. 7 illustrates another of many embodiments of a user interface according to the disclosure. detailed-description description=\"Detailed Description\" end=\"lead\"?",
  "patent_number": "None",
  "abstract": "A method for simulating a well system can include providing a well system model, providing a jet pump model, providing at least one calculation engine, inputting an input parameter, defining a mechanical configuration of the well system, integrating a jet pump model into a well system model, computing a solution to a model, and determining at least one production condition of a well system. A computer readable medium can have instructions stored thereon that, when executed by a processor, can cause the processor to perform a method including accessing a well system model, accessing a jet pump model, integrating the jet pump model and the well system model, computing a solution to a combined model, and determining a production condition of a well system.",
  "publication_number": "US20160314225A1-20161027",
  "_processing_info": {
    "original_size": 57185,
    "optimized_size": 2754,
    "reduction_percent": 95.18
  }
}