{
  "date_produced": "20160921",
  "publication_number": "US20160292587A1-20161006",
  "main_ipcr_label": "G06N9900",
  "decision": "PENDING",
  "application_number": "15035574",
  "inventor_list": [
    {
      "inventor_name_last": "RIGETTI",
      "inventor_name_first": "Chad Tyler",
      "inventor_city": "Emeryville",
      "inventor_state": "CA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "THOMPSON",
      "inventor_name_first": "Dane Christoffer",
      "inventor_city": "Granite Bay",
      "inventor_state": "CA",
      "inventor_country": "US"
    }
  ],
  "abstract": "In some aspects, a quantum computing system includes an electromagnetic waveguide system. The waveguide system has an interior surface that defines an interior volume of intersecting waveguides. Qubit devices are housed in the waveguide system. In some cases, the intersecting waveguides each define a cutoff frequency, and the qubit devices have qubit operating frequencies below the cutoff frequency. In some cases, coupler devices are housed in the waveguide system; each coupler device is configured to selectively couple a pair of neighboring qubit devices based on control signals received from a control source.",
  "filing_date": "20160510",
  "patent_number": "None",
  "summary": "<SOH> SUMMARY <EOH>In a general aspect, a quantum computing system includes an electromagnetic waveguide system. In some aspects, information is encoded in a multi-dimensional array of qubit devices housed in a multi-dimensional electromagnetic waveguide lattice. The qubit devices have respective qubit operating frequencies. The electromagnetic waveguide lattice is configured to suppress signal propagation between the qubit devices over a frequency range that includes the qubit operating frequencies. In some aspects, a quantum computing system includes a quantum processor cell assembly. The quantum processor cell assembly includes an electromagnetic waveguide system. The electromagnetic waveguide system includes an interior surface that defines an interior volume of intersecting waveguides. The intersecting waveguides define cutoff frequencies and are configured to evanesce electromagnetic waves below the cutoff frequencies. The quantum computing system includes a multi-dimensional array of qubit devices housed in the electromagnetic waveguide system. The qubit devices have respective qubit operating frequencies below the cutoff frequencies. In some aspects, a quantum computing system includes a quantum processor cell assembly comprising a system of intersecting waveguides. Each of the waveguides defines a cross-section and a propagation axis perpendicular to the cross-section, and the cross-section of each waveguide defines a cutoff frequency of the waveguide. The quantum computing system includes a multi-dimensional array of qubit devices housed in the system of intersecting waveguides. The qubit devices have respective qubit operating frequencies below the cutoff frequencies of the intersecting waveguides. In some aspects, a quantum processor cell assembly includes an electromagnetic waveguide system. The electromagnetic waveguide system has an interior surface that defines an interior volume of intersecting waveguides. A first subset of the waveguides intersect ...",
  "date_published": "20161006",
  "title": "Housing Qubit Devices in an Electromagnetic Waveguide System",
  "ipcr_labels": [
    "G06N9900",
    "G06F1580"
  ],
  "_processing_info": {
    "original_size": 405871,
    "optimized_size": 3348,
    "reduction_percent": 99.18
  }
}