{
  "decision": "PENDING",
  "application_number": "15039677",
  "date_published": "20161229",
  "date_produced": "20161214",
  "title": "SYSTEM AND METHOD FOR MEDICAL DATA ANALYSIS AND SHARING",
  "filing_date": "20160526",
  "inventor_list": [
    {
      "inventor_name_last": "McNutt",
      "inventor_name_first": "Todd",
      "inventor_city": "Severna Park",
      "inventor_state": "MD",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Wong",
      "inventor_name_first": "John",
      "inventor_city": "Ruxton",
      "inventor_state": "MD",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "DeWeese",
      "inventor_name_first": "Theodore",
      "inventor_city": "Towson",
      "inventor_state": "MD",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Herman",
      "inventor_name_first": "Joseph",
      "inventor_city": "Perry Hall",
      "inventor_state": "MD",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Quon",
      "inventor_name_first": "Harry",
      "inventor_city": "Rose Valley",
      "inventor_state": "PA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Evans",
      "inventor_name_first": "Kim",
      "inventor_city": "Seattle",
      "inventor_state": "WA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Moore",
      "inventor_name_first": "Joseph",
      "inventor_city": "Reisterstown",
      "inventor_state": "MD",
      "inventor_country": "US"
    }
  ],
  "ipcr_labels": [
    "G06F1900"
  ],
  "main_ipcr_label": "G06F1900",
  "summary": "<SOH> SUMMARY <EOH>Aspects of the invention may involve systems, methods, and/or computer readable medium. In one embodiment of the invention, a computer-implemented method may exist for analyzing and disseminating medical information. The method may include receiving, by one or more processors, a plurality of patient medical data; aggregating, by the one or more processors, the plurality of patient medical data, wherein access to patient private health information is restricted; receiving, by the one or more processors, a query for medical information; analyzing, by the one or more processors, the aggregated medical data based on the query; producing, by the one or more processors, a result of the query based on the analyzing of the aggregated medical data; and transmitting, by the one or more processors, the result of the query. In another embodiment of the invention, a system may exist. The system may include one or more mobile tablets for entering medical information; one or more storage devices, the one or more storage devices holding one or more databases, the one or more databases including one or more tables for storing and organizing the medical information, the one or more storage devices storing one or more instructions for analyzing and disseminating medical information; and one or more computers, wherein the one or more computers receive the medical information and store the medical information in the one or more databases, the one or more computers comprising one or more processors, the one or more processors operable to execute the one or more instructions, the one or more instructions comprising instructions for: receiving a query for medical information; analyzing the medical information; producing a result of the query based on the analyzing; and transmitting the result of the query. In another embodiment, a non-transitory computer-readable medium may store computer-executable instructions. The computer-readable medium may include one or more instr...",
  "patent_number": "None",
  "abstract": "A computer-implemented method may be provided for analyzing and disseminating medical information. The method may include steps performed by one or more processors including, receiving a plurality of patient medical data; aggregating the plurality of patient medical data, wherein access to patient private health information is restricted; receiving a query for medical information; analyzing the aggregated medical data based on the query; producing a result of the query based on the analyzing of the aggregated medical data; and transmitting the result of the query.",
  "publication_number": "US20160378919A1-20161229",
  "_processing_info": {
    "original_size": 103235,
    "optimized_size": 3988,
    "reduction_percent": 96.14
  }
}