{
  "decision": "PENDING",
  "application_number": "15030817",
  "date_published": "20160908",
  "date_produced": "20160824",
  "title": "CONTENT SEARCH AND RESULTS",
  "filing_date": "20160420",
  "inventor_list": [
    {
      "inventor_name_last": "VITTORIO",
      "inventor_name_first": "Steven Michael",
      "inventor_city": "Gainesville",
      "inventor_state": "FL",
      "inventor_country": "US"
    }
  ],
  "ipcr_labels": [
    "G06F1730",
    "G09B1900",
    "G09B506"
  ],
  "main_ipcr_label": "G06F1730",
  "summary": "<SOH> BRIEF SUMMARY <EOH>Systems and techniques for facilitating content search and results are described. The content can be presented in a manner that indicates the content's trustworthiness or relevancy. Example embodiments are described in which systems and techniques are illustrated in respect to several content categories, including educational content and medical content. An example embodiment is also described in which multiple content types relating to a search query may be shown in relation to one another. A method of facilitating content search and results can include, for example, identifying a plurality of content in response to receiving a search query, identifying a number of times each content of the plurality of content has been referenced by sources of a set of at least one designated source, and generating a search result of the plurality of content that is ordered based on the number of times each content has been referenced. This Summary is provided to introduce a selection of concepts in a simplified form that are further described below in the Detailed Description. This Summary is not intended to identify key features or essential features of the claimed subject matter, nor is it intended to be used to limit the scope of the claimed subject matter.",
  "patent_number": "None",
  "abstract": "A search request for content can be initiated by a user, and the content that is relevant to the search request can be identified and presented in a manner that indicates the content's trustworthiness or relevancy. The identified content can be ranked based on the number of times the content has been referenced as well as by source that referenced the content. The relevant identified content can then be displayed in an ordered list that is ordered based on the number of times the content has been referenced. In some cases, the order may be modified by the authority of the source.",
  "publication_number": "US20160259858A1-20160908",
  "_processing_info": {
    "original_size": 113140,
    "optimized_size": 2426,
    "reduction_percent": 97.86
  }
}