{
  "decision": "PENDING",
  "application_number": "15030006",
  "date_published": "20160915",
  "date_produced": "20160831",
  "title": "TRACEABLE METALLIC PRODUCTS AND METALLIC SUPPORT FOR NANOSTORAGE",
  "filing_date": "20160415",
  "inventor_list": [
    {
      "inventor_name_last": "ARSENAULT",
      "inventor_name_first": "Steve",
      "inventor_city": "Laterrière",
      "inventor_state": "",
      "inventor_country": "CA"
    },
    {
      "inventor_name_last": "GAUDET",
      "inventor_name_first": "Daniel",
      "inventor_city": "Chicoutimi",
      "inventor_state": "",
      "inventor_country": "CA"
    },
    {
      "inventor_name_last": "RIVARD",
      "inventor_name_first": "Daniel",
      "inventor_city": "St-Honoré de Chicoutimi",
      "inventor_state": "",
      "inventor_country": "CA"
    },
    {
      "inventor_name_last": "DUMONT",
      "inventor_name_first": "Maxime",
      "inventor_city": "Chicoutimi-Nord",
      "inventor_state": "",
      "inventor_country": "CA"
    },
    {
      "inventor_name_last": "LAMBERT",
      "inventor_name_first": "Jocelyn",
      "inventor_city": "Roberval",
      "inventor_state": "",
      "inventor_country": "CA"
    }
  ],
  "ipcr_labels": [
    "G06K1902",
    "C12Q168",
    "C25D1124",
    "C25D1120",
    "C25D346",
    "C25D348",
    "C25D350",
    "C25D338",
    "C25D312",
    "C25D322",
    "C25D330",
    "C25D326",
    "C25D544",
    "C25D700",
    "G01N33543"
  ],
  "main_ipcr_label": "G06K1902",
  "summary": "<SOH> BRIEF SUMMARY OF THE INVENTION <EOH>The invention relates to traceable metallic products which may be made traceable for integrity purposes, identification purposes, counterfeit avoidance purposes and the like. The invention also relates to a metallic support for nanostorage (or nanobanking) of various compounds and samples such as biological compounds, biochemical compounds, chemical compounds and the like. One particular aspect of the present invention concerns a traceable metallic product comprising a porous surface layer formed by anodization, the porous surface layer comprising at least one traceable biological compound. Another aspect of the present invention concerns a method for obtaining a traceable metallic product, comprising the steps of: providing an anodized metallic product having a porous surface layer formed by anodization; and impregnating a region of said porous surface layer with at least one traceable biological compound. Accordingly, a related aspect of the invention concerns the use of at least one traceable biological compound for tracking an anodized metallic product comprising a porous layer, wherein the at least one traceable biological compound is found inside pores of the surface layer. In embodiments, the at least one traceable biological compound is selected from the group consisting of nucleic acids, peptidic molecules (peptides, proteins, lipoprotein, glycosylated-protein), lipids, mono and polysaccharides, hormones, vitamins, and derivatives thereof. Another aspect of the present invention concerns a traceable piece of aluminum comprising a porous surface layer formed by anodization, the porous surface layer comprising nucleic acid molecules inside pores of the surface layer. Another aspect of the present invention concerns a method for tracking a porous metallic product having a porous surface layer formed by anodization, comprising: assigning at least one predetermined traceable compound to a porous metallic product to be tr...",
  "patent_number": "None",
  "abstract": "The invention relates to traceable metallic products, methods of uses and methods of making same. The metallic products may be made traceable for integrity purposes, identification purposes, counterfeit avoidance and the like. The invention also relates to metallic supports for nanostorage of various compounds and samples.",
  "publication_number": "US20160267368A1-20160915",
  "_processing_info": {
    "original_size": 87213,
    "optimized_size": 3650,
    "reduction_percent": 95.81
  }
}