{
  "date_produced": "20160921",
  "publication_number": "US20160292583A1-20161006",
  "main_ipcr_label": "G06N504",
  "decision": "PENDING",
  "application_number": "15038426",
  "inventor_list": [
    {
      "inventor_name_last": "Browning",
      "inventor_name_first": "Randolph",
      "inventor_city": "Mercer Island",
      "inventor_state": "WA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Papp",
      "inventor_name_first": "Stefan Nicholas",
      "inventor_city": "Seattle",
      "inventor_state": "WA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Zimmermann",
      "inventor_name_first": "Bernhard G.",
      "inventor_city": "Seattle",
      "inventor_state": "WA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Bressler",
      "inventor_name_first": "Benjamin Ralph",
      "inventor_city": "Sammamish",
      "inventor_state": "WA",
      "inventor_country": "US"
    }
  ],
  "abstract": "Techniques are described for analyzing user-supplied information and/or predicting future aspects of additional information that will be supplied by users. The analyzed information may include distributed group discussions involving numerous users, occurring via user comments and other content items supplied to social networking site(s) and/or other sources. Analysis of user-supplied information may, for example, include determining particular topics and/or categories of interest during one or more time periods and quantifying corresponding amounts of user interest; determining trends for, relevant terms and attributes for, and inter-relationships between the topics and categories; predicting future amounts of user interest in the topics and categories; tracking user interactions with information about the topics and/or categories; and taking further actions based on the analyzed and/or predicted information.",
  "filing_date": "20160520",
  "patent_number": "None",
  "summary": "<SOH> BRIEF DESCRIPTION OF THE DRAWINGS <EOH>FIG. 1 is a network diagram illustrating an example embodiment of a service that analyzes distributed group discussions and predicts further aspects of the discussions. FIGS. 2A-2K illustrate examples of analyzing distributed group discussions and predicting further aspects of the discussions. FIGS. 2L-2V and 2Y-2AC illustrate examples of displaying information about analyzed aspects of distributed group discussions and about further predicted aspects of the discussions, as well as using promotional information in various manners. FIGS. 2W-2X and 2AI-2AK illustrate examples of types of inter-relationships that may be automatically discovered between various types of distributed discussion-related information, and of using such discovered inter-relationship information in various manners. FIGS. 2AD-2AH illustrate examples of displaying and otherwise using journey-related information and promotional information in various manners. FIG. 3 is a block diagram illustrating a computing system suitable for executing embodiments of a described system for analyzing distributed group discussions and predicting further aspects of the discussions. FIGS. 4A-4B are an example flow diagram of an illustrated embodiment of a Group Discussion Prediction Service routine. FIG. 5 is an example flow diagram of an illustrated embodiment of a Comment Group Creation Manager routine. FIG. 6 is an example flow diagram of an illustrated embodiment of a Category Analysis Manager routine. FIGS. 7A-7C are an example flow diagram of an illustrated embodiment of a Prediction Manager routine. FIGS. 8A and 8B are example flow diagrams of illustrated embodiments of a Prediction Template Generation Manager routine. FIGS. 9A-9B are an example flow diagram of an illustrated embodiment of a Results Information Provider Manager routine. FIGS. 10A-10B are an example flow diagram of an illustrated embodiment of a Journey Manager routine. FIGS. 11A-11B are an exampl...",
  "date_published": "20161006",
  "title": "ANALYZING DISTRIBUTED GROUP DISCUSSIONS",
  "ipcr_labels": [
    "G06N504",
    "G06F1730",
    "G06F1727",
    "G06N9900"
  ],
  "_processing_info": {
    "original_size": 415812,
    "optimized_size": 3957,
    "reduction_percent": 99.05
  }
}