{
  "date_produced": "20160921",
  "publication_number": "US20160292573A1-20161006",
  "main_ipcr_label": "G06N502",
  "decision": "PENDING",
  "application_number": "15035555",
  "inventor_list": [
    {
      "inventor_name_last": "BABKO-MALAYA",
      "inventor_name_first": "Olga",
      "inventor_city": "Winchester",
      "inventor_state": "MA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "HUNTER",
      "inventor_name_first": "Daniel B.",
      "inventor_city": "Woburn",
      "inventor_state": "MA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "SEIDEL",
      "inventor_name_first": "Andrew C.",
      "inventor_city": "San Francisco",
      "inventor_state": "CA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "TORRELLI",
      "inventor_name_first": "Michelle A.",
      "inventor_city": "Chelmsford",
      "inventor_state": "MA",
      "inventor_country": "US"
    }
  ],
  "abstract": "The present invention is a method for constructing a knowledgebase that can provide analysis and trend prediction of emerging technologies. Metadata and full text are gathered from collections of documents, which can include more than 10 million documents, and are used to build a heterogeneous network of elements related to themes such as technical emergence. Indicators and models are selected that identify network characteristics and trends of interest. The indicators can be derived by applying a combination of citation analyses, natural language processing, entity disambiguation, organization classification, and time series analyses. A metric can be used to evaluate indicator utility. A framework can be sued to generate and validate the indicators. The models can be derived using an automated process. Upon receipt of a query, the indicators and models can be used to apply a scoring process to extracted features to predict a future prominence of an entity.",
  "filing_date": "20160510",
  "patent_number": "None",
  "summary": "<SOH> SUMMARY OF THE INVENTION <EOH>The present invention is a method for achieving a complete characterization of a knowledge base, including full text data as well as citations and metadata, so as to enable automatic identification of emerging technologies and other trends, and topics that may be candidates for further research and monitoring. In various embodiments, the disclosed method is able to distil information from very large databases, and is customizable to various tasks, including prediction of emerging scientific topics and technologies. Specifically, the present invention is a method for creating a knowledge base based on metadata and full text extracted and distilled from collections of data, whereby the method comprises the steps of using said data to build a heterogeneous network of elements related to emerging technologies and other trends, and selecting indicators and models to identify network characteristics and trends of interest to users, whereby information regarding emerging technologies and trends may be distilled from said data. In embodiments, information is gathered, including metadata and full text, from collections of scientific articles and patents. In various embodiments, tens of millions of documents can be processed. The extracted information is then used to build a heterogeneous network of elements related to an analysis of technical emergence. Indicators and models are then selected to identify network characteristics and trends that are of interest to users. In embodiments, a framework is employed for generation and validation of a large number of indicators. These indicators are derived by combining citation analyses, natural language processing, entity disambiguation, organization classification, and time series analyses. Embodiments of the invention employ an automated process for model selection and training, as well as various metrics for evaluating the utility of indicators. These evaluations can include making predictions...",
  "date_published": "20161006",
  "title": "A METHOD FOR DETECTION AND CHARACTERIZATION OF TECHNICAL EMERGENCE AND ASSOCIATED METHODS",
  "ipcr_labels": [
    "G06N502",
    "G06N700",
    "G06F1730"
  ],
  "_processing_info": {
    "original_size": 28342,
    "optimized_size": 4033,
    "reduction_percent": 85.77
  }
}