{
  "decision": "PENDING",
  "application_number": "15039732",
  "date_published": "20161215",
  "date_produced": "20161130",
  "title": "TOUCH SENSOR AND METHOD FOR MANUFACTURING SAME",
  "filing_date": "20160526",
  "inventor_list": [
    {
      "inventor_name_last": "HWANG",
      "inventor_name_first": "Ji Young",
      "inventor_city": "Daejeon",
      "inventor_state": "",
      "inventor_country": "KR"
    },
    {
      "inventor_name_last": "LEE",
      "inventor_name_first": "Donghyun",
      "inventor_city": "Daejeon",
      "inventor_state": "",
      "inventor_country": "KR"
    },
    {
      "inventor_name_last": "LEE",
      "inventor_name_first": "Seung Heon",
      "inventor_city": "Daejeon",
      "inventor_state": "",
      "inventor_country": "KR"
    },
    {
      "inventor_name_last": "SEO",
      "inventor_name_first": "Han Min",
      "inventor_city": "Daejeon",
      "inventor_state": "",
      "inventor_country": "KR"
    }
  ],
  "ipcr_labels": [
    "G06F3044"
  ],
  "main_ipcr_label": "G06F3044",
  "summary": "<SOH> BRIEF DESCRIPTION OF DRAWINGS <EOH>FIGS. 1 to 3 are views schematically illustrating a touch sensor in the related art. FIG. 4 is a view schematically illustrating a wiring electrode part of the touch sensor in the related art. FIGS. 5 and 6 are views schematically illustrating a touch sensor according to an exemplary embodiment of the present application. FIGS. 7 to 9 are views schematically illustrating the moiré evaluation results of the touch sensor according to an exemplary embodiment of the present application. FIGS. 10 to 14 are views schematically illustrating the aperture evaluation results of the touch sensor according to an exemplary embodiment of the present application. FIGS. 15 and 16 are views schematically illustrating the conductive metal line patterns of the wiring electrode part of the touch sensor according to an exemplary embodiment of the present application. FIGS. 17 to 24 are views schematically illustrating the moiré evaluation results according to the form of the conductive metal line pattern of the wiring electrode part of the touch sensor according to an exemplary embodiment of the present application. FIG. 25 is a view schematically illustrating a touch sensor according to an exemplary embodiment of the present application and a display device including the same. FIG. 26 is a view schematically illustrating disconnection points of the conductive metal line pattern according to an exemplary embodiment of the present application. FIG. 27 is a view schematically illustrating the touch sensor according to an exemplary embodiment of the present application. FIG. 28 is a view schematically illustrating a printing direction of the wiring electrode of the touch sensor according to an exemplary embodiment of the present application. detailed-description description=\"Detailed Description\" end=\"lead\"?",
  "patent_number": "None",
  "abstract": "The present application relates to a touch sensor and a method for preparing the same, and the touch sensor according to the present application includes: a substrate; and a driving electrode part, a sensing electrode part, and a wiring electrode part, which are provided on the same surface of the substrate, in which the driving electrode part, the sensing electrode part, and the wiring electrode part each include a conductive pattern including a shielding part and an opening.",
  "publication_number": "US20160364043A1-20161215",
  "_processing_info": {
    "original_size": 102724,
    "optimized_size": 3309,
    "reduction_percent": 96.78
  }
}