{
  "decision": "REJECTED",
  "application_number": "15031705",
  "date_published": "20161013",
  "date_produced": "20160928",
  "title": "WRISTBAND DEVICE INPUT USING WRIST MOVEMENT",
  "filing_date": "20160422",
  "inventor_list": [
    {
      "inventor_name_last": "Davydov",
      "inventor_name_first": "Anton M.",
      "inventor_city": "Gilroy",
      "inventor_state": "CA",
      "inventor_country": "US"
    }
  ],
  "ipcr_labels": [
    "G06F301",
    "G06F316",
    "G06F30482",
    "G06F116",
    "G06F30485"
  ],
  "main_ipcr_label": "G06F301",
  "summary": "<SOH> SUMMARY <EOH>Certain embodiments of the present invention relate to invoking a function of an electronic device using a wrist gesture (e.g., flexion or extension) that is detected by a wrist-worn device. The invoked function can be executed on the wrist-worn device or another device that is in communication with the wrist-worn device. The wrist-worn device can include a wristband that incorporates one or more sensors capable of detecting changes in the position of the wearer's wrist, e.g., by detecting deformation of the wristband, a force applied to the wristband, a change in pressure against a portion of the wristband, and/or a force or change in pressure applied against the back of the device (i.e., the surface of the device oriented toward the user's wrist). Signals from the wristband sensors can be analyzed to identify a specific wrist gesture. The identified gesture can be interpreted to determine a function to be invoked, for instance by reference to a gesture library that maps specific wrist gestures to functions, or actions, of the wrist-worn device. In some embodiments, the interpretation of a wrist gesture can be context-dependent, e.g., depending on what if any operations are in progress on the wrist-worn device when the gesture is made; thus, the same wrist gesture can initiate different functions in different contexts. In some embodiments, the function or action invoked by a wrist gesture can including sending control signals to another device that is in communication with the wrist-worn device, thereby allowing wrist gestures to be used for remote control. The following detailed description together with the accompanying drawings will provide a better understanding of the nature and advantages of the present invention.",
  "patent_number": "None",
  "abstract": "A function of an electronic device can be invoked using a wrist gesture (e.g., flexion or extension) that is detected by a wrist-worn device. The gesture can be detected using sensors in the wrist-worn device, e.g., in the wristband and/or behind a face member. A specific gesture can be identified from a library based on analysis of sensor signals. The invoked function can be executed on the wrist-worn device or another device that is in communication with the wrist-worn device.",
  "publication_number": "US20160299570A1-20161013",
  "_processing_info": {
    "original_size": 70034,
    "optimized_size": 2830,
    "reduction_percent": 95.96
  }
}