{
  "date_produced": "20160921",
  "publication_number": "US20160292586A1-20161006",
  "main_ipcr_label": "G06N9900",
  "decision": "ACCEPTED",
  "application_number": "15035547",
  "inventor_list": [
    {
      "inventor_name_last": "Rigetti",
      "inventor_name_first": "Chad Tyler",
      "inventor_city": "Emeryville",
      "inventor_state": "CA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Thompson",
      "inventor_name_first": "Dane Christoffer",
      "inventor_city": "Granite Bay",
      "inventor_state": "CA",
      "inventor_country": "US"
    }
  ],
  "abstract": "In some aspects, a quantum computing system includes a multi-dimensional array of qubit devices. Coupler devices reside at intervals between neighboring pairs of the qubit devices in the multi-dimensional array. Each coupler device is configured to produce an electromagnetic interaction between one of the neighboring pairs of qubit devices. In some cases, each qubit device has a respective qubit operating frequency that is independent of an offset electromagnetic field experienced by the qubit device, and the coupling strength of the electromagnetic interaction provided by each coupler device varies with an offset electromagnetic field experienced by the coupler device. In some cases, readout devices are each operably coupled to a single, respective qubit device to produce qubit readout signals that indicate the quantum state of the qubit device.",
  "filing_date": "20160510",
  "patent_number": "9892365",
  "summary": "<SOH> SUMMARY <EOH>In a general aspect, a quantum computing system includes a multi-dimensional array of qubit devices. In some aspects, qubit control signals are received in a multi-dimensional array of qubit devices. Each qubit device has a respective qubit operating frequency that is independent of an offset electromagnetic field experienced by the qubit device. The qubit control signal received by each qubit device is configured to manipulate a quantum state of the qubit device. Coupler control signals are received at coupler devices. The coupler devices reside at intervals between neighboring pairs of the qubit devices in the multi-dimensional array. The coupler control signal received by each coupler device is configured to produce an electromagnetic interaction between the neighboring pair of qubit devices that the coupler device resides between. A coupling strength of the electromagnetic interaction produced by each coupler device is influenced by an offset electromagnetic field experienced by the coupler device. In some aspects, qubit control signals are received in a multi-dimensional array of qubit devices. Each qubit device has a respective qubit operating frequency that is independent of an offset electromagnetic field experienced by the qubit device. The qubit control signal received by each qubit device is configured to manipulate a quantum state of the qubit device. Qubit readout signals are produced at readout devices associated with the multi-dimensional array of qubit devices. Each readout device is operably coupled to a single, respective qubit device. Each qubit readout signal is produced by one of the readout devices based on an electromagnetic interaction between the readout device and the respective qubit device. In some aspects, qubit control signals are received at a quantum processor cell that includes a multi-dimensional array of qubit devices. The multi-dimensional array includes sub-arrays associated with separate frequency bands. The q...",
  "date_published": "20161006",
  "title": "OPERATING A MULTI-DIMENSIONAL ARRAY OF QUBIT DEVICES",
  "ipcr_labels": [
    "G06N9900"
  ],
  "_processing_info": {
    "original_size": 402997,
    "optimized_size": 3572,
    "reduction_percent": 99.11
  }
}