{
  "decision": "PENDING",
  "application_number": "15038565",
  "date_published": "20161013",
  "date_produced": "20160928",
  "title": "OPTICAL CODE READING SYSTEM WITH DYNAMIC IMAGE REGIONALIZATION",
  "filing_date": "20160523",
  "inventor_list": [
    {
      "inventor_name_last": "CUMOLI",
      "inventor_name_first": "Marco",
      "inventor_city": "Monte San Pietro (Bologna)",
      "inventor_state": "",
      "inventor_country": "IT"
    },
    {
      "inventor_name_last": "MALAGUTI",
      "inventor_name_first": "Filippo",
      "inventor_city": "Bologna",
      "inventor_state": "",
      "inventor_country": "IT"
    },
    {
      "inventor_name_last": "PIUNTI",
      "inventor_name_first": "Francesco",
      "inventor_city": "Bologna",
      "inventor_state": "",
      "inventor_country": "IT"
    }
  ],
  "ipcr_labels": [
    "G06K710",
    "B65G4749",
    "B65G1500",
    "G06K714",
    "G06K1906"
  ],
  "main_ipcr_label": "G06K710",
  "summary": "<SOH> SUMMARY <EOH>The present invention recognizes and addresses disadvantages of prior art constructions and methods. According to one embodiment, the present invention provides an imaging system having a frame and a conveyor system with a generally planar conveyor surface that is movable with respect to the frame in a direction of travel and operative to convey an object in the direction of travel, the object having an optical code associated therewith. The system also has at least one imager system in a position with respect to the frame that is fixed during movement of the conveyor surface in the direction of travel. The at least one imager system has an image sensor comprising an array of optical detectors, optics configured to focus light reflected from a field of view onto the image sensor, and a processor. The image sensor is configured to output data representative of an image of the field of view. The conveyor system outputs at least one signal representative of a position of the object with respect to the field of view. The processor is configured to receive the at least one signal representative of a position of the object with respect to the field of view, and determine a position of the object with respect to the field of view based on the at least one signal. Upon determining that the object is within the field of view, and based upon a predetermined distance between the object and the optics, the processor defines a region that bounds the data representative of the image at least with respect to the direction of travel, and that encompasses a position that the object would have in the data representative of the image if the object is at the determined position in the field of view and at the predetermined distance from the optics. According to a further embodiment, the present invention provides a method of imaging objects on a conveyor system. The conveyor system has a generally planar conveyor surface that is movable with respect to a frame in a d...",
  "patent_number": "None",
  "abstract": "In a method and system for acquiring image data for detection of optical codes located on objects carried by a conveyor system, a conveyor system has an imager that includes a sensor and an optics arrangement disposed with respect to the sensor to direct light from a field of view to the sensor so that the sensor outputs image data. A processor system receives image data. The processor system determines a position of an object in a field of view with respect to the conveyor's direction of travel, based upon the determined position of the object in the field of view, and upon a predetermined distance between the object and the optics, defines a region that bounds the image data at least with respect to the direction of travel, and that encompasses a position the object would have in the image data if the object is at the determined position in the field of view and at the distance from the optics, with respect to the object.",
  "publication_number": "US20160300091A1-20161013",
  "_processing_info": {
    "original_size": 187303,
    "optimized_size": 3841,
    "reduction_percent": 97.95
  }
}