{
  "decision": "ACCEPTED",
  "application_number": "15031586",
  "date_published": "20160908",
  "date_produced": "20160824",
  "title": "METHOD OF HANDLING A GUEST PRINT JOB FOR PROCESSING BY AN AUTHENTICATED PRINTING SYSTEM AND SYSTEM FOR PERFORMING THE METHOD",
  "filing_date": "20160422",
  "inventor_list": [
    {
      "inventor_name_last": "DALAA",
      "inventor_name_first": "Tavs",
      "inventor_city": "Frederiksberg C",
      "inventor_state": "",
      "inventor_country": "DK"
    }
  ],
  "ipcr_labels": [
    "G06F312",
    "H04N132"
  ],
  "main_ipcr_label": "G06F312",
  "summary": "<SOH> BRIEF DESCRIPTION OF THE DRAWING <EOH>The invention and its many advantages will be described in more detail below with reference to the accompanying schematic drawing, which for the purpose of illustration shows some non-limiting embodiments, and in which: FIG. 1 shows a first embodiment of a method of handling a guest print job for processing by an authenticated printing system and a system for performing the method according to the first and second aspects of the present invention. detailed-description description=\"Detailed Description\" end=\"lead\"?",
  "patent_number": "9983835",
  "abstract": "Due to the lack of a user account, it is a problem to handle a guest print job, submitted by a guest user and associated with first user credentials, for processing by an authenticated printing system requiring the guest print job to be authenticated using second user credentials. This problem is solved by a method comprising the steps of i. obtaining the guest print job, the guest print job comprising print job metadata, the first user credentials being associated with the print job, ii. obtaining the second user credentials, iii. creating a guest user account with the authenticated printing system, the guest user account being associated with the second user credentials, iv. adding the second user credentials to the metadata, and v. forwarding at least the print job metadata, comprising the second user credentials, to the authenticated printing system for processing. A system and a computer program product for performing the method are also provided.",
  "publication_number": "US20160259602A1-20160908",
  "_processing_info": {
    "original_size": 66071,
    "optimized_size": 2159,
    "reduction_percent": 96.73
  }
}