{
  "decision": "PENDING",
  "application_number": "15039159",
  "date_published": "20170608",
  "date_produced": "20170524",
  "title": "SYSTEMS AND METHODS FOR SEARCHING FOR PROFESSIONALS WITHIN AN ONLINE COMMUNITY",
  "filing_date": "20160525",
  "inventor_list": [
    {
      "inventor_name_last": "JENNINGS",
      "inventor_name_first": "Kathleen",
      "inventor_city": "La Jolla",
      "inventor_state": "CA",
      "inventor_country": "US"
    }
  ],
  "ipcr_labels": [
    "G06Q1010",
    "G06Q5000"
  ],
  "main_ipcr_label": "G06Q1010",
  "summary": "<SOH> SUMMARY <EOH>Accordingly, systems and methods are disclosed for creating and nurturing an online community of professionals, and ranking, filtering, and/or presenting those professionals based on their activities within that community. In an embodiment, a method for searching for professionals within an online community is provided. The method may comprise using at least one hardware processor to: manage at least one database comprising member information for each of a plurality of members, wherein the plurality of members comprise a plurality of professional members and a plurality of non-professional members; store activity information for one or more interactions between one or more of the plurality of professional members and a web application; store feedback information received for one or more of the plurality of professional members; receive one or more search requests from at least one of the plurality of non-professional members, wherein each of the one or more search requests comprises one or more search criteria; and for each of the one or more search requests, identify two or more of the plurality of professional members based on the membership information for each of the two or more professional members and the one or more search criteria, determine an order for the identified two or more professional members based on the activity information and the feedback information for the identified two or more professional members, and generate a list comprising the identified two or more professional members in the determined order. In an additional embodiment, a system for searching for professionals within an online community is provided. The system may comprise: at least one hardware processor; at least one database comprising member information for each of a plurality of members, wherein the plurality of members comprise a plurality of professional members and a plurality of non-professional members; and one or more executable software modules configu...",
  "patent_number": "None",
  "abstract": "Systems and methods for searching for professionals within an online community. In an embodiment, a database is provided having member information for each of a plurality of members, including professional members and non-professional members. Activity information concerning one or more interactions between one or more of the professional members and a web application is tracked and stored. In addition, feedback information received for one or more of the professional members is tracked and stored. Search requests may be received, and for each of the search requests, two or more of the professional members may be identified based on member information and search criteria, an order can be determined for the identified professional members based on the stored activity information and feedback information, and a list can be generated including the identified professional members in the determined order.",
  "publication_number": "US20170161685A1-20170608",
  "_processing_info": {
    "original_size": 205128,
    "optimized_size": 3497,
    "reduction_percent": 98.3
  }
}