{
  "decision": "ACCEPTED",
  "application_number": "15035316",
  "date_published": "20160929",
  "date_produced": "20160914",
  "title": "ELECTRONIC DEVICE STAND",
  "filing_date": "20160509",
  "inventor_list": [
    {
      "inventor_name_last": "LAINE",
      "inventor_name_first": "AKI",
      "inventor_city": "HOUSTON",
      "inventor_state": "TX",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "MEHANDJIYSKY",
      "inventor_name_first": "DIMITRE",
      "inventor_city": "HOUSTON",
      "inventor_state": "TX",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "DELPIER",
      "inventor_name_first": "MICHAEL",
      "inventor_city": "HOUSTON",
      "inventor_state": "TX",
      "inventor_country": "US"
    }
  ],
  "ipcr_labels": [
    "G06F116",
    "H02J702",
    "H02J5010",
    "G06F126"
  ],
  "main_ipcr_label": "G06F116",
  "summary": "<SOH> BRIEF DESCRIPTION OF THE DRAWINGS <EOH>FIG. 1 is a perspective view of an electronic device stand according to an example implementation. FIG. 2 is an alternative perspective view of the electronic device stand of FIG. 1 according to an example implementation. FIG. 3 is a side view of the electronic device stand of FIG. 1 with an attached electronic device positioned in a first orientation according to an example implementation. FIG. 4 is an alternative side view of the electronic device stand of FIG. 1 with an attached electronic device positioned in a second orientation according to an example implementation. FIG. 5 is a perspective view of an electronic device stand according to an example implementation. FIG. 6 is a flow chart of a method of operating an electronic device and an electronic device stand according to an example implementation. detailed-description description=\"Detailed Description\" end=\"lead\"?",
  "patent_number": "9774135",
  "abstract": "An electronic device stand is provided in accordance with an aspect of the present disclosure. The electronic device stand includes a first section, a second section connected to the first section and positioned at an acute angle to the first section, and a dock connector extending from a first surface of the first section to attach to an electronic device. The first section of the electronic device is to support the electronic device in a first orientation when a first surface of the second section is in a first plane and is to support the electronic device in a second orientation when a second surface of the second section is in the first plane.",
  "publication_number": "US20160282905A1-20160929",
  "_processing_info": {
    "original_size": 41087,
    "optimized_size": 2430,
    "reduction_percent": 94.09
  }
}