{
  "decision": "PENDING",
  "application_number": "15046116",
  "date_published": "20170817",
  "date_produced": "20170802",
  "title": "SIMULATION SERVER CAPABLE OF CREATING EVENTS OF A LESSON PLAN BASED ON SIMULATION DATA STATISTICS",
  "filing_date": "20160217",
  "inventor_list": [
    {
      "inventor_name_last": "Bowness",
      "inventor_name_first": "David",
      "inventor_city": "Saint-Laurent",
      "inventor_state": "",
      "inventor_country": "CA"
    },
    {
      "inventor_name_last": "DELISLE",
      "inventor_name_first": "Jean-François",
      "inventor_city": "Saint-Laurent",
      "inventor_state": "",
      "inventor_country": "CA"
    },
    {
      "inventor_name_last": "HO",
      "inventor_name_first": "Dac Toan",
      "inventor_city": "Saint-Laurent",
      "inventor_state": "",
      "inventor_country": "CA"
    },
    {
      "inventor_name_last": "GINGRAS",
      "inventor_name_first": "Luc",
      "inventor_city": "Saint -Laurent",
      "inventor_state": "",
      "inventor_country": "CA"
    }
  ],
  "ipcr_labels": [
    "G09B902",
    "G09B702",
    "G06N504"
  ],
  "main_ipcr_label": "G09B902",
  "summary": "<SOH> SUMMARY <EOH>According to a first aspect, the present disclosure provides a simulation server. The simulation server comprises memory for storing simulation data, and a processing unit. The processing unit executes a plurality of simulations functionalities according to a lesson plan. The processing unit collects simulation data representative of the execution of the plurality of simulations functionalities according to the lesson plan. The processing unit stores the simulation data in the memory. The processing unit processes the simulation data to generate simulation data statistics. The processing unit creates at least one event having at least one rule based on the simulation data statistics. The at least one rule consists in at least one measurable value to be measured by at least one of the simulation functionalities.",
  "patent_number": "None",
  "abstract": "A simulation server capable of creating events of a lesson plan based on simulation data statistics. The simulation server comprises memory for storing simulation data, and a processing unit. The processing unit executes a plurality of simulations functionalities according to a lesson plan. The processing unit collects simulation data representative of the execution of the plurality of simulations functionalities according to the lesson plan. The processing unit stores the simulation data in the memory. The processing unit processes the simulation data to generate simulation data statistics. The processing unit creates at least one event having at least one rule based on the simulation data statistics. The at least one rule consists in at least one measurable value to be measured by at least one of the simulation functionalities.",
  "publication_number": "US20170236439A1-20170817",
  "_processing_info": {
    "original_size": 138420,
    "optimized_size": 2746,
    "reduction_percent": 98.02
  }
}