{
  "decision": "REJECTED",
  "application_number": "15043528",
  "date_published": "20160825",
  "date_produced": "20160810",
  "title": "MEDICAL INTERACTION SYSTEMS AND METHODS",
  "filing_date": "20160213",
  "inventor_list": [
    {
      "inventor_name_last": "Cabot",
      "inventor_name_first": "Gary",
      "inventor_city": "Honolulu",
      "inventor_state": "HI",
      "inventor_country": "US"
    }
  ],
  "ipcr_labels": [
    "G06F1728",
    "G06F1727"
  ],
  "main_ipcr_label": "G06F1728",
  "summary": "<SOH> BRIEF SUMMARY OF THE INVENTION <EOH>A medical interaction system for providing cross-language communication between a first user and a second user is provided. In some embodiments, the system may include: a speaker for providing audio output to the users; a graphical user interface for displaying visual information output to and receiving user input from the users; and a processor in communication with the speaker and the graphical interface, in which the processor is configured to identify a first language selected by the first user with the graphical user interface, identify a second language selected by the second user with the graphical user interface, receive first language input from the first user, interpret the first language input into a second language output, provide the second language output to the second user, receive second language input from the second user, determine second user consent to the second language output, interpret the second language input into first language output, and provide the first language output to the first user. According to another embodiment consistent with the principles of the invention, a medical interaction method for providing cross-language communication between a first user and a second user is provided. The method may include: identifying a first language selected by the first user; identifying a second language selected by the second user; receiving first language input from the first user; interpreting the first language input into a second language output; providing the second language output to the second user; receiving second language input from the second user; determining second user consent to the second language output; interpreting the second language input into first language output; and providing the first language output to the first user.",
  "patent_number": "None",
  "abstract": "A medical interaction system which in some embodiments, may include: a speaker for providing audio output to the users; a graphical user interface for displaying visual information output to and receiving user input from the users; and a processor in communication with the speaker and the graphical interface, in which the processor is configured to identify a first language selected by the first user with the graphical user interface, identify a second language selected by the second user with the graphical user interface, receive first language input from the first user, interpret the first language input into a second language output, provide the second language output to the second user, receive second language input from the second user, determine second user consent to the second language output, interpret the second language input into first language output, and provide the first language output to the first user.",
  "publication_number": "US20160246781A1-20160825",
  "_processing_info": {
    "original_size": 103946,
    "optimized_size": 3310,
    "reduction_percent": 96.82
  }
}