{
  "decision": "ACCEPTED",
  "application_number": "15049349",
  "date_published": "20170119",
  "date_produced": "20170104",
  "title": "Method Of Augmenting An Audio Content",
  "filing_date": "20160222",
  "inventor_list": [
    {
      "inventor_name_last": "TULL",
      "inventor_name_first": "Graham",
      "inventor_city": "Exeter",
      "inventor_state": "",
      "inventor_country": "GB"
    }
  ],
  "ipcr_labels": [
    "G06F316",
    "H04R2700"
  ],
  "main_ipcr_label": "G06F316",
  "summary": "<SOH> SUMMARY <EOH>According to an aspect of the present disclosure, there is provided a method of augmenting an ambiently experienced audio content, the method comprising: recording an acoustic audio signal from the ambiently experienced audio content, for example, using a sound transducer, e.g. a microphone; receiving a wireless signal comprising a first audio signal and a second audio signal, the wireless signal received using a first wireless communication system, wherein the first audio signal comprises sound that is also audible or clearly audible within the ambiently experienced audio content and the second audio signal comprises sound that is substantially inaudible or not clearly audible within the ambiently experienced audio content; comparing the first audio signal with the acoustic audio signal to determine a delay between the acoustic audio signal and the first audio signal; delaying the second audio signal by the determined delay; and reproducing the delayed second audio signal at an audible or clearly audible volume, such that it is substantially synchronised with the ambiently experienced audio content. The first audio signal may be configured to correspond to the ambiently experienced audio content. The method may further comprise: delaying the first audio signal by the determined delay; adjusting the relative volumes of the first and second audio signals according to an audio content setting; and reproducing the delayed first and second audio signals at the adjusted volumes, such that they are substantially synchronised with the ambiently experienced audio content. The wireless signal may further comprise one or more additional audio signals. The method may further comprise: delaying the one or more additional audio signals by the determined delay; adjusting the volumes of the one or more additional audio signals, relative to the first and second audio signals, according to the audio content setting; and reproducing the delayed one or more addition...",
  "patent_number": "9841942",
  "abstract": "A method of augmenting an ambiently experienced audio content is provided, the method comprises recording an acoustic audio signal from the ambiently experienced audio content; receiving a wireless signal comprising a first audio signal and a second audio signal, the wireless signal received using a first wireless communication system, wherein the first audio signal comprises sound that is also audible within the ambiently experienced audio content and the second audio signal comprises sound that is substantially inaudible within the ambiently experienced audio content; comparing the first audio signal with the acoustic audio signal to determine a delay between the acoustic audio signal and the first audio signal; delaying the second audio signal by the determined delay; and reproducing the delayed second audio signal at an audible volume, such that it is substantially synchronised with the ambiently experienced audio content. A device and system for augmenting the ambiently experience...",
  "publication_number": "US20170017460A1-20170119",
  "_processing_info": {
    "original_size": 41480,
    "optimized_size": 3538,
    "reduction_percent": 91.47
  }
}