{
  "date_produced": "20160817",
  "publication_number": "US20160253589A1-20160901",
  "main_ipcr_label": "G06N312",
  "decision": "PENDING",
  "application_number": "15048600",
  "inventor_list": [
    {
      "inventor_name_last": "KIM",
      "inventor_name_first": "Ji Sik",
      "inventor_city": "Daegu",
      "inventor_state": "",
      "inventor_country": "KR"
    },
    {
      "inventor_name_last": "SOHN",
      "inventor_name_first": "Kee Sun",
      "inventor_city": "Seoul",
      "inventor_state": "",
      "inventor_country": "KR"
    },
    {
      "inventor_name_last": "LEE",
      "inventor_name_first": "Jin Woong",
      "inventor_city": "Busan",
      "inventor_state": "",
      "inventor_country": "KR"
    }
  ],
  "abstract": "A system for developing a composition for powder molding which, after a viscosity of the composition for powder molding and a degreasing process, extracts optimal compositional information of the composition in terms of the ratios of the residual binder materials is disclosed. Such a system includes a searching logic unit configured, after generating a plurality of candidate compositional information, to extract the optimal compositional information therefrom and a synthesis/analysis module configured to synthesize and analyze compositions corresponding to the plurality of candidate compositional information and provide to the searching logic unit measurement information on the viscosities of the compositions corresponding to each of the plurality of candidate compositional information and ratios of residual binder materials after a degreasing process. Also, the searching logic unit extracts the optimal compositional information based on the candidate compositional information and the ...",
  "filing_date": "20160219",
  "patent_number": "None",
  "summary": "<SOH> SUMMARY OF THE INVENTION <EOH>The present invention is directed to a system and method of developing a composition for powder molding capable of effectively developing a composition powder molding in a short period of time by extracting compositional information on candidate compositions using a genetic algorithm and combining actually synthesized and analyzed information with the extracted compositional information. According to an aspect of the present invention, there is provided a system for developing a composition for powder molding capable of extracting compositional information on the composition in terms of a viscosity of the composition for powder molding and ratios of residual binder materials after a degreasing process. Such a system for developing a composition for powder molding may include a searching logic unit configured to generate a plurality of candidate compositional information and extract the optimal compositional information from the plurality of candidate compositional information, and a synthesis/analysis module configured to synthesize and analyze compositions corresponding to the plurality of candidate compositional information and provide measurement information on viscosities of the compositions corresponding to each of the plurality of candidate compositional information, and ratios of residual binder materials after a degreasing process to the searching logic unit. Here, the searching logic unit may extract the optimal compositional information based on the candidate compositional information and the measurement information on the candidate compositional information.",
  "date_published": "20160901",
  "title": "SYSTEM AND METHOD OF DEVELOPING COMPOSITION FOR POWDER MOLDING",
  "ipcr_labels": [
    "G06N312"
  ],
  "_processing_info": {
    "original_size": 33391,
    "optimized_size": 3454,
    "reduction_percent": 89.66
  }
}