{
  "decision": "PENDING",
  "application_number": "15045043",
  "date_published": "20160818",
  "date_produced": "20160803",
  "title": "APPARATUS AND METHODS FOR DATA COLLECTION, ANALYSIS AND SERVICE MODIFICATION BASED ON ONLINE ACTIVITY",
  "filing_date": "20160216",
  "inventor_list": [
    {
      "inventor_name_last": "Roosenraad",
      "inventor_name_first": "Chris",
      "inventor_city": "Vienna",
      "inventor_state": "VA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Harman",
      "inventor_name_first": "Richard",
      "inventor_city": "Austin",
      "inventor_state": "TX",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Watson",
      "inventor_name_first": "John W.",
      "inventor_city": "Falls Church",
      "inventor_state": "VA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Turner",
      "inventor_name_first": "Christopher",
      "inventor_city": "Leesburg",
      "inventor_state": "VA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Arnhold",
      "inventor_name_first": "Phil",
      "inventor_city": "New York",
      "inventor_state": "NY",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Durham",
      "inventor_name_first": "Brian",
      "inventor_city": "New York",
      "inventor_state": "NY",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Stovall",
      "inventor_name_first": "Barbara",
      "inventor_city": "New York",
      "inventor_state": "NY",
      "inventor_country": "US"
    }
  ],
  "ipcr_labels": [
    "H04L2906",
    "H04L1226",
    "G06F1730",
    "H04L2908"
  ],
  "main_ipcr_label": "H04L2906",
  "summary": "<SOH> SUMMARY <EOH>The present disclosure addresses the foregoing needs by disclosing, inter alia, apparatus and methods for modifying services based on collected data relating to online activity. In one aspect of the disclosure, a computerized system for, inter alia, managing network users is disclosed. In one embodiment, the system comprises a database or group of databases comprised of data drawn and aggregated from multiple sources, and one or more algorithms operative to run on a computerized platform (e.g., server) and configured to rate a particular device and/or user's security or trustworthiness. In one variant, mechanisms are implemented to, based at least on the aforementioned rating, treat a given user or account in a manner differing from other users (e.g., by offering additional services to users and/or devices that have maintained responsible online activity, by causing users who have poor rating to be restricted to types of services that are more resilient to malicious attacks, or even termination of a user as a network subscriber). In a second aspect, a computerized analytics “engine” is disclosed. In one embodiment, the engine comprises a plurality of computer algorithms operative to run on a computerized platform (e.g., server or server farm) and configured to utilize data from a multi-layer data structure to assess individual ones of users of a service provider network (as well as broader logical groups or aggregations of users). In one variant, the engine is disposed on one or more servers within a managed content delivery network and is operative to execute such that substantially real-time analysis and recommendations can be generated for numerous individual subscribers of the network in parallel. In a further aspect, a data architecture and corresponding database is disclosed. In one embodiment, the data architecture comprises a multi-layered architecture having at least first, second, third, and fourth logical layers, each of which can both ...",
  "patent_number": "None",
  "abstract": "Methods and apparatus for evaluating collected data relating to online activity, and modification of services within a service provider network. In one embodiment, a service provider collects data relating to the online activity of users of third-party services and correlates the data with subscribers of the service provider to generate useful products and analytics (e.g., classifications, behavioral models, etc.) containing information relating to the subscribers' online activity. The generated products may be used to determine whether and how to modify services provided to individual subscribers, exported for use by third parties, or for other purposes.",
  "publication_number": "US20160241579A1-20160818",
  "_processing_info": {
    "original_size": 132710,
    "optimized_size": 4186,
    "reduction_percent": 96.85
  }
}