{
  "decision": "ACCEPTED",
  "application_number": "15045628",
  "date_published": "20160609",
  "date_produced": "20160525",
  "title": "HAPTIC FEEDBACK ASSEMBLY",
  "filing_date": "20160217",
  "inventor_list": [
    {
      "inventor_name_last": "Patel",
      "inventor_name_first": "Dhaval Chandrakant",
      "inventor_city": "Cupertino",
      "inventor_state": "CA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Harley",
      "inventor_name_first": "Jonah A.",
      "inventor_city": "Cupertino",
      "inventor_state": "CA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Augenbergs",
      "inventor_name_first": "Peteris K.",
      "inventor_city": "Cupertino",
      "inventor_state": "CA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Davis",
      "inventor_name_first": "Derryk C.",
      "inventor_city": "Cupertino",
      "inventor_state": "CA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "McEuen",
      "inventor_name_first": "Scott J.",
      "inventor_city": "Cupertino",
      "inventor_state": "CA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Brock",
      "inventor_name_first": "John M.",
      "inventor_city": "Menlo Park",
      "inventor_state": "CA",
      "inventor_country": "US"
    }
  ],
  "ipcr_labels": [
    "G06F301",
    "G06F3041"
  ],
  "main_ipcr_label": "G06F301",
  "summary": "<SOH> SUMMARY <EOH>Tactile feedback may be provided using an actuator connected to a touchpad. The actuator may be controlled by actuator drive signals. As a user of an electronic device interacts with the touch pad, the user may make gestures and perform other touch-related tasks. When the user desires to select an on-screen object or perform other tasks of the type traditionally associated with button or keypad actuation events, the user may press downwards against the surface of the track pad. When sufficient force is detected, appropriate action may be taken and drive signals may be applied to the actuator. The actuator may impart movement to the touch pad. For example, the actuator may drive a coupling member into an edge of the planar touch pad member. Flexible pads may be formed under the force sensors to help allow the touch pad member to move laterally (in-plane with respect to the plane of the planar touch pad member) when the actuator is in operation. This may improve actuator efficiency. The actuator may move the touch pad in response to button press and release events or in response to satisfaction of other criteria in the electronic device. One embodiment of the present disclosure may take the form of a method for providing haptic feedback in an electronic device. The method includes sensing a first input force by a sensor and providing, via a feedback mechanism, a first feedback corresponding to the first input force, sensing a second input force by the sensor that is at least partially in an opposite direction from the first input force, and providing, via the feedback mechanism, a second feedback corresponding to the second input force. Another embodiment of the present disclosure may take the form of a haptic device for an electronic device. The haptic device includes a sensor configured to sense a user input and a feedback mechanism in communication with the sensor. The feedback mechanism is configured to provide feedback to a user. The feedback m...",
  "patent_number": "9772688",
  "abstract": "A haptic feedback assembly includes interconnections for mechanically and electrically securing a haptic actuator in a track pad assembly so as to securely and efficiently provide haptic feedback to a user.",
  "publication_number": "US20160162030A1-20160609",
  "_processing_info": {
    "original_size": 48749,
    "optimized_size": 3496,
    "reduction_percent": 92.83
  }
}