{
  "date_produced": "20170802",
  "publication_number": "US20170236067A1-20170817",
  "main_ipcr_label": "G06N9900",
  "decision": "PENDING",
  "application_number": "15042797",
  "inventor_list": [
    {
      "inventor_name_last": "Tjiong",
      "inventor_name_first": "Ching Lung",
      "inventor_city": "Round Rock",
      "inventor_state": "TX",
      "inventor_country": "US"
    }
  ],
  "abstract": "An analytic rule generation application is integrated into an electronic customer technical support system to enable those using the customer technical support center systems to build custom analytic rules, on demand, for use in diagnosing and detecting issues at customer process plant sites, without having to submit a request to a developer and wait for one or more new rules to be provided in future releases of the customer technical support system. The analytic rule builder can be used by local offices and local technology groups if need be, or can be used by personnel at customer sites. The custom analytic rules created using the rule builder application can be shared among the engineers using the electronic customer technical support system to empower local engineers to immediately use newly created rules. Still further, the analytic rule builder can be used in an online support system within a process plant, where on-site engineers can build custom analytic rules to monitor certai...",
  "filing_date": "20160212",
  "patent_number": "None",
  "summary": "<SOH> SUMMARY <EOH>An analytic rule builder system or application is provided for and is integrated into an electronic customer technical support system that enables those using the customer technical support system to build his or her own custom analytic rules, on demand, for use in diagnosing and detecting issues at a customer process plant site, without having to submit a request to a developer and wait for one or more new rules to be provided in future releases of the customer technical support system. The analytic rule builder can also be used by local offices and local technology groups, if need be, or can be used by personnel at customer sites. The custom analytic rules can be shared among engineers using the electronic customer technical support system to empower local engineers or users to generate and immediately use new rules. Moreover, rules created in a distributed manner by local groups or users can be provided to a centralized system for distribution to other users, and can be used to enable developers to understand what analytic rules are being created by local users. Still further, the analytic rule builder can be used in an online support system where on-site engineers build one or more custom analytic rules to monitor certain data stream or events within the plant control system and use the rules to trigger some actions within the plant, upon the detection of the events, such as setting alarms, collecting and analyzing additional data, etc. In one embodiment, a rule builder application provides a structured environment for graphically creating or programming new analytic rules which, for example, may be configured to use or analyze data from any of many different computer systems and applications within a process plant, including for example, computer hardware and network configuration applications, plant asset configuration and control applications, process plant control or diagnostic systems, etc. Moreover, the data used in the rules may include...",
  "date_published": "20170817",
  "title": "Rule Builder in a Process Control Network",
  "ipcr_labels": [
    "G06N9900",
    "G06N504"
  ],
  "_processing_info": {
    "original_size": 175981,
    "optimized_size": 3551,
    "reduction_percent": 97.98
  }
}