{
  "decision": "ACCEPTED",
  "application_number": "15042505",
  "date_published": "20161020",
  "date_produced": "20161005",
  "title": "DISPLAY DEVICE",
  "filing_date": "20160212",
  "inventor_list": [
    {
      "inventor_name_last": "KO",
      "inventor_name_first": "Gwang-bum",
      "inventor_city": "Seongnam-si",
      "inventor_state": "",
      "inventor_country": "KR"
    },
    {
      "inventor_name_last": "NA",
      "inventor_name_first": "Hyunjae",
      "inventor_city": "Seoul",
      "inventor_state": "",
      "inventor_country": "KR"
    },
    {
      "inventor_name_last": "JANG",
      "inventor_name_first": "Hyoungwook",
      "inventor_city": "Anyang-si",
      "inventor_state": "",
      "inventor_country": "KR"
    }
  ],
  "ipcr_labels": [
    "G06F3041",
    "G06F116",
    "G09G332"
  ],
  "main_ipcr_label": "G06F3041",
  "summary": "<SOH> SUMMARY <EOH>Exemplary embodiments provide a display device including a display panel and a touch panel, each including lines disposed in a ring pattern. Additional aspects will be set forth in the detailed description which follows, and, in part, will be apparent from the disclosure, or may be learned by practice of the inventive concept. Exemplary embodiments disclose a display device including a substrate, a plurality of gate lines disposed on the substrate and extending in a first direction, a plurality of data lines insulated from the gate lines and extending in a second direction crossing the first direction, and a plurality of pixels connected to the gate lines and the data lines. At least one line of the gate lines and the data lines includes a plurality of ring patterns arranged in a direction in which the one line extends, and two ring patterns adjacent to each other among the ring patterns may be connected to each other at least one position. Exemplary embodiments also disclose, a display device including a folding area and an nonfolding area. The display device includes a display panel including a first signal line disposed in the folding area and a touch panel including a second signal line disposed in the folding area. At least one signal line of the first and second signal lines includes a plurality of ring patterns arranged in a direction in which the one signal line extends, and two ring patterns adjacent to each other among the ring patterns may be connected to each other at least one position. The foregoing general description and the following detailed description are exemplary and explanatory and are intended to provide further explanation of the claimed subject matter.",
  "patent_number": "9927897",
  "abstract": "A display device includes a substrate, gate lines disposed on the substrate and extending in a first direction, data lines insulated from the gate lines and extending in a second direction crossing the first direction, pixels electrically connected to the gate lines and the data lines, wherein at least one line of the gate lines and the data lines comprises a ring pattern, wherein the ring pattern comprises rings and adjacent rings are electrically connected to each other in at least one position.",
  "publication_number": "US20160306476A1-20161020",
  "_processing_info": {
    "original_size": 52521,
    "optimized_size": 3039,
    "reduction_percent": 94.21
  }
}