{
  "date_produced": "20160525",
  "publication_number": "US20160162778A1-20160609",
  "main_ipcr_label": "G06N3063",
  "decision": "ACCEPTED",
  "application_number": "15043229",
  "inventor_list": [
    {
      "inventor_name_last": "Cantwell",
      "inventor_name_first": "Dermot",
      "inventor_city": "Sunnyvale",
      "inventor_state": "CA",
      "inventor_country": "US"
    }
  ],
  "abstract": "A method and system for analysis of data, including creating a first node, determining a first hyper-cube for the first node, determining whether a sample resides within the first hyper-cube. If the sample does not reside within the first hyper-cube, the method includes determining whether the sample resides within a first hyper-sphere, wherein the first hyper-sphere has a radius equal to a diagonal of the first hyper-cube.",
  "filing_date": "20160212",
  "patent_number": "9852371",
  "summary": "<SOH> BRIEF DESCRIPTION OF THE DRAWINGS <EOH>The present disclosure is illustrated by way of example, and not by way of limitation, in the figures of the accompanying drawings. FIG. 1 illustrates one embodiment of a network architecture. FIG. 2 illustrates one embodiment of a method for RBF network and hyper-cube analysis. FIG. 3 illustrates another embodiment of a method for RBF network and hyper-cube analysis. FIG. 4 illustrates an exemplary RBF network. FIG. 5 illustrates an exemplary RBF network for semi-conductor processing equipment. FIG. 6 illustrates false negative results for an RBF network. FIG. 7 illustrates false positive results for an RBF network. FIG. 8 illustrates an embodiment of an RBF network and hyper-cube analysis. FIG. 9 illustrates an embodiment of an excursion in an RBF network and hyper-cube analysis. FIG. 10 illustrates an embodiment of an excursion in an RBF network and hyper-cube analysis. FIG. 11 illustrates an embodiment of excursions in an RBF network and hyper-cube analysis. FIG. 12 illustrates an embodiment of creation of a hyper-cube and a hyper-sphere. FIG. 13 illustrates an embodiment of confidence estimation. FIGS. 14A, 14B, 14C, 14D, and 14E illustrate exemplary sensor data. FIGS. 15A and 15B illustrate exemplary sensor data. FIG. 16 illustrates an exemplary RBF network. FIG. 17 illustrates an exemplary computer system. FIG. 18 illustrates an embodiment of confidence estimation. detailed-description description=\"Detailed Description\" end=\"lead\"?",
  "date_published": "20160609",
  "title": "USING RADIAL BASIS FUNCTION NETWORKS AND HYPER-CUBES FOR EXCURSION CLASSIFICATION IN SEMI-CONDUCTOR PROCESSING EQUIPMENT",
  "ipcr_labels": [
    "G06N3063",
    "G06N308"
  ],
  "_processing_info": {
    "original_size": 44447,
    "optimized_size": 2563,
    "reduction_percent": 94.23
  }
}