{
  "date_produced": "20170809",
  "publication_number": "US20170243110A1-20170824",
  "main_ipcr_label": "G06N308",
  "decision": "PENDING",
  "application_number": "15046894",
  "inventor_list": [
    {
      "inventor_name_last": "Zamora Esquivel",
      "inventor_name_first": "Julio C.",
      "inventor_city": "Zapopan",
      "inventor_state": "",
      "inventor_country": "MX"
    },
    {
      "inventor_name_last": "Ibarra von Borstel",
      "inventor_name_first": "Alejandro",
      "inventor_city": "Tlajomuclo",
      "inventor_state": "",
      "inventor_country": "MX"
    },
    {
      "inventor_name_last": "Flores Fajardo",
      "inventor_name_first": "Carlos A.",
      "inventor_city": "Tlaquepaque",
      "inventor_state": "",
      "inventor_country": "MX"
    },
    {
      "inventor_name_last": "Lopez Meyer",
      "inventor_name_first": "Paulo",
      "inventor_city": "Zapopan",
      "inventor_state": "",
      "inventor_country": "MX"
    },
    {
      "inventor_name_last": "Wu",
      "inventor_name_first": "Xiaoyun May",
      "inventor_city": "Shanghai",
      "inventor_state": "",
      "inventor_country": "CN"
    }
  ],
  "abstract": "Technologies for using a shifted neural network include a compute device to determine a shift-based activation function of the shifted neural network. The shift-based activation function is a piecewise linear approximation of a transcendental activation function and is defined by a plurality of line segments such that a corresponding slope of each line segment is a power of two. The compute device further trains the shifted neural network based on shift-based input weights and the determined shift-based activation function.",
  "filing_date": "20160218",
  "patent_number": "None",
  "summary": "<SOH> BRIEF DESCRIPTION OF THE DRAWINGS <EOH>The concepts described herein are illustrated by way of example and not by way of limitation in the accompanying figures. For simplicity and clarity of illustration, elements illustrated in the figures are not necessarily drawn to scale. Where considered appropriate, reference labels have been repeated among the figures to indicate corresponding or analogous elements. FIG. 1 is a simplified block diagram of at least one embodiment of a compute device for using a shifted neural network; FIG. 2 is a simplified block diagram of at least one embodiment of an environment of a compute device of FIG. 1 ; FIG. 3 is a simplified flow diagram of at least one embodiment of a method for using a shifted neural network that may be executed by the compute device of FIG. 1 ; FIG. 4 is a simplified flow diagram of at least one embodiment of a method of determining a shift-based activation function for the shifted neural network; and FIG. 5 is a simplified graph illustrating the determination of a piecewise linear approximation of a transcendental activation function for the shifted neural network. detailed-description description=\"Detailed Description\" end=\"lead\"?",
  "date_published": "20170824",
  "title": "TECHNOLOGIES FOR SHIFTED NEURAL NETWORKS",
  "ipcr_labels": [
    "G06N308"
  ],
  "_processing_info": {
    "original_size": 50462,
    "optimized_size": 2887,
    "reduction_percent": 94.28
  }
}