{
  "decision": "PENDING",
  "application_number": "15044982",
  "date_published": "20160818",
  "date_produced": "20160803",
  "title": "EMPLOYMENT MATCHING SYSTEM AND DEVICES",
  "filing_date": "20160216",
  "inventor_list": [
    {
      "inventor_name_last": "Benham",
      "inventor_name_first": "Lydia",
      "inventor_city": "Edmond",
      "inventor_state": "OK",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Benham",
      "inventor_name_first": "David",
      "inventor_city": "Edmond",
      "inventor_state": "OK",
      "inventor_country": "US"
    }
  ],
  "ipcr_labels": [
    "G06Q1010"
  ],
  "main_ipcr_label": "G06Q1010",
  "summary": "<SOH> SUMMARY OF THE INVENTION <EOH>Described herein is an employment matching system. The preferred embodiment of this system includes a job seeker mobile device, an employer mobile device, and a central system server. The job seeker mobile device includes a location detection module, a user interface, a processor, a network connection module and a data storage medium. Each of these components of the job seek mobile device may be configured to communicate with each other. The data storage medium preferably includes executable instructions that direct the processor to display certain screens on the user interface. Based upon selection on the those screens, information and data may be generated that are stored by the processor as system data in the data storage medium. The screens displayed on the user interface can generally be categorized into job seeker screens and employer screens, although some screens may be used by both job seekers and employers. In the preferred embodiment of the employment matching system, the employer mobile device include the same components as described above for the job seeker mobile device. It will be understood that other embodiments are possible and included within the description provided below.",
  "patent_number": "None",
  "abstract": "A system for matching a job seeker with an employer. The system includes a first mobile device and second mobile device. Each device may include a location detection module, a user interface, a network connection module, a processor and a data storage medium that includes executable instructions and system data. The executable instructions are structured to direct the processor to present interactive screens on the user interface. Through the navigation of such screens, a job seeker can identify job posts of interest, apply for jobs, schedule interviews, and request recommendations from referral sources.",
  "publication_number": "US20160239806A1-20160818",
  "_processing_info": {
    "original_size": 48055,
    "optimized_size": 2523,
    "reduction_percent": 94.75
  }
}