{
  "decision": "PENDING",
  "application_number": "15048734",
  "date_published": "20170824",
  "date_produced": "20170809",
  "title": "Electronic Purchase and Charge Exemption System",
  "filing_date": "20160219",
  "inventor_list": [
    {
      "inventor_name_last": "Li",
      "inventor_name_first": "Junsheng",
      "inventor_city": "Dalian",
      "inventor_state": "",
      "inventor_country": "CN"
    },
    {
      "inventor_name_last": "Li",
      "inventor_name_first": "Yinqiu",
      "inventor_city": "Dalian",
      "inventor_state": "",
      "inventor_country": "CN"
    }
  ],
  "ipcr_labels": [
    "G06Q3006"
  ],
  "main_ipcr_label": "G06Q3006",
  "summary": "<SOH> SUMMARY <EOH>This invention relates to a system and method for allowing purchasers to make electronic purchases with a chance for a charge exemption. A charge exemption allows a purchaser to purchase goods or services by paying only a fraction of the full price. This system entices more users to use the system than would otherwise because a charge exemption is an exciting way to potentially acquire goods or services at a reduced price. These as well as other aspects, advantages, and alternatives, will become apparent to those of ordinary skill in the art by reading the following detailed description, with reference where appropriate to the accompanying drawings.",
  "patent_number": "None",
  "abstract": "This invention is a system and method for allowing a purchaser to make attempts for charge exemption when buying merchandise or services via a shopping platform over a communication network so they do not have to commit to paying the full price of the selected merchandise or service. A purchaser selects a certain merchandise or service at a client system. The client system transmits information about the selection to a server system. The server system computes whether the charge exemption is approved. The purchaser is allowed to continue making attempts until either he/she is approved or he/she uses up the allowed number of attempts. However, even if the purchaser does not win, he/she is allowed to pay the full price and purchase the item. If any of the purchaser's attempts are successful, or if the purchaser chooses to pay the full price of the item, the item is purchased.",
  "publication_number": "US20170243265A1-20170824",
  "_processing_info": {
    "original_size": 29612,
    "optimized_size": 2228,
    "reduction_percent": 92.48
  }
}