{
  "decision": "PENDING",
  "application_number": "15044486",
  "date_published": "20160609",
  "date_produced": "20160525",
  "title": "PUSH-BASED RECOMMENDATIONS",
  "filing_date": "20160216",
  "inventor_list": [
    {
      "inventor_name_last": "Koukoumidis",
      "inventor_name_first": "Emmanouil",
      "inventor_city": "Bellevue",
      "inventor_state": "WA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Beckman",
      "inventor_name_first": "Brian",
      "inventor_city": "Newcastle",
      "inventor_state": "WA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Whittaker",
      "inventor_name_first": "James Anthony",
      "inventor_city": "Woodinville",
      "inventor_state": "WA",
      "inventor_country": "US"
    }
  ],
  "ipcr_labels": [
    "G06Q3006"
  ],
  "main_ipcr_label": "G06Q3006",
  "summary": "<SOH> SUMMARY <EOH>This Summary is provided to introduce a selection of concepts in a simplified form that are further described below in the Detailed Description. This Summary is not intended to identify key factors or essential features of the claimed subject matter, nor is it intended to be used to limit the scope of the claimed subject matter. Among other things, one or more systems and/or techniques for pushing a recommendation to a user are provided herein. The recommendation may be pushed to the user (e.g., without user solicitation) based upon a triggering event associated with the user. For example, a set of triggering events may be defined based upon observed user behavior (e.g., the user regularly calls his sister on Tuesday afternoon, the user gets ice cream on Fridays if the temperature is above 80°, the user will only detour for a gas station if the price of gas is more than 20 cents cheaper than a more conveniently located gas station, etc.), a change in a real world value (e.g., the temperature rises above 80°, a location of the user is near a particular landmark, a vehicle of the user is low on gas, etc.), an email indicating that an event is to occur, social network event data (e.g., the user's sister has an event scheduled through a social network that may prevent her from being available for Tuesday afternoon's phone call), and/or a variety of other observations associated with the user and/or aggregated from other users. In this way, an occurrence of a triggering event associated with the user may be identified. One or more suggested entities corresponding to the triggering event may be determined. In one example, responsive to a Friday post office visit triggering event associated with observed user behavior (e.g., the user generally visits a post office after work on Fridays), one or more post offices may be determined as the one or more suggested entities. In another example, responsive to a phone call triggering event associated with observe...",
  "patent_number": "None",
  "abstract": "Among other things, one or more techniques and/or systems are provided for pushing a recommendation to a user. That is, a recommendation may be pushed to a device of the user based upon a triggering event associated with the user. The recommendation may be provided, for example, without user solicitation for the recommendation. In one example, a recommendation component may observe that the user frequently stops for ice cream on Fridays after work (e.g., based upon prior social network check-ins). Accordingly, on the following Friday, the recommendation component may push a recommendation to the user's device to visit a particular grocery store on the way home from work that is within 10 minutes of the user's home so that the user can avoid melting ice cream (e.g., a location constraint may be applied to choose a grocery store that is relatively close to the user's home).",
  "publication_number": "US20160162976A1-20160609",
  "_processing_info": {
    "original_size": 59788,
    "optimized_size": 3724,
    "reduction_percent": 93.77
  }
}