{
  "decision": "ACCEPTED",
  "application_number": "15044652",
  "date_published": "20160609",
  "date_produced": "20160525",
  "title": "ELECTRONIC ASSEMBLY COMPRISING A DISABLING MODULE",
  "filing_date": "20160216",
  "inventor_list": [
    {
      "inventor_name_last": "Bousquet",
      "inventor_name_first": "Nicolas",
      "inventor_city": "Colombes",
      "inventor_state": "",
      "inventor_country": "FR"
    },
    {
      "inventor_name_last": "Sierra",
      "inventor_name_first": "Yannick",
      "inventor_city": "Colombes",
      "inventor_state": "",
      "inventor_country": "FR"
    }
  ],
  "ipcr_labels": [
    "G06F2156"
  ],
  "main_ipcr_label": "G06F2156",
  "summary": "<SOH> Objective and Summary of the Invention <EOH>The present invention mainly sets out to solve the above-mentioned drawbacks. For this purpose the invention concerns an electronic assembly for electronic device, a trusted operating system and a Rich-OS operating system memorised in a memory of this electronic assembly executed thereupon, and the electronic assembly comprising a module detecting a security anomaly of the Rich-OS operating system and a module to disable at least one secure function of the terminal in response to this detected anomaly, these two modules being implementation-dependent on the trusted operating system, the disablement nevertheless allowing use of the electronic device in fail-soft mode. The invention also concerns a method for securing an electronic device on which a trusted operating system and a Rich-OS operating system are executed. The implementation of this method is dependent on the trusted operating system and comprises a step to detect an anomaly of the Rich-OS operating system and, in response to this detection step, a step to disable at least one secure function of the electronic device. The disablement step nevertheless allows use of the electronic device in fail-soft mode. The invention additionally concerns a terminal comprising an electronic assembly such as aforementioned. This terminal may a mobile telephone for example but also a touchpad or laptop computer. As a variant, the terminal may be a self-standing or embedded intelligent system widely used in architectures of machine-to-machine type, such as the on-board computer of a vehicle for example. As a variant it may be smartcard. The invention therefore enables a user of a device to make use thereof in secure manner, firstly because the invention provides for securing of the device when a security anomaly is detected, and secondly because securing of the device nonetheless allows the user to use some functions of the device which then functions in fail-soft mode. Sinc...",
  "patent_number": "9817972",
  "abstract": "An electronic assembly for an electronic device may include a detection module to detect a security anomaly of a Rich-OS operating system and a disabling module to disable at least one secure function of the electronic device in response to the detection. The disablement nevertheless allows use of the electronic device in fail-soft mode. The electronic assembly may be implemented such that these two modules are dependent on a trusted operating system, and the trusted operating system and the Rich-OS operating system may be stored in a memory of the electronic assembly and executed on the electronic assembly.",
  "publication_number": "US20160162687A1-20160609",
  "_processing_info": {
    "original_size": 37964,
    "optimized_size": 3304,
    "reduction_percent": 91.3
  }
}