{
  "decision": "PENDING",
  "application_number": "15043251",
  "date_published": "20160825",
  "date_produced": "20160810",
  "title": "GATHERING MATERIALS ON THE OCEAN SURFACE BASED ON FORECASTING AREA DENSITY",
  "filing_date": "20160212",
  "inventor_list": [
    {
      "inventor_name_last": "Jacobs",
      "inventor_name_first": "Gregg Arthur",
      "inventor_city": "Slidell",
      "inventor_state": "LA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Kirwan, JR.",
      "inventor_name_first": "A. D.",
      "inventor_city": "Newark",
      "inventor_state": "DE",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Huntley",
      "inventor_name_first": "Helga S.",
      "inventor_city": "Newark",
      "inventor_state": "DE",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Lipphardt, JR.",
      "inventor_name_first": "Bruce L.",
      "inventor_city": "Newark",
      "inventor_state": "DE",
      "inventor_country": "US"
    }
  ],
  "ipcr_labels": [
    "G06F1750",
    "G06F1711"
  ],
  "main_ipcr_label": "G06F1750",
  "summary": "<SOH> SUMMARY <EOH>Embodiments relate to gathering materials on an ocean surface. Initially, an initial distribution of material is determined based on observational sources, and the material is represented by particles in a numerical ocean model. Trajectories for the numerical ocean model are determined based on modeled surface currents data, and velocity gradients are computed along a corresponding trajectory of the trajectories for each of the particles based on the initial distribution. At this stage, deformation tensors are computed for each of the particles based on the velocity gradients, and a dilation map for the particles is generated based on a time step tensor of the plurality of deformation tensors for each of the particles. Collection of the material is monitored based on the dilation map.",
  "patent_number": "None",
  "abstract": "Embodiments relate to gathering materials on an ocean surface. Initially, an initial distribution of material is determined based on observational sources, and the material is represented by particles in a numerical ocean model. Trajectories for the numerical ocean model are determined based on modeled surface currents data, and velocity gradients are computed along a corresponding trajectory of the trajectories for each of the particles based on the initial distribution. At this stage, deformation tensors are computed for each of the particles based on the velocity gradients, and a dilation map for the particles is generated based on a time step tensor of the plurality of deformation tensors for each of the particles. Collection of the material is monitored based on the dilation map.",
  "publication_number": "US20160246903A1-20160825",
  "_processing_info": {
    "original_size": 29375,
    "optimized_size": 2636,
    "reduction_percent": 91.03
  }
}