{
  "date_produced": "20170603",
  "publication_number": "US20170169358A1-20170615",
  "main_ipcr_label": "G06N9900",
  "decision": "PENDING",
  "application_number": "15040954",
  "inventor_list": [
    {
      "inventor_name_last": "CHOI",
      "inventor_name_first": "Inseok Stephen",
      "inventor_city": "Redwood City",
      "inventor_state": "CA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "KI",
      "inventor_name_first": "Yang Seok",
      "inventor_city": "Palo Alto",
      "inventor_state": "CA",
      "inventor_country": "US"
    }
  ],
  "abstract": "A storage device includes a processor, a storage and a communication interface. The storage is configure to store local data and a first set of machine learning instructions, and the processor is configured to perform machine learning on the local data using the first set of machine learning instructions and generate or update a machine learning model after performing the machine learning on the local data. The communication interface is configured to send an update message including the generated or updated machine learning model to other storage devices.",
  "filing_date": "20160210",
  "patent_number": "None",
  "summary": "<SOH> SUMMARY <EOH>According to one embodiment, a storage device includes a processor, a storage and a communication interface. The storage is configure to store local data and a first set of machine learning instructions, and the processor is configured to perform machine learning on the local data using the first set of machine learning instructions and generate or update a machine learning model after performing the machine learning on the local data. The communication interface is configured to send an update message including the generated or updated machine learning model to other storage devices. According to one embodiment, a method includes: storing local data and a first set of machine learning instructions in a storage device; performing machine learning on the local data using the first set of machine learning instructions; generating and updating a machine learning model; and sending an update message including the generated or updated machine learning model to other storage devices. The above and other preferred features, including various novel details of implementation and combination of events, will now be more particularly described with reference to the accompanying figures and pointed out in the claims. It will be understood that the particular systems and methods described herein are shown by way of illustration only and not as limitations. As will be understood by those skilled in the art, the principles and features described herein may be employed in various and numerous embodiments without departing from the scope of the present disclosure.",
  "date_published": "20170615",
  "title": "IN-STORAGE COMPUTING APPARATUS AND METHOD FOR DECENTRALIZED MACHINE LEARNING",
  "ipcr_labels": [
    "G06N9900",
    "G06F1730"
  ],
  "_processing_info": {
    "original_size": 65599,
    "optimized_size": 2884,
    "reduction_percent": 95.6
  }
}