{
  "date_produced": "20160525",
  "publication_number": "US20160162808A1-20160609",
  "main_ipcr_label": "G06N9900",
  "decision": "ACCEPTED",
  "application_number": "15043788",
  "inventor_list": [
    {
      "inventor_name_last": "Feng",
      "inventor_name_first": "Junlan",
      "inventor_city": "Basking Ridge",
      "inventor_state": "NJ",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Barbosa",
      "inventor_name_first": "Luciano De Andrade",
      "inventor_city": "Madison",
      "inventor_state": "NJ",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Chang",
      "inventor_name_first": "Hisao",
      "inventor_city": "Cedar Park",
      "inventor_state": "TX",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Renger",
      "inventor_name_first": "Bernard S.",
      "inventor_city": "New Providence",
      "inventor_state": "NJ",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Dan",
      "inventor_name_first": "Ovidiu",
      "inventor_city": "Bethlehem",
      "inventor_state": "PA",
      "inventor_country": "US"
    }
  ],
  "abstract": "A system that incorporates teachings of the present disclosure may operate, for example, obtaining a number of blogs including an initial set of annotated blogs and unannotated blogs. The initial set of annotated blogs are annotated as being either relevant to a selected media program or not relevant to the selected media program. A set of features is determined associating the selected media program with the unannotated blogs and a trained classifier is generated based on the set of features. The trained classifier is applied to the blogs to identify a subset of blogs relevant to the selected media program. An analysis is performed on the selected blogs to determine a trend related to the selected media program and a graphical user interface is presented that concurrently presents the selected blogs, the trend, and the selected media program. Other embodiments are disclosed.",
  "filing_date": "20160215",
  "patent_number": "10032118",
  "summary": "<SOH> BRIEF DESCRIPTION OF THE DRAWINGS <EOH>FIGS. 1-2 depict illustrative embodiments of communication systems that provide media services; FIG. 3 depicts an illustrative embodiment of a web portal for interacting with the communication systems of FIGS. 1-2 ; FIG. 4 depicts an illustrative embodiment of a communication device utilized in the communication systems of FIGS. 1-2 ; FIG. 5 depicts an illustrative embodiment of a system for processing micro-blogs; FIGS. 6-8 depict illustrative embodiments for presenting graphical user interfaces by way of a media processor; FIG. 9 depicts an illustrative embodiment of a method operating in portions of the systems described in FIGS. 1-5 ; and FIG. 10 is a diagrammatic representation of a machine in the form of a computer system within which a set of instructions, when executed, may cause the machine to perform any one or more of the methods described herein. detailed-description description=\"Detailed Description\" end=\"lead\"?",
  "date_published": "20160609",
  "title": "METHOD AND APPARATUS FOR ASSOCIATING MICRO-BLOGS WITH MEDIA PROGRAMS",
  "ipcr_labels": [
    "G06N9900",
    "H04L1258",
    "G06F1730"
  ],
  "_processing_info": {
    "original_size": 65827,
    "optimized_size": 3066,
    "reduction_percent": 95.34
  }
}