{
  "date_produced": "20160727",
  "publication_number": "US20160232457A1-20160811",
  "main_ipcr_label": "G06N9900",
  "decision": "PENDING",
  "application_number": "15042086",
  "inventor_list": [
    {
      "inventor_name_last": "Gray",
      "inventor_name_first": "Alexander",
      "inventor_city": "Santa Clara",
      "inventor_state": "CA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Nelson",
      "inventor_name_first": "Christopher",
      "inventor_city": "Los Altos",
      "inventor_state": "CA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Rodeski",
      "inventor_name_first": "Vladimir",
      "inventor_city": "San Jose",
      "inventor_state": "CA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Kite",
      "inventor_name_first": "Lawrence",
      "inventor_city": "Los Gatos",
      "inventor_state": "CA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Kumar",
      "inventor_name_first": "Nitesh",
      "inventor_city": "Milpitas",
      "inventor_state": "CA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Gibiansky",
      "inventor_name_first": "Maxsim",
      "inventor_city": "Sunnyvale",
      "inventor_state": "CA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Chawla",
      "inventor_name_first": "Sachinder",
      "inventor_city": "Palo Alto",
      "inventor_state": "CA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Song",
      "inventor_name_first": "Philip",
      "inventor_city": "San Jose",
      "inventor_state": "CA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Aditya",
      "inventor_name_first": "Abhimanyu",
      "inventor_city": "San Jose",
      "inventor_state": "CA",
      "inventor_country": "US"
    }
  ],
  "abstract": "A system and method for providing various user interfaces is disclosed. In one embodiment, the various user interfaces include a series of user interfaces that guide a user through the machine learning process. In one embodiment, the various user interfaces are associated with a unified, project-based data scientist workspace to visually prepare, build, deploy, visualize and manage models, their results and datasets.",
  "filing_date": "20160211",
  "patent_number": "None",
  "summary": "<SOH> SUMMARY OF THE INVENTION <EOH>The present invention overcomes one or more of the deficiencies of the prior art at least in part by providing a system and method for providing a unified, project-based data scientist workspace to visually prepare, build, deploy, visualize and manage models, their results and datasets. According to one innovative aspect of the subject matter described in this disclosure, a system comprising one or more processors; and a memory including instructions that, when executed by the one or more processors, cause the system to: generate a data import interface for presentation to a user, the data import interface including a first set of one or more graphical elements that receive user interaction defining a dataset to be imported; generate a machine learning model creation interface for presentation to the user, the machine learning model creation interface including a second set of one or more graphical elements that receive user interaction defining a model to be generated; generate a model testing interface for presentation to the user, the model testing interface including a third set of one or more graphical elements defining a model to be tested and a test dataset; and generate a results interface for presentation to the user, the results interface including a fourth set of graphical elements informing the user of results obtained by testing the model to be tested with the test dataset. In general, another innovative aspect of the subject matter described in this disclosure may be embodied in methods that include generating, using one or more processors, a data import interface for presentation to a user, the data import interface including a first set of one or more graphical elements that receive user interaction defining a dataset to be imported; generating, using the one or more processors, a machine learning model creation interface for presentation to the user, the machine learning model creation interface including a second...",
  "date_published": "20160811",
  "title": "User Interface for Unified Data Science Platform Including Management of Models, Experiments, Data Sets, Projects, Actions and Features",
  "ipcr_labels": [
    "G06N9900",
    "G06F1730",
    "G06F30482",
    "G06F30484",
    "G06T1120"
  ],
  "_processing_info": {
    "original_size": 166691,
    "optimized_size": 4285,
    "reduction_percent": 97.43
  }
}