{
  "date_produced": "20160810",
  "publication_number": "US20160247083A1-20160825",
  "main_ipcr_label": "G06N700",
  "decision": "PENDING",
  "application_number": "15041291",
  "inventor_list": [
    {
      "inventor_name_last": "Adoni",
      "inventor_name_first": "Siddique M.",
      "inventor_city": "Bangalore",
      "inventor_state": "",
      "inventor_country": "IN"
    },
    {
      "inventor_name_last": "Nahamoo",
      "inventor_name_first": "David",
      "inventor_city": "Great Neck",
      "inventor_state": "NY",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Nesbitt",
      "inventor_name_first": "Pamela A.",
      "inventor_city": "Ridgefield",
      "inventor_state": "CT",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Shanmugam",
      "inventor_name_first": "Dhandapani",
      "inventor_city": "Bangalore",
      "inventor_state": "",
      "inventor_country": "IN"
    }
  ],
  "abstract": "Generating recommendations for an individual based on a mood of the individual. Receiving information corresponding to one or more activities associated with an individual over a period of time. The received information corresponding to the one or more activities associated with the individual is processed to detect a mood of the individual. A recommendation is generated for the individual based on the detected mood of the individual and a future event associated with the individual. The future event has an occurrence at a later time instance.",
  "filing_date": "20160211",
  "patent_number": "None",
  "summary": "<SOH> SUMMARY <EOH>According to embodiments of the present invention, provided is a system, a computer program product and a method for generating a recommendation for an individual based on a mood of the individual. The method comprises receiving information corresponding to one or more activities associated with an individual over a period of time. The method further comprises processing the information corresponding to one or more activities associated with the individual to detect an emotional state of the individual. The method further comprises generating a recommendation for the individual based on the detected emotional state of the individual and a future event associated with the individual, wherein the future event has an occurrence at a later time instance.",
  "date_published": "20160825",
  "title": "RECOMMENDATION FOR AN INDIVIDUAL BASED ON A MOOD OF THE INDIVIDUAL",
  "ipcr_labels": [
    "G06N700",
    "G06F954"
  ],
  "_processing_info": {
    "original_size": 42367,
    "optimized_size": 2345,
    "reduction_percent": 94.47
  }
}