{
  "decision": "ACCEPTED",
  "application_number": "15048237",
  "date_published": "20160922",
  "date_produced": "20160908",
  "title": "EVALUATION OF MODELS GENERATED FROM OBJECTS IN VIDEO",
  "filing_date": "20160219",
  "inventor_list": [
    {
      "inventor_name_last": "Zimerman",
      "inventor_name_first": "Gadi",
      "inventor_city": "Hod-Hasharon",
      "inventor_state": "",
      "inventor_country": "IL"
    },
    {
      "inventor_name_last": "Horovitz",
      "inventor_name_first": "Itsik",
      "inventor_city": "Holon",
      "inventor_state": "",
      "inventor_country": "IL"
    },
    {
      "inventor_name_last": "Akerman",
      "inventor_name_first": "Shmuel",
      "inventor_city": "Binyamina",
      "inventor_state": "",
      "inventor_country": "IL"
    },
    {
      "inventor_name_last": "Sole",
      "inventor_name_first": "Amir",
      "inventor_city": "Rehovot",
      "inventor_state": "",
      "inventor_country": "IL"
    }
  ],
  "ipcr_labels": [
    "G06K962",
    "G06T720",
    "G06K900"
  ],
  "main_ipcr_label": "G06K962",
  "summary": "<SOH> BRIEF DESCRIPTION OF THE DRAWINGS <EOH>FIG. 1 is a block diagram that illustrates an imaging system; FIG. 2 is a flow diagram of a process according to an embodiment of the invention for operating an image processing system; FIG. 3 is a block diagram that illustrates video and models generated from objects identified in the video; FIG. 4 is a block diagram that illustrates video and an evaluation of a model based on knowledge of an object in the video; FIG. 5 is a block diagram that illustrates video and an evaluation of models based on knowledge of objects in the video; FIG. 6 is a block diagram that illustrates video and an evaluation of models based on knowledge of objects in the video; FIG. 7 is a block diagram that illustrates an image processing system. detailed-description description=\"Detailed Description\" end=\"lead\"?",
  "patent_number": "10032079",
  "abstract": "Models are generated from objects identified in video. Each model is evaluated based on knowledge of the objects determined from video analysis, and preferred models are identified based on the evaluations. In some examples, each model could be evaluated by tracking a movement of each object in the video by using each model to track the object from which it was generated, evaluating an ability of each model to identify the objects in the video that are similar to the object from which it was generated, and determining an amount of false identifications made by each model of different objects in different video that does not include the object from which it was generated.",
  "publication_number": "US20160275373A1-20160922",
  "_processing_info": {
    "original_size": 39588,
    "optimized_size": 2519,
    "reduction_percent": 93.64
  }
}