{
  "decision": "ACCEPTED",
  "application_number": "15048919",
  "date_published": "20160616",
  "date_produced": "20160601",
  "title": "CUSTOMER TAILORED RELEASE MASTER PLAN GENERATION FOR HYBRID NETWORKED SOLUTIONS",
  "filing_date": "20160219",
  "inventor_list": [
    {
      "inventor_name_last": "Said",
      "inventor_name_first": "Bare",
      "inventor_city": "St. Leon",
      "inventor_state": "",
      "inventor_country": "DE"
    },
    {
      "inventor_name_last": "Eberlein",
      "inventor_name_first": "Peter",
      "inventor_city": "Malsch",
      "inventor_state": "",
      "inventor_country": "DE"
    }
  ],
  "ipcr_labels": [
    "G06F9445",
    "H04L2908"
  ],
  "main_ipcr_label": "G06F9445",
  "summary": "<SOH> SUMMARY <EOH>In some aspects of the current subject matter, a customer-tailored release master plan can be provided for a business software customer. The customer-tailored release master plan can be an interactive document that includes preparation steps to be performed to enable a new feature of a hybrid networked business solution that includes a cloud-based application and an on=premises business application, and can be generated based on a common release master plan, information characterizing the on-premises application of the business software customer, and a release master plan management object model, a customer-tailored release master plan for a hybrid networked business solution for the business software customer. Implementations of the current subject matter can include, but are not limited to, methods consistent with the descriptions provided herein as well as articles that comprise a tangibly embodied machine-readable medium operable to cause one or more machines (e.g., computers, etc.) to result in operations implementing one or more of the described features. Similarly, computer systems are also described that may include one or more processors and one or more memories coupled to the one or more processors. A memory, which can include a computer-readable storage medium, may include, encode, store, or the like one or more programs that cause one or more processors to perform one or more of the operations described herein. Computer implemented methods consistent with one or more implementations of the current subject matter can be implemented by one or more data processors residing in a single computing system or multiple computing systems. Such multiple computing systems can be connected and can exchange data and/or commands or other instructions or the like via one or more connections, including but not limited to a connection over a network (e.g. the Internet, a wireless wide area network, a local area network, a wide area network, a wired netw...",
  "patent_number": "9830138",
  "abstract": "A business software customer deploying both on-premises and cloud-based applications can be provided with an automatically-generated, customer-tailored release master plan for a hybrid networked business solution that can include specific information and instructions tailored to the business software customer's customer-specific system landscape.",
  "publication_number": "US20160170732A1-20160616",
  "_processing_info": {
    "original_size": 42529,
    "optimized_size": 3070,
    "reduction_percent": 92.78
  }
}