{
  "decision": "PENDING",
  "application_number": "15046842",
  "date_published": "20170824",
  "date_produced": "20170809",
  "title": "SYSTEMS, METHODS, AND DEVICES FOR USING A CODE TO TRACK TASK COMPLETION",
  "filing_date": "20160218",
  "inventor_list": [
    {
      "inventor_name_last": "Rdzak",
      "inventor_name_first": "Grzegorz",
      "inventor_city": "Trumbull",
      "inventor_state": "CT",
      "inventor_country": "US"
    }
  ],
  "ipcr_labels": [
    "G08B2124",
    "G06K710",
    "G06K714",
    "G06Q1010"
  ],
  "main_ipcr_label": "G08B2124",
  "summary": "<SOH> BRIEF DESCRIPTION OF THE SEVERAL VIEWS OF THE DRAWINGS <EOH>The accompanying figures, where like reference numerals refer to identical or functionally similar elements throughout the separate views, together with the detailed description below, are incorporated in and form part of the specification, and serve to further illustrate embodiments of concepts that include the claimed invention, and explain various principles and advantages of those embodiments. FIG. 1 is a functional block diagram of a system for using a code to track task completion, according to some embodiments. FIGS. 2-3 are a functional block diagrams of devices for using a code to track task completion, according to some embodiments. FIGS. 4A-4F are flowcharts of methods for using a code to track task completion, according to some embodiments. FIG. 5 is a flowchart of a method for generating a code used to track task completion, according to some embodiments. detailed-description description=\"Detailed Description\" end=\"lead\"? Skilled artisans will appreciate that elements in the figures are illustrated for simplicity and clarity and have not necessarily been drawn to scale. For example, the dimensions of some of the elements in the figures may be exaggerated relative to other elements to help to improve understanding of embodiments of the present invention. The apparatus and method components have been represented where appropriate by conventional symbols in the drawings, showing only those specific details that are pertinent to understanding the embodiments of the present invention so as not to obscure the disclosure with details that will be readily apparent to those of ordinary skill in the art having the benefit of the description herein.",
  "patent_number": "None",
  "abstract": "Embodiments of the present disclosure include systems, devices and methods for using a code to track task completion. Embodiments include receiving, by a user computing device, a code selection user input from a user interface of the user computing device. Further, embodiments include selecting, by the user computing device, a code for a task from a code repository based on the code selection user input. In addition, embodiments include scanning the code using at least one of a scanning module and an image capture device of the user computing device. Moreover, embodiments include receiving, by the user computing device, assignment information from the user interface for the code. Also, embodiments include assigning, by the user computing device, a task for the code based on the assignment information. Further, embodiments include storing, by the user computing device, the code with the assignment information and task in a database.",
  "publication_number": "US20170243463A1-20170824",
  "_processing_info": {
    "original_size": 68552,
    "optimized_size": 3287,
    "reduction_percent": 95.21
  }
}