{
  "decision": "ACCEPTED",
  "application_number": "15047880",
  "date_published": "20160825",
  "date_produced": "20160810",
  "title": "LOCKOUT TAG",
  "filing_date": "20160219",
  "inventor_list": [
    {
      "inventor_name_last": "MOORE",
      "inventor_name_first": "Michael",
      "inventor_city": "Coldwater",
      "inventor_state": "",
      "inventor_country": "CA"
    }
  ],
  "ipcr_labels": [
    "G09F300",
    "G06K1907",
    "G06K1906",
    "G09F308",
    "G09F1316"
  ],
  "main_ipcr_label": "G09F300",
  "summary": "<SOH> SUMMARY OF THE INVENTION <EOH>According to one aspect of the invention, there is provided a lockout tag having an elongate flag with a fastener proximate one end of the elongate flag and a seam proximate an end opposite the fastener. An indicia may be located between the fastener end and the seam end of the elongate flag and may be applied using one or more of digital printing, screen printing, woven labeling, or heat transfer printing. The elongate flag formed of a reflective and fluorescent material. The fastener may be a generally circular eye. The seam may comprise at least two layers of a reflective and fluorescent material. The flag may be cut proximate the fastener to form two flaps and the fastener may pass through both flaps. One side of each flap may be affixed to each other. According to another aspect of the invention, a pattern may be applied to the reflective and fluorescent material of the flag wherein the pattern may be square-shaped. The material may also comprise a dry-erase sheet and a transparent protective cover. According to yet another aspect of the invention, the flag may further comprise a pouch with an interior for receiving identification media wherein the pouch may have an eyelet and a zipper. The pouch may also have an electronically scannable code such as one of a quick response (QR) code, a bar code, and a radio-frequency identification device (RFID). The electronically scannable code may correspond to an index to data located on a network server.",
  "patent_number": "9799236",
  "abstract": "A lockout tag having an elongate flag; a fastener proximate one end of the elongate flag; a seam proximate an end opposite the fastener; a warning indicia between the fastener end and the seam end of the elongate flag; and the elongate flag formed of a reflective and fluorescent material. The flag further comprising a pouch for additional information regarding the owner and purpose of the flag.",
  "publication_number": "US20160247421A1-20160825",
  "_processing_info": {
    "original_size": 18820,
    "optimized_size": 2451,
    "reduction_percent": 86.98
  }
}