{
  "decision": "PENDING",
  "application_number": "15047438",
  "date_published": "20160825",
  "date_produced": "20160810",
  "title": "METHOD AND APPARATUS FOR PROVIDING A CUSTOMIZED VIEWING EXPERIENCE",
  "filing_date": "20160218",
  "inventor_list": [
    {
      "inventor_name_last": "SEXTON",
      "inventor_name_first": "Brad",
      "inventor_city": "Tarzana",
      "inventor_state": "CA",
      "inventor_country": "US"
    }
  ],
  "ipcr_labels": [
    "H04N21485",
    "H04N545",
    "H04N21431",
    "G06F30484",
    "H04N21218",
    "H04L2906",
    "H04N5445"
  ],
  "main_ipcr_label": "H04N21485",
  "summary": "<SOH> SUMMARY <EOH>Several aspects of the present invention will be described more fully hereinafter with reference to various methods and apparatuses. Some aspects of the invention relate to a server apparatus including a content player. The server apparatus includes an interface configured to serve the content player to a client apparatus. The content player is configured to operate on the client apparatus by receiving several content streams through a single socket connection and presenting each of the content streams to a different portion of a display. The manner of presentation is configurable by a user of the client apparatus. Other aspects of the invention relate to a server apparatus including a content player. The server apparatus includes an interface configured to serve the content player to a client apparatus. The content player is configured to operate on the client apparatus by receiving several content streams and coordinating allocation of resources on the client apparatus to present each of the content streams to a different portion of a display. The manner of presentation is configurable by a user of the client apparatus. Other aspects of the invention relate to a client apparatus including a display. The client apparatus includes a content player configured to receive several content streams through a single socket connection and concurrently present each of the content streams to a different portion of the display. The manner of presentation is configurable by a user of the client apparatus. Other aspects of the invention relate to a client apparatus including a display. The client apparatus includes a content player configured to receive several content streams and coordinate allocation of resources to present each of the content streams to a different portion of the display. The manner of presentation is configurable by a user of the client apparatus. Other aspects of the invention relate to a content player including a non-transitory machine-...",
  "patent_number": "None",
  "abstract": "Some aspects of the invention relate to a server apparatus including a content player. The server apparatus includes an interface configured to serve the content player to a client apparatus. The content player is configured to operate on the client apparatus by receiving several content streams through a single socket connection and presenting each of the content streams to a different portion of a display. The manner of presentation is configurable by a user of the client apparatus.",
  "publication_number": "US20160249108A1-20160825",
  "_processing_info": {
    "original_size": 107481,
    "optimized_size": 3118,
    "reduction_percent": 97.1
  }
}