{
  "date_produced": "20170809",
  "publication_number": "US20170243108A1-20170824",
  "main_ipcr_label": "G06N3063",
  "decision": "PENDING",
  "application_number": "15047936",
  "inventor_list": [
    {
      "inventor_name_last": "Ritter",
      "inventor_name_first": "Mark B.",
      "inventor_city": "Sherman",
      "inventor_state": "CT",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Yasuda",
      "inventor_name_first": "Takeo",
      "inventor_city": "Nara-ken",
      "inventor_state": "",
      "inventor_country": "JP"
    }
  ],
  "abstract": "Embodiments are directed to a driver circuit including a first amplifier having a voltage follower configured to control a first node to maintain a voltage of the first node at a constant value. By maintaining the first node voltage, the first amplifier having the voltage follower is further configured to have a first amplifier output current into the first node at a value without the effect of the voltage fluctuation. The driver circuit further includes a second amplifier configured to control a second node, wherein the second amplifier is in a current mirror configuration with respect to the first amplifier such that a second amplifier current output is a highly precise mirror of the first amplifier current output.",
  "filing_date": "20160219",
  "patent_number": "None",
  "summary": "<SOH> SUMMARY <EOH>Embodiments are directed to a driver circuit including a first amplifier having a voltage follower configured to control a first node to maintain a voltage of the first node at a constant value. The first amplifier having the voltage follower is further configured to have a first amplifier output current into the first node at a value without being affected by the voltage fluctuation. The driver circuit further includes a second amplifier configured to control a second node, wherein the second amplifier is in a current mirror configuration with respect to the first amplifier because the output current of a second amplifier is a mirror of (or the same as) the output current of the first amplifier final stage. Embodiments are further directed to a driver circuit including a first amplifier having a first amplifier first stage, a first amplifier final stage which drives a first amplifier final stage output current, wherein the first amplifier final stage output is connected to a first node, and wherein the first amplifier further comprises a voltage follower configured to control the first node to maintain a voltage of the first node at a constant value, and to control the first amplifier final stage output current so that the voltage of the first node stays at a constant value. The driver circuit further includes a second amplifier configured to control a second node, wherein the second amplifier is in a current mirror configuration with respect to the first amplifier because the output current of a second amplifier is a mirror of (or the same as) the output current of the first amplifier final stage. Embodiments are further directed to a driver circuit including a first amplifier having a first amplifier first stage, a first amplifier first stage positive output, a first amplifier first stage negative output and a first amplifier final stage which drives a first amplifier final stage output current, wherein the first amplifier final stage output is...",
  "date_published": "20170824",
  "title": "Current Mirror Scheme for An Integrating Neuron Circuit",
  "ipcr_labels": [
    "G06N3063",
    "G05F326"
  ],
  "_processing_info": {
    "original_size": 64978,
    "optimized_size": 3425,
    "reduction_percent": 94.73
  }
}