{
  "decision": "ACCEPTED",
  "application_number": "15040646",
  "date_published": "20160609",
  "date_produced": "20160525",
  "title": "SYSTEM AND METHOD OF IDENTITY VERIFICATION",
  "filing_date": "20160210",
  "inventor_list": [
    {
      "inventor_name_last": "Irwin",
      "inventor_name_first": "Donald E.",
      "inventor_city": "Fredericksburg",
      "inventor_state": "VA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "McKenzie",
      "inventor_name_first": "Nan K.",
      "inventor_city": "Garrett Park",
      "inventor_state": "MD",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Tartal",
      "inventor_name_first": "William A.",
      "inventor_city": "Baltimore",
      "inventor_state": "MD",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Stephen",
      "inventor_name_first": "Victoria K.",
      "inventor_city": "Burke",
      "inventor_state": "VA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Amato",
      "inventor_name_first": "Michael J.",
      "inventor_city": "Reston",
      "inventor_state": "VA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Ackerman",
      "inventor_name_first": "William G.",
      "inventor_city": "Washington",
      "inventor_state": "VA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Dixon",
      "inventor_name_first": "Robert E.",
      "inventor_city": "Washington",
      "inventor_state": "DC",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Smith",
      "inventor_name_first": "Daniel W.",
      "inventor_city": "Washington",
      "inventor_state": "DC",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Crabb",
      "inventor_name_first": "Gregory",
      "inventor_city": "Broadlands",
      "inventor_state": "VA",
      "inventor_country": "US"
    }
  ],
  "ipcr_labels": [
    "G06Q5026",
    "G06K900"
  ],
  "main_ipcr_label": "G06Q5026",
  "summary": "<SOH> SUMMARY <EOH>In one aspect described herein a system for verifying identity comprises a server configured to receive registration information and identification information from a registrant; an identification module in communication with the server, wherein the identification module is configured to receive the registration information and the identification information, and wherein the identification module is configured to verify the identification information, and to compare the verified identification information to the registration information; and wherein the server is configured to verify the identity of the registrant based on the comparison of the verified identification information to the registration information. In some embodiments, the identification information comprises a visual indication of a government issued identification. In some embodiments, the identification information comprises a visual representation of an identifying item. In some embodiments, the visual representation of the identifying item is associated with location information. In some embodiments, the identification module is configured to verify the visual representation of the identifying item by comparing location information in the identification module with the location information associated with the visual representation of the identifying item. In some embodiments, the identification module comprises more than one identification module. In some embodiments, wherein the identification module is in communication with a third party verification database or government agency verification database. In some embodiments, the identification module comprises a plurality of identification modules, and wherein another of the plurality of identification modules is in communication with a location verification database. In another aspect, a system for verifying identity comprises a server configured to receive registration information from a registrant; an identity proofing system...",
  "patent_number": "9898790",
  "abstract": "A system and method of verifying the identity of a user or registrant. The user or registrant provides identification information and registration information. The identification information may be a visual representation of an identifying item associated with location information. In some embodiments, the identification information may be a visual representation of a government issued identity. An identification module verifies the identification information and compares the verified identification information to the registration information.",
  "publication_number": "US20160163012A1-20160609",
  "_processing_info": {
    "original_size": 70562,
    "optimized_size": 4305,
    "reduction_percent": 93.9
  }
}