{
  "date_produced": "20170802",
  "publication_number": "US20170236063A1-20170817",
  "main_ipcr_label": "G06N504",
  "decision": "PENDING",
  "application_number": "15045820",
  "inventor_list": [
    {
      "inventor_name_last": "Dorris",
      "inventor_name_first": "Dustin M.",
      "inventor_city": "North Richland Hills",
      "inventor_state": "TX",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Edwards",
      "inventor_name_first": "Alan C.",
      "inventor_city": "Allen",
      "inventor_state": "TX",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Mudhiganti",
      "inventor_name_first": "Shilpa",
      "inventor_city": "Frisco",
      "inventor_state": "TX",
      "inventor_country": "US"
    }
  ],
  "abstract": "Mechanisms are provided for monitoring quality and correctness of content in communications handled by a vendor. The mechanisms sample a set of communications handled by the vendor to generate a sample set of communications and extract content from the sample set of communications. The mechanisms compare the extracted content with expected content of communications handled by the vendor and analyze the extracted content and the expected content to thereby identify differences between the extracted content and the expected content based on results of the analysis. In addition, the mechanisms determine a level of significance of the differences and generate a notification of whether or not to modify the communications, or an operation of the vendor, based on the determined level of significance of differences.",
  "filing_date": "20160217",
  "patent_number": "None",
  "summary": "<SOH> SUMMARY <EOH>This Summary is provided to introduce a selection of concepts in a simplified form that are further described herein in the Detailed Description. This Summary is not intended to identify key factors or essential features of the claimed subject matter, nor is it intended to be used to limit the scope of the claimed subject matter. In one illustrative embodiment, a method is provided, in a data processing system comprising a processor and a memory, for monitoring quality and correctness of content in communications handled by a vendor. The method comprises sampling, by the data processing system, a set of communications handled by the vendor to generate a sample set of communications and extracting, by the data processing system, content from the sample set of communications. The method further comprises comparing, by the data processing system, the extracted content with expected content of communications handled by the vendor and analyzing, by the data processing system, the extracted content and the expected content to thereby identify differences between the extracted content and the expected content based on results of the analysis. In addition, the method comprises determining, by the data processing system, a level of significance of the differences and generating, by the data processing system, a notification of whether or not to modify the communications, or an operation of the vendor, based on the determined level of significance of differences. In other illustrative embodiments, a computer program product comprising a computer useable or readable medium having a computer readable program is provided. The computer readable program, when executed on a data processing system, causes the data processing system to perform various ones of, and combinations of, the operations outlined above with regard to the method illustrative embodiment. In yet another illustrative embodiment, a system/apparatus is provided. The system/apparatus may comprise ...",
  "date_published": "20170817",
  "title": "Evaluating Vendor Communications for Accuracy and Quality",
  "ipcr_labels": [
    "G06N504",
    "G06N700"
  ],
  "_processing_info": {
    "original_size": 271195,
    "optimized_size": 3683,
    "reduction_percent": 98.64
  }
}