{
  "decision": "PENDING",
  "application_number": "15040754",
  "date_published": "20160811",
  "date_produced": "20160727",
  "title": "METHOD AND SYSTEM FOR MONITORING COMMODITY NETWORKS THROUGH RADIOFREQUENCY SCANNING",
  "filing_date": "20160210",
  "inventor_list": [
    {
      "inventor_name_last": "Spalenka",
      "inventor_name_first": "Josef",
      "inventor_city": "Louisville",
      "inventor_state": "KY",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Alphenaar",
      "inventor_name_first": "Deirdre",
      "inventor_city": "Prospect",
      "inventor_state": "KY",
      "inventor_country": "US"
    }
  ],
  "ipcr_labels": [
    "G06Q4004",
    "H04L2908",
    "H04W8418",
    "H04L1226"
  ],
  "main_ipcr_label": "G06Q4004",
  "summary": "<SOH> SUMMARY OF THE INVENTION <EOH>The present invention is a method and system for monitoring commodity supply, transfer, and demand networks by scanning the radiofrequency emissions from components of these networks. In the method and system of the present invention, monitoring devices (or monitors) are used to scan radiofrequency waves transmitted from meters, gauges, and other supervisory (or control) devices associated with components of a network. For example, metered points along a pipeline can be monitored, thus allowing for monitoring of flow rates into and out of the pipeline or other network component connected with the pipeline, along with the monitoring of other physical and/or quality parameters associated with the network and the commodity flowing through the network, but without direct access to network infrastructure. Such meters, gauges, and other supervisory devices may be associated with commodity and energy facilities, including, but not limited to: natural gas and crude oil pipelines; natural gas and crude oil delivery and receipt points; pumping stations for natural gas, crude oil, or other liquid energy commodities; natural gas meters at industrial end users, such as fertilizer and steel plants; residue gas outlets at gas processing plants; wastewater treatment plants; electric substations and grid meters; and inlets and outlets of natural gas liquid (NGL) processing facilities, such as NGL fractionators; and water and liquid energy storage facilities. An exemplary implementation of the method of the present invention commences with the positioning of a monitor at a predetermined location for monitoring a pipeline or other component of a network for supply, transfer, or demand of a commodity. Once a monitor is positioned at the predetermined location, a radio receiver of the monitor is used to receive radiofrequency waves from one or more supervisory devices associated with the network. Then, the radiofrequency waves are demodulated and conv...",
  "patent_number": "None",
  "abstract": "In the method and system of the present invention, a monitoring device (or monitor) is positioned at a predetermined location for monitoring a pipeline or other component of a network for supply, transfer, or demand of a commodity. A radio receiver of the monitor is used to receive radiofrequency waves from one or more supervisory (or control) devices associated with the network. Then, the radiofrequency waves are demodulated and converted into a digital data stream. The digital data stream is then separated into discrete data packets, with reference being made to a database in order to identify and decode the discrete data packets. The discrete data packets are then processed to determine information about the commodity relative to the component, such as the flow rate of the commodity through a pipeline. Such information is then communicated to interested parties.",
  "publication_number": "US20160232612A1-20160811",
  "_processing_info": {
    "original_size": 49743,
    "optimized_size": 3639,
    "reduction_percent": 92.68
  }
}