{
  "decision": "ACCEPTED",
  "application_number": "15040979",
  "date_published": "20170601",
  "date_produced": "20170517",
  "title": "Power Reduction in a Parallel Data Communications Interface Using Clock Resynchronization",
  "filing_date": "20160210",
  "inventor_list": [
    {
      "inventor_name_last": "Baumgartner",
      "inventor_name_first": "Steven J.",
      "inventor_city": "Zumbro Falls",
      "inventor_state": "MN",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Dreps",
      "inventor_name_first": "Daniel M.",
      "inventor_city": "Georgetown",
      "inventor_state": "TX",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Spear",
      "inventor_name_first": "Michael B.",
      "inventor_city": "Round Rock",
      "inventor_state": "TX",
      "inventor_country": "US"
    }
  ],
  "ipcr_labels": [
    "G06F132",
    "H04L708"
  ],
  "main_ipcr_label": "G06F132",
  "summary": "<SOH> SUMMARY <EOH>A communications mechanism for communicating digital data between two devices includes a parallel data link of multiple parallel lines, in which at least some of the components associated with one or more lines are powered down at least some of the time, and receiver components are re-synchronized with the transmitter upon re-powering the components by matching an internally generated data pattern in the receiver with a corresponding data pattern transmitted by the transmitter. In one or more preferred embodiments, both the transmitter and the receiver contain respective pseudo-random pattern generators which generate identical pre-determined pseudo-random bit streams. These bit streams are synchronized with respect to each other when the system containing the communications bus is initialized. When a line is temporarily powered down, the pseudo-random pattern generators in the transmitter and receiver remain powered on and continue to generate their respective bit streams. Upon re-powering the line, the transmitter transmits the pseudo-random bit stream generated by its pseudo-random bit stream generator. The receiver compares the pseudo-random bit stream received over the line with the pseudo-random bit stream internally generated by the receiver's pattern generator to determine an amount of shift required for the receiver circuits, and shifts the receiver's circuits so that the two patterns match, thus re-synchronizing the line. Preferably, this pseudo-random bit stream is not used solely for re-synchronization, but is also used for one or more other purposes, such as calibration of the receiver and/or scrambling of transmitted data. In one or more preferred embodiments, the receiver circuit for each line includes a respective local clock phase rotator, a sampler, a deserializer, and a deskew circuit, the output of the deskew circuit being adjusted to a common clock domain for all lines. The clock phase rotator adjusts the phase of the interfac...",
  "patent_number": "9715270",
  "abstract": "A digital data communications mechanism includes multiple parallel lines, in which components of one or more lines are temporarily powered down to save power. Preferably, both the transmitter and receiver contain respective generators generating identical pre-determined pseudo-random bit streams, which are initially synchronized and which remain powered up when the line is temporarily powered down. Upon re-powering the line, the transmitter transmits the locally generated bit stream, and the receiver compares the received bit stream with its internally generated bit stream to determine an amount of shift required for re-synchronization.",
  "publication_number": "US20170153689A1-20170601",
  "_processing_info": {
    "original_size": 206422,
    "optimized_size": 3549,
    "reduction_percent": 98.28
  }
}