{
  "date_produced": "20160525",
  "publication_number": "US20160162795A1-20160609",
  "main_ipcr_label": "G06N504",
  "decision": "ACCEPTED",
  "application_number": "15047248",
  "inventor_list": [
    {
      "inventor_name_last": "Smith",
      "inventor_name_first": "Lucas O.",
      "inventor_city": "Palo Alto",
      "inventor_state": "CA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Rickard",
      "inventor_name_first": "Oliver Clark",
      "inventor_city": "Palo Alto",
      "inventor_state": "CA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Moulia",
      "inventor_name_first": "Thomas William",
      "inventor_city": "Palo Alto",
      "inventor_state": "CA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Ferrell",
      "inventor_name_first": "William Christian",
      "inventor_city": "Palo Alto",
      "inventor_state": "CA",
      "inventor_country": "US"
    }
  ],
  "abstract": "A method and system that includes extracting event models from at least one personal planning source of a user, wherein a parameter of an event model includes event location; periodically receiving location information of at least one mobile device of the user; storing the location information in a location log; a pattern worker module maintaining user location patterns through the location log; generating a location prediction from the extracted event models and the user location patterns; a first content worker module checking if the location prediction meets a set of content requirements; if the set of content requirements is satisfied, initiating content retrieval from at least one service; and pushing the content to the mobile device.",
  "filing_date": "20160218",
  "patent_number": "9672468",
  "summary": "<SOH> BRIEF DESCRIPTION OF THE FIGURES <EOH>FIG. 1 is a schematic representation of a system of a preferred embodiment; FIG. 2 is an exemplary screenshot of generated content for an upcoming flight; FIG. 3 is an exemplary screenshot of generated content with a boarding pass for an upcoming flight; FIG. 4 is an exemplary screenshot of generated content for an upcoming trip to a hotel; FIG. 5 is an exemplary screenshot of generated content for travel information when leaving for work; FIGS. 6A-6C are exemplary screenshots of generated content to remind a user of a planned event; FIG. 7 is an exemplary screenshot of generated content for weather based on location prediction of a user; FIG. 8 is a detailed schematic representation of components of a location prediction platform of a preferred embodiment; FIG. 9 is a flowchart representation of a method of a preferred embodiment; FIGURE to is a sequence diagram representation of a method of a preferred embodiment; FIG. 11 is a flowchart representation of a variation of the method of a preferred embodiment for enabling platform use by third party applications and services; FIG. 12 is a sequence diagram representation of a platform variation of the method of a preferred embodiment; and FIGS. 13 and 14 are exemplary schematic representations of notifications pushed to a mobile device. detailed-description description=\"Detailed Description\" end=\"lead\"?",
  "date_published": "20160609",
  "title": "SYSTEM AND METHOD FOR PROVIDING INTELLIGENT LOCATION INFORMATION",
  "ipcr_labels": [
    "G06N504",
    "G06N9900"
  ],
  "_processing_info": {
    "original_size": 78185,
    "optimized_size": 3204,
    "reduction_percent": 95.9
  }
}