{
  "decision": "REJECTED",
  "application_number": "15048299",
  "date_published": "20170629",
  "date_produced": "20170614",
  "title": "SYSTEM FOR DISPLAYING AND PROMPTING LIFE PERCENTAGE OF ELECTRONIC DEVICE",
  "filing_date": "20160219",
  "inventor_list": [
    {
      "inventor_name_last": "LAM",
      "inventor_name_first": "TAI-SENG",
      "inventor_city": "Taipei City",
      "inventor_state": "",
      "inventor_country": "TW"
    },
    {
      "inventor_name_last": "Lin",
      "inventor_name_first": "Chiung-Chi",
      "inventor_city": "Taipei City",
      "inventor_state": "",
      "inventor_country": "TW"
    }
  ],
  "ipcr_labels": [
    "G06F126",
    "G06F132"
  ],
  "main_ipcr_label": "G06F126",
  "summary": "<SOH> SUMMARY OF THE INVENTION <EOH>For solving the drawbacks of the conventional technologies, the present invention provides a system for displaying and prompting a life percentage of an electronic device. In accordance with an aspect of the present invention, there is provided a system for displaying and prompting a life percentage of an electronic device. The system includes the electronic device and an intelligent device. The electronic device generates a history data. The intelligent device is installed in the electronic device. The intelligent device includes a signal transmission module, a processing unit, a storage module and a prompt displaying module. The signal transmission module is electrically connected with the electronic device, and receives the history data. The processing unit generates a life percentage value according to the history data of the electronic device, and generates a life percentage status signal according to the life percentage value. The storage module stores the history data. The prompt displaying module receives and displays the life percentage status signal. A user judges whether the electronic device is replaced with a new one according to the life percentage status signal. In an embodiment, the history data contains a product serial number, a maintenance record, an operating temperature, a usage time and at least one setting parameter of the electronic device. In an embodiment, the life percentage value is an equivalent usage time that is calculated according to at least a portion of the history data of the electronic device. The processing unit generates the life percentage status signal according to the equivalent usage time. In an embodiment, the electronic device is a host, a monitor, a printer, a hard disk drive or a peripheral device of a point-of-sale system. In an embodiment, the history data is actively read and stored by the intelligent device at regular time. In an embodiment, after the history data of the electroni...",
  "patent_number": "None",
  "abstract": "A system for displaying and prompting a life percentage of an electronic device is provided. The system includes the electronic device and an intelligent device installed in the electronic device. The intelligent device includes a signal transmission module, a processing unit, a storage module and a prompt displaying module. The signal transmission module is electrically connected with the electronic device for receiving the history data. The processing unit generates a life percentage value according to the history data of the electronic device, and generates a life percentage status signal according to the life percentage value. The storage module stores the history data. The prompt displaying module receives and displays the life percentage status signal. A user judges whether the electronic device is replaced with a new one according to the life percentage status signal.",
  "publication_number": "US20170185122A1-20170629",
  "_processing_info": {
    "original_size": 33383,
    "optimized_size": 3607,
    "reduction_percent": 89.2
  }
}