{
  "decision": "REJECTED",
  "application_number": "15044828",
  "date_published": "20160609",
  "date_produced": "20160525",
  "title": "BIOMETRIC DATABASE CORROBORATOR",
  "filing_date": "20160216",
  "inventor_list": [
    {
      "inventor_name_last": "STEPHANSON",
      "inventor_name_first": "Cory J.",
      "inventor_city": "La Selva Beach",
      "inventor_state": "CA",
      "inventor_country": "US"
    }
  ],
  "ipcr_labels": [
    "G06F1730"
  ],
  "main_ipcr_label": "G06F1730",
  "summary": "<SOH> SUMMARY <EOH>A biometric database corroborator is disclosed. In one embodiment, a biometric digital representation receiver receives a biometric digital representation representative of an individual. A biometric information gatherer collects biometric data from a first biometric database and at least a second different biometric database. A biometric comparator compares the biometric digital representation representative of the individual with the biometric data gathered from the first biometric database and at least the second different biometric database, the biometric comparator utilizing a predefined match percentage threshold to determine a match. A result provider provides a result from the biometric comparator in a tangible user output.",
  "patent_number": "None",
  "abstract": "A biometric database corroborator is disclosed. In one embodiment, a biometric digital representation receiver receives a biometric digital representation representative of an individual. A biometric information gatherer collects biometric data from a first biometric database and at least a second different biometric database. A biometric comparator compares the biometric digital representation representative of the individual with the biometric data gathered from the first biometric database and at least the second different biometric database, the biometric comparator utilizing a predefined match percentage threshold to determine a match. A result provider provides a result from the biometric comparator in a tangible user output.",
  "publication_number": "US20160162553A1-20160609",
  "_processing_info": {
    "original_size": 34474,
    "optimized_size": 2031,
    "reduction_percent": 94.11
  }
}