{
  "date_produced": "20170802",
  "publication_number": "US20170236061A1-20170817",
  "main_ipcr_label": "G06N502",
  "decision": "ACCEPTED",
  "application_number": "15041081",
  "inventor_list": [
    {
      "inventor_name_last": "Laborie",
      "inventor_name_first": "Philippe",
      "inventor_city": "L'Hay-les-Roses",
      "inventor_state": "",
      "inventor_country": "FR"
    },
    {
      "inventor_name_last": "Lhomme",
      "inventor_name_first": "Olivier M.D.",
      "inventor_city": "Cagnes-sur-Mer",
      "inventor_state": "",
      "inventor_country": "FR"
    },
    {
      "inventor_name_last": "Oudot",
      "inventor_name_first": "Olivier",
      "inventor_city": "Vallauris",
      "inventor_state": "",
      "inventor_country": "FR"
    },
    {
      "inventor_name_last": "Shaw",
      "inventor_name_first": "Paul",
      "inventor_city": "Grasse",
      "inventor_state": "",
      "inventor_country": "FR"
    }
  ],
  "abstract": "This invention relates to a system, method and computer program product for determining which anytime technique is the most efficient at solving an anytime problem using a first anytime technique and a second anytime technique to determine a first and a second plurality of solutions, respectively, wherein each of the first and the second the plurality of solutions includes a value and an associated computation time, respectively, and each of the first and the second plurality solutions including a minimized value and associated computation time, respectively. Determining a set of delta value ordinates and computation time ordinates. Determining a representative value ordinate and representative computation time ordinate. Determining an efficient anytime technique.",
  "filing_date": "20160211",
  "patent_number": "9953263",
  "summary": "<SOH> BRIEF SUMMARY <EOH>Additional aspects and/or advantages will be set forth in part in the description which follows and, in part, will be apparent from the description, or may be learned by practice of the invention. Embodiments of the present invention disclose a method, computer program product, and system for determining which anytime technique is the most efficient at solving an anytime problem using a first anytime technique and a second anytime technique to determine a first and a second plurality of solutions, respectively, wherein each of the first and the second the plurality of solutions includes a value and an associated computation time, respectively, and each of the first and the second plurality solutions including a minimized value and associated computation time, respectively. Determining a set of delta value ordinates and computation time ordinates where each delta value ordinate is the difference between a value from the first plurality of solutions and a value from the second plurality of solutions and where each delta computation time ordinate is the difference between an associated computation time from the first plurality of solutions and an associated computation time from the second plurality of solutions. Determining a representative value ordinate and representative computation time ordinate from a summation of the respective delta value and computation time ordinates. Determining an efficient anytime technique from the sign of the representative value ordinate and representative computation time ordinates.",
  "date_published": "20170817",
  "title": "PERFORMANCE COMPARISON",
  "ipcr_labels": [
    "G06N502",
    "G06F9455"
  ],
  "_processing_info": {
    "original_size": 72214,
    "optimized_size": 3307,
    "reduction_percent": 95.42
  }
}