{
  "date_produced": "20170726",
  "publication_number": "US20170228651A1-20170810",
  "main_ipcr_label": "G06N504",
  "decision": "PENDING",
  "application_number": "15040963",
  "inventor_list": [
    {
      "inventor_name_last": "Yamamoto",
      "inventor_name_first": "Seiji James",
      "inventor_city": "San Francisco",
      "inventor_state": "CA",
      "inventor_country": "US"
    }
  ],
  "abstract": "Computer-implemented systems and methods are disclosed for automatically generating predictive models using data driven featurization. The systems and methods provide for obtaining data associated with a target event, annotating the data to identify a target event and establishing one or more limits on the data, censoring the data based on the annotations, determining features of the censored data, and analyzing the features to determine a predictive model. In some embodiments, the systems and methods further provide for converting the features into a binary representation and analyzing the binary representation to produce the predictive model.",
  "filing_date": "20160210",
  "patent_number": "None",
  "summary": "<SOH> BRIEF DESCRIPTION OF THE DRAWINGS <EOH>Reference will now be made to the accompanying drawings showing example embodiments of this disclosure. In the drawings: FIG. 1 is a block diagram of an exemplary computing device, consistent with embodiments of the present disclosure. FIG. 2 is a block diagram of an exemplary system for data driven featurization, consistent with embodiments of the present disclosure. FIG. 3 is an exemplary data structure consistent with embodiments of the present disclosure. FIG. 4 is an exemplary data structure consistent with embodiments of the present disclosure. FIG. 5 is an exemplary data structure consistent with embodiments of the present disclosure. FIG. 6 is a flowchart of an exemplary method for data driven featurization, consistent with embodiments of the present disclosure. detailed-description description=\"Detailed Description\" end=\"lead\"?",
  "date_published": "20170810",
  "title": "DATA DRIVEN FEATURIZATION AND MODELING",
  "ipcr_labels": [
    "G06N504",
    "G06N9900"
  ],
  "_processing_info": {
    "original_size": 73384,
    "optimized_size": 2096,
    "reduction_percent": 97.14
  }
}