{
  "decision": "ACCEPTED",
  "application_number": "15045690",
  "date_published": "20160818",
  "date_produced": "20160803",
  "title": "APPARATUS AND METHOD FOR DISPLAYING INFORMATION",
  "filing_date": "20160217",
  "inventor_list": [
    {
      "inventor_name_last": "KIM",
      "inventor_name_first": "Hyunseok",
      "inventor_city": "Hwaseong-si",
      "inventor_state": "",
      "inventor_country": "KR"
    },
    {
      "inventor_name_last": "KWAK",
      "inventor_name_first": "Younghoon",
      "inventor_city": "Suwon-si",
      "inventor_state": "",
      "inventor_country": "KR"
    },
    {
      "inventor_name_last": "KIM",
      "inventor_name_first": "Dongkyu",
      "inventor_city": "Seoul",
      "inventor_state": "",
      "inventor_country": "KR"
    },
    {
      "inventor_name_last": "PARK",
      "inventor_name_first": "Sang-Hyen",
      "inventor_city": "Seoul",
      "inventor_state": "",
      "inventor_country": "KR"
    },
    {
      "inventor_name_last": "LEE",
      "inventor_name_first": "Seungyun",
      "inventor_city": "Hwaseong-si",
      "inventor_state": "",
      "inventor_country": "KR"
    }
  ],
  "ipcr_labels": [
    "G09G334",
    "G04G2108",
    "G04G900",
    "G09G336",
    "G06F132"
  ],
  "main_ipcr_label": "G09G334",
  "summary": "<SOH> SUMMARY <EOH>Aspects of the present disclosure are to address at least the above-mentioned problems and/or disadvantages and to provide at least the advantages described below. Accordingly, an aspect of the present disclosure is to provide an apparatus and method for displaying information of an electronic device. In accordance with an aspect of the present disclosure, a method for displaying information is provided. The method includes, in a standby mode, maintaining a display in a transparent state, the display covering a clock module including hands of a clock, in response to a display event, adjusting transparency of a display area on the display, and displaying information corresponding to the display event on the display area. In accordance with another aspect of the present disclosure, an apparatus for displaying information is provided. The apparatus includes a clock module including hands of a clock, a display covering the clock module, an adjuster configured to adjust transparency of the display, and a controller configured to, in a standby mode, maintain the display in a transparent state, adjust transparency of a display area on the display in response to a display event, and display information corresponding to the display event on the display area. According to an embodiment, the information display apparatus includes the clock module and the display. In this case, the information display apparatus continues to represent time through the clock module. In addition, in the standby mode, the information display apparatus maintains the display in the transparent state. Accordingly, the user of the information display apparatus can identify the time of the clock module, above the display, in real time. In addition, the information display apparatus displays information on the display by adjusting the transparency of the display in response to the display event. Accordingly, the user of the information display apparatus can easily identify the informat...",
  "patent_number": "10025275",
  "abstract": "An apparatus and a method for displaying information are provided. The method includes, in a standby mode, maintaining a display in a transparent state, the display covering a clock module including hands of a clock, in response to a display event, adjusting transparency of a display area on the display, and displaying information corresponding to the display event on the display area.",
  "publication_number": "US20160240149A1-20160818",
  "_processing_info": {
    "original_size": 55104,
    "optimized_size": 3545,
    "reduction_percent": 93.57
  }
}