{
  "date_produced": "20160810",
  "publication_number": "US20160247079A1-20160825",
  "main_ipcr_label": "G06N504",
  "decision": "PENDING",
  "application_number": "15049044",
  "inventor_list": [
    {
      "inventor_name_last": "MEWES",
      "inventor_name_first": "JOHN J.",
      "inventor_city": "MAYVILLE",
      "inventor_state": "ND",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "SALENTINY",
      "inventor_name_first": "DUSTIN M.",
      "inventor_city": "GRAND FORKS",
      "inventor_state": "ND",
      "inventor_country": "US"
    }
  ],
  "abstract": "A framework for diagnosing and predicting a suitability of soil conditions to various agricultural operations is performed in a combined, multi-part approach for simulating relationships between predictive data and observable outcomes. The framework includes analyzing one or more factors relevant to field trafficability, workability, and suitability for agricultural operations due to the effects of freezing and thawing cycles, and developing artificial intelligence systems to learn relationships between datasets to produce improved indications of trafficability, workability, and forecasts of suitability windows for a particular user, user community, farm, farm group, field, or equipment. The framework also includes a real-time feedback mechanism by which a user can validate or correct these indications and forecasts. The framework may further be configured to override one or more of the soil state assessments to ensure that indicators and forecasts are consistent with the recently-prov...",
  "filing_date": "20160220",
  "patent_number": "None",
  "summary": "<SOH> BRIEF SUMMARY OF THE INVENTION <EOH>It is therefore one objective of the present invention to provide systems and methods of diagnosing and predicting soil conditions for conducting various agricultural operations. It is another objective of the present invention to assess a soil state to evaluate field accessibility and suitability for agricultural activity. It is a further objective of the present invention to model one or both of soil moisture and soil temperature, and the impact on field access for whether a field is trafficable and workable. It is still another objective of the present invention to forecast temporal windows of opportunity for suitability of agricultural activity from models of anticipated freezing and thawing cycles in soils. It is another objective of the present invention to provide a system and method of evaluating data that includes soil, field, crop, and weather information to diagnose and predict soil conditions using a multi-part approach that includes physical models, artificial intelligence systems, and real-time user feedback. It is still another objective of the present invention to translate weather data, together with related crop and field characteristics, and an expected soil condition response thereto to model one or more of soil moisture and soil temperature for the impact on field access for whether a field is trafficable and workable. Recent parallel advances in weather and soil condition analysis and prediction, and in the availability of mechanisms for facilitating real-time and location-tagged data communication in farm operations, create an enticing set of possible new applications for addressing the problems outlined above. The application of both in-situ (though not necessarily in or near a particular field) and remotely-sensed weather information, in combination with advances in scientific and computational integration of data collected by these disparate weather observing systems, permit the diagnosis of field-l...",
  "date_published": "20160825",
  "title": "MODELING OF SOIL COMPACTION AND STRUCTURAL CAPACITY FOR FIELD TRAFFICABILITY BY AGRICULTURAL EQUIPMENT FROM DIAGNOSIS AND PREDICTION OF SOIL AND WEATHER CONDITIONS ASSOCIATED WITH USER-PROVIDED FEEDBACK",
  "ipcr_labels": [
    "G06N504"
  ],
  "_processing_info": {
    "original_size": 127002,
    "optimized_size": 3848,
    "reduction_percent": 96.97
  }
}