{
  "date_produced": "20160824",
  "publication_number": "US20160260021A1-20160908",
  "main_ipcr_label": "G06N700",
  "decision": "PENDING",
  "application_number": "15041301",
  "inventor_list": [
    {
      "inventor_name_last": "Marek",
      "inventor_name_first": "William",
      "inventor_city": "Bountiful",
      "inventor_state": "UT",
      "inventor_country": "US"
    }
  ],
  "abstract": "A method and system for adjusting inputs to an agriculture field to improve crop performance. Data are gathered for a field divided into zones, which may be sector-shaped or otherwise. These data include field characteristics, grower inputs, and yield. Statistical techniques are applied to (1) identify grower inputs that correlate with crop performance; (2) identify zones that may benefit from adjustments to one or more grower inputs; (3) predict improvements in crop performance that may result from adjusting one or more grower inputs for a particular zone; (4) suggest an adjustment to one or more grower inputs for a particular zone; (5) analyze actual effects of applying adjustments to grower inputs for a particular zone; (6) determine whether a zone may benefit from further tuning one or more grower inputs; and (7) suggesting tuning adjustments to one or more grower inputs for a zone. A method and system for computing “Sure Pressure”, i.e., for computing pump motor speed and conseque...",
  "filing_date": "20160211",
  "patent_number": "None",
  "summary": "<SOH> SUMMARY OF THE INVENTION <EOH>This invention builds on precision agricultural practices by disclosing a system and method for quantitative analysis of field characteristics and yield data, prescription of adjustments to grower inputs, and financial analysis of such precision solutions. The invention disclosed herein (1) statistically identifies field characteristics that correlate with sub-optimal and optimal crop performance; (2) assesses the potential effectiveness of an adjustment to one or more grower inputs; (3) prescribes a statistically-based precision solution comprising adjustment(s) to one or more grower inputs; (4) provides a prospective cost-benefit analysis for applying the precision solution; and (5) quantitatively assesses the actual effect of an applied precision solution on crop performance and the efficient management of inputs. In addition to improved crop performance, this invention promotes preservation of natural resources such as water and associated electric power requirements to lift and push water. The precision solution may comprise, but is not limited to, adjustments to irrigation, tillage, fertility treatment, seeding, or any other grower input. In addition to these specifically identified grower inputs, this invention accommodates other grower inputs known in the art. A prescription is generated based on standard stepwise regression techniques to derive correlation coefficient(s), confidence interval(s), residual value(s), and normalized coefficient(s) for mitigating risk through precision application of grower inputs. Additionally this invention provides the methodology for calculating a new data layer that allows the grower to precisely manage Variable Frequency Drives (VFD) to the motor load by precisely prescribing the correct Hz the motor must turn to meet end-of-system PSI requirements for optimal volumetric water distribution. A preferred embodiment may comprise three foundational components: (1) Field Data Analytics (“FDA”...",
  "date_published": "20160908",
  "title": "SYSTEM AND METHOD FOR IMPROVED AGRICULTURAL YIELD AND EFFICIENCY USING STATISTICAL ANALYSIS",
  "ipcr_labels": [
    "G06N700"
  ],
  "_processing_info": {
    "original_size": 61045,
    "optimized_size": 3603,
    "reduction_percent": 94.1
  }
}