{
  "date_produced": "20170809",
  "publication_number": "US20170243128A1-20170824",
  "main_ipcr_label": "G06N700",
  "decision": "PENDING",
  "application_number": "15048397",
  "inventor_list": [
    {
      "inventor_name_last": "Kishan",
      "inventor_name_first": "Arun U.",
      "inventor_city": "Kirkland",
      "inventor_state": "WA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Wilson",
      "inventor_name_first": "Emily Nicole",
      "inventor_city": "Seattle",
      "inventor_state": "WA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Soliman",
      "inventor_name_first": "Mohammed Nashaat",
      "inventor_city": "Redmond",
      "inventor_state": "WA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Maisuria",
      "inventor_name_first": "Paresh",
      "inventor_city": "Issaquah",
      "inventor_state": "WA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Weinberg",
      "inventor_name_first": "Shira",
      "inventor_city": "Tel Aviv",
      "inventor_state": "",
      "inventor_country": "IL"
    },
    {
      "inventor_name_last": "Virdi",
      "inventor_name_first": "Gurpreet",
      "inventor_city": "Redmond",
      "inventor_state": "WA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Brown",
      "inventor_name_first": "Jared",
      "inventor_city": "Seattle",
      "inventor_state": "WA",
      "inventor_country": "US"
    }
  ],
  "abstract": "Pooling computing resources based on inferences about a plurality of hardware devices. The method includes identifying inference information about the plurality of devices. The method further includes based on the inference information optimizing resource usage of the plurality of hardware devices.",
  "filing_date": "20160219",
  "patent_number": "None",
  "summary": "<SOH> BRIEF SUMMARY <EOH>One embodiment illustrated herein includes a method that may be practiced in a computing environment. The method includes acts for pooling computing resources based on inferences about a plurality of hardware devices. The method includes identifying inference information about the plurality of devices. The method further includes based on the inference information optimizing resource usage of the plurality of hardware devices. This Summary is provided to introduce a selection of concepts in a simplified form that are further described below in the Detailed Description. This Summary is not intended to identify key features or essential features of the claimed subject matter, nor is it intended to be used as an aid in determining the scope of the claimed subject matter. Additional features and advantages will be set forth in the description which follows, and in part will be obvious from the description, or may be learned by the practice of the teachings herein. Features and advantages of the invention may be realized and obtained by means of the instruments and combinations particularly pointed out in the appended claims. Features of the present invention will become more fully apparent from the following description and appended claims, or may be learned by the practice of the invention as set forth hereinafter.",
  "date_published": "20170824",
  "title": "User Presence Prediction Driven Device Management",
  "ipcr_labels": [
    "G06N700",
    "G06N504"
  ],
  "_processing_info": {
    "original_size": 38551,
    "optimized_size": 3092,
    "reduction_percent": 91.98
  }
}