{
  "date_produced": "20161005",
  "publication_number": "US20160307114A1-20161020",
  "main_ipcr_label": "G06N9900",
  "decision": "PENDING",
  "application_number": "15044351",
  "inventor_list": [
    {
      "inventor_name_last": "Ghosh",
      "inventor_name_first": "Riddhiman",
      "inventor_city": "Sunnyvale",
      "inventor_state": "CA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Dekhil",
      "inventor_name_first": "Mohamed E.",
      "inventor_city": "Santa Clara",
      "inventor_state": "CA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Zhang",
      "inventor_name_first": "Lei",
      "inventor_city": "Chicago",
      "inventor_state": "IL",
      "inventor_country": "US"
    }
  ],
  "abstract": "There is provided a computer-implemented method of performing sentiment analysis. An exemplary method comprises performing a first sentiment analysis on microblogging data based on a method using an opinion lexicon. The method also includes training a classifier using training data from the first sentiment analysis. Additionally, the method includes identifying a new opinion term in the microblogging data by performing a statistical test. The new opinion terms are not in the opinion lexicon. The method also includes identifying new microblogging data based on the new opinion term. Further, the method includes performing a second sentiment analysis on the new microblogging data using the classifier.",
  "filing_date": "20160216",
  "patent_number": "None",
  "summary": "<SOH> BRIEF DESCRIPTION OF THE DRAWINGS <EOH>Certain examples of embodiments are described in the following detailed description and in reference to the drawings, in which: FIG. 1 is a block diagram of a system for sentiment analysis, according to an embodiment of the present techniques; FIG. 2 is a process flow diagram showing a computer-implemented method for sentiment analysis according to an embodiment of the present techniques; FIG. 3 is a process flow diagram showing a computer-implemented method for sentiment analysis according to an embodiment of the present techniques; FIG. 4 is a process flow diagram for a method for sentiment analysis according to an embodiment of the present techniques; FIG. 5 is a block diagram of a system for sentiment analysis in accordance with an embodiment of the present techniques; and FIG. 6 is a block diagram showing a tangible, machine-readable medium that stores code adapted to perform sentiment analysis according to an exemplary embodiment of the present techniques. detailed-description description=\"Detailed Description\" end=\"lead\"?",
  "date_published": "20161020",
  "title": "PERFORMING SENTIMENT ANALYSIS",
  "ipcr_labels": [
    "G06N9900",
    "G06F1727",
    "G06F1730"
  ],
  "_processing_info": {
    "original_size": 28414,
    "optimized_size": 2637,
    "reduction_percent": 90.72
  }
}