{
  "decision": "PENDING",
  "application_number": "15049172",
  "date_published": "20170824",
  "date_produced": "20170809",
  "title": "ORGANIZING ELECTRONICALLY STORED FILES USING AN AUTOMATICALLY GENERATED STORAGE HIERARCHY",
  "filing_date": "20160222",
  "inventor_list": [
    {
      "inventor_name_last": "Lipka",
      "inventor_name_first": "Nedim",
      "inventor_city": "San Jose",
      "inventor_state": "CA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Gollub",
      "inventor_name_first": "Tim",
      "inventor_city": "Weimar",
      "inventor_state": "",
      "inventor_country": "DE"
    },
    {
      "inventor_name_last": "Koh",
      "inventor_name_first": "Eunyee",
      "inventor_city": "San Jose",
      "inventor_state": "CA",
      "inventor_country": "US"
    }
  ],
  "ipcr_labels": [
    "G06F1730"
  ],
  "main_ipcr_label": "G06F1730",
  "summary": "<SOH> BRIEF DESCRIPTION OF THE DRAWINGS <EOH>FIG. 1 schematically illustrates separating files in a first directory into both of the first directory and a newly created second directory so that the number of files in each directory is below a threshold, in accordance with an embodiment of the present disclosure. FIG. 2 is a flow diagram illustrating a method for organizing files using a vector representation of the files, in accordance with an embodiment of the present disclosure. FIG. 3 is a flow diagram illustrating a method for naming directories based on a similarity between a vector representation of content in the directory and a vector representation of article titles in a database, in an embodiment of the present disclosure. FIG. 4 schematically illustrates a search method in which one or more files is selected and a vector representation of the selected one or more files is used as search criteria for semantically similar content, in an embodiment of the present disclosure. FIG. 5 is a flow diagram illustrating a method for searching for content of a storage system by selecting one or more files and/or directories and generating a vector representation of the selected files and/or directories to use as a search term, in accordance with an embodiment of the present disclosure. FIG. 6A is a block diagram of a distributed processing environment that includes a file organization system, in accordance with an embodiment of the present disclosure. FIG. 6B is a block diagram of a file organization system configured to organize a directory hierarchy and files within the directory hierarchy, in accordance with an embodiment of the present disclosure. detailed-description description=\"Detailed Description\" end=\"lead\"? The figures depict various embodiments of the present disclosure for purposes of illustration only. Numerous variations, configurations, and other embodiments will be apparent from the following detailed discussion.",
  "patent_number": "None",
  "abstract": "Methods and systems are described that automatically organize directory hierarchies and to label individual directories systematically. Upon a number of files in a first directory exceeding a maximum number of files, a second directory is created. The files formerly disposed only in the first directory are organized into both of the first directory and the second directory so that the threshold number of files is not exceeded in either of the first or second directories. Organizing the files into the first and second directories uses vector representations of each of the files generated by the system so that, when organized, the first and second directories each include files with similar content. Labels are selected for each of the directories based on a comparison between a vector representation of the collective contents of each directory and vector representations of titles in a database.",
  "publication_number": "US20170242906A1-20170824",
  "_processing_info": {
    "original_size": 71369,
    "optimized_size": 3727,
    "reduction_percent": 94.78
  }
}