{
  "date_produced": "20170816",
  "publication_number": "US20170249552A1-20170831",
  "main_ipcr_label": "G06N502",
  "decision": "PENDING",
  "application_number": "15055729",
  "inventor_list": [
    {
      "inventor_name_last": "Boss",
      "inventor_name_first": "Gregory J.",
      "inventor_city": "Saginaw",
      "inventor_state": "MI",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Jones",
      "inventor_name_first": "Andrew R.",
      "inventor_city": "Round Rock",
      "inventor_state": "TX",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Lingafelt",
      "inventor_name_first": "Charles S.",
      "inventor_city": "Durham",
      "inventor_state": "NC",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "McConnell",
      "inventor_name_first": "Kevin C.",
      "inventor_city": "Austin",
      "inventor_state": "TX",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Moore, JR.",
      "inventor_name_first": "John E.",
      "inventor_city": "Brownsburg",
      "inventor_state": "IN",
      "inventor_country": "US"
    }
  ],
  "abstract": "In an approach for providing a response based on situational context, a computer determines that an individual is within a proximity of a computing device. The computer identifies an identity associated with the determined individual within the proximity of the computing device. The computer determines a location associated with the identified identity. The computer identifies an entry within a table based on at least in part on the identified identity and the determined location. The computer determines a stimulus associated with the identified entry occurs. The computer provides a response based on determining the stimulus associated with the identified entry occurs.",
  "filing_date": "20160229",
  "patent_number": "None",
  "summary": "<SOH> SUMMARY <EOH>Aspects of the present invention disclose a method, computer program product, and system for providing a response based on situational context. The method includes one or more computer processors determining that an individual is within a proximity of a computing device. The method further includes one or more computer processors identifying an identity associated with the determined individual within the proximity of the computing device. The method further includes one or more computer processors determining a location associated with the identified identity. The method further includes one or more computer processors identifying an entry within a table based on at least in part on the identified identity and the determined location. The method further includes one or more computer processors determining a stimulus associated with the identified entry occurs. The method includes one or more computer processors a response based on determining the stimulus associated with the identified entry occurs.",
  "date_published": "20170831",
  "title": "SITUATIONAL CONTEXT ANALYSIS PROGRAM",
  "ipcr_labels": [
    "G06N502",
    "G06F1730",
    "G06N9900"
  ],
  "_processing_info": {
    "original_size": 120874,
    "optimized_size": 2860,
    "reduction_percent": 97.63
  }
}