{
  "date_produced": "20160608",
  "publication_number": "US20160180221A1-20160623",
  "main_ipcr_label": "G06N502",
  "decision": "PENDING",
  "application_number": "15054327",
  "inventor_list": [
    {
      "inventor_name_last": "Sweeney",
      "inventor_name_first": "Peter Joseph",
      "inventor_city": "Kitchener",
      "inventor_state": "",
      "inventor_country": "CA"
    },
    {
      "inventor_name_last": "Black",
      "inventor_name_first": "Alexander David",
      "inventor_city": "Guelph",
      "inventor_state": "",
      "inventor_country": "CA"
    }
  ],
  "abstract": "Computer-implemented systems and methods for synthesis of concept definitions and concept relationships from a domain of data, utilizing different semantic processing protocols such as formal concept analysis and faceted classification synthesis from existing domain concepts that have a confidence gradient built into them. A cognitive or an input agent provides an input of an active concept which is matched against existing domain concepts. The resultant pool of relevant domain concepts is then used to derive virtual concept definitions using a semantic processing protocol. The derivation is then overlaid with a concept of relative proximity of an attribute from another within an attribute set. An additional layer of coherence is given by the relative proximity measure. The end result is a pool of related virtual concept definitions in a tree structure.",
  "filing_date": "20160226",
  "patent_number": "None",
  "summary": "<SOH> SUMMARY <EOH>There are various aspects to the systems and methods disclosed herein. Unless it is indicated to the contrary, these aspects are not intended to be mutually exclusive, but can be combined in various ways that are either discussed herein or will be apparent to those skilled in the art. Various embodiments, therefore, are shown and still other embodiments naturally will follow to those skilled in the art. An embodiment may instantiate one or more aspects of the invention. Embodiments, like aspects, are not intended to be mutually exclave unless the context indicates otherwise. One aspect of the inventive concepts is a computer-implemented method to synthesize concept definitions and relationships, such as from a natural language data source, that comprises obtaining an active concept definition, matching the active concept definition to a plurality of extracted real concept definitions within a domain, analyzing the real concept definitions for coherence within their attributes and deriving a plurality of virtual concept definitions from the real concept definitions by semantic processing, such that the derived virtual concept definitions form a hierarchical structure. Another aspect is a computer-implemented method to synthesize concept definitions and relationships, that comprises obtaining an active concept definition, matching the active concept definition to a plurality of extracted real concept definitions comprising attributes within a domain, analyzing the real concept definitions for coherence within their attributes and deriving a plurality of virtual concept definitions from the real concept definitions by semantic processing, such that the derived virtual concept definitions form a hierarchical structure. Yet another aspect is a machine-readable medium containing executable computer-program instructions which, when executed by a data processing system causes said system to perform a method, the method comprising obtaining an active conce...",
  "date_published": "20160623",
  "title": "SYSTEMS AND METHODS FOR SEMANTIC CONCEPT DEFINITION AND SEMANTIC CONCEPT RELATIONSHIP SYNTHESIS UTILIZING EXISTING DOMAIN DEFINITIONS",
  "ipcr_labels": [
    "G06N502"
  ],
  "_processing_info": {
    "original_size": 55337,
    "optimized_size": 3642,
    "reduction_percent": 93.42
  }
}