{
  "date_produced": "20161102",
  "publication_number": "US20160335533A1-20161117",
  "main_ipcr_label": "G06N300",
  "decision": "PENDING",
  "application_number": "15052681",
  "inventor_list": [
    {
      "inventor_name_last": "Davis",
      "inventor_name_first": "Joshua P.",
      "inventor_city": "Plano",
      "inventor_state": "TX",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Munoz",
      "inventor_name_first": "Ronald",
      "inventor_city": "Hackensack",
      "inventor_state": "NJ",
      "inventor_country": "US"
    }
  ],
  "abstract": "According to an embodiment, a processing network is configured to access a reputation system, provide a first user interface, provide a second user interface, receive a request from a user through the second user interface, retrieve user information from the reputation system, assign a plurality of human intelligence tasks based on the request, receive a plurality of results from the plurality of human intelligence tasks, confirm an identity and a status of the user based on the user information and the plurality of results, execute the request based on confirming the identity and the status of the user, and store evidence of execution of the request as an immutable data entry in a permanent database. The first user interface includes information from the reputation system, and the plurality of human intelligence tasks are assigned to a plurality of participants through the first user interface.",
  "filing_date": "20160224",
  "patent_number": "None",
  "summary": "<SOH> SUMMARY <EOH>According to an embodiment, a processing network is configured to access a reputation system, provide a first user interface, provide a second user interface, receive a request from a user through the second user interface, retrieve user information from the reputation system, assign a plurality of human intelligence tasks based on the request, receive a plurality of results from the plurality of human intelligence tasks, confirm an identity and a status of the user based on the user information and the plurality of results, execute the request based on confirming the identity and the status of the user, and store evidence of execution of the request as an immutable data entry in a permanent database. The first user interface includes information from the reputation system, and the plurality of human intelligence tasks are assigned to a plurality of participants through the first user interface.",
  "date_published": "20161117",
  "title": "System and Method for an Autonomous Entity",
  "ipcr_labels": [
    "G06N300",
    "G06N504"
  ],
  "_processing_info": {
    "original_size": 173602,
    "optimized_size": 2519,
    "reduction_percent": 98.55
  }
}