{
  "decision": "ACCEPTED",
  "application_number": "15059172",
  "date_published": "20160623",
  "date_produced": "20160608",
  "title": "MULTIPLE STAGE WORKLOAD MANAGEMENT SYSTEM",
  "filing_date": "20160302",
  "inventor_list": [
    {
      "inventor_name_last": "Caufield",
      "inventor_name_first": "Brian K.",
      "inventor_city": "Livermore",
      "inventor_state": "CA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Liu",
      "inventor_name_first": "Ron E.",
      "inventor_city": "San Jose",
      "inventor_state": "CA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Padmanabhan",
      "inventor_name_first": "Sriram K.",
      "inventor_city": "San Jose",
      "inventor_state": "CA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Shum",
      "inventor_name_first": "Mi W.",
      "inventor_city": "San Jose",
      "inventor_state": "CA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Sun",
      "inventor_name_first": "Chun H.",
      "inventor_city": "Beijing",
      "inventor_state": "",
      "inventor_country": "CN"
    },
    {
      "inventor_name_last": "Wei",
      "inventor_name_first": "DongJie",
      "inventor_city": "Beijing",
      "inventor_state": "",
      "inventor_country": "CN"
    }
  ],
  "ipcr_labels": [
    "G06F950"
  ],
  "main_ipcr_label": "G06F950",
  "summary": "<SOH> SUMMARY <EOH>Provided is a method for multiple stage workload management. The method comprises providing, using a processor of a computer, a staging queue and a run queue; receiving a workload; in response to determining that application resources are not available and that the workload has not been previously semi-started, adding the workload to the staging queue; and in response to determining that the application resources are not available and that the workload has been semi-started, in response to determining that run resources are available, starting the workload, and, in response to determining that the run resources are not available, adding the workload to the run queue. Provided is a computer program product for multiple stage workload management. The computer program product comprises a computer readable storage medium having program code embodied therewith, the program code executable by at least one processor to perform: providing a staging queue and a run queue; receiving a workload; in response to determining that application resources are not available and that the workload has not been previously semi-started, adding the workload to the staging queue; and in response to determining that the application resources are not available and that the workload has been semi-started, in response to determining that run resources are available, starting the workload, and, in response to determining that the run resources are not available, adding the workload to the run queue Provided is a computer system for multiple stage workload management. The computer system comprises one or more processors, one or more computer-readable memories and one or more computer-readable, tangible storage devices; and program instructions, stored on at least one of the one or more computer-readable, tangible storage devices for execution by at least one of the one or more processors via at least one of the one or more memories, to perform: providing a staging queue and a r...",
  "patent_number": "9733984",
  "abstract": "Provided are techniques for multiple stage workload management. A staging queue and a run queue are provided. A workload is received. In response to determining that application resources are not available and that the workload has not been previously semi-started, the workload is added to the staging queue. In response to determining that the application resources are not available and that the workload has been semi-started, and, in response to determining that run resources are available, the workload is started. In response to determining that the application resources are not available and that the workload has been semi-started, and, in response to determining that the run resources are not available, adding the workload to the run queue.",
  "publication_number": "US20160179578A1-20160623",
  "_processing_info": {
    "original_size": 69719,
    "optimized_size": 4014,
    "reduction_percent": 94.24
  }
}