{
  "date_produced": "20160608",
  "publication_number": "US20160180254A1-20160623",
  "main_ipcr_label": "G06N9900",
  "decision": "ACCEPTED",
  "application_number": "15056080",
  "inventor_list": [
    {
      "inventor_name_last": "MINENO",
      "inventor_name_first": "Kazuo",
      "inventor_city": "Kawasaki",
      "inventor_state": "",
      "inventor_country": "JP"
    }
  ],
  "abstract": "The information matching apparatus includes: a training data setting unit that sets supervised data in a machine learning device of supervised learning that learns judgment criteria used for a judgment of identicalness, similarity, and relevance between a plurality of records by matching the records configured by sets of values corresponding to items; a check point setting unit that sets a check point configured by one set of two records used for evaluating the set supervised data; and a learning result evaluation unit, for the set check point, acquires a change between a judgment result using judgment criteria derived as a result of learning based on set first supervised data and a judgment result using judgment criteria derived as a result of learning based on set second supervised data set and evaluates the supervised data based on the acquired change.",
  "filing_date": "20160229",
  "patent_number": "9721213",
  "summary": "<SOH> SUMMARY <EOH>According to an aspect of an embodiment of the invention, an information matching apparatus includes a processor, a memory. The processor executes setting supervised data in a machine learning device of supervised learning that learns judgment criteria used for a judgment of identicalness, similarity, and relevance between a plurality of records by matching the records configured by sets of values corresponding to items, setting a check point configured by one set of two records used for evaluating the supervised data set at the setting supervised data; and evaluating, for the check point set at the setting a check point, by acquiring a change between a judgment result using judgment criteria derived as a result of learning based on first supervised data set at the setting supervised data and a judgment result using judgment criteria derived as a result of learning based on second supervised data set at the setting supervised data and by evaluating the supervised data based on the acquired change. The object and advantages of the embodiment will be realized and attained by means of the elements and combinations particularly pointed out in the claims. It is to be understood that both the foregoing general description and the following detailed description are exemplary and explanatory and are not restrictive of the embodiment, as claimed.",
  "date_published": "20160623",
  "title": "INFORMATION MATCHING APPARATUS, METHOD OF MATCHING INFORMATION, AND COMPUTER READABLE STORAGE MEDIUM HAVING STORED INFORMATION MATCHING PROGRAM",
  "ipcr_labels": [
    "G06N9900"
  ],
  "_processing_info": {
    "original_size": 132986,
    "optimized_size": 2876,
    "reduction_percent": 97.84
  }
}