{
  "decision": "PENDING",
  "application_number": "15050996",
  "date_published": "20160630",
  "date_produced": "20160615",
  "title": "METHODS AND DEVICES FOR SWITCHING ON OR OFF SOCKET",
  "filing_date": "20160223",
  "inventor_list": [
    {
      "inventor_name_last": "LIU",
      "inventor_name_first": "Xin",
      "inventor_city": "Beijing",
      "inventor_state": "",
      "inventor_country": "CN"
    },
    {
      "inventor_name_last": "LIANG",
      "inventor_name_first": "Yue",
      "inventor_city": "Beijing",
      "inventor_state": "",
      "inventor_country": "CN"
    },
    {
      "inventor_name_last": "HOU",
      "inventor_name_first": "Enxing",
      "inventor_city": "Beijing",
      "inventor_state": "",
      "inventor_country": "CN"
    }
  ],
  "ipcr_labels": [
    "G06F128",
    "G06F944"
  ],
  "main_ipcr_label": "G06F128",
  "summary": "<SOH> SUMMARY <EOH>Accordingly, embodiments of the present disclosure provide methods and devices for switching on or off a socket. According to a first aspect of the present disclosure, there is provided a method for switching on or off socket, including: determining whether a processor of the socket is restarted after being powered off; setting a state of the socket as an off state when the processor is restarted after being powered off. According to a second aspect of the present disclosure, there is provided a device for switching on or off a socket, including: a determining module, configured to determine whether a processor of the socket is restarted after being powered off; a control module, configured to set a state of the socket as an off state when the processor is restarted after being powered off. According to a third aspect of the present disclosure, there is provided a device for switching on or off a socket, including: a processor; and a memory for storing instructions executable by the processor. The processor is configured to: determine whether a processor of the socket is restarted after being powered off; set a state of the socket as an off state when the processor is restarted after being powered off. It is to be understood that both the foregoing general description and the following detailed description are exemplary and explanatory only and are not restrictive of the present disclosure.",
  "patent_number": "None",
  "abstract": "A method and a device are provided for switching on or off a socket. The method includes: determining whether a processor of the socket is restarted after being powered off; setting a state of the socket as an off state when the processor is restarted after being powered off.",
  "publication_number": "US20160187953A1-20160630",
  "_processing_info": {
    "original_size": 41698,
    "optimized_size": 2524,
    "reduction_percent": 93.95
  }
}