{
  "decision": "PENDING",
  "application_number": "15056004",
  "date_published": "20160929",
  "date_produced": "20160914",
  "title": "DYNAMIC WORKLOAD DEPLOYMENT FOR DATA INTEGRATION SERVICES",
  "filing_date": "20160229",
  "inventor_list": [
    {
      "inventor_name_last": "Li",
      "inventor_name_first": "Yong",
      "inventor_city": "Newton",
      "inventor_state": "MA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Mamou",
      "inventor_name_first": "Jean-Claude",
      "inventor_city": "Millbury",
      "inventor_state": "MA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Meeks",
      "inventor_name_first": "David T.",
      "inventor_city": "Ashland",
      "inventor_state": "MA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Pu",
      "inventor_name_first": "Xiaoyan",
      "inventor_city": "Chelmsford",
      "inventor_state": "MA",
      "inventor_country": "US"
    }
  ],
  "ipcr_labels": [
    "G06F950",
    "G06F948",
    "H04L1224"
  ],
  "main_ipcr_label": "G06F950",
  "summary": "<SOH> SUMMARY <EOH>Aspects of an embodiment of the present invention disclose a method, system, and computer program product for deploying workload in a multi-tenancy computing environment, in accordance with an embodiment of the present invention. The method includes generating, by one or more computer processors, a tenant ID and a plan ID for a tenant based, at least in part, on a tenant registration request. The method includes storing, by one or more computer processors, the tenant ID and the plan ID into a shared system record. The method includes receiving, by one or more computer processors, a request to update a first tenant service plan. The method includes determining, by one or more computer processors, one or more resource pools supporting a second tenant service plan based at least in part, on an association between the tenant ID and the plan ID. The method includes deploying, by one or more computer processors, one or more resources from the one or more resource pools supporting the second tenant service plan.",
  "patent_number": "None",
  "abstract": "An approach for deploying workload in a multi-tenancy computing environment is provided. The approach generates, by one or more computer processors, a tenant ID and a plan ID for a tenant based, at least in part, on a tenant registration request. The approach stores, by one or more computer processors, the tenant ID and the plan ID into a shared system record. The approach receives, by one or more computer processors, a request to update a first tenant service plan. The approach determines, by one or more computer processors, one or more resource pools supporting a second tenant service plan based at least in part, on an association between the tenant ID and the plan ID. The approach deploys, by one or more computer processors, one or more resources from the one or more resource pools supporting the second tenant service plan.",
  "publication_number": "US20160283275A1-20160929",
  "_processing_info": {
    "original_size": 60833,
    "optimized_size": 2875,
    "reduction_percent": 95.27
  }
}