{
  "decision": "ACCEPTED",
  "application_number": "15050754",
  "date_published": "20160908",
  "date_produced": "20160824",
  "title": "IMAGE PROCESSING SYSTEM, PROCESS EXECUTION CONTROL APPARATUS, AND IMAGE GENERATION-OUTPUT CONTROL APPARATUS",
  "filing_date": "20160223",
  "inventor_list": [
    {
      "inventor_name_last": "YAMAKAWA",
      "inventor_name_first": "Takuya",
      "inventor_city": "Kanagawa",
      "inventor_state": "",
      "inventor_country": "JP"
    }
  ],
  "ipcr_labels": [
    "G06K1500",
    "G06K1502"
  ],
  "main_ipcr_label": "G06K1500",
  "summary": "<SOH> SUMMARY <EOH>As one aspect of the present invention, an image processing system for sequentially executing a plurality of processes is devised. The image processing system applicable includes a process execution control apparatus to control an execution of the plurality of processes, and an image generation-output control apparatus to control an execution of image generation-output operation. The process execution control apparatus includes a control-side drawing information generator to generate drawing information to be referred by an image forming apparatus when the image forming apparatus performs the image generation-output operation based on information of a target image to be used for the image generation-output operation. The image generation-output control apparatus includes an output-side drawing information generator corresponding to the control-side drawing information generator. The control-side drawing information generator excludes an execution result of a designated process item from execution results of a plurality of process items, to be executed for generating the drawing information, to generate designated-information-excluded image information based on the information of the target image. When process contents of the designated process item is set at the image generation-output control apparatus, the output-side drawing information generator executes the plurality of process items based on the generated designated-information-excluded image information. As one aspect of the present invention, a process execution control apparatus employable for an image processing system for sequentially executing a plurality of processes is devised. The process execution control apparatus is capable of controlling an execution of the plurality of processes. The process execution control apparatus includes a control-side drawing information generator to generate drawing information to be referred by an image forming apparatus when the image forming apparat...",
  "patent_number": "9704075",
  "abstract": "An image processing system for sequentially executing processes includes a process execution control apparatus to control an execution of the processes, and an image generation-output control apparatus to control an execution of image generation-output operation. The process execution control apparatus includes a control-side drawing information generator to generate drawing information to be referred when an image forming apparatus performs the image generation-output operation. The image generation-output control apparatus includes an output-side drawing information generator corresponding to the control-side drawing information generator. The control-side drawing information generator excludes an execution result of a designated process item from execution results of a plurality of process items, to be executed for generating the drawing information, to generate designated-information-excluded image information. When process contents of the designated process item is set at the imag...",
  "publication_number": "US20160260000A1-20160908",
  "_processing_info": {
    "original_size": 146682,
    "optimized_size": 3616,
    "reduction_percent": 97.53
  }
}