{
  "date_produced": "20160824",
  "publication_number": "US20160260028A1-20160908",
  "main_ipcr_label": "G06N9900",
  "decision": "ACCEPTED",
  "application_number": "15057184",
  "inventor_list": [
    {
      "inventor_name_last": "Nugent",
      "inventor_name_first": "Alex",
      "inventor_city": "Santa Fe",
      "inventor_state": "NM",
      "inventor_country": "US"
    }
  ],
  "abstract": "Methods and systems for feature extraction of LIDAR surface manifolds. LIDAR point data with respect to one or more LIDAR surface manifolds can be generated. An AHAH-based feature extraction operation can be automatically performed on the point data for compression and processing thereof. The results of the AHAH-based feature extraction operation can be output as a compressed binary label representative of the at least one surface manifold rather than the point data to afford a high-degree of compression for transmission or further processing thereof. Additionally, one or more voxels of a LIDAR point cloud composed of the point data can be scanned in order to recover the compressed binary label, which represents prototypical surface patches with respect to the LIDAR surface manifold(s).",
  "filing_date": "20160301",
  "patent_number": "9589238",
  "summary": "<SOH> BRIEF SUMMARY <EOH>The following summary of the invention is provided to facilitate an understanding of some of the innovative features unique to the present invention, and is not intended to be a full description. A full appreciation of the various aspects of the invention can be gained by taking the entire specification, claims, drawings, and abstract as a whole. It is therefore, one aspect of the disclosed embodiments to provide for an, improved feature extraction method and system. It is another aspect of the disclosed embodiments to provide for methods and systems for feature extraction of surface manifolds from noisy point cloud data sources. The aforementioned aspects and other objectives and advantages can now be achieved as described herein. Methods and systems for feature extraction of surface manifolds are disclosed herein. In general, pixilated data with depth information can be generated via techniques including, for example, LIDAR. An AHAH-based feature extraction operation can be automatically performed on or with respect to the point data for compression and processing thereof. The results of the AHAH-based feature extraction operation can be output as a compressed binary label representative of the at least one surface manifold rather than the point data to afford a high-degree of compression for transmission or further processing thereof. Additionally, one or more voxels of a point cloud composed of the point data can be scanned in order to recover the compressed binary label, which represents prototypical surface patches with respect to the surface manifold(s).",
  "date_published": "20160908",
  "title": "METHODS AND SYSTEMS FOR FEATURE EXTRACTION OF SURFACE MANIFOLDS",
  "ipcr_labels": [
    "G06N9900",
    "G06N504"
  ],
  "_processing_info": {
    "original_size": 67431,
    "optimized_size": 2972,
    "reduction_percent": 95.59
  }
}