{
  "date_produced": "20170809",
  "publication_number": "US20170243130A1-20170824",
  "main_ipcr_label": "G06N700",
  "decision": "PENDING",
  "application_number": "15052583",
  "inventor_list": [
    {
      "inventor_name_last": "Kephart",
      "inventor_name_first": "Aaron D.",
      "inventor_city": "Charlotte",
      "inventor_state": "NC",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Howie",
      "inventor_name_first": "Charles C.",
      "inventor_city": "Charlotte",
      "inventor_state": "NC",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Glover",
      "inventor_name_first": "DeAundra K.",
      "inventor_city": "Waxhaw",
      "inventor_state": "NC",
      "inventor_country": "US"
    }
  ],
  "abstract": "Embodiments of the present invention relate to apparatuses, systems, methods and computer program products for a technology configuration system. Specifically, the system typically provides operational data processing of a plurality of records associated with information technology operational activities, for dynamic transformation of data and evaluation of interdependencies of technology resources. In other aspects, the system typically provides technical language processing of the plurality of records for transforming technical and descriptive data, and constructing categorical activity records. The system may be configured to achieve significant reduction in memory storage and processing requirements by performing categorical data encoding of the plurality of records. The system may employ a dynamic categorical data decoding process, which delivers a reduction in processing time when the encoded records are decoded for evaluating the exposure of technology change events to technolog...",
  "filing_date": "20160224",
  "patent_number": "None",
  "summary": "<SOH> BRIEF SUMMARY <EOH>Embodiments of the present invention address the above needs and/or achieve other advantages by providing a computerized system, and an associated method and computer program product, for systematic data processing and technology configuration. Specifically, the system provides operational data processing, evaluation of interdependencies of information technology operational activities of an entity, technical language processing of activity records, categorical data encoding, dynamic data decoding, evaluation of technology stability, evaluation of the likelihood of technology change incidents, evaluation of the impact of technology change incidents, and/or modification of technology change incidents. In some embodiments the system comprises a computer apparatus including at least one processor, at least one memory device and a network communication device. In some embodiments, one or more modules are stored in the at least one memory device comprising computer readable instructions, that when executed by the at least one processor, cause the at least one processor to perform operational data processing, technical language processing, categorical data encoding, dynamic data decoding, and/or technology change evaluation. In some embodiments, the system is configured for operational data processing and data interdependency evaluation, wherein the computerized system provides an operational data processor module configured for evaluation, modification and quality control of data associated with information technology operational activities. In this regard, the system is configured to: retrieve a plurality of records regarding a plurality of information technology operational activities from an activity record database, wherein each record comprises a plurality of technology elements associated with one of the plurality of information technology operational activities, wherein at least one technology element of the plurality of technology element...",
  "date_published": "20170824",
  "title": "COMPUTERIZED SYSTEM FOR EVALUATING THE IMPACT OF TECHNOLOGY CHANGE INCIDENTS",
  "ipcr_labels": [
    "G06N700",
    "G06F1730"
  ],
  "_processing_info": {
    "original_size": 284682,
    "optimized_size": 3882,
    "reduction_percent": 98.64
  }
}