{
  "date_produced": "20170809",
  "publication_number": "US20170243120A1-20170824",
  "main_ipcr_label": "G06N504",
  "decision": "PENDING",
  "application_number": "15050887",
  "inventor_list": [
    {
      "inventor_name_last": "Doan",
      "inventor_name_first": "Dai Duong",
      "inventor_city": "Alameda",
      "inventor_state": "CA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Merritt",
      "inventor_name_first": "Alexander",
      "inventor_city": "Halifax",
      "inventor_state": "",
      "inventor_country": "CA"
    }
  ],
  "abstract": "A system for processing social media data includes a platform with a social media acquisition module configurable to collect a plurality of social media statements. The platform further includes an analysis engine configurable to analyze the plurality of social media statements according to a first sentiment model to generate first analytics data. The analysis engine is configurable to present the first analytics data to a client user, including a display of a sentiment value for each of the social media statements. The platform further includes a feedback queue configurable to receive feedback from the client user on at least a portion of the sentiment values; a model modification module configurable to modify the first sentiment model based on the feedback to result in a modified sentiment model; and a database configurable to store the modified sentiment model as a personalized sentiment model for the client user.",
  "filing_date": "20160223",
  "patent_number": "None",
  "summary": "<SOH> BRIEF DESCRIPTION OF THE DRAWINGS <EOH>A more complete understanding of the subject matter may be derived by referring to the detailed description and claims when considered in conjunction with the following figures, wherein like reference numbers refer to similar elements throughout the figures. FIG. 1 is a schematic block diagram of an exemplary environment for the storage, management, and administration of social media data analytics in accordance with an exemplary embodiment; FIG. 2 is a schematic block diagram of a client analytics platform in accordance with an exemplary embodiment; FIG. 3 is an exemplary tree structure architecture generated by the client analytics platform of FIG. 2 in accordance with an exemplary embodiment; FIG. 4 is a flowchart of a method for administering and personalizing sentiment analysis in accordance with an exemplary embodiment; FIG. 5 is a sample report generated by the client analytics platform of FIG. 2 in accordance with an exemplary embodiment; FIGS. 6-8 are sample statement trees generated by the client analytics platform of FIG. 2 in accordance with exemplary embodiments; and FIG. 9 is a block diagram of an exemplary multi-tenant application system that may implement the platform of FIG. 2 and the method of FIG. 4 in accordance with an exemplary embodiment. detailed-description description=\"Detailed Description\" end=\"lead\"?",
  "date_published": "20170824",
  "title": "DATA ANALYTICS SYSTEMS AND METHODS WITH PERSONALIZED SENTIMENT MODELS",
  "ipcr_labels": [
    "G06N504",
    "G06F30482",
    "G06N9900"
  ],
  "_processing_info": {
    "original_size": 70893,
    "optimized_size": 3054,
    "reduction_percent": 95.69
  }
}