{
  "date_produced": "20161102",
  "publication_number": "US20160335556A1-20161117",
  "main_ipcr_label": "G06N700",
  "decision": "PENDING",
  "application_number": "15053347",
  "inventor_list": [
    {
      "inventor_name_last": "TERAOKA",
      "inventor_name_first": "Teruhiko",
      "inventor_city": "Tokyo",
      "inventor_state": "",
      "inventor_country": "JP"
    }
  ],
  "abstract": "A prediction device according to an embodiment includes an acquiring unit and a predicting unit. The acquiring unit acquires usage states of a plurality of terminals used by a user. The predicting unit predicts a context of the user on the basis of the usage states of the respective terminals acquired by the acquiring unit. For example, the acquiring unit acquires discrete data indicating the usage state of each of the terminals, and the predicting unit predicts the context of the user on the basis of a combination of pieces of discrete data acquired from the respective terminals.",
  "filing_date": "20160225",
  "patent_number": "None",
  "summary": "<SOH> SUMMARY OF THE INVENTION <EOH>It is an object of the present invention to at least partially solve the problems in the conventional technology. A prediction device according to the present application includes an acquiring unit that acquires usage states of a plurality of terminals used by a user, and a predicting unit that predicts a context of the user on the basis of a combination of the usage states of the respective terminals acquired by the acquiring unit. The above and other objects, features, advantages and technical and industrial significance of this invention will be better understood by reading the following detailed description of presently preferred embodiments of the invention, when considered in connection with the accompanying drawings.",
  "date_published": "20161117",
  "title": "PREDICTION DEVICE, TERMINAL, PREDICTION METHOD, AND NON-TRANSITORY COMPUTER READABLE STORAGE MEDIUM",
  "ipcr_labels": [
    "G06N700",
    "G06N502"
  ],
  "_processing_info": {
    "original_size": 93804,
    "optimized_size": 1949,
    "reduction_percent": 97.92
  }
}