{
  "date_produced": "20160601",
  "publication_number": "US20160171392A1-20160616",
  "main_ipcr_label": "G06N9900",
  "decision": "PENDING",
  "application_number": "15050726",
  "inventor_list": [
    {
      "inventor_name_last": "Allen",
      "inventor_name_first": "Corville O.",
      "inventor_city": "Morrisville",
      "inventor_state": "NC",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Chung",
      "inventor_name_first": "Albert A.",
      "inventor_city": "Cary",
      "inventor_state": "NC",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Freed",
      "inventor_name_first": "Andrew R.",
      "inventor_city": "Cary",
      "inventor_state": "NC",
      "inventor_country": "US"
    }
  ],
  "abstract": "A method, system and computer-usable medium are disclosed for adjusting fact-based answers provided by a question/answer (QA) system. A user submits a question to the QA system, where it is categorized into a question type. The QA system then processes the question to generate an answer. The QA system then generates an answer adjustment if it is determined that the question type and answer meet a predicted undesirable outcome. The answer adjustment may include a warning, a disclaimer, a recommendation, an alternative fact-based answer, a referral to an assistance service, or any combination thereof.",
  "filing_date": "20160223",
  "patent_number": "None",
  "summary": "<SOH> SUMMARY OF THE INVENTION <EOH>A method, system and computer-usable medium are disclosed for adjusting fact-based answers provided by a question/answer (QA) system. In various embodiments, the QA system is trained to identify a question that might lead to an undesirable outcome. In certain embodiments, the method of training the QA system may include manual, automated or learning approaches. In various embodiments, a user submits a question to the QA system, where it is categorized into a question type. The QA system then processes the question to generate an answer. The QA system then generates an answer adjustment if it is determined that the question type and answer meet a predicted undesirable outcome. In certain embodiments, the answer adjustment may include a warning, a disclaimer, a recommendation, an alternative fact-based answer, a referral to an assistance service, or any combination thereof. In various embodiments, the answer and the answer adjustment is provided to the user. In certain embodiments, a time-stamped record is generated and retained, which includes the question, the answer, the answer adjustment, and identification information associated with the user.",
  "date_published": "20160616",
  "title": "Adjusting Fact-Based Answers to Consider Outcomes",
  "ipcr_labels": [
    "G06N9900",
    "G06F1730"
  ],
  "_processing_info": {
    "original_size": 57467,
    "optimized_size": 2649,
    "reduction_percent": 95.39
  }
}