{
  "date_produced": "20160601",
  "publication_number": "US20160171375A1-20160616",
  "main_ipcr_label": "G06N502",
  "decision": "PENDING",
  "application_number": "15051857",
  "inventor_list": [
    {
      "inventor_name_last": "WANG",
      "inventor_name_first": "Xiaodong",
      "inventor_city": "Shanxi",
      "inventor_state": "",
      "inventor_country": "CN"
    },
    {
      "inventor_name_last": "FANG",
      "inventor_name_first": "Jun",
      "inventor_city": "Shanxi",
      "inventor_state": "",
      "inventor_country": "CN"
    }
  ],
  "abstract": "In some examples, a method for recognizing a pseudo message is described. The method may include receiving a message intended for a recipient having an associated recipient Ontology. The method may also include semantically analyzing content of the message to determine whether the content is inconsistent with any rules in the recipient Ontology. The method may also include, upon a determination that the content is inconsistent with a rule in the recipient Ontology, authenticating the message as a pseudo message.",
  "filing_date": "20160224",
  "patent_number": "None",
  "summary": "<SOH> SUMMARY <EOH>Technologies described herein generally relate to the generation and identification of pseudo messages based on Ontology reasoning. In some examples, a method for recognizing a pseudo message is described. The method may include receiving a message intended for a recipient having an associated recipient Ontology. The method may also include semantically analyzing content of the message to determine whether the content is inconsistent with any rules in the recipient Ontology. The method may also include, upon a determination that the content is inconsistent with a rule in the recipient Ontology, authenticating the message as a pseudo message. In some examples, a method for generating a pseudo message recognizable as such by an intended recipient is described. The method may include generating an error sentence that is inconsistent with a rule in a recipient Ontology associated with a recipient. The method may also include selecting a piece of text as background content. The method may also include inserting the error sentence into the background content to form the pseudo message. In some examples, a system for generating and recognizing pseudo messages is described. The system may include a first processor and a first non-transitory computer-readable medium. The first non-transitory computer-readable medium may have computer-executable instructions stored thereon that are executable by the first processor to perform operations. The operations may include receiving messages intended for a recipient having an associated recipient Ontology. The operations may also include semantically analyzing content of each received message to determine whether the content is inconsistent with any rules in the recipient Ontology. The operations may also include, upon a determination that the content of a message is inconsistent with a rule in the recipient Ontology, authenticating the message as a pseudo message. The foregoing summary is illustrative only and is n...",
  "date_published": "20160616",
  "title": "PSEUDO MESSAGE RECOGNITION BASED ON ONTOLOGY REASONING",
  "ipcr_labels": [
    "G06N502"
  ],
  "_processing_info": {
    "original_size": 69934,
    "optimized_size": 3192,
    "reduction_percent": 95.44
  }
}