{
  "date_produced": "20170809",
  "publication_number": "US20170243133A1-20170824",
  "main_ipcr_label": "G06N9900",
  "decision": "PENDING",
  "application_number": "15050787",
  "inventor_list": [
    {
      "inventor_name_last": "Zavesky",
      "inventor_name_first": "Eric",
      "inventor_city": "Austin",
      "inventor_state": "TX",
      "inventor_country": "US"
    }
  ],
  "abstract": "An autonomous agent maintains and updates an underlying model in a dynamic system. The autonomous agent receives minimum acceptable criteria from secondary users of the underlying model. The agent then compares current output samples of the model with the minimum acceptable criteria. If output samples do not meet the minimum acceptable criteria, then the agent formulates alternative model improvement actions and evaluates each alternative action by modeling rewards associated with it. The agent executes the alternative model improvement action having the highest reward.",
  "filing_date": "20160223",
  "patent_number": "None",
  "summary": "<SOH> BRIEF DESCRIPTION OF THE DRAWINGS <EOH>The present disclosure can be readily understood by considering the following detailed description in conjunction with the accompanying drawings, in which: FIG. 1 is a block diagram showing a communications network in accordance with aspects of the present disclosure. FIG. 2 is a block diagram showing a virtualized communications network in accordance with aspects of the present disclosure. FIG. 3 is a block diagram showing a system in accordance with aspects of the present disclosure. FIG. 4 is a block diagram showing tasks and information flow in accordance with aspects of the present disclosure. FIG. 5 is a block diagram showing a method in accordance with aspects of the present disclosure. detailed-description description=\"Detailed Description\" end=\"lead\"? To facilitate understanding, identical reference numerals have been used, where possible, to designate identical elements that are common to the figures.",
  "date_published": "20170824",
  "title": "Agent For Learning And Optimization Execution",
  "ipcr_labels": [
    "G06N9900",
    "G06N504"
  ],
  "_processing_info": {
    "original_size": 44663,
    "optimized_size": 2089,
    "reduction_percent": 95.32
  }
}