{
  "decision": "ACCEPTED",
  "application_number": "15055106",
  "date_published": "20170831",
  "date_produced": "20170816",
  "title": "DATA PRIVACY MANAGEMENT SYSTEM AND METHOD",
  "filing_date": "20160226",
  "inventor_list": [
    {
      "inventor_name_last": "Lovin",
      "inventor_name_first": "Paul",
      "inventor_city": "Munich",
      "inventor_state": "",
      "inventor_country": "DE"
    }
  ],
  "ipcr_labels": [
    "G06F2162"
  ],
  "main_ipcr_label": "G06F2162",
  "summary": "<SOH> SUMMARY <EOH>This Summary is provided to introduce a selection of concepts in a simplified form that are further described below in the Detailed Description. This Summary is not intended to identify key features or essential features of the claimed subject matter, nor is it intended to be used as an aid in determining the scope of the claimed subject matter. In various aspects, systems, methods, and computer-readable storage devices are provided to improve a computing device's ability to manage data privacy for online users. One aspect of the technology described herein is to improve the computing device's ability for building and maintaining a data distribution structure to track the whereabouts of various user data of a user. Another aspect of the technology described herein is to improve the computing device's ability to direct one service provider to furnish another service provider with requisite user data upon the user's explicit or implicit consent. Yet another aspect of the technology described herein is to improve the computing device's ability to facilitate the user to manage his or her data distributed over various service providers, e.g., to manually purge some user data from a service provider.",
  "patent_number": "9946897",
  "abstract": "Aspects of the technology described herein can provide data privacy management. An exemplary computing device may have a tracker to track various user data of a user distributed among different service providers based on metadata associated with the user data. When a transaction manager of the exemplary computing device receives a request for a first service provider to access the user data of the user, the transaction manager may request a second service provider having the user data to provide the user data to the first service provider if the user approves the first service provider to access the user data.",
  "publication_number": "US20170249478A1-20170831",
  "_processing_info": {
    "original_size": 79027,
    "optimized_size": 2374,
    "reduction_percent": 97.0
  }
}