{
  "decision": "PENDING",
  "application_number": "15055444",
  "date_published": "20160623",
  "date_produced": "20160608",
  "title": "ENHANCED SYSTEM AND METHOD FOR PROVIDING A VIRTUAL SPACE",
  "filing_date": "20160226",
  "inventor_list": [
    {
      "inventor_name_last": "LUNDIN",
      "inventor_name_first": "John A.",
      "inventor_city": "San Francisco",
      "inventor_state": "CA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "WESTFALL",
      "inventor_name_first": "Daniel",
      "inventor_city": "San Francisco",
      "inventor_state": "CA",
      "inventor_country": "US"
    }
  ],
  "ipcr_labels": [
    "G06F30481",
    "G06F314",
    "G06F30484",
    "G06T1340"
  ],
  "main_ipcr_label": "G06F30481",
  "summary": "<SOH> SUMMARY <EOH>One aspect of the disclosure relates to determining a representation of a virtual space based on information defining a personality of a character within the virtual space. As described above, within a virtual space, different types of characters based on how they are controlled may exist. For example, an avatar is a type of character that may be controlled by an associated user to represent the user in the virtual space. AI characters, on the other end, may be controlled by intelligence that is configured into the virtual space, such as computer programs. One of ordinary skill in the art will recognize any other types of characters that may exist in a virtual space. In any case, a character's personality may be determined based on activities, events, missions and etc. the character has participated in within the virtual space. The personality of the character may also be determined based on information regarding a user. In some examples, the character's personality may be determined in ways that are not controlled or predicted by the user. In some other examples, the character's personality may be determined by adopting the user's personality, skills, preferences and/or other information regarding the user. In some implementations, the character's personality may be determined to provide therapeutic impact to the user or to act as a compliment to the user's personality to increase their emotional connection to the character and their engagement in the game, or facilitate their development. This may include determining a character's personality to cause growth, self-understanding, empathy, increased assertiveness, improved ability to relate to others, decreases in symptomatology such as anxiety or low mood, and/or to provide other therapeutic impacts. The personality of the character may also be customized by the user (e.g., by adjusting a set of traits reflecting the character's personality such as enthusiasm, compassion, toughness, tone of voice...",
  "patent_number": "None",
  "abstract": "A system and method for providing a virtual space determines a representation of the virtual space based on information defining a personality of a character within the virtual space and/or information indicating a user's personality. The system and method may also determine the information defining the character's personality based on information regarding the user and/or information regarding the character. In some examples, the system and method may further determine information to facilitate a development of the user based on the information describing the user's personality. The system and method may also determine the user's personality based on information indicating user's personality. In some examples, the user's personality may be determined based on user's experiences within the virtual space. In some other examples, the user's personality may be determined based on information regarding the user that is acquired from sources external to the virtual space.",
  "publication_number": "US20160179297A1-20160623",
  "_processing_info": {
    "original_size": 95682,
    "optimized_size": 3724,
    "reduction_percent": 96.11
  }
}