{
  "date_produced": "20160615",
  "publication_number": "US20160189032A1-20160630",
  "main_ipcr_label": "G06N502",
  "decision": "ACCEPTED",
  "application_number": "15059714",
  "inventor_list": [
    {
      "inventor_name_last": "Horvitz",
      "inventor_name_first": "Eric",
      "inventor_city": "Kirkland",
      "inventor_state": "WA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Paparizos",
      "inventor_name_first": "Stelios",
      "inventor_city": "San Jose",
      "inventor_state": "CA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Barga",
      "inventor_name_first": "Roger",
      "inventor_city": "Bellevue",
      "inventor_state": "WA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Burger",
      "inventor_name_first": "Doug",
      "inventor_city": "Bellevue",
      "inventor_state": "WA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Gupta",
      "inventor_name_first": "Vinay",
      "inventor_city": "Sammamish",
      "inventor_state": "WA",
      "inventor_country": "US"
    }
  ],
  "abstract": "A server computing device and related method for providing recommendations to a user computing device are disclosed. In one example, user activity of the user of a user computing device and friend activity of a friend using a friend computing device are received. A request for a recommendation is received from the user device. Based on the user and friend activities, it is estimated that the user and friend will approach an intersecting location within a window of time, and the user and friend are available to meet in that window. A recommendation of a service offered within a distance of the location is sent, with the recommendation displayed on the user computing device.",
  "filing_date": "20160303",
  "patent_number": "9569726",
  "summary": "<SOH> SUMMARY <EOH>A server computing device and related method for providing recommendations to a user computing device are disclosed herein. In one example, user activity is received that includes a detected current location of and direction of travel of the user computing device and calendar activity of a user of the user computing device. Friend activity of a friend using a friend computing device is also received, with the friend activity including a detected current location of and direction of travel of the friend computing device and calendar activity of the friend. A request for a recommendation for a target product or service is received from the user computing device. Based on the respective detected current locations and directions of travel of the user computing device and the friend computing device, an estimate is made that the user and the friend will approach an intersecting location within a predetermined window of time. Based on the calendar activity of the user and the calendar activity of the friend, it is determined that the user and the friend are available to meet in the predetermined window of time. A recommendation is sent including a recommended service offered at a service location within a threshold distance of the intersecting location, wherein the recommendation is displayed on a display associated with the user computing device, the recommendation facilitating a meeting between the user and the friend. This Summary is provided to introduce a selection of concepts in a simplified form that are further described below in the Detailed Description. This Summary is not intended to identify key features or essential features of the claimed subject matter, nor is it intended to be used to limit the scope of the claimed subject matter. Furthermore, the claimed subject matter is not limited to implementations that solve any or all disadvantages noted in any part of this disclosure.",
  "date_published": "20160630",
  "title": "SERVER COMPUTING DEVICE FOR RECOMMENDING MEETING A FRIEND AT A SERVICE LOCATION BASED ON CURRENT LOCATION, TRAVEL DIRECTION, AND CALENDAR ACTIVITY",
  "ipcr_labels": [
    "G06N502"
  ],
  "_processing_info": {
    "original_size": 59593,
    "optimized_size": 3835,
    "reduction_percent": 93.56
  }
}