{
  "decision": "PENDING",
  "application_number": "15057592",
  "date_published": "20170907",
  "date_produced": "20170823",
  "title": "DISPLAYING OF AUGMENTED REALITY OBJECTS",
  "filing_date": "20160301",
  "inventor_list": [
    {
      "inventor_name_last": "Aratsu",
      "inventor_name_first": "Taku",
      "inventor_city": "Tokyo",
      "inventor_state": "",
      "inventor_country": "JP"
    },
    {
      "inventor_name_last": "Komoda",
      "inventor_name_first": "Toshiyuki",
      "inventor_city": "Tokyo",
      "inventor_state": "",
      "inventor_country": "JP"
    },
    {
      "inventor_name_last": "Umehara",
      "inventor_name_first": "Yohei",
      "inventor_city": "Kawasaki-shi",
      "inventor_state": "",
      "inventor_country": "JP"
    },
    {
      "inventor_name_last": "Yokoyama",
      "inventor_name_first": "Satoshi",
      "inventor_city": "Chiba",
      "inventor_state": "",
      "inventor_country": "JP"
    }
  ],
  "ipcr_labels": [
    "G06T1900"
  ],
  "main_ipcr_label": "G06T1900",
  "summary": "<SOH> SUMMARY <EOH>According to one aspect of an embodiment of the present invention, the present invention provides a computer-implemented method for displaying one or more AR objects on a transparent display device. The method comprises the following steps: associating data of one or more transparent areas corresponding to one or more real objects with a first layer for seeing one or more real objects on the transparent display device, wherein the data has information on a location and shape of the one or more real objects on the transparent display device, associating one or more AR objects with a second layer for displaying one or more AR objects on the transparent display device; and overlaying the first layer with the second layer to display the one or more AR objects on the transparent display device, wherein the one or more real objects are seen through the one or more transparent areas on the transparent display device by a user wearing or having the transparent display device. According to another aspect of an embodiment of the present invention, a computer system comprising a computer readable storage medium storing a program of instructions executable by the computer system to perform one or more methods described herein also may be provided. According to another aspect of an embodiment of the present invention, a computer program product comprising a computer readable storage medium storing a program of instructions executable by the computer system to perform one or more methods described herein also may be provided.",
  "patent_number": "None",
  "abstract": "An embodiment of the present invention provides a computer-implemented method for displaying one or more augmented reality (AR) objects on a transparent display device, comprising: associating data of one or more transparent areas corresponding to one or more real objects with a first layer for seeing one or more real objects on the transparent display device, wherein the data has information on a location and shape of the one or more real objects on the transparent display device, associating one or more AR objects with a second layer for displaying one or more AR objects on the transparent display device; and overlaying the first layer with the second layer to display the one or more AR objects on the transparent display device, wherein the one or more real objects are seen through the one or more transparent areas on the transparent display device by transparent area the transparent display device.",
  "publication_number": "US20170256094A1-20170907",
  "_processing_info": {
    "original_size": 107016,
    "optimized_size": 3425,
    "reduction_percent": 96.8
  }
}