{
  "date_produced": "20160608",
  "publication_number": "US20160180253A1-20160623",
  "main_ipcr_label": "G06N9900",
  "decision": "PENDING",
  "application_number": "15054681",
  "inventor_list": [
    {
      "inventor_name_last": "Lakshmanan",
      "inventor_name_first": "Geetika T.",
      "inventor_city": "Winchester",
      "inventor_state": "MA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Rozsnyai",
      "inventor_name_first": "Szabolcs",
      "inventor_city": "New York",
      "inventor_state": "NY",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Wang",
      "inventor_name_first": "Fei",
      "inventor_city": "Ossining",
      "inventor_state": "NY",
      "inventor_country": "US"
    }
  ],
  "abstract": "Methods and systems for refining a process model include determining whether the process model is too dense or too sparse. A predictive model is learned from execution traces to predict an outcome. The predictive model is modified responsive to the determination of whether the process model is too dense or too sparse. A refined process model is refined from updated traces based on attributes present in the modified predictive model.",
  "filing_date": "20160226",
  "patent_number": "None",
  "summary": "<SOH> SUMMARY <EOH>A method for refining a process model includes determining whether the process model is too dense or too sparse. A predictive model is learned from execution traces to predict an outcome. The predictive model is modified responsive to the determination of whether the process model is too dense or too sparse. A refined process model is refined from updated traces based on attributes present in the modified predictive model. A system for mining a process model includes a predictive model module configured to learn a predictive model to predict an outcome from the execution traces. A model refinement module comprising a processor is configured to determine whether the process model is too dense or too sparse, to modify the predictive model responsive to said determination, and to trigger the mining module to mine a refined process model from updated traces based on attributes present in the modified predictive model. These and other features and advantages will become apparent from the following detailed description of illustrative embodiments thereof, which is to be read in connection with the accompanying drawings.",
  "date_published": "20160623",
  "title": "ITERATIVE REFINEMENT OF PATHWAYS CORRELATED WITH OUTCOMES",
  "ipcr_labels": [
    "G06N9900"
  ],
  "_processing_info": {
    "original_size": 35970,
    "optimized_size": 2431,
    "reduction_percent": 93.24
  }
}