{
  "decision": "PENDING",
  "application_number": "15057091",
  "date_published": "20161208",
  "date_produced": "20161122",
  "title": "DIALYSIS PREDICTIVE MODEL",
  "filing_date": "20160229",
  "inventor_list": [
    {
      "inventor_name_last": "Dong",
      "inventor_name_first": "Yanting",
      "inventor_city": "Lexington",
      "inventor_state": "KY",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Gopal",
      "inventor_name_first": "Vipin",
      "inventor_city": "Louisville",
      "inventor_state": "KY",
      "inventor_country": "US"
    }
  ],
  "ipcr_labels": [
    "G06F1900",
    "G06N700"
  ],
  "main_ipcr_label": "G06F1900",
  "summary": "<SOH> BACKGROUND AND SUMMARY OF THE INVENTION <EOH>Chronic Kidney disease (CKD) is used to identify conditions that damage a person's kidney in such a manner s to decrease the kidney's ability to filter the waste levels present in the bloodstream. CKD increases a person's risk of developing heart and blood vessel diseases. CKD may develop slowly over time. CKD may be caused by diabetes, high blood pressure and other disorders. According to the National Kidney Foundation®, 26 million American adults have CKD and millions more are at increased risk. It is generally understood that most cases of CKD are caused by diabetes or high blood pressure but these causes still only account for about ⅔ of the CKD cases. The remainder are the result of other disorders, environmental and other factors. Diagnosing CKD requires medical diagnostic tests. Because the symptoms of CKD develop slowly and aren't necessarily specific to CKD, may people with CKD are not aware that they are suffering from the disease until they are tested. Some people with CKD exhibit no symptoms and aren't aware that they have the disease until tested. Patients who are unaware of their CKD are at greater risk for other health conditions and complications that arise as the result of the failure to treat their undetected CKD. In addition to greater health risks as the result of failure to treat their condition, a worsening of a patient's condition may markedly increase their cost of care, leading to a potentially avoidable need for dialysis treatments that may result from end-stage renal disease (ESRD). Thus, caregivers and insurance providers may have an interest in detecting a patient's CKD condition as early as possible. In addition to detection, caregivers and insurance providers may have an interest in predicting the likelihood that a patient currently exhibiting CKD symptoms will progress to ESRD and the resultant requirement for dialysis. As with many diseases, the cost to treat a patient's CKD conditio...",
  "patent_number": "None",
  "abstract": "The present invention is a method of predicting the likelihood that chronic kidney disease will result in end stage renal disease requiring dialysis. The method uses various indicators comprising information specific to an individual as well as information representing characteristics of a population including demographic information, health care and prescription insurance claims, and involvement in various programs designed to improve the health of a user. The method applies a predictive algorithm to these indicators in order to derive a risk score indicating an individual's risk of dialysis.",
  "publication_number": "US20160357923A1-20161208",
  "_processing_info": {
    "original_size": 40081,
    "optimized_size": 3282,
    "reduction_percent": 91.81
  }
}