{
  "date_produced": "20170809",
  "publication_number": "US20170243123A1-20170824",
  "main_ipcr_label": "G06N504",
  "decision": "PENDING",
  "application_number": "15050200",
  "inventor_list": [
    {
      "inventor_name_last": "Ballal",
      "inventor_name_first": "Pradeep Niranjan",
      "inventor_city": "Singapore",
      "inventor_state": "",
      "inventor_country": "SG"
    }
  ],
  "abstract": "A testing framework associated with a decision metaphor model tool reads table profile files to generate requests for a test of a decision metaphor. The testing framework sends the requests for the test to a decision engine and receives responses for the requests for comparison against expected values and possible errors. The testing framework also outputs an output file that includes a result of the test, where the output file is formatted in a computer-displayable and user-readable graphical format.",
  "filing_date": "20160222",
  "patent_number": "None",
  "summary": "<SOH> SUMMARY <EOH>In one aspect, an electronic document is received by a decision metaphor model tool. The electronic document has content that includes requirement analysis and design artifacts in a computer-readable format. The requirement analysis and design artifacts define a decision metaphor that graphically represents business rules for execution by a decision engine. The decision metaphor model tool is programmed with logic to read and interpret the content of the electronic document. The decision metaphor model tool reads, according to the programmed logic, the requirement analysis and design artifacts from the electronic document to create an intermediate model of the requirement analysis and design artifacts. The intermediate model is formatted into one or more computer-readable table import files. The decision metaphor model tool outputs, with the intermediate model to a communication network, the table import files and one or more table profile files containing test data for testing of the decision metaphor. The decision metaphor model tool also reads the one or more table import files for import into the decision engine. A testing framework, associated with the decision metaphor model tool and programmed with test logic to read and interpret the table profile files, reads the table profile files to generate requests for a test for the decision metaphor. The testing framework sends the requests for the test to the decision engine and receives, from the decision engine, responses for the requests for comparison against expected values and possible errors. The testing framework also outputs an output file that includes a result of the test, where the output file is formatted in a computer-displayable and user-readable graphical format. In some variations one or more of the following can optionally be included. The testing framework can read negative test values generated by the decision metaphor model tool and stored with the one or more table profile fi...",
  "date_published": "20170824",
  "title": "System for Round Trip Engineering of Decision Metaphors",
  "ipcr_labels": [
    "G06N504",
    "G06F1730"
  ],
  "_processing_info": {
    "original_size": 41495,
    "optimized_size": 3070,
    "reduction_percent": 92.6
  }
}