{
  "decision": "PENDING",
  "application_number": "15057880",
  "date_published": "20161027",
  "date_produced": "20161012",
  "title": "SYSTEM AND METHOD OF UPDATING A NETWORK ELEMENT",
  "filing_date": "20160301",
  "inventor_list": [
    {
      "inventor_name_last": "Sprygada",
      "inventor_name_first": "Peter Raymond",
      "inventor_city": "Cary",
      "inventor_state": "NC",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Berly",
      "inventor_name_first": "Mark",
      "inventor_city": "Pittsboro",
      "inventor_state": "NC",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Gourlay",
      "inventor_name_first": "Douglas",
      "inventor_city": "Menlo Park",
      "inventor_state": "CA",
      "inventor_country": "US"
    }
  ],
  "ipcr_labels": [
    "G06F9445",
    "G06F944"
  ],
  "main_ipcr_label": "G06F9445",
  "summary": "<SOH> SUMMARY OF THE DESCRIPTION <EOH>A method and apparatus of a device that performs a hitless update a boot image of a network element. In this embodiment, the device identifies the network element to update and determines if the network element has redundant paths. If this network element has redundant paths, the device configures the network element to drain data processing of the network element. In addition, the device updates the network element to a new boot image when the data processing of the network element is drained. Other methods and apparatuses are also described.",
  "patent_number": "None",
  "abstract": "A method and apparatus of a device that performs a hitless update a boot image of a network element. In this embodiment, the device identifies the network element to update and determines if the network element has redundant paths. If this network element has redundant paths, the device configures the network element to drain data processing of the network element. In addition, the device updates the network element to a new boot image when the data processing of the network element is drained.",
  "publication_number": "US20160313985A1-20161027",
  "_processing_info": {
    "original_size": 53453,
    "optimized_size": 1930,
    "reduction_percent": 96.39
  }
}