{
  "decision": "PENDING",
  "application_number": "15056679",
  "date_published": "20170831",
  "date_produced": "20170816",
  "title": "ELECTRONIC DEVICE WITH DYNAMIC THRESHOLDING FOR FORCE DETECTION",
  "filing_date": "20160229",
  "inventor_list": [
    {
      "inventor_name_last": "Hill",
      "inventor_name_first": "Matthew D.",
      "inventor_city": "Cupertino",
      "inventor_state": "CA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Phouthavong",
      "inventor_name_first": "Rasamy",
      "inventor_city": "Cupertino",
      "inventor_state": "CA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Myers",
      "inventor_name_first": "Scott A.",
      "inventor_city": "Cupertino",
      "inventor_state": "CA",
      "inventor_country": "US"
    }
  ],
  "ipcr_labels": [
    "G06F3041",
    "G06F116"
  ],
  "main_ipcr_label": "G06F3041",
  "summary": "<SOH> SUMMARY <EOH>The embodiments described herein generally relate to an electronic device having a touch-sensitive surface or region that is configured to receive force-based user input. In particular, the device may include one or more force sensors that are configured to detect a touch that exceeds a predetermined force threshold. The device may be configured to initiate or generate a press-event signal in response to a touch that exceeds the force threshold, which may be interpreted as user input by the device or operating system. In some embodiments, the force threshold is dynamically adjusted in response to a detected or estimated stability condition in order to prevent tipping or undesirable movement of the device. By dynamically adjusting the threshold, touch user input for the device may be optimized for use with a particular mounting accessory or support configuration. In some cases, multiple sub-regions may be defined over the touch-sensitive surface, each sub-region having a different force threshold. Some example embodiments are directed to a method for setting a force threshold for an electronic device having a touch-sensitive surface. A stability condition of the electronic device may be determined using one or more sensors (e.g., internal sensors). The force threshold may be reduced or modified for at least a portion of the touch-sensitive surface based on the stability condition. A press-event signal may be initiated or generated in response to receiving a touch on the touch-sensitive surface that exceeds the force threshold. In some embodiments, a change in the stability condition of the electronic device is detected and, in response, an updated force threshold is set for the portion of the touch-sensitive surface. The updated force threshold may be based on the detected change in the stability condition. In some embodiments, the force threshold is dynamically updated based on an estimated change in an orientation of the electronic device. In som...",
  "patent_number": "None",
  "abstract": "The systems and techniques described herein generally relate to an electronic device having a touch-sensitive surface or region that is configured to receive force-based user input and dynamically adjust a force threshold used to recognize the force-based user input. In particular, the device may include one or more force sensors that are configured to detect a touch that exceeds a dynamically adjustable threshold. In some embodiments, the threshold is dynamically adjusted in response to a detected or estimated stability condition. By dynamically adjusting the threshold, the device may be better adapted or optimized for use with a particular support accessory or support configuration. In some cases, multiple sub-regions may be defined over the touch-sensitive surface, each sub-region having a different force threshold.",
  "publication_number": "US20170249048A1-20170831",
  "_processing_info": {
    "original_size": 110065,
    "optimized_size": 3697,
    "reduction_percent": 96.64
  }
}