{
  "decision": "PENDING",
  "application_number": "15056950",
  "date_published": "20160908",
  "date_produced": "20160824",
  "title": "SYSTEM AND METHOD FOR ASSESSING PERFORMANCE METRICS AND USE OF THE SAME",
  "filing_date": "20160229",
  "inventor_list": [
    {
      "inventor_name_last": "SABET",
      "inventor_name_first": "MONA",
      "inventor_city": "SAN CARLOS",
      "inventor_state": "CA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Hayward",
      "inventor_name_first": "Matthew",
      "inventor_city": "Burlingame",
      "inventor_state": "CA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Dreytser",
      "inventor_name_first": "Ilya",
      "inventor_city": "CANTON",
      "inventor_state": "MA",
      "inventor_country": "US"
    }
  ],
  "ipcr_labels": [
    "G06Q1006"
  ],
  "main_ipcr_label": "G06Q1006",
  "summary": "<SOH> SUMMARY <EOH>The present invention describes a system and method for performance assessment using performance analytics metrics system (PAM). PAM uses varied methods, processes and systems to collect, capture, classify, store, and manage performance data, and dynamically analyze, process and report personalized metrics using such data. PAM provides visibility and transparency about performance management to individual using PAM and to groups such as workforce participants and may be used by individuals and groups to guide them towards better performance outcomes. Embodiments of the present invention are described below, and other extensions are possible without departing from the spirit and scope of the present invention. In one embodiment, a person, a peer or a mentor, coach, a supervisor, or a performance manager use PAM to input, gather, process and assess a person personalized metrics. The system and method enable the person to set a specific benchmark or goal for a person to achieve his or her personalized performance objectives. In one embodiment, the system and method provides personalized metrics for a person, wherein personalized metrics may include, but are not limited to, how they spend their time, who they spend their time with, how effective their interactions are, how their performance relates to career outcomes, and how their personal performance metrics compare against their peers, colleagues, role models, or other industry, community or organizational groups. In one embodiment, a continuous assessment of a person's performance metric is done using PAM and displayed on a hardware device in real time. As a method, in another embodiment, once a person is involved in a specific activity the system detects it as a step. In one embodiment, the PAM analyzes and categorizes a person's interactions from various inputs collected by the PAM application, and automatically generates a display to the person showing how the person's time has been allocated o...",
  "patent_number": "None",
  "abstract": "A system and method for assessing performance by generating performance analytics metrics are described. The system takes inputs that are performance indicators, performs analytics and processes results immediately to provide personalized performance metrics and group performance metrics. The system and method describe an effective way of obtaining and processing data used to calculate performance metrics, and useful outcomes from the analyzing and processing of the performance metrics. The system described provides visibility and transparency about performance management to individual using the system and to groups such as workforce participants and may be used by individuals and groups to guide them towards better performance outcomes.",
  "publication_number": "US20160260044A1-20160908",
  "_processing_info": {
    "original_size": 136730,
    "optimized_size": 3601,
    "reduction_percent": 97.37
  }
}