{
  "decision": "PENDING",
  "application_number": "15057838",
  "date_published": "20170907",
  "date_produced": "20170823",
  "title": "Dynamic Seating and Workspace Planning",
  "filing_date": "20160301",
  "inventor_list": [
    {
      "inventor_name_last": "Daher",
      "inventor_name_first": "Ameed",
      "inventor_city": "Cary",
      "inventor_state": "NC",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Ewing",
      "inventor_name_first": "William David",
      "inventor_city": "Chapel Hill",
      "inventor_state": "NC",
      "inventor_country": "US"
    }
  ],
  "ipcr_labels": [
    "G06Q1002",
    "H04L2906",
    "G06T700",
    "G06T720",
    "H04N718",
    "G06K900"
  ],
  "main_ipcr_label": "G06Q1002",
  "summary": "<SOH> SUMMARY <EOH>Therefore, what is needed are methods and systems for dynamic reservation and planning of seating and workspaces to provide the capability of generating up-to-date, real-time seating charts and information about a facility's status and fill up time, so employees can make timely decisions on whether or not they should find an alternate space to work, or make a seating reservation. As described herein, the systems and methods make seating decisions based on factors such as the time at which an inbound employee will arrive at the site according on their distance and mode of transportation (as tracked via mobile device), as well as their priority in the organization and personal seating preferences—and then suggest seating based upon these factors. The systems and methods automatically determine the identity and workspace location of employees currently within the facility based upon a variety of inputs including customized facial recognition techniques and leveraging technology fingerprints of particular users, which enables the system to ‘see’ employees in real-time and recognize where they are sitting. The systems and methods described herein also enhance the dynamic seating environment by advising employees of a current status of a particular work facility (or facilities) and by presenting the employees with a real-time seating and reservation chart through, e.g., a mobile device before the employees arrive. The employees are able to set up advance reservations for workspaces so that each employee is ensured to have a reserved workspace in advance (if any are available) and, depending on the person's preferences, the system advises the employee which workspaces fit their preferences (e.g., location, proximity to other employees, available technology resources, and the like). The invention, in one aspect, features a computerized method for dynamic seating and workspace planning. A server computing device determines an identity and a workspace locat...",
  "patent_number": "None",
  "abstract": "Methods and apparatuses are described for dynamic seating and workspace planning. A server computing device determines an identity and a workspace location of people within a facility by analyzing digital images from cameras at the facility and data elements of interactions with hardware devices at the facility. The server computing device determines the workspace location for each person within the facility using (i) a physical location associated with a digital image in which the person appears and (ii) a physical location associated with at least one of the hardware devices being used by the person. The server computing device generates a workspace reservation chart indicating a portion of workspace locations currently being used and a portion of workspace locations reserved for future use. The server computing device provides advice to remove computing devices regarding available workspace locations at the facility.",
  "publication_number": "US20170255880A1-20170907",
  "_processing_info": {
    "original_size": 100909,
    "optimized_size": 3681,
    "reduction_percent": 96.35
  }
}