{
  "decision": "ACCEPTED",
  "application_number": "15052786",
  "date_published": "20160825",
  "date_produced": "20160810",
  "title": "PROCESSOR POWER MANAGEMENT",
  "filing_date": "20160224",
  "inventor_list": [
    {
      "inventor_name_last": "SUGUMAR",
      "inventor_name_first": "Suresh",
      "inventor_city": "Bangalore KRN",
      "inventor_state": "",
      "inventor_country": "IN"
    },
    {
      "inventor_name_last": "GEMAR",
      "inventor_name_first": "Jeffrey",
      "inventor_city": "San Diego",
      "inventor_state": "CA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "TAHA",
      "inventor_name_first": "Ali",
      "inventor_city": "San Diego",
      "inventor_state": "CA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "DERBYSHIRE",
      "inventor_name_first": "Amy",
      "inventor_city": "Boulder",
      "inventor_state": "CO",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "XUE",
      "inventor_name_first": "Tao",
      "inventor_city": "San Diego",
      "inventor_state": "CA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "TAMJIDI",
      "inventor_name_first": "Mohammad",
      "inventor_city": "San Diego",
      "inventor_state": "CA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "MITTAL",
      "inventor_name_first": "Rajat",
      "inventor_city": "San Francisco",
      "inventor_state": "CA",
      "inventor_country": "US"
    }
  ],
  "ipcr_labels": [
    "G06F132"
  ],
  "main_ipcr_label": "G06F132",
  "summary": "<SOH> SUMMARY <EOH>Aspects of a method of operating a power management function are disclosed. The method includes providing an instruction stream for a first circuit and a second circuit and providing selectively an operation voltage and at least one low-power voltage to the second circuit independent of a supply voltage of the first circuit in response to a sequence of the instruction stream. Aspects of an apparatus are disclosed. The apparatus includes a first circuit and a second circuit sharing an instruction stream. A voltage controller circuit is configured to provide an operation voltage and at least one low-power voltage to the second circuit independent of a supply voltage of the first circuit in response to a sequence of the instruction stream. Aspects of an apparatus are disclosed. The apparatus includes a first circuit and a second circuit sharing an instruction stream. The apparatus further includes means for generating voltage control signals that provides selectively an operation voltage and at least one low-power voltage to the second circuit independent of a supply voltage of the first circuit in response to a sequence of the instruction stream. It is understood that other aspects of apparatus and methods will become readily apparent to those skilled in the art from the following detailed description, wherein various aspects of apparatus and methods are shown and described by way of illustration. As will be realized, these aspects may be implemented in other and different forms and its several details are capable of modification in various other respects. Accordingly, the drawings and detailed description are to be regarded as illustrative in nature and not as restrictive.",
  "patent_number": "9817470",
  "abstract": "An apparatus includes a first circuit and a second circuit sharing an instruction stream. A voltage controller circuit is configured to provide an operation voltage and at least one low-power voltage to the second circuit independent of a supply voltage of the first circuit in response to a sequence of the instruction stream. In another aspect, a method of operating a power management function is presented. The method includes providing an instruction stream for a first circuit and a second circuit and providing selectively an operation voltage and at least one low-power voltage to the second circuit independent of a supply voltage of the first circuit in response to a sequence of the instruction stream.",
  "publication_number": "US20160246362A1-20160825",
  "_processing_info": {
    "original_size": 51059,
    "optimized_size": 3827,
    "reduction_percent": 92.5
  }
}