{
  "decision": "ACCEPTED",
  "application_number": "15053656",
  "date_published": "20160818",
  "date_produced": "20160803",
  "title": "MUSICALLY CONTEXTUAL AUDIO ADVERTISEMENTS",
  "filing_date": "20160225",
  "inventor_list": [
    {
      "inventor_name_last": "Ales",
      "inventor_name_first": "Brian K.",
      "inventor_city": "Berlin",
      "inventor_state": "",
      "inventor_country": "DE"
    }
  ],
  "ipcr_labels": [
    "G06Q3002",
    "G06F316"
  ],
  "main_ipcr_label": "G06Q3002",
  "summary": "<SOH> SUMMARY <EOH>Audio advertisements for music services can be created and played to minimize any perceived discontinuity by a listener from a preceding song. Specifically, a voice-over content item (e.g., a spoken advertisement produced without music) may combined with a non-song musical content item (e.g., backing music specifically produced for advertisements) to create an audio advertisement to be played after a song on a streaming music service. The non-song musical content item may be selected based on its similarity to the preceding song (e.g., genre, tempo, or harmony) and/or a musical preference of a user (e.g., a preferred genre, which can be obtained through a user's music service account and/or can be selected by the user). The genre of both the preceding song and a musical preference of a user may be used to select a non-song musical content item genre by a weighting that determines the probability of the genre used for an advertisement. In accordance with the disclosed subject matter, a system, method and computer program product for altering the playback of one or more song recordings and/or one or more non-song musical content items is described herein. Embodiments of the system comprise a decision engine having logic for using metadata for the one or more song recordings and one or more non-song musical content items. The logic performs the steps of: responsive to playback of at least a first song recording of the song recordings, interpreting the metadata for the first song recording; identifying a first non-song musical content item for playback at or near an end of the first song recording based on a similarity between the first song recording and the first non-song musical content item; and, in response to determining that the first song recording is at or near its end of playback, forming an altered playback of the first non-song musical content item by performing via real time digital audio signal processing an alteration of the first non-s...",
  "patent_number": "9459828",
  "abstract": "Audio advertisements for music services can be created and played to minimize any perceived discontinuity by a listener from a preceding song. Specifically, a voice-over content item (e.g., a spoken advertisement produced without music) may combined with a non-song musical content item (e.g., backing music specifically produced for advertisements) to create an audio advertisement to be played after a song on a streaming music service. The non-song musical content item may be selected based on its similarity to the preceding song (e.g., genre, tempo, or harmony) and/or a musical preference of a user (e.g., a preferred genre obtained through a user's music service account and/or selected by the user). The genre of both the preceding song and a musical preference of a user may be used to select a non-song musical content item genre by a weighting that determines the probability of the genre used for an advertisement.",
  "publication_number": "US20160239876A1-20160818",
  "_processing_info": {
    "original_size": 174634,
    "optimized_size": 3469,
    "reduction_percent": 98.01
  }
}