{
  "decision": "ACCEPTED",
  "application_number": "15052102",
  "date_published": "20170511",
  "date_produced": "20170427",
  "title": "FOLDABLE DISPLAY DEVICE",
  "filing_date": "20160224",
  "inventor_list": [
    {
      "inventor_name_last": "In-Sung",
      "inventor_name_first": "Song",
      "inventor_city": "Gyeonggi-do",
      "inventor_state": "",
      "inventor_country": "KR"
    },
    {
      "inventor_name_last": "Seung Hee",
      "inventor_name_first": "Cho",
      "inventor_city": "Incheon",
      "inventor_state": "",
      "inventor_country": "KR"
    }
  ],
  "ipcr_labels": [
    "G06F116"
  ],
  "main_ipcr_label": "G06F116",
  "summary": "<SOH> SUMMARY OF THE INVENTION <EOH>Accordingly, the present invention has been made to improve the invention of Korean Patent Application No. 10-2011-0047360 that is the related art, and one subject to be achieved by the present invention is to provide a foldable display device, which can freely adjust the inclination angle of the display device to form an acute angle or an obtuse angle in addition to two folding/unfolding operations of a hinge device, and can temporarily maintain the adjusted angle of the display device to improve convenience in use. In accordance with one aspect of the present invention, there is provided a foldable display device, which includes a first body and a second body formed in the same plate shape and symmetrically arranged; and a hinge device coupled to the first body and the second body to make the first body and the second body rotate in the range between an unfolded state in which the first body and the second body are put on the same plane and a folded state in which the first body and the second body overlap each other, wherein the hinge device includes a base plate having first to third step portions formed on an upper surface of the base plate; a first rotary body formed on one side of an upper portion of the base plate, fixedly coupled to a side surface of the first rotary body, and having a first shaft formed on the first rotary body; a second shaft fixedly coupled to a side surface of the second rotary body and having a second shaft formed on the second rotary body in parallel to the first shaft; a center support body penetrated by the first shaft and the second shaft to rotatably support the first rotary body and the second rotary body; and a first elastic portion and a second elastic portion provided on an outside of the center support body to elastically support the first shaft and the second shaft so that the unfolded state or the folded state can be maintained. The foldable display device according to the aspect of the p...",
  "patent_number": "9720447",
  "abstract": "A foldable display device is provided, which includes a first body and a second body formed in the same plate shape and symmetrically arranged, a hinge device coupled to the first body and the second body to make the first body and the second body rotate in the range between an unfolded state in which the first body and the second body are put on the same plane and a folded state in which the first body and the second body overlap each other, and an angle maintenance device provided with first and second stopper units capable of fixing a rotating angle of the hinge device to a certain angle. Accordingly, the inclination angle of the display device can be freely adjusted to form an acute angle or an obtuse angle in addition to two folding and unfolding operations of the hinge device and the adjusted angle can be temporarily maintained to further improve convenience in use.",
  "publication_number": "US20170131741A1-20170511",
  "_processing_info": {
    "original_size": 54428,
    "optimized_size": 3542,
    "reduction_percent": 93.49
  }
}