{
  "date_produced": "20170816",
  "publication_number": "US20170249554A1-20170831",
  "main_ipcr_label": "G06N504",
  "decision": "PENDING",
  "application_number": "15053978",
  "inventor_list": [
    {
      "inventor_name_last": "Zirnstein",
      "inventor_name_first": "Jan",
      "inventor_city": "St. Louis Park",
      "inventor_state": "MN",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Germann",
      "inventor_name_first": "David J.",
      "inventor_city": "North Vancouver",
      "inventor_state": "",
      "inventor_country": "CA"
    },
    {
      "inventor_name_last": "Light",
      "inventor_name_first": "Marc",
      "inventor_city": "Saint Paul",
      "inventor_state": "MN",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Stewart",
      "inventor_name_first": "Gregory E.",
      "inventor_city": "North Vancouver",
      "inventor_state": "",
      "inventor_country": "CA"
    },
    {
      "inventor_name_last": "Grunow",
      "inventor_name_first": "Jonathan T.",
      "inventor_city": "Indian Trail",
      "inventor_state": "NC",
      "inventor_country": "US"
    }
  ],
  "abstract": "A method includes identifying costs associated with different outcomes of a failure prediction algorithm. The algorithm is configured to predict one or more faults with at least one piece of industrial equipment. The different outcomes include both successful and unsuccessful predictions by the algorithm. The method also includes identifying a threshold value for the algorithm using the costs, where the threshold value is used by the failure prediction algorithm to identify whether maintenance of the at least one piece of industrial equipment is needed. The method further includes providing the threshold value to the algorithm. The threshold value is selected such that a net positive economic benefit is obtained from use of the threshold value with the failure prediction algorithm. In addition, the method can include generating a signal indicating whether maintenance is needed based on a comparison of an indicator value calculated using the algorithm and the threshold value.",
  "filing_date": "20160225",
  "patent_number": "None",
  "summary": "<SOH> SUMMARY <EOH>This disclosure provides a cost-driven system and method for predictive equipment failure detection. In a first embodiment, a method includes identifying costs associated with different outcomes of a failure prediction algorithm. The failure prediction algorithm is configured to predict one or more faults with at least one piece of industrial equipment, and the different outcomes include both successful and unsuccessful predictions by the failure prediction algorithm. The method also includes identifying a threshold value for the failure prediction algorithm using the costs, where the threshold value is used by the failure prediction algorithm to identify whether maintenance of the at least one piece of industrial equipment is needed. The method further includes providing the threshold value to the failure prediction algorithm. In addition, the method can include receiving equipment data associated with operation of the at least one piece of industrial equipment, calculating an indicator value based on the equipment data using the failure prediction algorithm, comparing the indicator value to the threshold value, and generating a signal indicating whether maintenance is needed based on the comparison. The threshold value is selected such that a net positive economic benefit is obtained from use of the threshold value with the failure prediction algorithm. In a second embodiment, an apparatus includes at least one processing device configured to identify costs associated with different outcomes of a failure prediction algorithm. The failure prediction algorithm is configured to predict one or more faults with at least one piece of industrial equipment, and the different outcomes include both successful and unsuccessful predictions by the failure prediction algorithm. The at least one processing device is also configured to identify a threshold value for the failure prediction algorithm using the costs, where the threshold value is used by the failu...",
  "date_published": "20170831",
  "title": "COST-DRIVEN SYSTEM AND METHOD FOR PREDICTIVE EQUIPMENT FAILURE DETECTION",
  "ipcr_labels": [
    "G06N504",
    "G06N9900"
  ],
  "_processing_info": {
    "original_size": 64262,
    "optimized_size": 4177,
    "reduction_percent": 93.5
  }
}