{
  "date_produced": "20170816",
  "publication_number": "US20170249560A1-20170831",
  "main_ipcr_label": "G06N9900",
  "decision": "PENDING",
  "application_number": "15055075",
  "inventor_list": [
    {
      "inventor_name_last": "Cudak",
      "inventor_name_first": "Gary David",
      "inventor_city": "Wake Forest",
      "inventor_state": "NC",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Crowe",
      "inventor_name_first": "John Scott",
      "inventor_city": "Durham",
      "inventor_state": "NC",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Lee-Baron",
      "inventor_name_first": "Jennifer J.",
      "inventor_city": "Morrisville",
      "inventor_state": "NC",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Peterson",
      "inventor_name_first": "Nathan J.",
      "inventor_city": "Oxford",
      "inventor_state": "NC",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Rose",
      "inventor_name_first": "Amy Leigh",
      "inventor_city": "Chapel Hill",
      "inventor_state": "NC",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Young",
      "inventor_name_first": "Bryan L.",
      "inventor_city": "Tualatin",
      "inventor_state": "OR",
      "inventor_country": "US"
    }
  ],
  "abstract": "After first installation of an application program on a computing device, the computing devices monitors a behavior of the application program for a period of time and then builds a behavior profile of the application program from the behavior. After the period of time has elapsed, such as specified period of time, the computing device may prevent the application program from deviating from the behavior profile. After the period of time has elapsed, such as when an update or patch to the application program has been applied or installed, the computing device may continue to monitor the behavior of the application program, and in response to determining that the behavior of the application program after the period of time deviates from the behavior profile, perform an action with respect to the application program.",
  "filing_date": "20160226",
  "patent_number": "None",
  "summary": "<SOH> SUMMARY <EOH>An example method includes, after first installation of an application program on a computing device, monitoring, by the computing device, a behavior of the application program for a period of time and building a behavior profile of the application program from the behavior. The method includes, after the period of time, performing one of the following. First, the computing device can prevent the application program from deviating from the behavior profile. Second, the computing device can continue to monitor the behavior of the application program, and in response to determining that the behavior of the application program after the period of time deviates from the behavior profile, perform an action with respect to the application program. An example non-transitory computer-readable data storage medium storing computer-executable code performable by a computing device to perform a method. The method includes, after first installation of an application program on the computing device, monitoring a behavior of the application program for a specified period of time. The method includes, after the specified period of time has elapsed, constructing a behavior profile of the application program based on the behavior that has been monitored for the specified period of time. The method includes, after the behavior profile has been constructed, preventing the application program from engaging in behavior that deviates from the behavior profile. An example computing device includes hardware resources, including a processor. The computing devices a non-transitory computer-readable data storage medium storing computer-executable code that is executable by the processor. The code is executable by the processor to, after first installation of an application program on the computing device, monitor a behavior of the application program. The code is executable by the processor to, after an update or patch of the application program has been applied or installed...",
  "date_published": "20170831",
  "title": "COMPUTING DEVICE APPLICATION PROGRAM BEHAVIOR PROFILE",
  "ipcr_labels": [
    "G06N9900",
    "G06F9445"
  ],
  "_processing_info": {
    "original_size": 43637,
    "optimized_size": 4136,
    "reduction_percent": 90.52
  }
}