{
  "decision": "PENDING",
  "application_number": "15056815",
  "date_published": "20161229",
  "date_produced": "20161214",
  "title": "VEHICLE OPERATION ASSISTANCE INFORMATION MANAGEMENT FOR AUTONOMOUS VEHICLE CONTROL OPERATION",
  "filing_date": "20160229",
  "inventor_list": [
    {
      "inventor_name_last": "KONET",
      "inventor_name_first": "HEATHER",
      "inventor_city": "Canton",
      "inventor_state": "MI",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "GOUDY",
      "inventor_name_first": "ROY",
      "inventor_city": "Farmington Hills",
      "inventor_state": "MI",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "CHRISTENSEN",
      "inventor_name_first": "ANDREW",
      "inventor_city": "South Lyon",
      "inventor_state": "MI",
      "inventor_country": "US"
    }
  ],
  "ipcr_labels": [
    "B60K3500",
    "G05D100",
    "G06K900"
  ],
  "main_ipcr_label": "B60K3500",
  "summary": "<SOH> SUMMARY <EOH>Disclosed herein are aspects, features, elements, implementations, and embodiments of vehicle operation assistance information management for autonomous vehicle control operation. An aspect of the disclosed embodiments is a vehicle configured to perform vehicle operation assistance information management for autonomous vehicle control transfer. The vehicle may include a primary graphical display portion, a secondary graphical display portion, and a processor configured to execute instructions stored on a non-transitory computer readable medium to perform vehicle operation assistance information management autonomous vehicle control operation. Vehicle operation assistance information management autonomous vehicle control operation may include identifying a vehicle operation assistance information item, the vehicle operation assistance information item indicating a location of a candidate vehicle control operation. Vehicle operation assistance information management autonomous vehicle control operation may include, on a condition that an immanency for the vehicle operation assistance information item exceeds a maximum relevant immanence, storing information representing the vehicle operation assistance information item. Vehicle operation assistance information management autonomous vehicle control operation may include, on a condition that the immanency is within the maximum relevant immanence, presenting a representation of the vehicle operation assistance information item. Presenting the representation of the vehicle operation assistance information item may include controlling the primary graphical display portion to present a graphical representation of the vehicle operation assistance information item, wherein controlling the primary graphical display portion to present the graphical representation includes controlling the primary graphical display portion to present a first portion of the graphical representation, and controlling the secondary...",
  "patent_number": "None",
  "abstract": "A vehicle implementing vehicle operation assistance information management for autonomous vehicle control operation may identify a vehicle operation assistance information item, the vehicle operation assistance information item indicating a location of a candidate vehicle control operation. On a condition that the immanency is within the maximum relevant immanence, the vehicle may present a representation of the vehicle operation assistance information item, which may include controlling the primary graphical display portion to present a graphical representation of the vehicle operation assistance information item, wherein controlling the primary graphical display portion to present the graphical representation includes controlling the primary graphical display portion to present a first portion of the graphical representation, and controlling the secondary graphical display portion to present the graphical representation, wherein controlling the secondary graphical display portion to ...",
  "publication_number": "US20160375768A1-20161229",
  "_processing_info": {
    "original_size": 317869,
    "optimized_size": 3908,
    "reduction_percent": 98.77
  }
}