{
  "date_produced": "20160803",
  "publication_number": "US20160239760A1-20160818",
  "main_ipcr_label": "G06N9900",
  "decision": "PENDING",
  "application_number": "15059476",
  "inventor_list": [
    {
      "inventor_name_last": "BRADLEY",
      "inventor_name_first": "Lisa M.",
      "inventor_city": "Cary",
      "inventor_state": "NC",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "BROOMHALL",
      "inventor_name_first": "Matthew E.",
      "inventor_city": "Goffstown",
      "inventor_state": "NH",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "LOREDO",
      "inventor_name_first": "Robert E.",
      "inventor_city": "North Miami Beach",
      "inventor_state": "FL",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Silva",
      "inventor_name_first": "Asima",
      "inventor_city": "Holden",
      "inventor_state": "MA",
      "inventor_country": "US"
    }
  ],
  "abstract": "A system for assessing a user interaction experience of content displayed on a mobile device, implemented by a computing processor, receives an indication of content to be displayed on the mobile device. The indication is received in response to a user attempting to access the content. The system analyzes the content to assess the user interaction experience of the content to be displayed on the mobile device. The analysis is based at least on the mobile device on which the content is to be displayed. The user interaction experience is comprised of the viewing quality of the content to be displayed on the mobile device, and/or a feasibility of user interaction with the content. Based on the user interaction experience, the system presents, on the mobile device on which the content is to be displayed, an indication of the user interaction experience and the indication of the content to be displayed on the mobile device.",
  "filing_date": "20160303",
  "patent_number": "None",
  "summary": "<SOH> SUMMARY <EOH>According to an embodiment disclosed herein, in a method for identifying viewing quality of content displayed on a mobile device, the method receives an indication of content to be displayed on the mobile device, where the indication is received in response to a user attempting to access the content on the mobile device. The method analyzes the content to assess the user interaction experience of the content to be displayed on the mobile device. The analysis is based at least on the mobile device on which the content is to be displayed. The user interaction experience is comprised of at least one of the viewing quality of the content to be displayed on the mobile device, and a feasibility of user interaction with the content. Based on the user interaction experience, the method presents on the mobile device on which the content is to be displayed, an indication of the user interaction experience and the indication of the content to be displayed on the mobile device. The method allows the user to determine whether to access the content. The method detects an action by the user, wherein the action indicates whether the user accessed the content. Based on the action by the user, the method learns user preferences associated with viewing the content on the mobile device, and incorporates the user preferences into the analysis of the content. System and computer program products corresponding to the above-summarized methods are also described and claimed herein.",
  "date_published": "20160818",
  "title": "INTELLIGENT USER INTERACTION EXPERIENCE FOR MOBILE COMPUTING DEVICES",
  "ipcr_labels": [
    "G06N9900"
  ],
  "_processing_info": {
    "original_size": 33219,
    "optimized_size": 3439,
    "reduction_percent": 89.65
  }
}