{
  "decision": "PENDING",
  "application_number": "15055501",
  "date_published": "20160901",
  "date_produced": "20160817",
  "title": "CODE USAGE MAP",
  "filing_date": "20160226",
  "inventor_list": [
    {
      "inventor_name_last": "Singh",
      "inventor_name_first": "Abhishek Kumar",
      "inventor_city": "Rogers",
      "inventor_state": "AR",
      "inventor_country": "US"
    }
  ],
  "ipcr_labels": [
    "G06F1136",
    "G06F944"
  ],
  "main_ipcr_label": "G06F1136",
  "summary": "<SOH> BRIEF DESCRIPTION OF THE DRAWINGS <EOH>The accompanying drawings are not intended to be drawn to scale. In the drawings, each identical or nearly identical component that is illustrated in various figures is represented by a like numeral. For purposes of clarity, not every component may be labeled in every drawing. In the drawings: FIG. 1 is a block diagram showing a code usage mapping system for dynamically enforcing a code usage policy in accordance with various embodiments. FIG. 2 is a flow diagram illustrating a method for dynamically enforcing a code usage policy in accordance with various embodiments. FIG. 3 is a flow diagram illustrating another method for dynamically enforcing a code usage policy in accordance with various embodiments. FIGS. 4A-4B are representations of error messages displayed within graphical user interfaces of software development environments in accordance with various embodiments. FIG. 5 is an example computational device block diagram depicting various components which can be used to implement various of the disclosed embodiments. FIG. 6 is an example computational device block diagram depicting various components which can be used to implement various of the disclosed embodiments in a distributed system. detailed-description description=\"Detailed Description\" end=\"lead\"?",
  "patent_number": "None",
  "abstract": "A method for dynamically enforcing a code usage policy including mapping machine code compiled from source code to identify construct interactions in the machine code, determining whether the construct interactions identified by the mapping conform to one or more construct interaction maps in a construct interaction registry associated with a code usage policy, and generating instructions to render one or more error messages within a graphical user interface of a development environment in response to a determination that one or more of the construct interactions in the machine code fails to comply with at least one of the construct interaction maps in the construct interaction registry.",
  "publication_number": "US20160253256A1-20160901",
  "_processing_info": {
    "original_size": 44515,
    "optimized_size": 2546,
    "reduction_percent": 94.28
  }
}