{
  "date_produced": "20170816",
  "publication_number": "US20170249563A1-20170831",
  "main_ipcr_label": "G06N9900",
  "decision": "PENDING",
  "application_number": "15057062",
  "inventor_list": [
    {
      "inventor_name_last": "Garvey",
      "inventor_name_first": "Dustin",
      "inventor_city": "Oakland",
      "inventor_state": "CA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Shaft",
      "inventor_name_first": "Uri",
      "inventor_city": "Fremont",
      "inventor_state": "CA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Wong",
      "inventor_name_first": "Lik",
      "inventor_city": "Palo Alto",
      "inventor_state": "CA",
      "inventor_country": "US"
    }
  ],
  "abstract": "Techniques are described for classifying seasonal patterns in a time series. In an embodiment, a set of time series data is decomposed to generate a noise signal and a dense signal, where the noise signal includes a plurality of sparse features from the set of time series data and the dense signal includes a plurality of dense features from the set of time series data. A set of one or more sparse features from the noise signal is selected for retention. After selecting the sparse features, a modified set of time series data is generated by combining the set of one or more sparse features with a set of one or more dense features from the plurality of dense features. At least one seasonal pattern is identified from the modified set of time series data. A summary for the seasonal pattern may then be generated and stored.",
  "filing_date": "20160229",
  "patent_number": "None",
  "summary": "<SOH> Summary Views and Interfaces <EOH>The summary data that is generated for a given set of time series data may provide one or more views or other interfaces for analyzing classified seasonal patterns. For example, summary generation logic 238 may generate GUI objects, interface controls, textual data and/or other data objects to display a summary of what recurrent patterns were detected and how they were classified. Referring to FIG. 8 , it depicts an example summary for seasonal patterns that have been classified as recurrent weekly highs and recurrent weekly lows. The summary includes data that identifies the seasonal class and the stretches of time/segments that belong to the seasonal class. In the present example, the seasonal classes correspond to recurring seasonal highs and recurring seasonal lows for weekly database logons. The summary data includes a weekly profile view that allows a user to visualize a prototypical weekly season. The data points in the weekly profile view may be generated based on extracted sparse/dense seasonal components, nominal values detected within the time series data, and/or inferred trend points. Summary generation logic 238 may generate an interface that allow the user to navigate to different summary views and/or to drill-down to view more details about a seasonal profile. In the context of database logons, for example, the user may navigate to a specific week to view historical and/or predicted database logons. When the classifications are generated based on data collected from multiple hosts, the user may drill down to a specific host to view the seasonal patterns for the specific host database. Thus, the user may view the classified seasonal patterns and trends for an individual target hardware or software resource and for a group of target hardware and/or software resources. With database logons, for instance, the user may view seasonal logon patterns for an individual database server instance and seasonal logon patterns...",
  "date_published": "20170831",
  "title": "UNSUPERVISED METHOD FOR CLASSIFYING SEASONAL PATTERNS",
  "ipcr_labels": [
    "G06N9900",
    "G06N504"
  ],
  "_processing_info": {
    "original_size": 121759,
    "optimized_size": 3665,
    "reduction_percent": 96.99
  }
}