{
  "date_produced": "20160824",
  "publication_number": "US20160260027A1-20160908",
  "main_ipcr_label": "G06N9900",
  "decision": "PENDING",
  "application_number": "15051893",
  "inventor_list": [
    {
      "inventor_name_last": "Kuwabara",
      "inventor_name_first": "Nobuaki",
      "inventor_city": "Yokohama-shi",
      "inventor_state": "",
      "inventor_country": "JP"
    },
    {
      "inventor_name_last": "Suzuki",
      "inventor_name_first": "Masahiro",
      "inventor_city": "Kawasaki-shi",
      "inventor_state": "",
      "inventor_country": "JP"
    },
    {
      "inventor_name_last": "Kobayashi",
      "inventor_name_first": "Kazuhiko",
      "inventor_city": "Yokohama-shi",
      "inventor_state": "",
      "inventor_country": "JP"
    },
    {
      "inventor_name_last": "Nakazato",
      "inventor_name_first": "Yusuke",
      "inventor_city": "Tokyo",
      "inventor_state": "",
      "inventor_country": "JP"
    }
  ],
  "abstract": "To enable work safely in a space where a robot and a worker coexist without defining an area in a work space using a monitoring boundary or the like and thus improve productivity, there is provided a robot controlling apparatus which controls the robot by detecting time-series states of the worker and the robot, and comprises: a detecting unit configured to detect a state of the worker; a learning information holding unit configured to hold learning information obtained by learning the time-series states of the robot and the worker; and a controlling unit configured to control an operation of the robot based on the state the worker output from the detecting unit and the learning information output from the learning information holding unit.",
  "filing_date": "20160224",
  "patent_number": "None",
  "summary": "<SOH> SUMMARY OF THE INVENTION <EOH>To solve such a problem as described above, a robot controlling apparatus of the present invention which controls a robot by detecting time-series states of a worker and the robot, comprises: a detecting unit configured to detect a state of the worker; a learning information holding unit configured to hold learning information obtained by learning the time-series states of the robot and the worker; and a controlling unit configured to control an operation of the robot based on the state of the worker output from the detecting unit and the learning information output from the learning information holding unit. According to the present invention, it enables work safely in the space where the robot and the worker coexist, without defining an area in the work space using the monitoring boundary or the like. Thus, it is possible to improve productivity. Further features of the present invention will become apparent from the following description of exemplary embodiments with reference to the attached drawings.",
  "date_published": "20160908",
  "title": "ROBOT CONTROLLING APPARATUS AND ROBOT CONTROLLING METHOD",
  "ipcr_labels": [
    "G06N9900",
    "B25J1308"
  ],
  "_processing_info": {
    "original_size": 66093,
    "optimized_size": 2812,
    "reduction_percent": 95.75
  }
}