{
  "decision": "ACCEPTED",
  "application_number": "15051542",
  "date_published": "20160616",
  "date_produced": "20160601",
  "title": "MANAGING GUI CONTROL AUTO-ADVANCING",
  "filing_date": "20160223",
  "inventor_list": [
    {
      "inventor_name_last": "Commarford",
      "inventor_name_first": "Patrick M.",
      "inventor_city": "Louisville",
      "inventor_state": "KY",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Shupp",
      "inventor_name_first": "Lauren M.",
      "inventor_city": "Apex",
      "inventor_state": "NC",
      "inventor_country": "US"
    }
  ],
  "ipcr_labels": [
    "G06F30481",
    "G06F1724",
    "G06F30489",
    "G06F30484"
  ],
  "main_ipcr_label": "G06F30481",
  "summary": "<SOH> BRIEF SUMMARY OF THE INVENTION <EOH>Embodiments of the present invention provide a method, system and computer program product for preventing unintentional GUI control advances. In an embodiment of the invention, a method for preventing unintentional graphical user interface (GUI) control advancing associated with an auto-advance feature can be provided. The method can include defining a threshold time period, selecting a GUI control in a GUI for which auto-advancement is enabled, receiving complete input for the selected GUI control, and suppressing a manual directive to advance to a next ordered GUI control in the GUI responsive to the manual directive being received within the threshold time period between the receipt of the complete input and the manual directive. In another embodiment of the invention defining a threshold time period ca include initializing a timer, wherein the timer measures the time between the receipt of the complete input and the manual directive. In yet another embodiment of the invention, selecting a GUI control in a GUI can include selecting a pre-formatted text box in a GUI form. In yet another embodiment, receiving complete input can include receiving input of a set number of characters expected by the selected GUI control. Furthermore in another embodiment of the invention suppressing a manual directive can include ignoring user input being received by the next ordered GUI control. In yet another embodiment of the invention, receiving complete input for the selected GUI control further can include automatically forwarding of a cursor from the selected GUI control to the next ordered GUI control responsive to receiving a set number of characters in the selected GUI control. In another embodiment, the manual directive to advance can be a delimiter input selected from the group consisting of tab, space, period, dash, and carriage return stroke. In yet another embodiment of the invention, a data processing system configured to preve...",
  "patent_number": "9990101",
  "abstract": "Embodiments of the present invention provide a method, system and computer program product for preventing unintentional GUI control advances. In an embodiment of the invention, a method for preventing unintentional graphical user interface (GUI) control advancing associated with an auto-advance feature can be provided. The method can include defining a threshold time period, selecting a GUI control in a GUI for which auto-advancement is enabled, receiving complete input for the selected GUI control, and suppressing a manual directive to advance to a next ordered GUI control in the GUI responsive to the manual directive being received within the threshold time period between the receipt of the complete input and the manual directive.",
  "publication_number": "US20160170574A1-20160616",
  "_processing_info": {
    "original_size": 34613,
    "optimized_size": 3465,
    "reduction_percent": 89.99
  }
}