{
  "date_produced": "20170214",
  "publication_number": "US20170061287A1-20170302",
  "main_ipcr_label": "G06N502",
  "decision": "REJECTED",
  "application_number": "15053462",
  "inventor_list": [
    {
      "inventor_name_last": "Nigul",
      "inventor_name_first": "Leho",
      "inventor_city": "Richmond Hill",
      "inventor_state": "",
      "inventor_country": "CA"
    }
  ],
  "abstract": "A method for updating and generating frequently asked questions (FAQs) associated with at least one communication channel is provided. The method may include detecting the at least one communication channel. The method may further include extracting a plurality of FAQs data from the detected at least one communication channel. Additionally, the method may include normalizing the extracted plurality of FAQs data. The method may also include updating and generating a plurality of FAQs based on the extracted plurality of FAQs data. The method may further include communicating the updated and generated plurality of FAQs to the detected at least one communication channel.",
  "filing_date": "20160225",
  "patent_number": "None",
  "summary": "<SOH> SUMMARY <EOH>A method may include detecting, by a FAQs maintenance program, a website that includes a plurality of frequently asked questions (FAQs) in the form of text query. The FAQs maintenance program may be an application running on a client device via a communications network, and further the FAQs maintenance program may interact with one or more software products. The plurality of FAQs may have been inputted by a plurality of users using the website. The FAQs may include a question and an answer to the question. The method may include extracting the plurality of FAQs from the website. The method may include normalizing, by a FAQs data normalizer, the extracted plurality FAQs. The method may include determining that the plurality of FAQs includes offensive content. The method may include updating, by the FAQs maintenance program, the plurality of FAQs by replacing the offensive content with inoffensive content based on the determining that the plurality of FAQs may include offensive content and further based on historical data from previous updates.",
  "date_published": "20170302",
  "title": "FAQs UPDATER AND GENERATOR FOR MULTI-COMMUNICATION CHANNELS",
  "ipcr_labels": [
    "G06N502",
    "G06F1730"
  ],
  "_processing_info": {
    "original_size": 47245,
    "optimized_size": 2309,
    "reduction_percent": 95.11
  }
}