{
  "date_produced": "20170823",
  "publication_number": "US20170255862A1-20170907",
  "main_ipcr_label": "G06N502",
  "decision": "PENDING",
  "application_number": "15057487",
  "inventor_list": [
    {
      "inventor_name_last": "Li",
      "inventor_name_first": "Xiang",
      "inventor_city": "New York",
      "inventor_state": "NY",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Lee",
      "inventor_name_first": "Sungjin",
      "inventor_city": "Edgewater",
      "inventor_state": "NJ",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Pappu",
      "inventor_name_first": "Aasish",
      "inventor_city": "New York",
      "inventor_state": "NY",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Hu",
      "inventor_name_first": "Yifan",
      "inventor_city": "Mountain Lakes",
      "inventor_state": "NJ",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Stent",
      "inventor_name_first": "Amanda",
      "inventor_city": "New York",
      "inventor_state": "NY",
      "inventor_country": "US"
    }
  ],
  "abstract": "The present teaching relates to generating user profiles with semantic knowledge. A first information associated with a user is obtained. One or more entities are identified from the first information. The one or more entities are augmented based on second information to generate a set of augmented entities. The set of augmented entities are clustered into a set of hierarchical clusters. A set of user profiles is generated based on the set of hierarchical clusters so that the user profile is to be used to personalize content recommendation.",
  "filing_date": "20160301",
  "patent_number": "None",
  "summary": "<SOH> SUMMARY <EOH>The present teaching relates to methods, systems, and programming for user profiling for content recommendation over the internet. In particular, the present teaching relates to methods, systems, and programming for user profiling for content recommendation over the internet. According to an embodiments of the present teaching, a method implemented on a computing device having at least one processor, storage, and a communication platform connected to a network for generating user profiles with semantic knowledge comprises obtaining first information associated with a user; identifying one or more entities from the first information; augmenting the one or more entities based on second information to generate a set of augmented entities; clustering the set of augmented entities into a set of hierarchical clusters; and generating a set of user profiles based on the set of hierarchical clusters so that the user profile is to be used to personalize content recommendation. In some embodiments, the method further comprises identifying at least one related entity from the second information that relates to the one or more entities; and adding the at least one related entity to the one or more entities to generate the set of augmented entities, wherein the second information comprises a knowledge archive of named entities. In some embodiments, the method further comprises estimating user interests with respect to the set of augmented entities; and incorporating the user interests with respect to the set of augmented entities into the user profile. In some embodiments, estimating user interests with respect to the set of augmented entities further comprises identifying known user interests with respect to the one or more entities based on semantic relationships between the one or more entities; estimating inferred user interests with respect to the at least one related entity based on semantic relationships between the at least one related entity and the on...",
  "date_published": "20170907",
  "title": "METHOD AND SYSTEM FOR USER PROFILING FOR CONTENT RECOMMENDATION",
  "ipcr_labels": [
    "G06N502",
    "H04L2908"
  ],
  "_processing_info": {
    "original_size": 80221,
    "optimized_size": 3686,
    "reduction_percent": 95.41
  }
}