{
  "date_produced": "20170809",
  "publication_number": "US20170243112A1-20170824",
  "main_ipcr_label": "G06N308",
  "decision": "PENDING",
  "application_number": "15051722",
  "inventor_list": [
    {
      "inventor_name_last": "Ekambaram",
      "inventor_name_first": "Vijay",
      "inventor_city": "Tamilnadu",
      "inventor_state": "",
      "inventor_country": "IN"
    },
    {
      "inventor_name_last": "Rakshit",
      "inventor_name_first": "Sarbajit K.",
      "inventor_city": "Kolkata",
      "inventor_state": "",
      "inventor_country": "IN"
    }
  ],
  "abstract": "A deep learning approach for comparative incident reference identification. An incident comparator receives descriptive texts including at least one past incidents, associated past features, selected incident and associated selected incident features. The descriptive texts are sent toward a text to vector engine. The incident comparator receives neural vectors associated to the descriptive texts and sends the neural vectors toward a learning engine. The incident comparator receives common features based on deep learning of the neural vectors. The neural vectors are plotted in N-D space based on the common features to create incident reference models. The incident comparator compares the selected incident and associated features with the incident reference models to identify and output comparative reference incidents.",
  "filing_date": "20160224",
  "patent_number": "None",
  "summary": "<SOH> SUMMARY <EOH>As disclosed herein, a method for a deep learning approach for comparative incident reference identification, the method comprising: receiving, by an incident comparator, one or more descriptive texts comprising at least one of a one or more past incidents, one or more past features associated with the one or more past incidents, selected incident and one or more selected incident features associated with the selected incident; sending, by the incident comparator, the one or more descriptive texts toward a text to vector engine; receiving, by the incident comparator, one or more neural vectors associated with the one or more descriptive texts; sending, by the incident comparator, the one or more neural vectors toward a learning engine; receiving, by the incident comparator, one or more common features based on deep learning of the one or more neural vectors; plotting, by the incident comparator, the one or more neural vectors in N-D space for at least one of the one or more common features, creating one or more incident reference models; comparing, by the incident comparator, the selected incident and the one or more selected incident features associated with the one or more incident reference models to identify one or more comparative reference incidents and outputting, by the incident comparator, the one or more comparative reference incidents. A computer system and a computer program product corresponding to the above method are also disclosed herein.",
  "date_published": "20170824",
  "title": "DEEP LEARNING APPROACH TO IDENTIFY COMPARATIVE REFERENCE INCIDENTS",
  "ipcr_labels": [
    "G06N308",
    "G06N9900"
  ],
  "_processing_info": {
    "original_size": 55228,
    "optimized_size": 3038,
    "reduction_percent": 94.5
  }
}