{
  "decision": "PENDING",
  "application_number": "15058333",
  "date_published": "20160929",
  "date_produced": "20160914",
  "title": "INFORMATION EXTRACTION DEVICE, INFORMATION EXTRACTION METHOD, AND DISPLAY CONTROL SYSTEM",
  "filing_date": "20160302",
  "inventor_list": [
    {
      "inventor_name_last": "NAKAMURA",
      "inventor_name_first": "NOBUTATSU",
      "inventor_city": "Tokyo",
      "inventor_state": "",
      "inventor_country": "JP"
    }
  ],
  "ipcr_labels": [
    "G06F1730",
    "G06F1722"
  ],
  "main_ipcr_label": "G06F1730",
  "summary": "<SOH> SUMMARY <EOH>For this reason, an object of the present invention is to solve the above-mentioned problem and efficiently extract the structured information from the Web site. An information extraction device according to an exemplary aspect of the invention includes, a storage unit that stores structured model information that is a result obtained by learning a relationship between a type of structured information that is information having a relationship and a data content or a position of data of the structured information; and a structurization executing unit that extracts the structured information from document data that is an extraction object based on the structured model information. An information extraction method according to an exemplary aspect of the invention includes, storing structured model information that is a result obtained by learning a relationship between a type of structured information that is information having a relationship and a data content or a position of data of the structured information; and extracting the structured information from document data that is an extraction object on the basis of the structured model information. A display control system according to an exemplary aspect of the invention includes, a structurization executing unit that extracts structured information that is information having a relationship from document data that is an extraction object; and a display control unit that makes a terminal display an extraction result in order of a certainty of result obtained by extracting the structured information.",
  "patent_number": "None",
  "abstract": "An information extraction device includes: a storage unit that stores structured model information that is a result obtained by learning a relationship between a type of structured information that is information having a relationship and a data content or a position of data of the structured information; and a structurization executing unit that extracts the structured information from document data that is an extraction object based on the structured model information.",
  "publication_number": "US20160283605A1-20160929",
  "_processing_info": {
    "original_size": 57970,
    "optimized_size": 2655,
    "reduction_percent": 95.42
  }
}