{
  "decision": "PENDING",
  "application_number": "15051846",
  "date_published": "20160825",
  "date_produced": "20160810",
  "title": "Systems and Methods for Managing a Vehicle Sharing Facility",
  "filing_date": "20160224",
  "inventor_list": [
    {
      "inventor_name_last": "SCICLUNA",
      "inventor_name_first": "Larry",
      "inventor_city": "London",
      "inventor_state": "",
      "inventor_country": "GB"
    },
    {
      "inventor_name_last": "BERNATSKIY",
      "inventor_name_first": "Yuriy",
      "inventor_city": "Samara",
      "inventor_state": "",
      "inventor_country": "RU"
    }
  ],
  "ipcr_labels": [
    "G06Q1002"
  ],
  "main_ipcr_label": "G06Q1002",
  "summary": "<SOH> BRIEF DESCRIPTION OF THE DRAWINGS <EOH>Embodiments of the invention will now be described, by way of example only, with reference to the accompanying drawings, in which: FIG. 1 a is a schematic diagram of a system for management of a private hire vehicle service according to various aspects of the present invention; FIG. 1 b is a schematic diagram of a different configuration of the FIG. 1 system for management of a private hire vehicle service according to various aspects of the present invention; FIG. 2 is a flow chart illustrating overall operation of the system in fulfilling a booking through providing a private hire vehicle, and is performed by the system of FIG. 1 a or the system of FIG. 1 b; FIG. 3 is a flow chart illustrating calculating a score for a combination of a vehicle/driver pair in relation to a booking, and is performed by the system of FIG. 1 a or the system of FIG. 1 b; FIG. 4 is a flow chart illustrating allocation of a vehicle/driver pairing in relation to a booking, and is performed by the system of FIG. 1 a or the system of FIG. 1 b; FIG. 5 is a schematic diagram illustrating components of a server forming part of the FIG. 1 a or FIG. 1 b system; FIG. 6 is a flow chart; FIG. 7 shows a graphical user interface; and FIG. 8 is a flow chart illustrating an embodiment of the invention. detailed-description description=\"Detailed Description\" end=\"lead\"?",
  "patent_number": "None",
  "abstract": "A method and apparatus for managing a networked vehicle resource sharing facility, the method and system provide for: (a) detecting a plurality of inputs corresponding to vehicle booking requests, wherein each of the plurality of vehicle booking requests contains data identifying a drop-off location and a pick-up location that is distinct from the pick-up location of each of the other customers; (b) accessing a data structure containing stored data relating to user authorisations for using the vehicle-sharing facility to verify whether each of the vehicle booking requests relates to a customer authorised to use the vehicle-sharing facility; and for those vehicle booking requests relating to customers identified as being authorised to use the vehicle-sharing facility: (c) automatically selecting customers to share a vehicle and calculating a suggested route for the vehicle using the pick-up location and drop-off locations of the customers and one or more stored vehicle-share criteria.",
  "publication_number": "US20160247095A1-20160825",
  "_processing_info": {
    "original_size": 93280,
    "optimized_size": 3089,
    "reduction_percent": 96.69
  }
}