{
  "decision": "PENDING",
  "application_number": "15050884",
  "date_published": "20161006",
  "date_produced": "20160921",
  "title": "UPDATE CONTROL METHOD AND UPDATE CONTROL DEVICE",
  "filing_date": "20160223",
  "inventor_list": [
    {
      "inventor_name_last": "SUWABE",
      "inventor_name_first": "Fumihiko",
      "inventor_city": "Machida",
      "inventor_state": "",
      "inventor_country": "JP"
    }
  ],
  "ipcr_labels": [
    "G06F9445"
  ],
  "main_ipcr_label": "G06F9445",
  "summary": "<SOH> SUMMARY <EOH>According to an aspect of the present invention, provided is an update control device including a storage device and a processor. The processor is configured to store task identifiers of respective tasks in the storage device in association with information on an application program or file to be used in the respective tasks. The processor is configured to update first information on a first application program or file on basis of second information on the first application program or file when a first patch program is applied. The first patch program causes a change on the first application program or file when the first patch program is applied. The first information is stored in the storage device in association with a first task identifier of a first task. The second information is included in the first patch program. The object and advantages of the invention will be realized and attained by means of the elements and combinations particularly pointed out in the claims. It is to be understood that both the foregoing general description and the following detailed description are exemplary and explanatory and are not restrictive of the invention, as claimed.",
  "patent_number": "None",
  "abstract": "An update control device includes a storage device and a processor. The processor is configured to store task identifiers of respective tasks in the storage device in association with information on an application program or file to be used in the respective tasks. The processor is configured to update first information on a first application program or file on basis of second information on the first application program or file when a first patch program is applied. The first patch program causes a change on the first application program or file when the first patch program is applied. The first information is stored in the storage device in association with a first task identifier of a first task. The second information is included in the first patch program.",
  "publication_number": "US20160291961A1-20161006",
  "_processing_info": {
    "original_size": 55641,
    "optimized_size": 2501,
    "reduction_percent": 95.51
  }
}