{
  "decision": "PENDING",
  "application_number": "15057707",
  "date_published": "20170323",
  "date_produced": "20170309",
  "title": "METHODS AND SYSTEMS FOR RECORDING INTERACTIONS WITH A SYSTEM FOR PURCHASING MOBILE PHONES AND OTHER ELECTRONIC DEVICES",
  "filing_date": "20160301",
  "inventor_list": [
    {
      "inventor_name_last": "Silva",
      "inventor_name_first": "John Edward",
      "inventor_city": "San Diego",
      "inventor_state": "CA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Bowles",
      "inventor_name_first": "Mark Vincent",
      "inventor_city": "San Diego",
      "inventor_state": "CA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Ploetner",
      "inventor_name_first": "Jeffrey",
      "inventor_city": "San Diego",
      "inventor_state": "CA",
      "inventor_country": "US"
    }
  ],
  "ipcr_labels": [
    "G06Q2018",
    "G06F1730",
    "G06Q2020"
  ],
  "main_ipcr_label": "G06Q2018",
  "summary": "<SOH> BRIEF DESCRIPTION OF THE DRAWINGS <EOH>FIG. 1 is an isometric view of a kiosk configured in accordance with an embodiment of the disclosed technology for recycling mobile phones and/or other electronic devices. FIG. 2 illustrates a system in which an operator server computer receives a transaction record from a number of remotely located kiosks in accordance with an embodiment of the disclosed technology. FIG. 3 is a flow diagram of a routine implemented by a processing device in a kiosk to record a transaction while presenting information to a user in accordance with an embodiment of the disclosed technology. FIG. 4 is a schematic diagram illustrating various components associated with the kiosk of FIG. 1 in accordance with an embodiment of the disclosed technology. detailed-description description=\"Detailed Description\" end=\"lead\"?",
  "patent_number": "None",
  "abstract": "The present disclosure describes various embodiments of methods and systems for operating a kiosk that is configured to purchase electronic items from a user. One or more cameras on the kiosk record a transaction which is stored as a record on a computer-readable medium. A record is also kept of the times at which events occur such as the user activating a control or button, as well as times when graphical user interface (GUI) screens are presented to the user. The transaction record can be analyzed in real time or at a later date to determine why some transactions are not completed or to improve the user experience with the kiosk.",
  "publication_number": "US20170083886A1-20170323",
  "_processing_info": {
    "original_size": 62985,
    "optimized_size": 2431,
    "reduction_percent": 96.14
  }
}