{
  "decision": "PENDING",
  "application_number": "15059125",
  "date_published": "20160623",
  "date_produced": "20160608",
  "title": "METHODS, SYSTEMS, AND COMPUTER-READABLE MEDIA FOR SEMANTICALLY ENRICHING CONTENT AND FOR SEMANTIC NAVIGATION",
  "filing_date": "20160302",
  "inventor_list": [
    {
      "inventor_name_last": "Dimassimo",
      "inventor_name_first": "Pascal",
      "inventor_city": "Montreal",
      "inventor_state": "",
      "inventor_country": "CA"
    },
    {
      "inventor_name_last": "Pettigrew",
      "inventor_name_first": "Steve",
      "inventor_city": "Montreal",
      "inventor_state": "",
      "inventor_country": "CA"
    },
    {
      "inventor_name_last": "Brousseau",
      "inventor_name_first": "Martin",
      "inventor_city": "Montreal",
      "inventor_state": "",
      "inventor_country": "CA"
    },
    {
      "inventor_name_last": "Simard",
      "inventor_name_first": "Charles-Olivier",
      "inventor_city": "Montreal",
      "inventor_state": "",
      "inventor_country": "CA"
    },
    {
      "inventor_name_last": "Williams",
      "inventor_name_first": "Eric",
      "inventor_city": "Montreal",
      "inventor_state": "",
      "inventor_country": "CA"
    },
    {
      "inventor_name_last": "Lacroix",
      "inventor_name_first": "Francis",
      "inventor_city": "Montreal",
      "inventor_state": "",
      "inventor_country": "CA"
    },
    {
      "inventor_name_last": "Deligia",
      "inventor_name_first": "Alex",
      "inventor_city": "Montreal",
      "inventor_state": "",
      "inventor_country": "CA"
    },
    {
      "inventor_name_last": "Texier",
      "inventor_name_first": "Jean-Michel",
      "inventor_city": "Montreal",
      "inventor_state": "",
      "inventor_country": "CA"
    }
  ],
  "ipcr_labels": [
    "G06F1730",
    "G06F1724"
  ],
  "main_ipcr_label": "G06F1730",
  "summary": "<SOH> SUMMARY <EOH>The invention generally provides novel methods, systems, and computer-readable media that provide improvements for generating semantically-enriched content and for semantic navigation. One aspect of the invention provides a method of displaying search results on a computing device. The method entails receiving search results in response to a search query, displaying a list of search results in a search engine interface and displaying a plurality of facets in the search engine interface. Each of the facets is derived from explicit editorial metadata or inferred semantic annotations and comprises faceted search results. Each of the faceted search results is displayed in association with user interface elements for including or excluding the faceted search result as additional search terms to subsequently refine the search query. Another aspect of the invention provides a method of presenting content on a computing device. The method entails identifying a plurality of semantic annotations for content, determining one or more semantic connections between the semantic annotations, and dynamically generating a topic page based on the one or more semantic connections. Yet another aspect of the invention provides a method, performed by a computing device, for annotating content. The method entails automatically inferring new metadata from the content and from existing metadata and automatically annotating the content with the new metadata. New metadata generated using this method can be used to improve the relevancy of the search results and enhance the search and navigation experience for the end-user of the computing device. Yet another aspect of the invention provides a method for semantically searching content, the method comprising displaying a first facet and a second facet as part of faceted search results in response to a search query, associating a first facet with a second facet in response to user input, and searching a semantic index based on ...",
  "patent_number": "None",
  "abstract": "Methods, systems and computer-readable media enable various techniques related to semantic navigation. One aspect is a technique for displaying semantically derived facets in the search engine interface. Each of the facets comprises faceted search results. Each of the faceted search results is displayed in association with user interface elements for including or excluding the faceted search result as additional search terms to subsequently refine the search query. Another aspect automatically infers new metadata from the content and from existing metadata and then automatically annotates the content with the new metadata to improve recall and navigation. Another aspect identifies semantic annotations by determining semantic connections between the semantic annotations and then dynamically generating a topic page based on the semantic connections.",
  "publication_number": "US20160179933A1-20160623",
  "_processing_info": {
    "original_size": 69567,
    "optimized_size": 4498,
    "reduction_percent": 93.53
  }
}