{
  "date_produced": "20160810",
  "publication_number": "US20160247084A1-20160825",
  "main_ipcr_label": "G06N700",
  "decision": "PENDING",
  "application_number": "15052107",
  "inventor_list": [
    {
      "inventor_name_last": "Miller",
      "inventor_name_first": "Mark R.",
      "inventor_city": "San Francisco",
      "inventor_state": "CA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Goore",
      "inventor_name_first": "Natan",
      "inventor_city": "San Francisco",
      "inventor_state": "CA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Uddenberg",
      "inventor_name_first": "Signo",
      "inventor_city": "San Francisco",
      "inventor_state": "CA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Crowther",
      "inventor_name_first": "Ethan",
      "inventor_city": "San Francisco",
      "inventor_state": "CA",
      "inventor_country": "US"
    }
  ],
  "abstract": "A method is provided for analyzing energy or environmental factors relative to energy. One or more processors of a data management system receives a plurality of signals relating to a plurality of streams of data. The signals directed to at least one of: energy physical assets, energy related environment factors, energy availability, energy usage and energy source. A data transformer is used to transform the data to item and attribute characterizations. The data transformer uses a processor to organize the first, second and third streams of data according to their associated items and attributes. One or more analytic engines are used to receive the items with their attributes from the data management system and provide multi-dimensional analysis relative to a scale of study for at least one business intelligence, where multi-dimensional analysis is defined as analysis that compares, calculates, correlates, or operates on items and/or attributes from at least two distinct dimensions. Th...",
  "filing_date": "20160224",
  "patent_number": "None",
  "summary": "<SOH> SUMMARY <EOH>An object of the present invention is to provide systems and methods for analyzing energy or environmental factors relative to energy. Another object of the present invention is to provide systems and methods for analyzing energy or environmental factors relative to energy by receiving at one or more processors of a data management system a plurality of signals relating to a plurality of streams of data. A further object of the present invention is to provide systems and methods for analyzing energy or environmental factors relative to energy by receiving at one or more processors of a data management system a plurality of signals relating to a plurality of streams of data, where the signals directed to at least one of: energy physical assets, energy related environment factors, energy availability, energy usage and energy source. These and other objects of the present invention are achieved in a method for analyzing energy or environmental factors relative to energy. One or more processors of a data management system receive a plurality of signals relating to a plurality of streams of data. The signals directed to at least one of: energy physical assets, energy related environment factors, energy availability, energy usage and energy source. A data transformer is used to transform the data to item and attribute characterizations. The data transformer uses a processor to organize the first, second and third streams of data according to their associated items and attributes. One or more analytic engines are used to receive the items with their attributes from the data management system and provide multi-dimensional analysis relative to a scale of study for at least one business intelligence, where multi-dimensional analysis is defined as analysis that compares, calculates, correlates, or operates on items and/or attributes from at least two distinct dimensions. The one or more processor of the data management system are used to provide multi-dimens...",
  "date_published": "20160825",
  "title": "SYSTEMS AND METHODS FOR ANALYZING ENERGY OR ENVIRONMENTAL FACTORS RELATIVE TO ENERGY",
  "ipcr_labels": [
    "G06N700",
    "G06F1730",
    "G06N9900"
  ],
  "_processing_info": {
    "original_size": 79030,
    "optimized_size": 4059,
    "reduction_percent": 94.86
  }
}