{
  "decision": "ACCEPTED",
  "application_number": "15051283",
  "date_published": "20170608",
  "date_produced": "20170524",
  "title": "ARRAY SUBSTRATE, TOUCH SCREEN, TOUCH DISPLAY DEVICE, AND FABRICATION METHOD THEREOF",
  "filing_date": "20160223",
  "inventor_list": [
    {
      "inventor_name_last": "LOU",
      "inventor_name_first": "JUNHUI",
      "inventor_city": "Shanghai",
      "inventor_state": "",
      "inventor_country": "CN"
    },
    {
      "inventor_name_last": "WU",
      "inventor_name_first": "TIANYI",
      "inventor_city": "Shanghai",
      "inventor_state": "",
      "inventor_country": "CN"
    },
    {
      "inventor_name_last": "WU",
      "inventor_name_first": "YONG",
      "inventor_city": "Shanghai",
      "inventor_state": "",
      "inventor_country": "CN"
    }
  ],
  "ipcr_labels": [
    "G06F3047"
  ],
  "main_ipcr_label": "G06F3047",
  "summary": "<SOH> BRIEF SUMMARY OF THE DISCLOSURE <EOH>One aspect of the present disclosure provides an array substrate. The array substrate includes a base substrate having a display region and a non-display region adjacent to the display region, a plurality of touch leading wires disposed in the display region, a plurality of touch electrode blocks disposed in the display region and electrically connected to the plurality of touch leading wires, and a peripheral driving circuit having a plurality of driving transistors disposed in the non-display region. Each driving transistor includes a top gate electrode formed at a same layer as the touch leading wire. Another aspect of the present disclosure provides a fabrication method for an array substrate. The fabrication method includes providing a base substrate having a display region and a non-display region; forming a plurality of gate electrodes in the display region and a plurality of bottom gate electrodes in the non-display region at a same layer; forming a display-region gate electrode insulating layer and a non-display-region gate electrode insulating layer at a same layer; forming a first active layer in the display region and a second active layer in the non-display region at a same layer; forming a plurality of first source electrodes and a plurality of first drain electrodes in the display region, a plurality of second source electrodes and a plurality of second drain electrodes in the non-display at a same layer; forming a display-region passivation layer and a non-display-region passivation layer at a same layer; and forming a plurality of touch leading wires in the display region and a plurality of top gate electrodes in the non-display region at a same layer. Another aspect of the present disclosure provides a touch display device. The touch display device includes a touch screen having an array substrate. The array substrate includes a base substrate having a display region and a non-display region adjacent to th...",
  "patent_number": "10013124",
  "abstract": "An array substrate, a touch screen, a touch display device and fabrication methods are provided. The array substrate includes a base substrate having a display region and a non-display region adjacent to the display region, a plurality of touch leading wires disposed in the display region, a plurality of touch electrode blocks disposed in the display region and electrically connected to the plurality of touch leading wires, and a peripheral driving circuit having a plurality of driving transistors disposed in the non-display region. Each driving transistor includes a top gate electrode formed at a same layer as the touch leading wire.",
  "publication_number": "US20170160841A1-20170608",
  "_processing_info": {
    "original_size": 85841,
    "optimized_size": 3493,
    "reduction_percent": 95.93
  }
}