{
  "date_produced": "20170823",
  "publication_number": "US20170255865A1-20170907",
  "main_ipcr_label": "G06N504",
  "decision": "PENDING",
  "application_number": "15057331",
  "inventor_list": [
    {
      "inventor_name_last": "Riscutia",
      "inventor_name_first": "Vlad",
      "inventor_city": "Redmond",
      "inventor_state": "WA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Vaidyanathan",
      "inventor_name_first": "Priya",
      "inventor_city": "Clyde Hill",
      "inventor_state": "WA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Stepanich",
      "inventor_name_first": "Darron J.",
      "inventor_city": "Seattle",
      "inventor_state": "WA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Hoogerwerf",
      "inventor_name_first": "Scott",
      "inventor_city": "Seattle",
      "inventor_state": "WA",
      "inventor_country": "US"
    }
  ],
  "abstract": "Experimentation action definitions can each define a different computer action. Execution rules can govern an execution order of the different computer actions. A set of computer-readable preference levels of a current user profile can be received. Each of the preference levels can be for a corresponding one of the executed actions being executed for the current user profile. The preference levels can correspond to user interface responses to the execution of the executed actions. One of the executed actions can be selected as a follow-up action to take for a subsequent user profile. The selecting can include selecting the follow-up action from among a plurality of available actions such as the executed actions. In response to the selection, execution of the selected follow-up action for a subsequent user profile can be requested.",
  "filing_date": "20160301",
  "patent_number": "None",
  "summary": "<SOH> SUMMARY <EOH>The tools and techniques discussed herein relate to computer system experimentation on computer actions to be taken by computer applications. As an example, the tools and techniques can include storing experimentation action definitions in a computer system. Each of the definitions can define a different computer action. Execution rules can also be stored in the computer system, where the execution rules can govern an execution order of the different computer actions. A set of computer-readable preference level(s) of a current user profile can be received. Each of the preference level(s) can be for a corresponding one of the executed actions being executed for the current user profile. The preference levels can correspond to user interface responses to the execution of the executed actions. The example of the tools and techniques can further include selecting one of the executed actions as a follow-up action to take in the computer system for a subsequent user profile. This selecting can include applying a set of computer-readable selection rules (which may or may not be combined with the execution rules) to at least one of the one or more preference levels. The selecting can also include accounting for common characteristic(s) between the subsequent user profile and the current user profile. The selecting can include selecting the follow-up action from among a plurality of available actions. In response to the selection, execution of the selected follow-up action for a subsequent user profile can be requested. This Summary is provided to introduce a selection of concepts in a simplified form. The concepts are further described below in the Detailed Description. This Summary is not intended to identify key features or essential features of the claimed subject matter, nor is it intended to be used to limit the scope of the claimed subject matter. Similarly, the invention is not limited to implementations that address the particular techniques, tool...",
  "date_published": "20170907",
  "title": "COMPUTER APPLICATION ACTION EXPERIMENTATION",
  "ipcr_labels": [
    "G06N504",
    "H04L2908"
  ],
  "_processing_info": {
    "original_size": 85334,
    "optimized_size": 3836,
    "reduction_percent": 95.5
  }
}