{
  "date_produced": "20160706",
  "publication_number": "US20160210559A1-20160721",
  "main_ipcr_label": "G06N700",
  "decision": "PENDING",
  "application_number": "15060555",
  "inventor_list": [
    {
      "inventor_name_last": "Jean-Baptiste",
      "inventor_name_first": "Rachel",
      "inventor_city": "Washington",
      "inventor_state": "DC",
      "inventor_country": "US"
    }
  ],
  "abstract": "A system and method to monitor, visualize, and predict the progression or recession of symptoms or diseases is disclosed herein. The system includes a control server that creates and disperses surveys that are tailored to target a particular symptom or disease, such as Ebola. Various users operating a plurality of computing devices in the field, such as in a particular country, may answer the questions for every patient, and then transmit the data in real-time to a database associated with and accessible by the control server. The control server may perform various calculations including prediction analysis on the received data in order to determine the prevalence and possible spread of the disease. Based on the analysis by the control server, decision-makers in Non-Governmental Organizations may make accurate and effective decisions in a more time effective and cost-efficient basis, and ultimately save lives.",
  "filing_date": "20160303",
  "patent_number": "None",
  "summary": "<SOH> SUMMARY <EOH>A system and method that continuously receives data from a plurality of computing devices and processes and visualizes the data in real-time is disclosed. The data may be based on a survey created by an administrator, or automated, wherein the survey is tailored to discover particular symptoms associated with a particular disease or sickness. Multiple users operating computing devices may answer the questions in the survey for each patient the user encounters. From there, the data may be sent to a control server which re-formats the data into one readable format for the control server, so that all information received from the plurality of computing devices is accounted for. The control server may then perform various processes on the received data, such as predictive analyses on the potential progression or regression of symptoms or diseases based on the data. The system according to the above includes memory and one or more computing devices operatively coupled to the memory, wherein the one or more processors are configured to: continuously receive, from a plurality of computing devices, symptom information of a population, wherein the symptom information received from each of the plurality of computing devices is in a different data format; reformat the received symptom information into a single data format; display the reformatted symptom information in real-time into a graphic; continuously update the displayed graphic, in real-time, with newly received symptom information of the population; and predict future patterns on the displayed graphic based on the newly received transmitted information and the populous information, wherein the prediction of future patterns includes predicting future symptoms or diseases in a geographic region. As a further example, at least two of the plurality of computing devices are in different geographical regions. As another example, the one or more processors are configured to create a link, wherein the link ...",
  "date_published": "20160721",
  "title": "SYSTEM AND METHOD TO MONITOR, VISUALIZE, AND PREDICT DISEASES",
  "ipcr_labels": [
    "G06N700",
    "G06N504"
  ],
  "_processing_info": {
    "original_size": 66607,
    "optimized_size": 3492,
    "reduction_percent": 94.76
  }
}