{
  "decision": "PENDING",
  "application_number": "15069897",
  "date_published": "20170202",
  "date_produced": "20170119",
  "title": "Swipe Shoppe",
  "filing_date": "20160314",
  "inventor_list": [
    {
      "inventor_name_last": "Torres",
      "inventor_name_first": "Francisco Severo",
      "inventor_city": "Leominster",
      "inventor_state": "MA",
      "inventor_country": "US"
    }
  ],
  "ipcr_labels": [
    "G06Q3006",
    "G06Q5000",
    "G06Q3002"
  ],
  "main_ipcr_label": "G06Q3006",
  "summary": "<SOH> BRIEF SUMMARY OF THE INVENTION <EOH>“Swipe Shoppe” is a website and mobile application designed for all CPUs and Smart phone platforms. It will make searching for what you want to buy easier than ever before. It is a price and comparison invention to help expose consumers to more options in less time. “Swipe Shoppe” makes finding a product that you want immediately or in a couple of months as simple as it has ever been. Just search a product and find where it is at the best price. Or you can browse and discover new brands, vendors, and businesses you've never knew existed. “Swipe Shoppe” takes products from websites, stores, and all private sale sites and stores and brings them to the “Swipe Shoppe” platform. It makes browsing and pricing everything you shop for more simple. (All drawings were done with a WESTCOTT 12 inch ruler, and, an Artist's Loft 6 inch All Purpose Template for all the shapes in the drawings.)",
  "patent_number": "None",
  "abstract": "Swipe Shoppe connects the consumer with local deals wherever they are and connects them to the entire retail market and pre-owned items listed by private sellers in stores, at shops, and online. Combined with the retail and private sale markets online and physical store locations, “Swipe Shoppe” hopes to get the best product according to the exact prompt typed into the search bar, to the consumer at the faster than anything else, since “Swipe Shoppe” is the first and only product of its' kind. “Swipe Shoppe” will educate the consumer.",
  "publication_number": "US20170032435A1-20170202",
  "_processing_info": {
    "original_size": 45403,
    "optimized_size": 2078,
    "reduction_percent": 95.42
  }
}