{
  "decision": "REJECTED",
  "application_number": "15067831",
  "date_published": "20160915",
  "date_produced": "20160831",
  "title": "Apparatus and Method for Mutli-Layered Graphical User Interface for Use in Mediated Reality",
  "filing_date": "20160311",
  "inventor_list": [
    {
      "inventor_name_last": "Mack",
      "inventor_name_first": "Corey",
      "inventor_city": "Venice",
      "inventor_state": "CA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Kokonaski",
      "inventor_name_first": "William",
      "inventor_city": "Gig Harbor",
      "inventor_state": "WA",
      "inventor_country": "US"
    }
  ],
  "ipcr_labels": [
    "G06T1900",
    "G06T1160",
    "G06N302",
    "G06T1520",
    "G06T1920",
    "G06F30481",
    "G06F301"
  ],
  "main_ipcr_label": "G06T1900",
  "summary": "<SOH> SUMMARY <EOH>Disclosed is a computer-implemented method that, in an embodiment, yields an immersive mediated reality experience by layering certain graphical user interface elements or active elements running in a real time computing application. The method and apparatus allow a user to traverse real 3D space and have certain overlaid bits of information appear at appropriate scale, projection, and time based on a desired application. Since this system does not use an image sensor to place images, a gain in performance may be yielded via the lower processing demands.",
  "patent_number": "None",
  "abstract": "Disclosed are methods and devices for displaying a virtual image in a field of vision of a user without the use of an image sensor. In an embodiment, the device receives first data identifying a user's first location and uses the first data to estimate the user's first location. The estimate of the user's first location is then used to identify at least one user interface element or active element within the user's field of vision. The at least one user interface element or active element is associated with one of a plurality of layered planes in a virtual space. A first version of the user interface element or active element is displayed within a first field of vision of the user. The user's updated location is then used to update the appearance of the representation of the user interface element or active element within a second field of vision of the user.",
  "publication_number": "US20160267714A1-20160915",
  "_processing_info": {
    "original_size": 41448,
    "optimized_size": 2247,
    "reduction_percent": 94.58
  }
}