{
  "decision": "ACCEPTED",
  "application_number": "15064964",
  "date_published": "20160915",
  "date_produced": "20160831",
  "title": "Low-Pin Microcontroller Device With Multiple Independent Microcontrollers",
  "filing_date": "20160309",
  "inventor_list": [
    {
      "inventor_name_last": "Kris",
      "inventor_name_first": "Bryan",
      "inventor_city": "Gilbert",
      "inventor_state": "AZ",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Wojewoda",
      "inventor_name_first": "Igor",
      "inventor_city": "Tempe",
      "inventor_state": "AZ",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Dumais",
      "inventor_name_first": "Alex",
      "inventor_city": "Gilbert",
      "inventor_state": "AZ",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Catherwood",
      "inventor_name_first": "Mike",
      "inventor_city": "Georgetown",
      "inventor_state": "TX",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Fall",
      "inventor_name_first": "Brian",
      "inventor_city": "Mesa",
      "inventor_state": "AZ",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Tollefson",
      "inventor_name_first": "Jason",
      "inventor_city": "Phoenix",
      "inventor_state": "AZ",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Wilke",
      "inventor_name_first": "Calum",
      "inventor_city": "Chandler",
      "inventor_state": "AZ",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Mickey",
      "inventor_name_first": "Dave",
      "inventor_city": "Chandler",
      "inventor_state": "AZ",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Spohrer",
      "inventor_name_first": "Thomas",
      "inventor_city": "Chandler",
      "inventor_state": "AZ",
      "inventor_country": "US"
    }
  ],
  "ipcr_labels": [
    "G06F1342",
    "G06F1316",
    "G06F13364"
  ],
  "main_ipcr_label": "G06F1342",
  "summary": "<SOH> SUMMARY <EOH>There exists, however, a need for such dual or multi-core microcontroller devices to be arranged within a low pin count housing. According to an embodiment, a microcontroller device may comprise a plurality of external pins comprising a plurality of input/output pins, a first microcontroller comprising a first central processing unit (CPU), a first system bus coupled with the first CPU, first memory coupled with the first system bus, and a first plurality of peripheral devices coupled with the first system bus, a second microcontroller comprising a second central processing unit (CPU), a second system bus coupled with the second CPU, second memory coupled with the second system bus, and a second plurality of peripheral devices coupled with the second system bus, and a pad ownership multiplexer unit being controllable to assign control of the input/output pins to either the first microcontroller or the second microcontroller, wherein the number of external pins is less than the sum of a data buswidth of the first and second microcontroller. According to a further embodiment, the microcontroller may further comprise configuration registers that determine an assignment of the external pins, wherein the configuration registers are programmed during programming of the microcontroller device. According to a further embodiment, the microcontroller device may further comprise special function registers that determine an assignment of the external pins. According to a further embodiment, the special function registers are programmable only by the first microcontroller. According to a further embodiment, the first microcontroller can be a master and the second microcontroller can be a slave, wherein a program memory of the second microcontroller comprises volatile memory which is writable by the first microcontroller. According to a further embodiment, each microcontroller may comprises a peripheral pin select unit configured to assign a selected external p...",
  "patent_number": "10002102",
  "abstract": "A microcontroller device has a housing with a plurality of external pins having a plurality of input/output pins, a first microcontroller with a first central processing unit (CPU), a first system bus coupled with the first CPU, first memory coupled with the first system bus, and a first plurality of peripheral devices coupled with the first system bus, a second microcontroller with a second central processing unit (CPU), a second system bus coupled with the second CPU, second memory coupled with the second system bus, and a second plurality of peripheral devices coupled with the second system bus, and a pad ownership multiplexer unit being controllable to assign control of the input/output pins to either the first microcontroller or the second microcontroller, wherein the number of external pins is less than the sum of a data buswidth of the first and second microcontroller.",
  "publication_number": "US20160267046A1-20160915",
  "_processing_info": {
    "original_size": 48981,
    "optimized_size": 4634,
    "reduction_percent": 90.54
  }
}