{
  "decision": "PENDING",
  "application_number": "15061265",
  "date_published": "20160908",
  "date_produced": "20160824",
  "title": "APPARATUS AND METHOD OF MONITORING PRODUCT PLACEMENT WITHIN A SHOPPING FACILITY",
  "filing_date": "20160304",
  "inventor_list": [
    {
      "inventor_name_last": "High",
      "inventor_name_first": "Donald R.",
      "inventor_city": "Noel",
      "inventor_state": "MO",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Chakrobartty",
      "inventor_name_first": "Shuvro",
      "inventor_city": "Bentonville",
      "inventor_state": "AR",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Taylor",
      "inventor_name_first": "Robert C.",
      "inventor_city": "Rogers",
      "inventor_state": "AR",
      "inventor_country": "US"
    }
  ],
  "ipcr_labels": [
    "G06Q1008",
    "G06K932",
    "G06K900",
    "H04N1302",
    "G06T700"
  ],
  "main_ipcr_label": "G06Q1008",
  "summary": "<SOH> BRIEF DESCRIPTION OF THE DRAWINGS <EOH>The above needs are at least partially met through provision of embodiments of systems, devices, and methods designed to provide assistance to customers and/or workers in a shopping facility, such as described in the following detailed description, particularly when studied in conjunction with the drawings, wherein: FIG. 1 comprises a block diagram of a shopping assistance system as configured in accordance with various embodiments of these teachings; FIGS. 2A and 2B are illustrations of a motorized transport unit of the system of FIG. 1 in a retracted orientation and an extended orientation in accordance with some embodiments; FIGS. 3A and 3B are illustrations of the motorized transport unit of FIGS. 2A and 2B detachably coupling to a movable item container, such as a shopping cart, in accordance with some embodiments; FIG. 4 comprises a block diagram of a motorized transport unit as configured in accordance with various embodiments of these teachings; FIG. 5 comprises a block diagram of a computer device as configured in accordance with various embodiments of these teachings; FIG. 6 comprises a block diagram of a shopping assistance system as configured in accordance with various embodiments of these teachings; FIG. 7 shows a simplified block diagram of an exemplary motorized transport unit, in accordance with some embodiments; FIG. 8A illustrates a simplified block diagram of an exemplary three-dimensional (3D) scanner, in accordance with some embodiments; FIG. 8B shows a simplified plane view of a plurality of exemplary 3D scanners cooperated with a motorized transport unit, in accordance with some embodiments; FIG. 9 shows simplified block diagram of a motorized transport unit supporting and moving multiple 3D scanners along a modular having multiple shelves that supports multiple different products, in accordance with some embodiments; FIG. 10 shows a simplified overhead view of at least a portion of a shopping faci...",
  "patent_number": "None",
  "abstract": "Methods and apparatuses are provided for use in monitoring product placement within a shopping facility. Some embodiments provide an apparatus configured to determine product placement conditions within a shopping facility, comprising: a transceiver configured to wirelessly receive communications; a product monitoring control circuit coupled with the transceiver; a memory coupled with the control circuit and storing computer instructions that when executed by the control circuit cause the control circuit to: obtain a composite three-dimensional (3D) scan mapping corresponding to at least a select area of the shopping facility and based on a series of 3D scan data; evaluate the 3D scan mapping to identify multiple product depth distances; and identify, from the evaluation of the 3D scan mapping, when one or more of the multiple product depth distances is greater than a predefined depth distance threshold from the reference offset distance of the product support structure.",
  "publication_number": "US20160260054A1-20160908",
  "_processing_info": {
    "original_size": 148851,
    "optimized_size": 3898,
    "reduction_percent": 97.38
  }
}