{
  "decision": "PENDING",
  "application_number": "15066723",
  "date_published": "20170914",
  "date_produced": "20170830",
  "title": "DVR CONTENT BACKUP USING ANOTHER DVR OR ANOTHER HDD ON THE SAME DVR",
  "filing_date": "20160310",
  "inventor_list": [
    {
      "inventor_name_last": "Milne",
      "inventor_name_first": "James R.",
      "inventor_city": "Ramona",
      "inventor_state": "CA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Ansfield",
      "inventor_name_first": "Fred",
      "inventor_city": "San Diego",
      "inventor_state": "CA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Zustak",
      "inventor_name_first": "Frederick J.",
      "inventor_city": "Poway",
      "inventor_state": "CA",
      "inventor_country": "US"
    }
  ],
  "ipcr_labels": [
    "G06F306",
    "G06F2110"
  ],
  "main_ipcr_label": "G06F306",
  "summary": "<SOH> SUMMARY <EOH>Accordingly, an apparatus includes at least one computer memory that is not a transitory signal and that in turn includes instructions executable by at least one processor to receive a transfer command, and responsive to the transfer command, backup content on a first storage of an in-home digital video recorder (DVR) to a second storage configured as a redundant array of independent disks (RAID)-1. The transfer is over a direct communication path between, the first and second storages. In some examples, the first and second storages are internal to the first DVR. In other examples, the first storage is internal to the first DVR and the second storage is internal to a second DVR. The content that is backed, up can include two or more of: recorded programs, season passes, customer preferences. To this end, in some implementations the instructions can be executed to authenticate digital rights management (DRM) of the first DVR, and execute transfer of content from the first storage to the second storage responsive to successful authentication of the DRM. In another aspect, an apparatus includes at least one computer memory that is not a transitory signal and that in torn includes instructions executable by at least one processor to present on at least one display at least one user interface (UI). The UI includes a configuration selector selectable to configure a selectable one of first and second storages associated with a digital video recording (DVR) system as a backup storage. The UI also includes a start selector selectable to copy content, on the first storage to the second storage with the second storage configured as a redundant artsy of independent disks (RAID)-1 storage. In another aspect, a method includes recording content on a first storage of a first digital video recorder (DVR), and backing up the content onto a second storage configured as a redundant array of independent disks (RAID)-1 storage. The details of the present application,...",
  "patent_number": "None",
  "abstract": "A technique to backup data on a DVR includes receiving a transfer command, and responsive to the transfer command, backing up content on a first storage of an in-home digital video recorder (DVR) to a second storage configured as a redundant array of independent disks (RAID)-1. The transfer is over a direct communication path between the first and second storages.",
  "publication_number": "US20170262182A1-20170914",
  "_processing_info": {
    "original_size": 82753,
    "optimized_size": 3228,
    "reduction_percent": 96.1
  }
}