{
  "date_produced": "20170830",
  "publication_number": "US20170262755A1-20170914",
  "main_ipcr_label": "G06N502",
  "decision": "PENDING",
  "application_number": "15064821",
  "inventor_list": [
    {
      "inventor_name_last": "Takeuchi",
      "inventor_name_first": "Emiko",
      "inventor_city": "Tokyo",
      "inventor_state": "",
      "inventor_country": "JP"
    },
    {
      "inventor_name_last": "Takuma",
      "inventor_name_first": "Daisuke",
      "inventor_city": "Tokyo",
      "inventor_state": "",
      "inventor_country": "JP"
    },
    {
      "inventor_name_last": "Toyoshima",
      "inventor_name_first": "Hirobumi",
      "inventor_city": "Tokyo",
      "inventor_state": "",
      "inventor_country": "JP"
    }
  ],
  "abstract": "A first element is extracted from a pair including a past inquiry and a past response, wherein the first element indicates that the past response shows an understanding of the past inquiry. A model is generated used to estimate a second element in a new inquiry based on the first element, wherein the second element indicates that a new response to the new inquiry shows an understanding of the new inquiry.",
  "filing_date": "20160309",
  "patent_number": "None",
  "summary": "<SOH> SUMMARY <EOH>Embodiments of the present invention provide systems, methods, and program products for supporting generation of a response to an inquiry. A first element is extracted from a pair including a past inquiry and a past response, wherein the first element indicates that the past response shows an understanding of the past inquiry. A model is generated used to estimate a second element in a new inquiry based on the first element, wherein the second element indicates that a new response to the new inquiry shows an understanding of the new inquiry.",
  "date_published": "20170914",
  "title": "SUPPORTING GENERATION OF A RESPONSE TO AN INQUIRY",
  "ipcr_labels": [
    "G06N502"
  ],
  "_processing_info": {
    "original_size": 42058,
    "optimized_size": 1792,
    "reduction_percent": 95.74
  }
}