{
  "decision": "REJECTED",
  "application_number": "15062330",
  "date_published": "20170126",
  "date_produced": "20170110",
  "title": "TOUCH ALPHABET AND COMMUNICATION SYSTEM",
  "filing_date": "20160307",
  "inventor_list": [
    {
      "inventor_name_last": "DUFFIELD",
      "inventor_name_first": "ROBERT H.",
      "inventor_city": "COEUR D'ALENE",
      "inventor_state": "ID",
      "inventor_country": "US"
    }
  ],
  "ipcr_labels": [
    "G06F3041",
    "G06F3023",
    "G06F30488"
  ],
  "main_ipcr_label": "G06F3041",
  "summary": "<SOH> SUMMARY <EOH>A touch alphabet and communication system is provided. The communication system uses a predetermined set of touch gestures, such as fingertip touch patterns performable on keyless touch-sensitive surfaces, to express the user's desired communication. The touch-sensitive surface may be the touch screen display of a computer, tablet device, cell phone, or a touch-sensitive pad, for example. The finger touch patterns are based on a limited set of unique and ergonomically pleasing finger positions that may be performed in a limited area. The touch alphabet allows the user to comprehensively communicate without looking at the communication device, and with just one hand, or in another implementation, with two hands. Thus, a user can comfortably tap an entire alphabet and related functions, with one hand, without having to visualize the user interface surface or hunt for individual keys. This summary section is not intended to give a full description of touch alphabets and communication systems. A detailed description with example implementations follows.",
  "patent_number": "None",
  "abstract": "A touch alphabet and communication system is provided. The communication system uses a predetermined set of touch gestures, such as fingertip touch patterns performable on keyless touch-sensitive surfaces, to express the user's desired communication. The touch-sensitive surface may be the touch screen display of a computer, tablet device, cell phone, or a touch-sensitive pad, for example. The finger touch patterns are based on a limited set of unique and ergonomically pleasing finger positions that may be performed in a limited area. The touch alphabet allows the user to comprehensively communicate without looking at the communication device, and with just one hand, or in another implementation, with two hands. Thus, a user can comfortably tap an entire alphabet and related functions, with one hand, without having to visualize the user interface surface or hunt for individual keys.",
  "publication_number": "US20170024053A1-20170126",
  "_processing_info": {
    "original_size": 51715,
    "optimized_size": 2540,
    "reduction_percent": 95.09
  }
}