{
  "date_produced": "20160615",
  "publication_number": "US20160189033A1-20160630",
  "main_ipcr_label": "G06N502",
  "decision": "ACCEPTED",
  "application_number": "15062497",
  "inventor_list": [
    {
      "inventor_name_last": "Contreras",
      "inventor_name_first": "David",
      "inventor_city": "Apex",
      "inventor_state": "NC",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Sizemore",
      "inventor_name_first": "Robert C.",
      "inventor_city": "Fuquay-Varina",
      "inventor_state": "NC",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Smith",
      "inventor_name_first": "Sterling R.",
      "inventor_city": "Apex",
      "inventor_state": "NC",
      "inventor_country": "US"
    }
  ],
  "abstract": "A mechanism is provided in a question answering system for duration similarity weighting in a question answering system. The question answering system receives an input question. The question answering system generates a plurality of candidate answers to the input question using a corpus of information. The question answering system identifies a question-side duration value for the input question and identifies a policy-side duration value for a policy to be applied to an entity identified in the input question. The question answering system determines a duration similarity weight for each of the plurality of candidate answers. The question answering system applies the duration similarity weight to each of the plurality of candidate answers. The question answering system ranks the plurality of candidate answers and outputs one or more of the candidate answers.",
  "filing_date": "20160307",
  "patent_number": "9535980",
  "summary": "<SOH> SUMMARY <EOH>In one illustrative embodiment, a method, in a data processing system, is provided for duration similarity weighting in a question answering system. The method comprises receiving an input question and generating a plurality of candidate answers to the input question using a corpus of information. The method further comprises identifying a question-side duration value for the input question and identifying a policy-side duration value for a policy to be applied to an entity identified in the input question. The method further comprises determining a duration similarity weight for each of the plurality of candidate answers and applying the duration similarity weight to each of the plurality of candidate answers. The method further comprises ranking the plurality of candidate answers and outputting one or more of the candidate answers. In other illustrative embodiments, a computer program product comprising a computer useable or readable medium having a computer readable program is provided. The computer readable program, when executed on a computing device, causes the computing device to perform various ones of, and combinations of, the operations outlined above with regard to the method illustrative embodiment. In yet another illustrative embodiment, a system/apparatus is provided. The system/apparatus may comprise one or more processors and a memory coupled to the one or more processors. The memory may comprise instructions which, when executed by the one or more processors, cause the one or more processors to perform various ones of, and combinations of, the operations outlined above with regard to the method illustrative embodiment. These and other features and advantages of the present invention will be described in, or will become apparent to those of ordinary skill in the art in view of, the following detailed description of the example embodiments of the present invention.",
  "date_published": "20160630",
  "title": "NLP Duration and Duration Range Comparison Methodology Using Similarity Weighting",
  "ipcr_labels": [
    "G06N502"
  ],
  "_processing_info": {
    "original_size": 62300,
    "optimized_size": 3673,
    "reduction_percent": 94.1
  }
}