{
  "date_produced": "20170830",
  "publication_number": "US20170262762A1-20170914",
  "main_ipcr_label": "G06N700",
  "decision": "PENDING",
  "application_number": "15066937",
  "inventor_list": [
    {
      "inventor_name_last": "Conover",
      "inventor_name_first": "Michael",
      "inventor_city": "San Francisco",
      "inventor_state": "CA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Jurka",
      "inventor_name_first": "Timothy P.",
      "inventor_city": "Redwood City",
      "inventor_state": "CA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "McGinty",
      "inventor_name_first": "Claire D.",
      "inventor_city": "San Francisco",
      "inventor_state": "CA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Shen",
      "inventor_name_first": "Quinn Z.",
      "inventor_city": "San Francisco",
      "inventor_state": "CA",
      "inventor_country": "US"
    }
  ],
  "abstract": "The disclosed embodiments provide a system for processing data. During operation, the system calculates one or more quantiles from a distribution of historic user engagement with content within a member segment of a social network. Next, the system performs a comparison of the one or more quantiles with a current measurement of user engagement with a content item within the member segment. When the comparison indicates that the current measurement of user engagement exceeds a threshold, the system presents the content item to one or more members in the member segment.",
  "filing_date": "20160310",
  "patent_number": "None",
  "summary": "<SOH> BRIEF DESCRIPTION OF THE FIGURES <EOH>FIG. 1 shows a schematic of a system in accordance with the disclosed embodiments. FIG. 2 shows a system for processing data in accordance with the disclosed embodiments. FIG. 3 shows the generation of a content pool based on expanded network engagement with content items in a social network in accordance with the disclosed embodiments. FIG. 4 shows the engagement-based selection of a content item for highlighting within a member segment of a social network in accordance with the disclosed embodiments. FIG. 5 shows a flowchart illustrating the processing of data in accordance with the disclosed embodiments. FIG. 6 shows a flowchart illustrating the process of using queries of a data set to aggregate measurements of user engagement with a set of content items within a second-degree network of a member in accordance with the disclosed embodiments. FIG. 7 shows a flowchart illustrating the processing of data in accordance with the disclosed embodiments. FIG. 8 shows a computer system in accordance with the disclosed embodiments. detailed-description description=\"Detailed Description\" end=\"lead\"? In the figures, like reference numerals refer to the same figure elements.",
  "date_published": "20170914",
  "title": "ENGAGEMENT-BASED SELECTION OF CONTENT FOR MEMBER SEGMENTS OF SOCIAL NETWORKS",
  "ipcr_labels": [
    "G06N700",
    "G06F1730"
  ],
  "_processing_info": {
    "original_size": 55834,
    "optimized_size": 2845,
    "reduction_percent": 94.9
  }
}