{
  "date_produced": "20170830",
  "publication_number": "US20170262758A1-20170914",
  "main_ipcr_label": "G06N504",
  "decision": "PENDING",
  "application_number": "15067027",
  "inventor_list": [
    {
      "inventor_name_last": "Boyapalle",
      "inventor_name_first": "Anantha K.",
      "inventor_city": "Cedar Park",
      "inventor_state": "TX",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Gatson",
      "inventor_name_first": "Michael S.",
      "inventor_city": "Austin",
      "inventor_state": "TX",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Hammons",
      "inventor_name_first": "Marc R.",
      "inventor_city": "Round Rock",
      "inventor_state": "TX",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Tan",
      "inventor_name_first": "Danilo O.",
      "inventor_city": "Austin",
      "inventor_state": "TX",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Vichare",
      "inventor_name_first": "Nikhil M.",
      "inventor_city": "Austin",
      "inventor_state": "TX",
      "inventor_country": "US"
    }
  ],
  "abstract": "A method and information handling system configured to store aggregate information handling system interaction telemetry data representing levels of operational activity reported for a user of an information handling system in a monitoring system data repository memory device and for receiving aggregate information handling system interaction telemetry data for a plurality of other users that is crowd-sourced from a population of information handling systems accessed by a plurality of other users. An application processor executes instructions of an information handling system interaction signature platform. The interaction signature platform may apply a supervised learning model algorithm to the aggregate information handling system interaction telemetry data for the user in comparison to the aggregate information handling system interaction telemetry data for the plurality of other users to determine at least one indirect identifier of the interaction telemetry data, wherein a value ...",
  "filing_date": "20160310",
  "patent_number": "None",
  "summary": "<SOH> BRIEF DESCRIPTION OF THE DRAWINGS <EOH>It will be appreciated that for simplicity and clarity of illustration, elements illustrated in the Figures are not necessarily drawn to scale. For example, the dimensions of some elements may be exaggerated relative to other elements. Embodiments incorporating teachings of the present disclosure are shown and described with respect to the drawings herein, in which: FIG. 1 is a block diagram illustrating an information handling system according to an embodiment of the present disclosure; FIG. 2 is a block diagram illustrating a network environment having a plurality of information handling systems according to an embodiment of the present disclosure; FIG. 3 is a block diagram illustrating components for an aspect of an intelligent system configuration management system with an information handling system interaction signature platform according to an embodiment of the present disclosure; FIG. 4 is a flow diagram illustrating a method of determining fingerprint profiles of operational activity by an information handling system information handling system interaction signature platform according to an embodiment of the present disclosure; FIG. 5A is a diagram illustrating an example of an interaction profile of operational activity by a user of an information handling system according to an embodiment of the present disclosure; FIG. 5B is a diagram illustrating another example of an interaction profile of operational activity by a user of an information handling system according to an embodiment of the present disclosure; FIG. 5C is a diagram illustrating yet another example of an interaction profile of operational activity by a user of an information handling system according to an embodiment of the present disclosure; FIG. 6A is a block diagram illustrating components for another aspect of an intelligent configuration management system according to an embodiment of the present disclosure; FIG. 6B is a block diagram illust...",
  "date_published": "20170914",
  "title": "SYSTEM AND METHOD TO ASSESS ANOMALOUS BEHAVIOR ON AN INFORMATION HANDLING SYSTEM USING INDIRECT IDENTIFIERS",
  "ipcr_labels": [
    "G06N504",
    "G06N9900"
  ],
  "_processing_info": {
    "original_size": 130146,
    "optimized_size": 4209,
    "reduction_percent": 96.77
  }
}