{
  "date_produced": "20160914",
  "publication_number": "US20160283856A1-20160929",
  "main_ipcr_label": "G06N700",
  "decision": "PENDING",
  "application_number": "15069632",
  "inventor_list": [
    {
      "inventor_name_last": "JAYARAMAN",
      "inventor_name_first": "Srinivasan",
      "inventor_city": "Bangalore",
      "inventor_state": "",
      "inventor_country": "IN"
    },
    {
      "inventor_name_last": "Purushothaman",
      "inventor_name_first": "Balamuralidhar",
      "inventor_city": "Bangalore",
      "inventor_state": "",
      "inventor_country": "IN"
    }
  ],
  "abstract": "A system for determining stress level of a person in real-time have been disclosed. In one aspect, the system captures physiological data associated to the person. In one embodiment, the physiological data may be captured by using a plurality of sensors attached at wrist or ankle or neck or waist or hip of the person, for a predetermined time interval. The plurality of sensors may include a wrist watch or a wristband or a textile material. The system further pre-processes the physiological data in order to extract one or more physiological parameters. In one aspect, the pre-processing may include performing an analysis on the physiological data. The system further determines the stress level of the person upon performing the statistical analysis on the one or more physiological parameters. According to another embodiment, a method for real time determination of stress level of the person has also been provided.",
  "filing_date": "20160314",
  "patent_number": "None",
  "summary": "<SOH> SUMMARY <EOH>Embodiments of the present disclosure present technological improvements as solutions to one or more of the above-mentioned technical problems recognized by the inventors in conventional systems. In one implementation, a system and a processor implemented method for determining a stress level of a person in real-time is disclosed. The present invention may be used to capture physiological data associated to the person. In one embodiment, the physiological data may be captured by using a single or an array of sensors attached to wrist or ankle or neck or waist of the person. In one aspect, the array of sensor could be 2 or more sensing element embodied as a sensor. In one aspect, in order to measure the arterial pulse palpation rate, a sensor may be attached to the wrist of the person by using the wristwatch or the wristband or the textile as a cuff. The system further includes a transmitter, a storage device and a processor. The transmitter transmits the stream of pulse palpation signal to the processor. The processor further includes a preprocessing module and a decision support system module. The preprocessing module preprocesses the stream of arterial pulse palpation signal to extract a plurality of physiological parameters. The decision support module performs a statistical modal analysis of the plurality of physiological parameters and determines the stress level of the person based on the statistical modal analysis. In another embodiment, the present invention may capture the physiological data by using an integrated smart phone sensor. It may be understood that the present invention may require minimum of 1 minute of the arterial pulse palpation rate. In one scenario, the present invention may capture the physiological data and transmit the physiological data to a smart phone or an external device having a decision support system (DSS) module installed on the smart phone or the external device. Once the physiological data is transmitted, th...",
  "date_published": "20160929",
  "title": "SYSTEM AND METHOD FOR DETERMINING PSYCHOLOGICAL STRESS OF A PERSON",
  "ipcr_labels": [
    "G06N700",
    "A61B500",
    "A61B5024",
    "A61B518",
    "G06N504",
    "A61B516"
  ],
  "_processing_info": {
    "original_size": 43462,
    "optimized_size": 3700,
    "reduction_percent": 91.49
  }
}