{
  "decision": "PENDING",
  "application_number": "15065676",
  "date_published": "20170720",
  "date_produced": "20170705",
  "title": "METHOD AND SYSTEM FOR AUTOMATIC REPLENISHMENT AND MANAGEMENT OF INVENTORY",
  "filing_date": "20160309",
  "inventor_list": [
    {
      "inventor_name_last": "SIRISILLA",
      "inventor_name_first": "Nataraj",
      "inventor_city": "Hyderabad",
      "inventor_state": "",
      "inventor_country": "IN"
    },
    {
      "inventor_name_last": "TOGARCHETI",
      "inventor_name_first": "Sowmya",
      "inventor_city": "Hyderabad",
      "inventor_state": "",
      "inventor_country": "IN"
    }
  ],
  "ipcr_labels": [
    "G06Q1008",
    "H04L2908"
  ],
  "main_ipcr_label": "G06Q1008",
  "summary": "<SOH> SUMMARY <EOH>Embodiments of the present disclosure present technological improvements as solutions to one or more of the above-mentioned technical problems recognized by the inventors in conventional systems. For example, in one embodiment, a system for automatic replenishment and management of inventory, wherein the system includes a plurality of containers placed within premises or establishments. The sensors attached with containers determine the residual level of the one or more household commodities and share the received information with a one or more communication boxes. Further, the system includes a one or more communication boxes to receive and aggregate the information of the residual level of the one or more household commodities. Furthermore, the system includes a host server to receive the aggregated information from the one or more communication boxes and integrate the received information with one or more unique identifiers. Furthermore, the host server aggregates and enhances the integrated information of the residual level of the one or more household commodities with user's location details and shares with the one or more third parties which have subscribed to the services of host server. In addition to, the system includes users' electronic devices to receive the customized offer information prepared and shared by the one or more third parties via the host server and to place an order as per the customized offer information. In another embodiment, a computer implemented method for automatic replenishment and management of an inventory wherein the method includes determining the residual level of the one or more household commodities in the plurality of containers and sharing this information with the respective communication box of the one or more communication boxes. Further, the one or more communication boxes aggregates the received information and shares with the host server of the system. Therefore, the host server integrates the recei...",
  "patent_number": "None",
  "abstract": "The present disclosure discloses a system and method for automatic replenishment and management of inventory determines residual level of one or more household commodities, provides information concerning the residual level of one or more household commodities to various vendors, and a users' electronic device application using which the user can decide to place an order. The system includes plurality of sensor enabled commodity containers for inventory, communication boxes for receiving and further reporting current residual level of the one or more household commodities and a host server for integrating the received residual level information with one or more unique identifiers. Further, the host server provides the integrated information list to third parties without having any manual involvement in the whole process. Therefore, the host server may receive customized offer information concerning the integrated information list of one or more household commodities from the third part...",
  "publication_number": "US20170206489A1-20170720",
  "_processing_info": {
    "original_size": 45795,
    "optimized_size": 3730,
    "reduction_percent": 91.86
  }
}