{
  "date_produced": "20160622",
  "publication_number": "US20160196501A1-20160707",
  "main_ipcr_label": "G06N700",
  "decision": "REJECTED",
  "application_number": "15069276",
  "inventor_list": [
    {
      "inventor_name_last": "Anand",
      "inventor_name_first": "Rangachari",
      "inventor_city": "Teaneck",
      "inventor_state": "NJ",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Lee",
      "inventor_name_first": "Juhnyoung",
      "inventor_city": "Katonah",
      "inventor_state": "NY",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Liu",
      "inventor_name_first": "Rong",
      "inventor_city": "Sterling",
      "inventor_state": "VA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Miyamoto",
      "inventor_name_first": "Kohtaroh",
      "inventor_city": "Tokyo",
      "inventor_state": "",
      "inventor_country": "JP"
    }
  ],
  "abstract": "Diagnosing and detecting causes of an incident may comprise classifying the incident by keywords, searching for co-occurring and reoccurring group of incidents, summarizing commonalities in the group of incidents, correlating the group of incidents with causes, defining association rules between the commonalities, and predicting potential problems based on the correlated group of incidents with causes.",
  "filing_date": "20160314",
  "patent_number": "None",
  "summary": "<SOH> BRIEF SUMMARY <EOH>A method for diagnosing and detecting causes of an incident interactively, in one aspect, may comprise classifying the incident by keywords. The method may further comprise searching for co-occurring and reoccurring group of incidents. The method may also comprise summarizing commonalities in the group of incidents. The method may further comprise correlating the group of incidents with causes. The method may also comprise defining association rules between the commonalities. The method may further comprise predicting potential problems based on the correlated group of incidents with causes. In another aspect, a method of for diagnosing and detecting causes of an incident interactively, may comprise searching for relevant incident tickets by keywords. The method may further comprise computing similarity scores to generate a rank list of results of the search. The method may also comprise determining context relevancy weight by examining account technology portfolio to eliminate one or more of the incident tickets from the ranked list of results. The method may further comprise returning a top predetermined number of results from the ranked list of results. A system for diagnosing and detecting causes of an incident interactively, in one aspect, may comprising a user interface operable to execute on a processor and issue a query. The system may also comprise a search engine operable to receive the query, transform the query into sub-queries comprising a structured search and a free-text search, and to search for co-occurring and reoccurring group of incidents. The search engine may be further operable to correlate the group of incidents with causes based on common events found in the group of incidents, and present the co-occurring and reoccurring group of incidents and the causes to the user interface. A computer readable storage medium storing a program of instructions executable by a machine to perform one or more methods described herein ...",
  "date_published": "20160707",
  "title": "DIAGNOSING INCIDENTS FOR INFORMATION TECHNOLOGY SERVICE MANAGEMENT",
  "ipcr_labels": [
    "G06N700",
    "G06F1730"
  ],
  "_processing_info": {
    "original_size": 77574,
    "optimized_size": 3405,
    "reduction_percent": 95.61
  }
}