{
  "date_produced": "20160615",
  "publication_number": "US20160189046A1-20160630",
  "main_ipcr_label": "G06N700",
  "decision": "PENDING",
  "application_number": "15060782",
  "inventor_list": [
    {
      "inventor_name_last": "Byron",
      "inventor_name_first": "Donna K.",
      "inventor_city": "Petersham",
      "inventor_state": "MA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Estrada",
      "inventor_name_first": "Suzanne L.",
      "inventor_city": "Boca Raton",
      "inventor_state": "FL",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Pikovsky",
      "inventor_name_first": "Alexander",
      "inventor_city": "Lexington",
      "inventor_state": "MA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Winkler",
      "inventor_name_first": "Timothy P.",
      "inventor_city": "Clinton",
      "inventor_state": "MA",
      "inventor_country": "US"
    }
  ],
  "abstract": "A mechanism is provided in a data processing system for rating difficulty of a question. The mechanism receives an input question and generates one or more candidate answers from a corpus of knowledge using a pipeline of software engines. The pipeline of software engines generates a plurality of features extracted from the question, the one or more candidate answers, or the corpus of knowledge. The mechanism then generates a question difficulty score based on the plurality of features using a machine learning model. The machine learning model maps features to assigned weights for scaling the difficulty score.",
  "filing_date": "20160304",
  "patent_number": "None",
  "summary": "<SOH> SUMMARY <EOH>In one illustrative embodiment, a method, in a data processing system, is provided for rating difficulty of a question. The method comprises receiving an input question and generating one or more candidate answers from a corpus of knowledge using a pipeline of software engines. The pipeline of software engines generates a plurality of features extracted from the question, the one or more candidate answers, or the corpus of knowledge. The method further comprises generating a question difficulty score based on the plurality of features using a machine learning model. The machine learning model maps features to assigned weights for scaling the difficulty score. In other illustrative embodiments, a computer program product comprising a computer useable or readable medium having a computer readable program is provided. The computer readable program, when executed on a computing device, causes the computing device to perform various ones of, and combinations of, the operations outlined above with regard to the method illustrative embodiment. In yet another illustrative embodiment, a system/apparatus is provided. The system/apparatus may comprise one or more processors and a memory coupled to the one or more processors. The memory may comprise instructions which, when executed by the one or more processors, cause the one or more processors to perform various ones of, and combinations of, the operations outlined above with regard to the method illustrative embodiment. These and other features and advantages of the present invention will be described in, or will become apparent to those of ordinary skill in the art in view of, the following detailed description of the example embodiments of the present invention.",
  "date_published": "20160630",
  "title": "Rating Difficulty of Questions",
  "ipcr_labels": [
    "G06N700",
    "G06N9900"
  ],
  "_processing_info": {
    "original_size": 71058,
    "optimized_size": 3353,
    "reduction_percent": 95.28
  }
}