{
  "decision": "PENDING",
  "application_number": "15061770",
  "date_published": "20160908",
  "date_produced": "20160824",
  "title": "SHOPPING FACILITY ASSISTANCE SYSTEMS, DEVICES AND METHODS TO SUPPORT REQUESTING IN-PERSON ASSISTANCE",
  "filing_date": "20160304",
  "inventor_list": [
    {
      "inventor_name_last": "Winkle",
      "inventor_name_first": "David C.",
      "inventor_city": "Bella Vista",
      "inventor_state": "AR",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "McHale",
      "inventor_name_first": "Brian G.",
      "inventor_city": "Chadderton Oldham",
      "inventor_state": "",
      "inventor_country": "GB"
    },
    {
      "inventor_name_last": "High",
      "inventor_name_first": "Donald R.",
      "inventor_city": "Noel",
      "inventor_state": "MO",
      "inventor_country": "US"
    }
  ],
  "ipcr_labels": [
    "G06Q3002",
    "G06Q1006",
    "H04W404",
    "G06Q3006"
  ],
  "main_ipcr_label": "G06Q3002",
  "summary": "<SOH> BRIEF DESCRIPTION OF THE DRAWINGS <EOH>The above needs are at least partially met through provision of embodiments of systems, devices, and methods designed to provide assistance to customers and/or workers in a shopping facility, such as described in the following detailed description, particularly when studied in conjunction with the drawings, wherein: FIG. 1 comprises a block diagram of a shopping assistance system as configured in accordance with various embodiments of these teachings; FIGS. 2A and 2B are illustrations of a motorized transport unit of the system of FIG. 1 in a retracted orientation and an extended orientation in accordance with some embodiments; FIGS. 3A and 3B are illustrations of the motorized transport unit of FIGS. 2A and 2B detachably coupling to a movable item container, such as a shopping cart, in accordance with some embodiments; FIG. 4 comprises a block diagram of a motorized transport unit as configured in accordance with various embodiments of these teachings; FIG. 5 comprises a block diagram of a computer device as configured in accordance with various embodiments of these teachings; FIG. 6 comprises a flow diagram as configured in accordance with various embodiments of these teachings; FIG. 7 comprises a block diagram as configured in accordance with various embodiments of these teachings; and FIG. 8 comprises a block diagram as configured in accordance with various embodiments of these teachings. detailed-description description=\"Detailed Description\" end=\"lead\"? Elements in the figures are illustrated for simplicity and clarity and have not necessarily been drawn to scale. For example, the dimensions and/or relative positioning of some of the elements in the figures may be exaggerated relative to other elements to help to improve understanding of various embodiments of the present teachings. Also, common but well-understood elements that are useful or necessary in a commercially feasible embodiment are often not depicted in ...",
  "patent_number": "None",
  "abstract": "A motorized transport unit configured to move through a retail store space includes a location-determination component by which the motorized transport unit determines (either unilaterally or with the assistance of one or more remote elements) its location within the retail store space, a direct user-input interface by which a customer at the retail store space can request in-person human assistance, and a wireless network interface by which the request for in-person human assistance and a present location of the motorized transport unit is transmitted to a central computer system. The central computer system can respond to that request by tasking at least one person to present themselves to the customer.",
  "publication_number": "US20160260142A1-20160908",
  "_processing_info": {
    "original_size": 90974,
    "optimized_size": 3646,
    "reduction_percent": 95.99
  }
}