{
  "decision": "PENDING",
  "application_number": "15065271",
  "date_published": "20170126",
  "date_produced": "20170110",
  "title": "Method and Apparatus for Single-Hand Operation on Full Screen",
  "filing_date": "20160309",
  "inventor_list": [
    {
      "inventor_name_last": "LI",
      "inventor_name_first": "Guosheng",
      "inventor_city": "Beijing",
      "inventor_state": "",
      "inventor_country": "CN"
    },
    {
      "inventor_name_last": "LIU",
      "inventor_name_first": "Anyu",
      "inventor_city": "Beijing",
      "inventor_state": "",
      "inventor_country": "CN"
    },
    {
      "inventor_name_last": "TAO",
      "inventor_name_first": "Jun",
      "inventor_city": "Beijing",
      "inventor_state": "",
      "inventor_country": "CN"
    }
  ],
  "ipcr_labels": [
    "G06F30488",
    "G06F30481"
  ],
  "main_ipcr_label": "G06F30488",
  "summary": "<SOH> SUMMARY <EOH>According to a first aspect of embodiments of the present disclosure, there is provided a method for single-hand operation on a full screen of a smart device. The method includes determining whether a single-hand operation mode is activated, displaying a cursor indicator on the screen of the smart device when the single-hand operation mode is activated, moving the cursor indicator based on a track generated by a sliding operation on the screen of the smart device, determining whether the cursor indicator is moved into a trigger region, and activating the trigger region to receive an instruction associated with a touch event on the screen when the cursor indicator is moved into the trigger region. The touch event locates outside the trigger region. According to a second aspect of embodiments of the present disclosure, there is provided an apparatus for single-hand operation on a full screen of a smart device. The apparatus includes a processor, and a memory for storing instructions executable by the processor. The processor is configured to perform determining whether a single-hand operation mode is activated, displaying a cursor indicator on a screen of the smart device when the single-hand operation mode is activated, moving the cursor indicator based on a track generated by a sliding operation on the screen of the smart device, determining whether the cursor indicator is moved into a trigger region, and activating the trigger region to receive an instruction associated with a touch event on the screen when the cursor indicator is moved into the trigger region. The touch event locates outside the trigger region. According to a second aspect of embodiments of the present disclosure, a non-transitory computer-readable storage medium having stored therein instructions that, when executed by a processor of a smart device, causes the smart device to perform a single-hand operation method. The method includes displaying a plurality of icons on the scre...",
  "patent_number": "None",
  "abstract": "The present disclosure relates to a method and an apparatus for single-hand operation on a full screen of a smart device, which pertains to the field of computer technology. The method for single-hand operation on a full screen includes determining whether a single-hand operation mode is activated, displaying a cursor indicator on the screen of the smart device when the single-hand operation is activated, moving the cursor indicator based on a track generated by a sliding operation on the screen of the smart device, determining whether the cursor indicator is moved into a trigger region, and activating the trigger region to receive an instruction associated with a touch event on the screen when the cursor indicator is moved into the trigger region. The touch event locates outside the trigger region.",
  "publication_number": "US20170024105A1-20170126",
  "_processing_info": {
    "original_size": 56776,
    "optimized_size": 3646,
    "reduction_percent": 93.58
  }
}