{
  "decision": "PENDING",
  "application_number": "15067759",
  "date_published": "20160915",
  "date_produced": "20160831",
  "title": "METHOD, GRAPHICAL INTERFACE, AND MEDICAL APPARATUS FOR PLANNING A MEDICAL IMAGING EXAMINATION",
  "filing_date": "20160311",
  "inventor_list": [
    {
      "inventor_name_last": "Beckmann",
      "inventor_name_first": "Marc",
      "inventor_city": "Bubenreuth",
      "inventor_state": "",
      "inventor_country": "DE"
    },
    {
      "inventor_name_last": "Jaeger",
      "inventor_name_first": "Anja",
      "inventor_city": "Fuerth",
      "inventor_state": "",
      "inventor_country": "DE"
    },
    {
      "inventor_name_last": "Nufer",
      "inventor_name_first": "Stephan",
      "inventor_city": "Erlangen",
      "inventor_state": "",
      "inventor_country": "DE"
    },
    {
      "inventor_name_last": "Speckner",
      "inventor_name_first": "Thorsten",
      "inventor_city": "Erlangen",
      "inventor_state": "",
      "inventor_country": "DE"
    },
    {
      "inventor_name_last": "Thoene",
      "inventor_name_first": "Jens",
      "inventor_city": "Nuernberg",
      "inventor_state": "",
      "inventor_country": "DE"
    }
  ],
  "ipcr_labels": [
    "G06F30488",
    "G06F301",
    "G06F30484"
  ],
  "main_ipcr_label": "G06F30488",
  "summary": "<SOH> SUMMARY OF THE INVENTION <EOH>An object of the invention is to improve such planning of a medical imaging examination. The inventive method for planning a medical imaging examination of an examination subject by operation of a medical imaging apparatus includes the following steps. A planning environment for the planning of the medical imaging examination is provided on a touch display of a graphical interface. At least one imaging parameter for the medical imaging examination is specified by a manual input on the touch display. Information is provided on the touch display dependent on the manual input, the information being presented haptically on the touch display. The examination subject can be a patient, a volunteer for training the system, an animal or a phantom. The graphical interface unit is in particular a visualization unit and/or an output unit for the presentation and/or graphical output of information to a user, in particular a member of the medical operating staff (operator). Furthermore, the graphical interface unit can also be configured for the input of information, in particular for the specification of the at least one medical imaging parameter, by a medical operator. The graphical interface preferably is a graphical output unit, more specifically the touch display. Such a touch display makes it particularly simple to visualize information and to enter the at least one medical imaging parameter as an input. The touch display can in this case be directly arranged on the medical imaging apparatus so that there is no need for a medical operator to leave the examination room in which the medical imaging apparatus is situated for that purpose. In this situation the graphical interface unit is preferably arranged on a housing that encloses the scanner of the medical imaging apparatus. A touch display, also known as a touchscreen, is a touch-sensitive screen. When portions of the screen, in particular portions of an image displayed on the screen, a...",
  "patent_number": "None",
  "abstract": "In a method for planning a medical imaging examination, as well as a graphical interface and a medical imaging apparatus and a storage medium for implementing the method, a planning environment for the planning of the medical imaging examination is provided on a touch display of a graphical interface, at least one imaging parameter for the medical imaging examination is specified by a manual input on the touch display, and information is provided on the touch display in response to the manual input, the information being presented haptically on the touch display.",
  "publication_number": "US20160266760A1-20160915",
  "_processing_info": {
    "original_size": 111752,
    "optimized_size": 3753,
    "reduction_percent": 96.64
  }
}