{
  "date_produced": "20170405",
  "publication_number": "US20170109654A1-20170420",
  "main_ipcr_label": "G06N9900",
  "decision": "ACCEPTED",
  "application_number": "15065907",
  "inventor_list": [
    {
      "inventor_name_last": "CAFFREY",
      "inventor_name_first": "JAMES M.",
      "inventor_city": "WOODSTOCK",
      "inventor_state": "NY",
      "inventor_country": "US"
    }
  ],
  "abstract": "Embodiments include method, systems and computer program products for identifying unusual intervals in an information technology (IT) system. Aspects include training a log analysis system based on historical data for the IT system, the historical data including a plurality of intervals each having an interval anomaly score and receiving status messages from a plurality of pieces of IT equipment in the IT system. Aspects also include grouping the status messages into an interval and calculating an interval anomaly score for the interval and comparing the interval anomaly score with one or more priority level cutoffs created by the training and responsively generating an alert based on the comparison, wherein the alert indicates that the interval is unusual.",
  "filing_date": "20160310",
  "patent_number": "9772896",
  "summary": "<SOH> SUMMARY <EOH>In accordance with an embodiment, a method for identifying unusual intervals in an IT system is provided. The method includes training a log analysis system based on historical data for the IT system, the historical data including a plurality of intervals each having an interval anomaly score. The method also includes receiving, by the log analysis system, status messages from a plurality of pieces of IT equipment in the IT system and grouping the status messages into an interval and calculating an interval anomaly score for the interval. The method further includes comparing the interval anomaly score with one or more priority level cutoffs created by the training and responsively generating an alert based on the comparison, wherein the alert indicates that the interval is unusual. In accordance with another embodiment, a system for identifying unusual intervals in an IT system includes a processor in communication with one or more types of memory. The processor is configured to train a log analysis system based on historical data for the IT system, the historical data including a plurality of intervals each having an interval anomaly score and to receive status messages from a plurality of pieces of IT equipment in the IT system. The processor is also configured to group the status messages into an interval and calculating an interval anomaly score for the interval and to compare the interval anomaly score with one or more priority level cutoffs created by the training and responsively generating an alert based on the comparison, wherein the alert indicates that the interval is unusual. In accordance with a further embodiment, a computer program product for identifying unusual intervals in an IT system includes a non-transitory storage medium readable by a processing circuit and storing instructions for execution by the processing circuit for performing a method. The method includes training a log analysis system based on historical data for the...",
  "date_published": "20170420",
  "title": "IDENTIFYING INTERVALS OF UNUSUAL ACTIVITY IN INFORMATION TECHNOLOGY SYSTEMS",
  "ipcr_labels": [
    "G06N9900",
    "H04L1226",
    "G06F1730"
  ],
  "_processing_info": {
    "original_size": 35142,
    "optimized_size": 3364,
    "reduction_percent": 90.43
  }
}