{
  "date_produced": "20170823",
  "publication_number": "US20170255859A1-20170907",
  "main_ipcr_label": "G06N304",
  "decision": "PENDING",
  "application_number": "15062067",
  "inventor_list": [
    {
      "inventor_name_last": "TAN",
      "inventor_name_first": "Xuan",
      "inventor_city": "Sunnyvale",
      "inventor_state": "CA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "NEDOVIC",
      "inventor_name_first": "Nikola",
      "inventor_city": "San Jose",
      "inventor_state": "CA",
      "inventor_country": "US"
    }
  ],
  "abstract": "According to some embodiments, the present disclosure may relate to a method of neural network analysis that includes receiving a first electronic message, storing it in a storage device, and decoding it to output a first data structure. The first electronic message may reference a first dictionary entry correlating the first electronic message to the first data structure including more bits than the first message. The method may also include providing the first data structure to a processing element to perform a data structure analysis on the first data structure yielding a second data structure including more bits than the first electronic message. The method may also include matching the second data structure to a second dictionary entry correlating the second data structure to a second electronic message that includes fewer bits than the second data structure, and transmitting the second electronic message instead of the second data structure.",
  "filing_date": "20160305",
  "patent_number": "None",
  "summary": "<SOH> SUMMARY <EOH>One or more embodiments of the present disclosure may include a method of neural network analysis that includes receiving a first electronic message and storing the first electronic message in a storage device. The method also may include decoding the first electronic message to output a first data structure where the first electronic message references a first dictionary entry that correlates the first electronic message to the first data structure that includes more bits than the first electronic message. The method may also include providing the first data structure to a processing element to perform a data structure analysis in the neural network on the first data structure that may yield a second data structure that includes more bits than the first electronic message. The method may also include matching the second data structure to a second dictionary entry that correlates the second data structure to a second electronic message that includes fewer bits than the second data structure. The method may also include transmitting the second electronic message instead of the more complex second data structure. The method may additionally include testing performance of a second dictionary that includes the second dictionary entry, and, based on the test of the second dictionary, adjusting the size of the second dictionary. The object and advantages of the embodiments will be realized and achieved at least by the elements, features, and combinations particularly pointed out in the claims. Both the foregoing general description and the following detailed description provide examples and are explanatory and are not restrictive.",
  "date_published": "20170907",
  "title": "NEURAL NETWORK ANALYSIS",
  "ipcr_labels": [
    "G06N304"
  ],
  "_processing_info": {
    "original_size": 58076,
    "optimized_size": 3283,
    "reduction_percent": 94.35
  }
}