{
  "date_produced": "20170830",
  "publication_number": "US20170262763A1-20170914",
  "main_ipcr_label": "G06N700",
  "decision": "PENDING",
  "application_number": "15068613",
  "inventor_list": [
    {
      "inventor_name_last": "Smith",
      "inventor_name_first": "Robert Stewart",
      "inventor_city": "Calgary",
      "inventor_state": "",
      "inventor_country": "CA"
    }
  ],
  "abstract": "A method and system for anticipating the actions of individuals and the occurrence of natural events are disclosed. The anticipatory information system (AIS) stores information using specific and unique methods and applies unique methods to evaluate and identify the upcoming actions of individuals or the upcoming occurrence of natural events based on unique analysis methods applied to existing action and event information, previous action and event stored information, information about nearby and influential actions and the application of a method for determining and ranking the likelihood of an actions occurrence and options for mitigating the resulting effect of such actions.",
  "filing_date": "20160313",
  "patent_number": "None",
  "summary": "<SOH> SUMMARY <EOH>Various embodiments of a method and system for anticipatory action and event identification are disclosed. According to one embodiment, a method may include one or more actions or events or the combination of actions or events into a single action or event whereby an action or event is identified as an elemental combination of flow information including, but not limited to, an entity, agreements, measures and valuations, nodes, waypoints, inventories, velocity, directionality, trajectory, speed, distance, probability of occurrence, variance, georelational indication, categories, relationships, affect, relevance, relevance correlation, time, spatial indication and versioning. The method may further include completely specifying the next actions or events of an entity including, but not limited to, changes to entities, agreements, measures and valuations, nodes, waypoints, inventories, velocities, directionality, trajectory, speeds, distances, probability of occurrence, variances, georelational indications, categories, relationships, affects, relevance, relevance correlations, time, spatial indications and versions. According to another embodiment, a method may include determining the status of an action or event as measured by, but not limited to, entities, agreements, measures and valuations, nodes, waypoints, velocities, directionality, trajectory, speeds, distances, probability of occurrence, variances, georelational indications, categories, relationships, affects, relevance, relevance correlations, time, spatial indications and versions and any variance to expected actions or events. The method may further include using variance information to determine the next available actions or events of the entity and probability of occurrence and level of risk. A system is further contemplated that in one embodiment is a computer system configured to identify one or more series of anticipated actions or events, their probability of occurrence and the lev...",
  "date_published": "20170914",
  "title": "System for anticipating the actions of biological and natural entities",
  "ipcr_labels": [
    "G06N700",
    "G06F1730"
  ],
  "_processing_info": {
    "original_size": 73761,
    "optimized_size": 3260,
    "reduction_percent": 95.58
  }
}