{
  "decision": "PENDING",
  "application_number": "15064525",
  "date_published": "20170914",
  "date_produced": "20170830",
  "title": "ELASTIC RULE ENGINE FOR A SMART HOME",
  "filing_date": "20160308",
  "inventor_list": [
    {
      "inventor_name_last": "Li",
      "inventor_name_first": "Zhiyun",
      "inventor_city": "Mountain View",
      "inventor_state": "CA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Zheng",
      "inventor_name_first": "Pei",
      "inventor_city": "Mountain View",
      "inventor_state": "CA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Wang",
      "inventor_name_first": "Qia",
      "inventor_city": "Mountain View",
      "inventor_state": "CA",
      "inventor_country": "US"
    }
  ],
  "ipcr_labels": [
    "G05B19042",
    "H04L1228",
    "G06N502"
  ],
  "main_ipcr_label": "G05B19042",
  "summary": "<SOH> SUMMARY <EOH>This disclosure provides an elastic rule engine for a smart home. In a first embodiment, this disclosure provides an apparatus including a communications unit and at least one processor. The communications unit is configured to communicate with a client device in the system. The at least one processor is coupled to the communications unit. The at least one processor configured to monitor a rule in the system. The rule controls the client device. The at least one processor is also configured to, responsive to the rule for the client device being triggered, determine whether an anomaly exists in the system. The at least one processor is also configured to, response to the anomaly existing, determine whether an override action is available for the anomaly. The at least one processor is also configured to, responsive to the override action being available, override the rule. In a second embodiment, this disclosure provides a method for managing a smart home system. The method includes monitoring a rule in the smart home system. The rule controls the client device. The method also includes, responsive to the rule for the client device being triggered, determining whether an anomaly exists in the system. The method also includes, response to the anomaly existing, determining whether an override action is available for the anomaly. The method also includes, responsive to the override action being available, overriding the rule. Other technical features may be readily apparent to one skilled in the art from the following figures, descriptions, and claims. Before undertaking the DETAILED DESCRIPTION below, it may be advantageous to set forth definitions of certain words and phrases used throughout this patent document. The term “couple” and its derivatives refer to any direct or indirect communication between two or more elements, whether or not those elements are in physical contact with one another. The terms “transmit,” “receive,” and “communicate,” as ...",
  "patent_number": "None",
  "abstract": "An embodiment of this disclosure provides an apparatus including a communications unit and at least one processor. The communications unit is configured to communicate with a client device in the system. The at least one processor is coupled to the communications unit. The at least one processor configured to monitor a rule in the system. The rule controls the client device. The at least one processor is also configured to, responsive to the rule for the client device being triggered, determine whether an anomaly exists in the system. The at least one processor is also configured to, response to the anomaly existing, determine whether an override action is available for the anomaly. The at least one processor is also configured to, responsive to the override action being available, override the rule.",
  "publication_number": "US20170261954A1-20170914",
  "_processing_info": {
    "original_size": 46318,
    "optimized_size": 3696,
    "reduction_percent": 92.02
  }
}