{
  "decision": "PENDING",
  "application_number": "15063521",
  "date_published": "20170608",
  "date_produced": "20170524",
  "title": "MODULARIZED AUTOMATED-APPLICATION-RELEASE-MANAGEMENT SUBSYSTEM",
  "filing_date": "20160308",
  "inventor_list": [
    {
      "inventor_name_last": "KHAZANCHI",
      "inventor_name_first": "RAJESH",
      "inventor_city": "San Jose",
      "inventor_state": "CA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "SINGH",
      "inventor_name_first": "SERVESH",
      "inventor_city": "Bangalore",
      "inventor_state": "",
      "inventor_country": "IN"
    },
    {
      "inventor_name_last": "SINGH",
      "inventor_name_first": "KIRAN",
      "inventor_city": "Bangalore",
      "inventor_state": "",
      "inventor_country": "IN"
    },
    {
      "inventor_name_last": "SARAF",
      "inventor_name_first": "RISHI",
      "inventor_city": "Bangalore",
      "inventor_state": "",
      "inventor_country": "IN"
    },
    {
      "inventor_name_last": "GOVINDARAJU",
      "inventor_name_first": "AGILA",
      "inventor_city": "Bangalore",
      "inventor_state": "",
      "inventor_country": "IN"
    }
  ],
  "ipcr_labels": [
    "G06F948",
    "H04L2908",
    "H04L2906"
  ],
  "main_ipcr_label": "G06F948",
  "summary": "<SOH> SUMMARY <EOH>The current document is directed to an automated-application-release-management subsystem, or facility, that organizes and manages the application-development and application-release processes to allow for continuous application development and release. The current document is particularly directed to implementations in which the automated application-release-management subsystem is highly modularized to provide plug-in compatibility with a large variety of external, third-party subsystems, libraries, and functionalities. This highly plug-in-compatible architecture provides for decreasing dependencies on various subsystems and components of a workflow-based cloud-management system in which the plug-compatible automated application-release-management subsystem is incorporated.",
  "patent_number": "None",
  "abstract": "The current document is directed to an automated-application-release-management subsystem, or facility, that organizes and manages the application-development and application-release processes to allow for continuous application development and release. The current document is particularly directed to implementations in which the automated application-release-management subsystem is highly modularized to provide plug-in compatibility with a large variety of external, third-party subsystems, libraries, and functionalities. This highly plug-in-compatible architecture provides for decreasing dependencies on various subsystems and components of a workflow-based cloud-management system in which the plug-compatible automated application-release-management subsystem is incorporated.",
  "publication_number": "US20170161101A1-20170608",
  "_processing_info": {
    "original_size": 120126,
    "optimized_size": 2745,
    "reduction_percent": 97.71
  }
}