{
  "decision": "PENDING",
  "application_number": "15068947",
  "date_published": "20170914",
  "date_produced": "20170830",
  "title": "METHOD AND APPARATUS FOR PROVIDING A MULTI-PANE GRAPHICAL DISPLAY WITH INFORMATION ASSOCIATED WITH A CASE DATA STRUCTURE",
  "filing_date": "20160314",
  "inventor_list": [
    {
      "inventor_name_last": "Farrell",
      "inventor_name_first": "David Sean",
      "inventor_city": "Lisle",
      "inventor_state": "IL",
      "inventor_country": "US"
    }
  ],
  "ipcr_labels": [
    "G06F30484",
    "G06F30482",
    "G06F1730",
    "G06F30488",
    "H04L2908"
  ],
  "main_ipcr_label": "G06F30484",
  "summary": "<SOH> BRIEF DESCRIPTION OF THE DISCLOSURE <EOH>The approaches described herein provide for methods and apparatuses for providing a multi-pane graphical display with information associated with a case data structure. In many of these embodiments, an apparatus includes a network interface with an input and an output. The apparatus also includes a display device which may be comprised of a touch-sensitive user interface. The apparatus also includes a processor coupled to the network interface and the display device. The processor is configured to display at the display device a first content pane, a second content pane, and a third content pane. This allows a user to evaluate the plurality of content panes in order to identify a course of action associated with the abnormality detected in the industrial machine or system. The first content pane comprises a case report received at the input of the network interface. The case report representing characteristics of a case associated with an abnormality detected in an industrial machine or system. The second content pane comprises a user input interface configured to receive a user input. In some approaches, the user input is a free-form text entry. In other approaches, the user input is an audio entry. In still other approaches, the user input is a video entry. In other approaches, the user input is selected from a predefined list of user inputs. The processor is configured to transmit the user input to a central computing device at a central location. The third content pane comprises a response to the user input. The response is received at the input of the network interface. In some approaches, the processor is configured to display at the display device fourth content pane. The fourth content pane comprises a timeline. The timeline is received at the input of the network interface. In some approaches, the plurality of content panes are defined by a display width and a display height. At least one of the display width a...",
  "patent_number": "None",
  "abstract": "Approaches are provided for an apparatus having an interface with an input and an output. The apparatus also includes a display device having a touch-sensitive user interface. The apparatus also includes a processor coupled to the interface and the display device. The processor is configured to display at the display device a first content pane, a second content pane, and a third content pane. The first content pane includes a case report received at the input of the interface. The case report represents characteristics of a case associated with an abnormality detected in an industrial machine or system. The second content pane includes a user input interface configured to receive a user input. The third content pane includes a response to the user input. The response is received at the input of the interface.",
  "publication_number": "US20170262160A1-20170914",
  "_processing_info": {
    "original_size": 43280,
    "optimized_size": 3485,
    "reduction_percent": 91.95
  }
}