{
  "decision": "ACCEPTED",
  "application_number": "15069090",
  "date_published": "20160922",
  "date_produced": "20160908",
  "title": "INFORMATION PROCESSING APPARATUS AND STORAGE MEDIUM",
  "filing_date": "20160314",
  "inventor_list": [
    {
      "inventor_name_last": "NAGASAWA",
      "inventor_name_first": "Yuichi",
      "inventor_city": "Kanagawa",
      "inventor_state": "",
      "inventor_country": "JP"
    }
  ],
  "ipcr_labels": [
    "H04N100",
    "G06K903",
    "G06K900"
  ],
  "main_ipcr_label": "H04N100",
  "summary": "<SOH> SUMMARY OF THE INVENTION <EOH>In an embodiment of the present invention, an information processing apparatus is provided. The information processing apparatus includes a plurality of human body detecting sensors that detect presence of a user, in which each of the human body detecting sensors has a detection area for detecting the presence of the user; an operation part that receives an operation by the user; and an erroneous detection determination part that determines an erroneous detection if the operation part does not receive the operation by the user within a predetermined time after one of the human body detecting sensors detects the presence of the user. If a number of erroneous detections of the one of the human body detecting sensors is equal to or more than a first threshold, the erroneous detection determination part sends an instruction to reduce the detection area to the one of the human body detecting sensors and sends an instruction to increase the detection area to another one of the human body detecting sensors.",
  "patent_number": "9832325",
  "abstract": "An information processing apparatus includes a plurality of human body detecting sensors that detect a user, each of the human body detecting sensors having a detection area for detecting the presence of the user; an operation part that receives an operation by the user; and an erroneous detection determination part that determines an erroneous detection if the operation part does not receive the operation by the user within a predetermined time after one of the human body detecting sensors detects the presence of the user. If a number of erroneous detections of the one of the human body detecting sensors is equal to or more than a first threshold, the erroneous detection determination part sends an instruction to reduce the detection area to the one of the human body detecting sensors and sends an instruction to increase the detection area to another one of the human body detecting sensors.",
  "publication_number": "US20160277599A1-20160922",
  "_processing_info": {
    "original_size": 44260,
    "optimized_size": 2517,
    "reduction_percent": 94.31
  }
}