{
  "date_produced": "20170802",
  "publication_number": "US20170236060A1-20170817",
  "main_ipcr_label": "G06N502",
  "decision": "PENDING",
  "application_number": "15071063",
  "inventor_list": [
    {
      "inventor_name_last": "IGNATYEV",
      "inventor_name_first": "OLEKSIY",
      "inventor_city": "BELMONT",
      "inventor_state": "CA",
      "inventor_country": "US"
    }
  ],
  "abstract": "Systems, apparatuses, and methods for the automated detection of incorrect data during a data entry process or detecting incorrect data that has been entered and stored previously. In one embodiment, the invention utilizes one or more of statistical analysis or a machine learning technique (either supervised or unsupervised) in order to identify potentially incorrect data.",
  "filing_date": "20160315",
  "patent_number": "None",
  "summary": "<SOH> SUMMARY <EOH>The terms “invention,” “the invention,” “this invention” and “the present invention” as used herein are intended to refer broadly to all of the subject matter described in this document and to the claims. Statements containing these terms should be understood not to limit the subject matter described herein or to limit the meaning or scope of the claims. Embodiments of the invention covered by this patent are defined by the claims and not by this summary. This summary is a high-level overview of various aspects of the invention and introduces some of the concepts that are further described in the Detailed Description section below. This summary is not intended to identify key, essential, or required features of the claimed subject matter, nor is it intended to be used in isolation to determine the scope of the claimed subject matter. The subject matter should be understood by reference to appropriate portions of the entire specification of this patent, to any or all drawings, and to each claim. Embodiments of the invention are directed to systems, apparatuses, and methods for the automated detection of incorrect data during a data entry process or detecting incorrect data that has been entered and stored previously. In one embodiment, the invention utilizes one or more of statistical analysis or a machine learning technique (either supervised or unsupervised) in order to identify potentially incorrect data. This may involve one or more of determining “patterns” of data entry that indicate a strong correlation between two items of data, learning a relationship between two pieces of data that suggest the pieces typically are entered together, identifying potential values of data that are “outliers”, etc. Depending on values for one or more thresholds or limits (such as how “close” the data value is to historical and known correct data), the likelihood that a piece of data being evaluated is incorrect is determined. If this likelihood is above some t...",
  "date_published": "20170817",
  "title": "System and Method for Automated Detection of Incorrect Data",
  "ipcr_labels": [
    "G06N502",
    "G06F1730"
  ],
  "_processing_info": {
    "original_size": 120258,
    "optimized_size": 3006,
    "reduction_percent": 97.5
  }
}