{
  "date_produced": "20170915",
  "publication_number": "US20170278011A1-20170928",
  "main_ipcr_label": "G06N9900",
  "decision": "PENDING",
  "application_number": "15077303",
  "inventor_list": [
    {
      "inventor_name_last": "Castelli",
      "inventor_name_first": "Vittorio",
      "inventor_city": "Croton on Hudson",
      "inventor_state": "NY",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Florian",
      "inventor_name_first": "Radu",
      "inventor_city": "Danbury",
      "inventor_state": "CT",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Moon",
      "inventor_name_first": "Taesun",
      "inventor_city": "Scarsdale",
      "inventor_state": "NY",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Sil",
      "inventor_name_first": "Avirup",
      "inventor_city": "Ossining",
      "inventor_state": "NY",
      "inventor_country": "US"
    }
  ],
  "abstract": "A method and system are provided for combining models. The method includes forming, by a computer having a processor and a memory, model pairs from a model ensemble that includes a plurality of models. The method further includes comparing the model pairs based on sets of output results produced by the model pairs to provide comparison results. The method also includes constructing, by the computer, a combination model from at least one of the model pairs based on the comparison results. The comparing step is performed using user-generated set-based feedback.",
  "filing_date": "20160322",
  "patent_number": "None",
  "summary": "<SOH> SUMMARY <EOH>According to an aspect of the present principles, a method is provided for combining models. The method includes forming, by a computer having a processor and a memory, model pairs from a model ensemble that includes a plurality of models. The method further includes comparing the model pairs based on sets of output results produced by the model pairs to provide comparison results. The method also includes constructing, by the computer, a combination model from at least one of the model pairs based on the comparison results. The comparing step is performed using user-generated set-based feedback. According to another aspect of the present principles, a non-transitory computer readable storage medium is provided. The non-transitory computer readable storage medium includes a computer readable program for combining models. The computer readable program when executed on a computer causes the computer to perform steps of a method. The method includes forming model pairs from a model ensemble that includes a plurality of models. The method further includes constructing a combination model from at least one of the model pairs based on comparison results. The comparison results are obtained by comparing the model pairs based on sets of output results produced by the model pairs using user-generated set-based feedback. According to yet another aspect of the present principles, a system is provided. The system includes a computer, having a processor and a memory. The computer is configured to form model pairs from a model ensemble that includes a plurality of models. The computer is further configured to construct a combination model from at least one of the model pairs based on comparison results. The comparison results are obtained by comparing the model pairs based on sets of output results produced by the model pairs using user-generated set-based feedback. These and other features and advantages will become apparent from the following detailed descrip...",
  "date_published": "20170928",
  "title": "SEARCH, QUESTION ANSWERING, AND CLASSIFIER CONSTRUCTION",
  "ipcr_labels": [
    "G06N9900",
    "G06N504",
    "G06F1730"
  ],
  "_processing_info": {
    "original_size": 55856,
    "optimized_size": 3577,
    "reduction_percent": 93.6
  }
}