{
  "date_produced": "20160628",
  "publication_number": "US20160203418A1-20160714",
  "main_ipcr_label": "G06N9900",
  "decision": "PENDING",
  "application_number": "15079712",
  "inventor_list": [
    {
      "inventor_name_last": "Comerford",
      "inventor_name_first": "Liam D.",
      "inventor_city": "Carmel",
      "inventor_state": "NY",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Viswanathan",
      "inventor_name_first": "Mahesh",
      "inventor_city": "Yorktown Heights",
      "inventor_state": "NY",
      "inventor_country": "US"
    }
  ],
  "abstract": "A method and system for teaching an object of a deictic reference to a machine. A processor of the machine teaches the object of the deictic reference to the machine which results in the machine learning the object. The teaching includes: the processor finds an item in a region indicated by a physical pointing gesture, by the user, that points to the object; the processor shines a laser light on the item and in response, the processor receives a negative spoken indication from the user that the item shined on by the laser light is not the object; in response to the negative spoken indication from the user, the processor interacts with the user in an iterative procedure wherein the machine learns the object in a final iteration of the procedure. The processor stores the learned object in a storage repository.",
  "filing_date": "20160324",
  "patent_number": "None",
  "summary": "<SOH> SUMMARY OF THE INVENTION <EOH>The present invention resides in a machine, system and method for user-guided teaching of a deictic reference and an object of a deictic reference to a conversational command and control system installed in a vehicle or machine, in accordance with an embodiment of the invention. In an embodiment, the deictic reference tool further includes a verification module for confirming understanding of the one or more objects of the deictic reference learned from the user in order to detect and correct any errors pertaining to the one or more objects of the deictic reference learned, wherein the confirming understanding of the one or more objects of the deictic reference learned includes one or more of: displaying the object of the deictic reference utilizing a graphical user interface for permitting correction by spoken or graphical or deictic interactions, utilizing a laser scanner subsystem to outline or paint the object of the deictic reference and utilizing a computer-driven manipulator to point the object of the deictic reference. In an embodiment, the deictic reference module observes the physical pointing gesture via one or more image capturing devices coupled to the computer system and decodes the one or more objects of the deictic reference utilizing the conversational system. The deictic reference tool further includes a decoder module for decoding the physical pointing gesture to locate a reference region and an object recognition module for determining whether or not a object is a correct object that the physical pointing gesture points to. In an embodiment, the conversational system further includes a speech recognition module for decoding any spoken utterances received from a user using a respective spoken user interface of the one or more respective machine subsystems coupled to the data and control bus, a gesture recognition module for decoding indications received via a respective physical user interface of the one or more...",
  "date_published": "20160714",
  "title": "USER-GUIDED TEACHING AN OBJECT OF A DEICTIC REFERENCE TO A MACHINE",
  "ipcr_labels": [
    "G06N9900",
    "G10L1304",
    "G10L1722"
  ],
  "_processing_info": {
    "original_size": 75736,
    "optimized_size": 3560,
    "reduction_percent": 95.3
  }
}