{
  "decision": "PENDING",
  "application_number": "15071009",
  "date_published": "20160707",
  "date_produced": "20160622",
  "title": "METHOD TO INPUT CONTENT IN A STRUCTURED MANNER WITH REAL-TIME ASSISTANCE AND VALIDATION",
  "filing_date": "20160315",
  "inventor_list": [
    {
      "inventor_name_last": "Chen",
      "inventor_name_first": "Kai",
      "inventor_city": "Shanghai",
      "inventor_state": "",
      "inventor_country": "CN"
    },
    {
      "inventor_name_last": "Chen",
      "inventor_name_first": "Ping",
      "inventor_city": "Shanghai",
      "inventor_state": "",
      "inventor_country": "CN"
    },
    {
      "inventor_name_last": "Dutch",
      "inventor_name_first": "Michael John",
      "inventor_city": "Saratoga",
      "inventor_state": "CA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Chen",
      "inventor_name_first": "Bo",
      "inventor_city": "Shanghai",
      "inventor_state": "",
      "inventor_country": "CN"
    },
    {
      "inventor_name_last": "Claudatos",
      "inventor_name_first": "Christopher Hercules",
      "inventor_city": "San Jose",
      "inventor_state": "CA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Shao",
      "inventor_name_first": "Feng",
      "inventor_city": "Suzhou",
      "inventor_state": "",
      "inventor_country": "CN"
    }
  ],
  "ipcr_labels": [
    "G06F1727",
    "G06F30481",
    "G06F30484",
    "G06F1721",
    "G06F1724"
  ],
  "main_ipcr_label": "G06F1727",
  "summary": "<SOH> BRIEF DESCRIPTION OF THE DRAWINGS <EOH>Various embodiments of the invention are disclosed in the following detailed description and the accompanying drawings. FIG. 1 is a flowchart illustrating an embodiment of a process for providing real-time guidance associated with an active input in a user-defined, structured input and a context-sensitive rule. FIG. 2 is a diagram showing various embodiments of an active input. FIG. 3 is a diagram showing various embodiments for determining a context-sensitive rule. FIG. 4 is a diagram showing various embodiments for providing guidance in real time. FIG. 5 is a diagram showing an embodiment of a user interface which is configured to display, in real time, content assistance associated with a column. FIG. 6 is a diagram showing an embodiment of a user interface which is configured to display, in real time, content assistance associated with an operator. FIG. 7 is a diagram showing an embodiment of a user interface which is configured to display, in real-time, format assistance associated with a value. FIG. 8 is a diagram showing an embodiment of a user interface which is configured to display, in real-time, format validation associated with a value. FIG. 9 is a diagram showing an embodiment of a user interface which is configured to display, in real-time, content assistance associated with an operator associated with concatenating triplets. FIG. 10 is a diagram showing an embodiment of a user interface which is configured to display, in real-time, format validation associated with an operator associated with concatenating triplets. FIG. 11 is a diagram showing an embodiment of a user interface which is configured to display, in real-time, content validation associated with a column. FIG. 12 is a diagram illustrating an embodiment of a context-sensitive rule which includes a bitmap. FIG. 13A is a flowchart illustrating an embodiment of a first portion of a process for setting a permitted values bit and a permitted format bi...",
  "patent_number": "None",
  "abstract": "A user-defined, structured input which identifies a column in a database and includes an active input associated with the column is received via a UI. A format-related, context-sensitive rule which applies to the active input is determined including by determining an expected format for the active input based at least in part on the format of the column in the database. Guidance associated with satisfying the rule is provided in real time via the UI. This includes displaying format assistance associated with the rule (by identifying the expected format and/or automatically configuring the UI so that the active input has a format which matches the expected format) and/or displaying format validation associated with the rule, including by indicating whether the format of the active input matches the expected format.",
  "publication_number": "US20160196256A1-20160707",
  "_processing_info": {
    "original_size": 69458,
    "optimized_size": 4175,
    "reduction_percent": 93.99
  }
}