{
  "decision": "PENDING",
  "application_number": "15077889",
  "date_published": "20160714",
  "date_produced": "20160628",
  "title": "DEVICES AND METHODS FOR INFORMATION PROCESSING AND ACCESS CONTROL",
  "filing_date": "20160322",
  "inventor_list": [
    {
      "inventor_name_last": "Teshima",
      "inventor_name_first": "Taro",
      "inventor_city": "Tokyo",
      "inventor_state": "",
      "inventor_country": "JP"
    }
  ],
  "ipcr_labels": [
    "G06Q3004",
    "G06Q1010",
    "H04L1258",
    "G06Q2010"
  ],
  "main_ipcr_label": "G06Q3004",
  "summary": "<SOH> SUMMARY <EOH>According to one aspect, there is provided an information processing apparatus including: a first storage unit that is configured to store user information associating, for each individual user, user identification information identifying said each individual user with at least one unique information piece; a generation unit that is configured to generate a code for said each individual user using the at least one unique information piece and the user identification information, which are stored in the first storage unit, according to a predetermined rule; a second storage unit that is configured to store business document information including the user identification information of a first user included in the user information stored in the first storage unit; and a processing unit that is configured to determine, upon receiving an access request for accessing the business document information from a second user whose user information is stored in the first storage unit, whether a first code of the first user matches a second code of the second user, and granting, when the first code and the second code match, the second user access rights to access business document information generated by the first user and stored in the second storage unit.",
  "patent_number": "None",
  "abstract": "A user information storage unit stores user information associating, for each user, an electronic mail address and at least one location information piece of the user with each other. A registration unit generates a code for each user using the location information and electronic mail address according to a predetermined rule. An invoice information storage unit stores invoice information including the electronic mail address of a first user included in the user information. When receiving an access request for accessing invoice information from a second user whose user information is stored in the user information storage unit, the registration unit determines whether the first code of the first user matches the second code of the second user, and if the first and second codes match, grants the second user access rights to access invoice information generated by the first user and stored in the invoice information storage unit.",
  "publication_number": "US20160203531A1-20160714",
  "_processing_info": {
    "original_size": 82719,
    "optimized_size": 2808,
    "reduction_percent": 96.61
  }
}