{
  "decision": "ACCEPTED",
  "application_number": "15075676",
  "date_published": "20160714",
  "date_produced": "20160628",
  "title": "Background Enrollment and Authentication of a User",
  "filing_date": "20160321",
  "inventor_list": [
    {
      "inventor_name_last": "Boshra",
      "inventor_name_first": "Michael",
      "inventor_city": "Melbourne",
      "inventor_state": "FL",
      "inventor_country": "US"
    }
  ],
  "ipcr_labels": [
    "G06F2132",
    "G06F1730"
  ],
  "main_ipcr_label": "G06F2132",
  "summary": "<SOH> SUMMARY <EOH>Embodiments described herein acquire biometric images in the background as a user interacts naturally with an electronic device. Authentication of the user can also be done in the background using a newly captured biometric image and a previously captured biometric data that is tagged with user identification data (UID) such as a password or pin. A biometric sensing device can be operatively connected to a processing device in an electronic device, such as a processing device in a laptop computer, a tablet computing device, and a smart telephone. In some embodiments, the biometric sensing device can be positioned at a location that a user's physical or behavioral trait is naturally detectable, in contact with, or in close proximity to as the user interacts with the electronic device. A method for authenticating a user can include capturing at a first time a first biometric image when the user interacts with the electronic device and tagging the first biometric image with a UID that is associated with the user. The UID can be a pin or a password that the user entered within a given time period around the time the first biometric image is captured. Subsequently, a second biometric image can be captured and a determination made as to whether the second biometric image matches the first biometric image tagged with the first UID. The user can be given access to the electronic device and/or to an application being accessed on the electronic device when the second biometric image matches the tagged first biometric image. The application can be an application, a website, an account, and the like that requires the user to enter the UID for access. In another aspect, a method for authenticating multiple users of an electronic device that includes a biometric sensing device can include capturing a first biometric image when a first user interacts with the electronic device and tagging the first biometric image with a first UID that is associated with the fir...",
  "patent_number": "9928355",
  "abstract": "An electronic device can include a processing device operatively connected to a biometric sensing device. The biometric sensing device may capture a biometric image each time a user interacts with the electronic device. When the user enters user identification data (UID) and a biometric image was recently captured, the biometric image is tagged with the UID. The user can access the electronic device and/or an application being accessed on the electronic device when a subsequently captured biometric image matches a tagged biometric image or an untagged biometric image that is assigned to a cluster that includes a tagged biometric image.",
  "publication_number": "US20160203306A1-20160714",
  "_processing_info": {
    "original_size": 60617,
    "optimized_size": 3201,
    "reduction_percent": 94.72
  }
}