{
  "decision": "PENDING",
  "application_number": "15078044",
  "date_published": "20160929",
  "date_produced": "20160914",
  "title": "PLAYBACK OF STREAMED MEDIA CONTENT",
  "filing_date": "20160323",
  "inventor_list": [
    {
      "inventor_name_last": "Whitman",
      "inventor_name_first": "Brian",
      "inventor_city": "Brooklyn",
      "inventor_state": "NY",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Ogle",
      "inventor_name_first": "Matthew S.",
      "inventor_city": "New York",
      "inventor_state": "NY",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Rodger",
      "inventor_name_first": "David P.",
      "inventor_city": "Arlington",
      "inventor_state": "MA",
      "inventor_country": "US"
    }
  ],
  "ipcr_labels": [
    "H04L2906",
    "G06F30482",
    "G06F1730",
    "G06F316"
  ],
  "main_ipcr_label": "H04L2906",
  "summary": "<SOH> SUMMARY <EOH>It is in view of the above considerations and others that the various embodiments disclosed herein have been made. There is a need for a solution that allows for an improved user experience when consuming media, e.g. in the form of streamed media. Advantageously, such a solution would also enable a more personalized user experience when consuming media. Also, it would be advantageous if such a solution requires less user interaction. Accordingly, it is a general object of the embodiments of the present technology to allow for an improved user experience when consuming media content. In a first aspect, the technology disclosed herein concerns a system for playback of streamed media content. The system comprises an electronic device including a first processing circuit, a first communication circuit, a first memory, and a user interface. Also, the system comprises a computer server system including a second processing circuit, a second communication circuit, and a second memory storing at least one data message that is to be operated on. Each one of the at least one data message includes (a) a subscriber identity parameter associated with said electronic device, and (b) information related to previously played media content associated with the subscriber identity parameter. The computer server system is configured to: retrieve the stored at least one data message from the second memory to determine (a) the subscriber identity parameter associated with said electronic device, and (b) the information related to previously played media content associated with the subscriber identity parameter; create at least one proposed media playlist based on (a) the subscriber identity parameter associated with said electronic device as well as the (b) information related to previously played media associated with the subscriber identity parameter; generate a media data message including said at least one proposed media playlist; and communicate a signal including ...",
  "patent_number": "None",
  "abstract": "The present disclosure generally relates to the providing of media content, e.g. audio content in the form of music. More particularly, the present disclosure relates to systems, methods, computer server systems and electronic devices for playback of streamed media content. A visual array of one or several media options that correspond to one or more proposed media playlists can be provided at the user interface of the electronic devices. This makes it possible to facilitate the browsing, and thus the selection, of media content. The one or more proposed media playlists are based on previously played media and, accordingly, the proposed media playlists become personalized to fit the taste of the user of the electronic device.",
  "publication_number": "US20160285937A1-20160929",
  "_processing_info": {
    "original_size": 68209,
    "optimized_size": 3592,
    "reduction_percent": 94.73
  }
}