{
  "date_produced": "20170906",
  "publication_number": "US20170270425A1-20170921",
  "main_ipcr_label": "G06N9900",
  "decision": "ACCEPTED",
  "application_number": "15071037",
  "inventor_list": [
    {
      "inventor_name_last": "Danson",
      "inventor_name_first": "Christopher",
      "inventor_city": "Austin",
      "inventor_state": "TX",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "BROWN",
      "inventor_name_first": "Douglas",
      "inventor_city": "Austin",
      "inventor_state": "TX",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "WARFORD",
      "inventor_name_first": "Roger",
      "inventor_city": "Hoschton",
      "inventor_state": "GA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "TRABA",
      "inventor_name_first": "Andrew",
      "inventor_city": "Chicago",
      "inventor_state": "IL",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "HELLER",
      "inventor_name_first": "Jordana",
      "inventor_city": "Chicago",
      "inventor_state": "IL",
      "inventor_country": "US"
    }
  ],
  "abstract": "Methods, apparatus, and systems for analyzing data trends are described herein. The present disclosure includes the identification of trending terms in data through the use of an unsupervised algorithm. Trends are identified and counted during a first and second time period. The frequency and co-occurrence of groups of terms is compared to determine a set of trending terms without reference to a library of pre-defined terms. The set of trending terms is displayed to a user.",
  "filing_date": "20160315",
  "patent_number": "9760838",
  "summary": "<SOH> SUMMARY <EOH>The present disclosure describes methods and systems that analyze data relationships. The disclosure relates to a system for analyzing data relating to trends that includes a processor; an analysis module, wherein the analysis module is a non-transitory computer readable medium operably connected to the processor, wherein the non-transitory computer readable medium includes a plurality of instructions stored in association therewith that are accessible to, and executable by, the processor, wherein the plurality of instructions when executed: analyze a first plurality of communications occurring over a first time period based on voice data and non-voice data; determine a first plurality of terms based on the analyzed first plurality of communications; analyze a second plurality of communications occurring over a second time period based on voice, data and non-voice data; determine a second plurality of terms based on the analyzed second plurality of communications; compare the terms of the first plurality of terms and the second plurality of terms based on one or more factors including a frequency of the terms in each of the first and second time periods; identify a set of trending terms based on the comparison of the terms without reference to a library of pre-defined terms; and communicate the identified set of trending terms to be displayed to a user; and a display device configured to display the identified set of trending terms to a user. In one embodiment, the first time period and the second time period have fixed lengths that are equal. In another embodiment, the first time period and the second time period are sequential and do not overlap. In another embodiment, communicating the set of trending terms further includes instructions that, when executed, transmit the set of trending terms to a communication distributor. In a further embodiment, the instruction to identify the set of trending terms further includes establishing a frequency th...",
  "date_published": "20170921",
  "title": "TREND IDENTIFICATION AND BEHAVIORAL ANALYTICS SYSTEM AND METHODS",
  "ipcr_labels": [
    "G06N9900",
    "G06N504"
  ],
  "_processing_info": {
    "original_size": 96288,
    "optimized_size": 3630,
    "reduction_percent": 96.23
  }
}