{
  "date_produced": "20160628",
  "publication_number": "US20160203412A1-20160714",
  "main_ipcr_label": "G06N700",
  "decision": "PENDING",
  "application_number": "15076884",
  "inventor_list": [
    {
      "inventor_name_last": "Merdivan",
      "inventor_name_first": "Erinc",
      "inventor_city": "Dublin",
      "inventor_state": "",
      "inventor_country": "IE"
    },
    {
      "inventor_name_last": "Riendeau",
      "inventor_name_first": "John A.",
      "inventor_city": "Atlanta",
      "inventor_state": "GA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Whitley",
      "inventor_name_first": "Michael D.",
      "inventor_city": "Durham",
      "inventor_state": "NC",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Zhang",
      "inventor_name_first": "Le",
      "inventor_city": "Durham",
      "inventor_state": "NC",
      "inventor_country": "US"
    }
  ],
  "abstract": "An approach is provided in which a knowledge manager identifies a first cohort type and a second cohort type corresponding to an entity included in a question. The knowledge manager determines inferred states to the question by comparing a first set of cohort attributes corresponding to a first cohort type against entity attributes corresponding to the question. In turn, the knowledge manager generates possible answers by comparing the inferred states against a second set of cohort attributes corresponding to a second cohort type.",
  "filing_date": "20160322",
  "patent_number": "None",
  "summary": "<SOH> BRIEF SUMMARY <EOH>According to one embodiment of the present disclosure, an approach is provided in which a knowledge manager identifies a first cohort type and a second cohort type corresponding to an entity included in a question. The knowledge manager determines inferred states to the question by comparing a first set of cohort attributes corresponding to a first cohort type against entity attributes corresponding to the question. In turn, the knowledge manager generates possible answers by comparing the inferred states against a second set of cohort attributes corresponding to a second cohort type. The foregoing is a summary and thus contains, by necessity, simplifications, generalizations, and omissions of detail; consequently, those skilled in the art will appreciate that the summary is illustrative only and is not intended to be in any way limiting. Other aspects, inventive features, and advantages of the present disclosure, as defined solely by the claims, will become apparent in the non-limiting detailed description set forth below.",
  "date_published": "20160714",
  "title": "Inferred Facts Discovered through Knowledge Graph Derived Contextual Overlays",
  "ipcr_labels": [
    "G06N700",
    "G06N9900"
  ],
  "_processing_info": {
    "original_size": 58928,
    "optimized_size": 2607,
    "reduction_percent": 95.58
  }
}