{
  "date_produced": "20170906",
  "publication_number": "US20170270419A1-20170921",
  "main_ipcr_label": "G06N700",
  "decision": "PENDING",
  "application_number": "15070547",
  "inventor_list": [
    {
      "inventor_name_last": "Sánchez Charles",
      "inventor_name_first": "David",
      "inventor_city": "Barcelona",
      "inventor_state": "",
      "inventor_country": "ES"
    },
    {
      "inventor_name_last": "Muntés Mulero",
      "inventor_name_first": "Victor",
      "inventor_city": "Barcelona",
      "inventor_state": "",
      "inventor_country": "ES"
    }
  ],
  "abstract": "In a computer server, a ticket element generated by an issue tracking system responsive to a client request is received, where the ticket element includes a data field including data indicative of an attribute. A database including state data stored therein is accessed responsive to receipt of the ticket element. The state data relates a plurality of states that are specific to the attribute. One of the plurality of states related by the state data is identified as corresponding to a future state of the attribute based on a current state of the attribute, and a future probability of escalation of the ticket element is computed based on the future state of the attribute responsive to identification of the one of the plurality of states as corresponding thereto. An action indicator is provided in response to the client request.",
  "filing_date": "20160315",
  "patent_number": "None",
  "summary": "<SOH> SUMMARY <EOH>Some embodiments described herein are directed to a computer server including a processor and a memory coupled to the processor. The memory includes a computer-readable storage medium storing computer-readable program code therein that is executable by the processor to perform operations including receiving a ticket element from or generated by an issue tracking system responsive to a client request. The ticket element includes a data field having data therein indicative of an attribute. The operations further include accessing a database including state data stored therein responsive to receipt of the ticket element. The state data includes and relates a plurality of states that are specific to the attribute indicated by the data field of the ticket element. The operations further include identifying one of the plurality of states related by the state data as corresponding to a future state of the attribute based on a current state of the attribute, and computing a future probability of escalation of the ticket element based on the future state of the attribute responsive to identification of the one of the plurality of states of the state data as corresponding thereto. The operations further include providing an action indicator in response to the client request. The action indicator is based on the future probability of escalation of the ticket element relative to a predefined threshold. Some embodiments described herein are directed to a method performed by a processor of a computer server. The method includes accessing a database including state data stored therein. The state data includes and relates a plurality of states that are specific to a time-dependent attribute that is indicated by data in a data field of a ticket element, where the ticket element is received from or generated by an issue tracking system responsive to a client request. The method further includes identifying ones of the plurality of states related by the state data a...",
  "date_published": "20170921",
  "title": "ESCALATION PREDICTION BASED ON TIMED STATE MACHINES",
  "ipcr_labels": [
    "G06N700",
    "G06F1730"
  ],
  "_processing_info": {
    "original_size": 90310,
    "optimized_size": 3557,
    "reduction_percent": 96.06
  }
}