{
  "decision": "PENDING",
  "application_number": "15074749",
  "date_published": "20161103",
  "date_produced": "20161019",
  "title": "ONLINE DIAGNOSTIC SYSTEM WITH VIRTUAL MEDICAL ASSISTANCE FOR THE DIAGNOSED DISEASE UTILIZING NANO-DEVICES AND QUANTUM CLOUD\nCOMPUTING",
  "filing_date": "20160318",
  "inventor_list": [
    {
      "inventor_name_last": "Abraham",
      "inventor_name_first": "Fred",
      "inventor_city": "Tempe",
      "inventor_state": "AZ",
      "inventor_country": "US"
    }
  ],
  "ipcr_labels": [
    "G01N3353",
    "G06F1900",
    "G01N3500",
    "G06Q2018",
    "G01N100"
  ],
  "main_ipcr_label": "G01N3353",
  "summary": "<SOH> SUMMARY OF THE INVENTION <EOH>The present invention relates to implementing an online diagnostic system, wherein the system comprises of an electrode that is inserted into a container containing the client sample, which is connected to an electronic device through a Bluetooth low energy communication channel for receiving one or more client sample intensities, or the system is integrated with a disposable dual purpose pin/prick embedded with the Microfluidic chip (MFC) diagnostic kiosk for receiving the client sample intensities. Further, the system transmits the received sample intensities to a cloud computing technology for diagnosing the client's sample, and the system displays the diagnosis result on the electronic device or the Light Emitting Diode (LED) screen on the diagnostic screen, within a short interval of time. After diagnosing the client's sample, the online diagnostic system provides a virtual medical assistance for the diagnosed disease.",
  "patent_number": "None",
  "abstract": "The present invention relates to implementing an online diagnostic system for diagnosing the sample received from a client. The system is connected with an electrode through a Bluetooth low energy communication channel to receive the sample from one or more subscribed client(s) and the system is configured to transmit the received sample for further diagnosis of the sample. Additionally, the system can be supported with a diagnostic kiosk integrated with a dual purpose chip/imbedded Microfluidic chip (MFC) to collect the test sample. Further, the transmitted sample is diagnosed in the cloud by using nano technology and through the implementation of the cloud computation technology. Further, the application is configured to send back the sample diagnosis result to the electronic device from which the client sample was collected or through a diagnostic kiosk LED display to provide a virtual medical assistance for the clients diagnosed with a disease.",
  "publication_number": "US20160320371A1-20161103",
  "_processing_info": {
    "original_size": 33121,
    "optimized_size": 2599,
    "reduction_percent": 92.15
  }
}