{
  "decision": "PENDING",
  "application_number": "15076148",
  "date_published": "20160714",
  "date_produced": "20160628",
  "title": "DEVICES, METHODS, AND SYSTEMS FOR PROVIDING INTERACTIVITY WITH DIGITAL SIGNS",
  "filing_date": "20160321",
  "inventor_list": [
    {
      "inventor_name_last": "Krig",
      "inventor_name_first": "Scott A.",
      "inventor_city": "Santa Clara",
      "inventor_state": "CA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Pickering",
      "inventor_name_first": "Cynthia A.",
      "inventor_city": "Phoenix",
      "inventor_state": "AZ",
      "inventor_country": "US"
    }
  ],
  "ipcr_labels": [
    "G06F30481",
    "G06F314",
    "G06F301"
  ],
  "main_ipcr_label": "G06F30481",
  "summary": "<SOH> BRIEF DESCRIPTION OF THE DRAWINGS <EOH>The concepts described herein are illustrated by way of example and not by way of limitation in the accompanying figures. For simplicity and clarity of illustration, elements illustrated in the figures are not necessarily drawn to scale. Where considered appropriate, reference labels have been repeated among the figures to indicate corresponding or analogous elements. FIG. 1 is a simplified block diagram of at least one embodiment of a system for providing interactivity with one or more digital signs; FIG. 2 is a simplified block diagram of at least one embodiment of an interactive digital sign of the system of FIG. 1 ; FIG. 3 is a simplified block diagram of at least one embodiment of a mobile communication device of the system of FIG. 1 ; FIG. 4 is a simplified block diagram of at least one embodiment of an environment of the interactive digital sign of the system of FIG. 2 ; FIG. 5 is a simplified block diagram of at least one embodiment of an environment of the mobile communication device of the system of FIG. 3 ; FIG. 6 is a simplified block diagram of at least one embodiment of a display of the interactive digital sign of the system of FIG. 1 ; FIG. 7 is a simplified block diagram of at least one embodiment of a display of the interactive digital sign of the system of FIG. 1 ; FIG. 8 is a simplified block diagram of at least one embodiment of a display of the interactive digital sign of the system of FIG. 1 ; FIG. 9 is a simplified flow diagram of at least one embodiment of a method for updating an interactive digital sign that may be executed by the interactive digital sign of FIG. 2 ; FIGS. 10 and 11 is a simplified flow diagram of at least one embodiment of a method for facilitating interactivity with a digital sign that may be executed by the interactive digital sign of FIG. 2 ; FIG. 12 is a simplified flow diagram of at least one embodiment of a method for registering and communicating with a digital sign manag...",
  "patent_number": "None",
  "abstract": "A device, method, and system for providing interactivity with a digital sign includes an interactive digital sign configured to display information in response to interactions by a viewer. The viewer may interact with the digital sign using sensors of the digital sign or via use of a mobile communication device carried by the viewer. User data may be used by the interactive digital sign to select the information, which may include advertisements, coupons, directions, and other information. The information may be transmitted to the viewer's mobile communication device.",
  "publication_number": "US20160202849A1-20160714",
  "_processing_info": {
    "original_size": 98590,
    "optimized_size": 3319,
    "reduction_percent": 96.63
  }
}