{
  "date_produced": "20160914",
  "publication_number": "US20160283839A1-20160929",
  "main_ipcr_label": "G06N300",
  "decision": "PENDING",
  "application_number": "15072736",
  "inventor_list": [
    {
      "inventor_name_last": "Ye",
      "inventor_name_first": "Jay J.",
      "inventor_city": "Bangor",
      "inventor_state": "ME",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Shum",
      "inventor_name_first": "Chung Ho",
      "inventor_city": "Bangor",
      "inventor_state": "ME",
      "inventor_country": "US"
    }
  ],
  "abstract": "A method of using artificial intelligence (e.g., SMILE) to assist users, such as pathologists and pathologist assistants, in pathology report preparation is described. The method includes the steps of (1) specimen gross examination, submission and dictation, (2) final diagnosis dictation, and (3) Cancer Protocol Templates construction. SMILE “listens” to the voice commands, “reads” case/slide information, goes through algorithms, and engages in report preparation. SMILE performs secretarial tasks, such as typing, error checking, important information announcing, and inputting commands by simulating keystrokes and mouse clicks, thus enabling the user to focus on the professional tasks at hand. This results in an increase in the efficiency for the user, and a decrease in reporting errors. Human-SMILE interaction is very much human-to-human like, mediated by voice recognition technology and text-to-speech. There is a significant reduction in the keyboard and mouse usage in comparison to e...",
  "filing_date": "20160317",
  "patent_number": "None",
  "summary": "<SOH> SUMMARY <EOH>The below summary is merely representative and non-limiting. The above problems are overcome, and other advantages may be realized, by the use of the embodiments. In a first aspect, an embodiment provides an artificial intelligence [Secretary-Mimicking Artificial Intelligence (SMILE)] that assists pathologists and pathologist assistants in pathology report preparation at the steps of (1) specimen gross examination, submission and dictation, (2) final diagnosis dictation, and (3) Cancer Protocol Templates construction. SMILE “listens” to the voice commands, “reads” case/slide information, goes through algorithms, and engages in report preparation. SMILE performs secretarial tasks, such as typing, error checking, and interacting with the graphical user interface (GUI) by simulating keystrokes and mouse clicks, thus enabling the pathologists and pathologist assistants to focus on the professional tasks at hand. This results in an increase in the efficiency for the pathologists and pathologist assistants, and a decrease in reporting errors. Human-SMILE interaction is very much human-to-human like, mediated by voice recognition technology and text-to-speech. There is a significant reduction in the keyboard and mouse usage in comparison to either human transcription or voice recognition without SMILE. In a further aspect, an embodiment provides a method of computer-assisted pathology report preparation. The computer being used to assist in the report preparation displays a cursor at a current cursor location in an active window. In response to determining a voice input regarding a report document has a command for the computer, the method also includes determining a current context of the computer, determining at least one instruction based on the command and the current context, and executing at least one instruction on the computer. The current context is based at least in part on the active window and the current cursor location.",
  "date_published": "20160929",
  "title": "SECRETARY-MIMICKING ARTIFICIAL INTELLIGENCE FOR PATHOLOGY REPORT PREPARATION",
  "ipcr_labels": [
    "G06N300",
    "G10L1522"
  ],
  "_processing_info": {
    "original_size": 85869,
    "optimized_size": 3733,
    "reduction_percent": 95.65
  }
}