{
  "decision": "REJECTED",
  "application_number": "15072776",
  "date_published": "20160922",
  "date_produced": "20160908",
  "title": "IMAGE FORMING CONTROL APPARATUS, IMAGE FORMING SYSTEM, AND METHOD OF CONTROLLING INFORMATION FOR IMAGE FORMATION",
  "filing_date": "20160317",
  "inventor_list": [
    {
      "inventor_name_last": "Yukie",
      "inventor_name_first": "Itsuo",
      "inventor_city": "Tokyo",
      "inventor_state": "",
      "inventor_country": "JP"
    }
  ],
  "ipcr_labels": [
    "G06K1502"
  ],
  "main_ipcr_label": "G06K1502",
  "summary": "<SOH> SUMMARY <EOH>Example embodiments of the present invention include an image forming control apparatus coupled to an image forming apparatus through a network and to control the image forming apparatus to form an image. The image forming control apparatus includes a memory to store first recording medium information including, for each one of a plurality of entries of recording medium to be formed with an image, basic recording medium information that is previously determined by a type of recording medium and extended recording medium information that is previously determined by property of the image to be formed on the recording medium. The image forming control apparatus obtains second recording medium information from the image forming apparatus, the second recording medium being stored in a memory of the image forming apparatus and including for each one of a plurality of entries of recording medium to be formed with an image, basic recording medium information that is previously determined by a type of recording medium and extended recording medium information that is previously determined by property of the image to be formed on the recording medium, compares between the first recording medium information and the second recording medium information to generate a comparison result, and synchronizes between the first recording medium information and the second recording medium information based on the comparison result indicating that the first recording medium information and the second recording medium information do not match with each other. Example embodiments of the present invention include an image forming system including the above-described image forming control apparatus and one or more image forming apparatuses to be controlled by the image forming control apparatus. Example embodiments of the present invention include a method for controlling information, performed by the image forming control apparatus, and a non-transitory recording medium sto...",
  "patent_number": "None",
  "abstract": "An image forming control apparatus, which includes a memory to store first recording medium information, obtains second recording medium information from an image forming apparatus, compares between the first recording medium information and the second recording medium information to generate a comparison result, and synchronizes between the first recording medium information and the second recording medium information based on the comparison result indicating that the first recording medium information and the second recording medium information do not match with each other.",
  "publication_number": "US20160275383A1-20160922",
  "_processing_info": {
    "original_size": 61125,
    "optimized_size": 3178,
    "reduction_percent": 94.8
  }
}