{
  "date_produced": "20170906",
  "publication_number": "US20170270429A1-20170921",
  "main_ipcr_label": "G06N9900",
  "decision": "PENDING",
  "application_number": "15075691",
  "inventor_list": [
    {
      "inventor_name_last": "Bhattacharya",
      "inventor_name_first": "Sakyajit",
      "inventor_city": "Bangalore",
      "inventor_state": "",
      "inventor_country": "IN"
    },
    {
      "inventor_name_last": "Rajan",
      "inventor_name_first": "Vaibhav",
      "inventor_city": "Bangalore",
      "inventor_state": "",
      "inventor_country": "IN"
    }
  ],
  "abstract": "A method and system for data classification using machine learning comprises collecting a dataset with a data collection module, receiving the dataset at a classification module configured for machine learning, dividing the dataset into a plurality of vectors, transforming the plurality of vectors into a plurality of variables wherein each variable is assigned a label, and classifying the variables.",
  "filing_date": "20160321",
  "patent_number": "None",
  "summary": "<SOH> SUMMARY <EOH>The following summary is provided to facilitate an understanding of some of the innovative features unique to the embodiments disclosed and is not intended to be a full description. A full appreciation of the various aspects of the embodiments can be gained by taking the entire specification, claims, drawings, and abstract as a whole. It is, therefore, one aspect of the disclosed embodiments to provide a method and system for machine learning. It is another aspect of the disclosed embodiments to provide a method and system for feature classification. It is yet another aspect of the disclosed embodiments to provide an enhanced method and system for training a classifier to correctly classify a minority feature in imbalanced datasets with overlap. It is another aspect of the disclosed embodiments to provide a method and system for identifying hazardous seismic activity. It is another aspect of the disclosed embodiments to provide methods and systems for segmentation of image attributes. It is another aspect of the disclosed embodiments to provide methods and systems for identifying defective motor components in electric current drive signals. It is another aspect of the disclosed embodiments to provide methods and systems for classifying unbalanced, overlapping data sets related to patient and customer satisfaction, risk assessment, fraud detection, pattern discovery, and analysis of complex data. The aforementioned aspects and other objectives and advantages can now be achieved as described herein. A method and system for classifying data comprises a sensor which collects a dataset; a processor; a data bus coupled to the processor; and a computer-usable medium embodying computer program code, the computer-usable medium being coupled to the data bus, the computer program code comprising instructions executable by the processor and configured for receiving the dataset at a classification module configured for machine learning, dividing the dataset in...",
  "date_published": "20170921",
  "title": "METHODS AND SYSTEMS FOR IMPROVED MACHINE LEARNING USING SUPERVISED CLASSIFICATION OF IMBALANCED DATASETS WITH OVERLAP",
  "ipcr_labels": [
    "G06N9900",
    "G06N700"
  ],
  "_processing_info": {
    "original_size": 54271,
    "optimized_size": 3172,
    "reduction_percent": 94.16
  }
}