{
  "date_produced": "20160628",
  "publication_number": "US20160203409A1-20160714",
  "main_ipcr_label": "G06N700",
  "decision": "PENDING",
  "application_number": "15074063",
  "inventor_list": [
    {
      "inventor_name_last": "Iyer",
      "inventor_name_first": "Rahul",
      "inventor_city": "Foster City",
      "inventor_state": "CA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Qian",
      "inventor_name_first": "Hai",
      "inventor_city": "San Mateo",
      "inventor_state": "CA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Yang",
      "inventor_name_first": "Shengwen",
      "inventor_city": "Beijing",
      "inventor_state": "",
      "inventor_country": "CN"
    },
    {
      "inventor_name_last": "Welton",
      "inventor_name_first": "Caleb E.",
      "inventor_city": "Foster City",
      "inventor_state": "CA",
      "inventor_country": "US"
    }
  ],
  "abstract": "A framework for executing iterative grouped optimization algorithms such as machine learning and other analytic algorithms directly on unsorted data within a SQL data store without first redistributing the data comprises an architecture that provides C++ abstraction layers that include the algorithms over a SQL data store, and a higher Python abstraction layer that includes grouping and iteration controllers and call functionality to the C++ layer for invocation of the algorithms.",
  "filing_date": "20160318",
  "patent_number": "None",
  "summary": "<SOH> BRIEF DESCRIPTION OF THE DRAWINGS <EOH>Various embodiments of the invention are disclosed in the following detailed description and the accompanying drawings. FIG. 1 is a diagrammatic view of the architecture of a distributed database system with which the invention may be used; FIG. 2 illustrates a preferred embodiment of a node of the database system of FIG. 1 ; FIG. 3 is a diagrammatic view that illustrates generally a process in accordance with the invention; FIG. 4 is a diagrammatic view illustrating the architecture of a preferred embodiment of a system in accordance with the invention; and FIG. 5 is diagrammatic view of a process in accordance with a preferred embodiment of the invention. detailed-description description=\"Detailed Description\" end=\"lead\"?",
  "date_published": "20160714",
  "title": "FRAMEWORK FOR CALCULATING GROUPED OPTIMIZATION ALGORITHMS WITHIN A DISTRIBUTED DATA STORE",
  "ipcr_labels": [
    "G06N700",
    "G06F1730"
  ],
  "_processing_info": {
    "original_size": 37273,
    "optimized_size": 2289,
    "reduction_percent": 93.86
  }
}