{
  "date_produced": "20170906",
  "publication_number": "US20170270414A1-20170921",
  "main_ipcr_label": "G06N504",
  "decision": "PENDING",
  "application_number": "15075952",
  "inventor_list": [
    {
      "inventor_name_last": "Ignatova",
      "inventor_name_first": "Vanya",
      "inventor_city": "Saint Martin D'heres",
      "inventor_state": "",
      "inventor_country": "FR"
    },
    {
      "inventor_name_last": "Gray",
      "inventor_name_first": "Anthony R.",
      "inventor_city": "Victoria",
      "inventor_state": "",
      "inventor_country": "CA"
    }
  ],
  "abstract": "A method comprises detecting a power quality event, determining if one or more power outages occurs in a defined time period extending from a beginning of the power quality event to an end of the power quality event, and if one or more power outages occurs in the defined time period, then performing an analysis, where performing the analysis comprises determining if the one or more power outages is associated with the power quality event. The method may also comprise outputting the information regarding the analysis to a display device.",
  "filing_date": "20160321",
  "patent_number": "None",
  "summary": "<SOH> SUMMARY <EOH>According to one aspect of the present invention, a method is provided that comprises detecting a power quality event, determining if one or more power outages occurs in a defined time period extending from a beginning of the power quality event to an end of the power quality event, if one or more power outages occurs in the defined time period, then performing an analysis, where performing the analysis comprises determining if the one or more power outages is associated with the power quality event, and outputting information regarding the analysis to a display device. In accordance with some embodiments, the power quality event is detected by a power quality monitoring device, and determining if the one or more power outages is associated with the power quality event comprises: determining if the power quality monitoring device detects a power outage during the defined time period, and if the power quality monitoring device detects a power outage during the defined time period, providing a reliability index to be included in the outputted information, the reliability index corresponding to a confidence level that the one or more power outages is associated with the power quality event. According to another embodiment, the method further comprises identifying a location of the power quality monitoring device that detects the power quality event, determining if power quality monitoring devices positioned downstream from the power quality monitoring device detect a power outage during the defined time period; and providing the reliability index if the power quality monitoring devices positioned downstream from the power quality monitoring device detect a power outage during the defined time period. According to yet another embodiment, the method further comprises: determining if the power quality monitoring device and the power quality monitoring devices positioned downstream from the power quality monitoring device detect a power outage in a time ...",
  "date_published": "20170921",
  "title": "METHOD FOR INFERRING DOWNTIME FROM POWER QUALITY DATA",
  "ipcr_labels": [
    "G06N504"
  ],
  "_processing_info": {
    "original_size": 119234,
    "optimized_size": 3240,
    "reduction_percent": 97.28
  }
}