{
  "date_produced": "20170214",
  "publication_number": "US20170061328A1-20170302",
  "main_ipcr_label": "G06N9900",
  "decision": "PENDING",
  "application_number": "15077873",
  "inventor_list": [
    {
      "inventor_name_last": "MAJUMDAR",
      "inventor_name_first": "Somdeb",
      "inventor_city": "Mission Viejo",
      "inventor_state": "CA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "TOWAL",
      "inventor_name_first": "Regan Blythe",
      "inventor_city": "La Jolla",
      "inventor_state": "CA",
      "inventor_country": "US"
    }
  ],
  "abstract": "An apparatus for classifying an input includes a classifier and a feature extractor. The feature extractor is configured to generate a feature vector based on the input. The feature vector is also configured to set a number of elements of the feature vector to zero to produce a sparse feature vector. The sparse feature vector has the same dimensions as the feature vector generated by the feature extractor. However, the sparse feature vector includes fewer non-zero elements than the feature vector generated by the feature extractor. The feature vector is further configured to forward the sparse feature vector to the classifier to classify the input.",
  "filing_date": "20160322",
  "patent_number": "None",
  "summary": "<SOH> SUMMARY <EOH>In an aspect of the present disclosure, an apparatus for classifying an input is disclosed. The apparatus includes a classifier and a feature extractor. The feature extractor is configured to generate a feature vector from the input. The feature vector is also configured to set a number of elements of the feature vector to zero to produce a sparse feature vector. The sparse feature vector has the same dimensions as the feature vector generated by the feature extractor. The sparse feature vector includes fewer non-zero elements than the feature vector generated by the feature extractor. The feature vector is further configured to forward the sparse feature vector to a classifier to classify the input. In another aspect of the present disclosure, a method for classifying an input is disclosed. The method includes generating a feature vector from the input. The method also includes setting a number of elements of the feature vector to zero to produce a sparse feature vector. The sparse feature vector has the same dimensions as the generated feature vector. The sparse feature vector also includes fewer non-zero elements than the generated feature vector. The method further includes forwarding the sparse feature vector to a classifier to classify the input. In yet another aspect of the present disclosure, an apparatus for classifying an input is disclosed. The apparatus includes means for generating a feature vector from the input. The apparatus also includes means for setting a number of elements of the feature vector to zero to produce a sparse feature vector. The sparse feature vector has the same dimensions as the generated feature vector. The sparse feature vector also includes fewer non-zero elements than the generated feature vector. The apparatus further includes means for forwarding the sparse feature vector to a classifier to classify the input. In still another aspect of the present disclosure, a non-transitory computer-readable medium is pr...",
  "date_published": "20170302",
  "title": "ENFORCED SPARSITY FOR CLASSIFICATION",
  "ipcr_labels": [
    "G06N9900",
    "G06N308"
  ],
  "_processing_info": {
    "original_size": 65193,
    "optimized_size": 3351,
    "reduction_percent": 94.86
  }
}