{
  "decision": "REJECTED",
  "application_number": "15079252",
  "date_published": "20161006",
  "date_produced": "20160921",
  "title": "METHOD, AND STORAGE MEDIUM",
  "filing_date": "20160324",
  "inventor_list": [
    {
      "inventor_name_last": "NAGAMATSU",
      "inventor_name_first": "Shinji",
      "inventor_city": "Fukuoka",
      "inventor_state": "",
      "inventor_country": "JP"
    }
  ],
  "ipcr_labels": [
    "G06Q1008",
    "G06T700"
  ],
  "main_ipcr_label": "G06Q1008",
  "summary": "<SOH> SUMMARY <EOH>According to an aspect of the invention, a method executed by a computer, the method includes: acquiring a captured image in which a product display shelf is image-captured; detecting, from the captured image, first identification information associated with a first position in the product display shelf and second identification information associated with a second position in the product display shelf; and determining that a display position of a product exists between the first position and the second position, in a case where product identification information associated with the product is detected at a position between the first identification information and the second identification information in the captured image. The object and advantages of the invention will be realized and attained by means of the elements and combinations particularly pointed out in the claims. It is to be understood that both the foregoing general description and the following detailed description are exemplary and explanatory and are not restrictive of the invention, as claimed.",
  "patent_number": "None",
  "abstract": "A method executed by a computer, the method includes: acquiring a captured image in which a product display shelf is image-captured; detecting, from the captured image, first identification information associated with a first position in the product display shelf and second identification information associated with a second position in the product display shelf; and determining that a display position of a product exists between the first position and the second position, in a case where product identification information associated with the product is detected at a position between the first identification information and the second identification information in the captured image.",
  "publication_number": "US20160292628A1-20161006",
  "_processing_info": {
    "original_size": 50138,
    "optimized_size": 2314,
    "reduction_percent": 95.38
  }
}