{
  "date_produced": "20170906",
  "publication_number": "US20170270418A1-20170921",
  "main_ipcr_label": "G06N700",
  "decision": "PENDING",
  "application_number": "15070267",
  "inventor_list": [
    {
      "inventor_name_last": "Reschke",
      "inventor_name_first": "Kevin",
      "inventor_city": "San Francisco",
      "inventor_state": "CA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Suklikar",
      "inventor_name_first": "Atul",
      "inventor_city": "San Francisco",
      "inventor_state": "CA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Maas",
      "inventor_name_first": "Andrew",
      "inventor_city": "San Francisco",
      "inventor_state": "CA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Potts",
      "inventor_name_first": "Christopher",
      "inventor_city": "San Francisco",
      "inventor_state": "CA",
      "inventor_country": "US"
    }
  ],
  "abstract": "In various example embodiments, a system and methods are presented for generation and manipulation of predictive models within a user interface. The system and methods receive a view query with object data and time data and generate a user interface having a first graphical representation of a set of historical data responsive to the view query. The systems and methods generate a predictive model based on the set of historical data and generate a second graphical representation for the predictive model. The systems and methods generate and monitor a movable pivot element to automatically modify the predictive model and second graphical representation upon a change in position of the pivot element.",
  "filing_date": "20160315",
  "patent_number": "None",
  "summary": "<SOH> BRIEF DESCRIPTION OF THE DRAWINGS <EOH>Various ones of the appended drawings merely illustrate example embodiments of the present disclosure and cannot be considered as limiting its scope. FIG. 1 is a block diagram illustrating a networked system, according to some example embodiments. FIG. 2 is a block diagram of an example predictive modeling system, according to various embodiments. FIG. 3 is a flowchart illustrating an example method of generating and manipulating related predictive models within a graphical user interface, according to various embodiments. FIG. 4 is an example interface diagram illustrating a user interface screen of a predictive modeling system, according to various embodiments. FIG. 5 is a flowchart illustrating an example method for generating and manipulating related predictive models within a graphical user interface, according to various embodiments. FIG. 6 is an example interface diagram illustrating a user interface screen of a predictive modeling system, according to various embodiments. FIG. 7 is a flowchart illustrating an example method of generating and manipulating related predictive models within a graphical user interface, according to various embodiments. FIG. 8 is a block diagram illustrating an example of a software architecture that may be installed on a machine, according to some example embodiments. FIG. 9 illustrates a diagrammatic representation of a machine in the form of a computer system within which a set of instructions may be executed for causing the machine to perform any one or more of the methodologies discussed herein, according to an example embodiment. detailed-description description=\"Detailed Description\" end=\"lead\"? The headings provided herein are merely for convenience and do not necessarily affect the scope or meaning of the terms used.",
  "date_published": "20170921",
  "title": "POINT IN TIME PREDICTIVE GRAPHICAL MODEL EXPLORATION",
  "ipcr_labels": [
    "G06N700",
    "G06F30484"
  ],
  "_processing_info": {
    "original_size": 86014,
    "optimized_size": 3556,
    "reduction_percent": 95.87
  }
}