{
  "decision": "PENDING",
  "application_number": "15075733",
  "date_published": "20170112",
  "date_produced": "20161228",
  "title": "TOUCHSCREEN FREQUENCY CONVERTER AND DRIVE SYSTEM",
  "filing_date": "20160321",
  "inventor_list": [
    {
      "inventor_name_last": "Hu",
      "inventor_name_first": "Zhongliang",
      "inventor_city": "Espoo",
      "inventor_state": "",
      "inventor_country": "FI"
    },
    {
      "inventor_name_last": "Jokinen",
      "inventor_name_first": "Markku",
      "inventor_city": "Helsinki",
      "inventor_state": "",
      "inventor_country": "FI"
    },
    {
      "inventor_name_last": "Schroderus",
      "inventor_name_first": "Petri",
      "inventor_city": "Espoo",
      "inventor_state": "",
      "inventor_country": "FI"
    },
    {
      "inventor_name_last": "Tamminen",
      "inventor_name_first": "Mikko",
      "inventor_city": "Tampere",
      "inventor_state": "",
      "inventor_country": "FI"
    }
  ],
  "ipcr_labels": [
    "G06F3041",
    "G06F30488",
    "G06F30482",
    "G06F3044",
    "G06F3045"
  ],
  "main_ipcr_label": "G06F3041",
  "summary": "<SOH> BRIEF DESCRIPTION <EOH>The following presents a simplified summary of features disclosed herein to provide a basic understanding of some exemplary aspects of the invention. This summary is not an extensive overview of the invention. It is not intended to identify key/critical elements of the invention or to delineate the scope of the invention. Its sole purpose is to present some concepts disclosed herein in a simplified form as a prelude to a more detailed description. According to an aspect, there is provided the subject matter of the independent claims. Embodiments are defined in the dependent claims. One or more examples of implementations are set forth in more detail in the accompanying drawings and the description below. Other features will be apparent from the description and drawings, and from the claims. Some embodiments provide displaying a user interface on a touchscreen during power outage. Some embodiments provide a frequency converter operable by a touchscreen capable of displaying a user interface of the frequency converter during power outage.",
  "patent_number": "None",
  "abstract": "There is provided displaying a user interface during a power outage. A touchscreen comprises a lower layer comprising an electronic paper display and an upper layer comprising a transparent display. The touch screen may be arranged in a frequency converter and a drive system.",
  "publication_number": "US20170010735A1-20170112",
  "_processing_info": {
    "original_size": 47621,
    "optimized_size": 2370,
    "reduction_percent": 95.02
  }
}