{
  "date_produced": "20170915",
  "publication_number": "US20170278010A1-20170928",
  "main_ipcr_label": "G06N9900",
  "decision": "PENDING",
  "application_number": "15077085",
  "inventor_list": [
    {
      "inventor_name_last": "Edakunni",
      "inventor_name_first": "Narayanan Unny",
      "inventor_city": "Bangalore",
      "inventor_state": "",
      "inventor_country": "IN"
    },
    {
      "inventor_name_last": "Galhotra",
      "inventor_name_first": "Sainyam",
      "inventor_city": "Chandigarh",
      "inventor_state": "",
      "inventor_country": "IN"
    }
  ],
  "abstract": "The disclosed embodiments illustrate methods and systems for prediction of a communication channel for communication with customer service. The method includes monitoring, by one or more sensors in a server, a communication involving at least a first user for a pre-defined time period. The one or more types of communication channels being used by at least the first user over the pre-defined time period and/or the one or more types of problems reported by at least the first user, is monitored. The method further includes generating, by one or more processors of the server, a temporal data based on the monitoring. The classifier is trained by the one or more processors, based on the generated temporal data. The classifier predicts a likelihood of selection of a type of communication channels from the one or more types of communication channels, for communication between the first user and the server.",
  "filing_date": "20160322",
  "patent_number": "None",
  "summary": "<SOH> SUMMARY <EOH>According to the embodiments illustrated herein, there may be provided a method for prediction of a communication channel for communication with a customer service. The method may include monitoring, by one or more sensors in a server, a communication involving at least a first user for a pre-defined time period. The one or more types of communication channels being used by at least the first user over the pre-defined time period and/or the one or more types of problems reported by at least the first user, is monitored. The method may further include generating, by one or more processors of the server, a temporal data based on the monitoring. The classifier may be trained by the one or more processors, based on the generated temporal data. The classifier may predict a likelihood of selection of a type of communication channels from the one or more types of communication channels, for communication between the first user and the server. According to the embodiments illustrated herein, there may be provided a system for prediction of a communication channel for communication with a customer service. The system may include one or more processors in a server. The one or more servers may be configured to monitor a communication involving at least a first user for a pre-defined time period. The one or more types of communication channels being used by at least the first user over the pre-defined time period and/or the one or more types of problems reported by at least the first user, are monitored by the one or more processors of the server. The system may further include generation, by the one or more processors of the server, a temporal data based on the monitoring. The classifier may be trained by the one or more processors, based on the generated temporal data. The classifier may predict a likelihood of selection of a type of communication channels from the one or more types of communication channels, for communication between the first user and the...",
  "date_published": "20170928",
  "title": "METHOD AND SYSTEM TO PREDICT A COMMUNICATION CHANNEL FOR COMMUNICATION WITH A CUSTOMER SERVICE",
  "ipcr_labels": [
    "G06N9900",
    "G06Q3000",
    "H04L1226"
  ],
  "_processing_info": {
    "original_size": 71325,
    "optimized_size": 3677,
    "reduction_percent": 94.84
  }
}