{
  "decision": "ACCEPTED",
  "application_number": "15072367",
  "date_published": "20160929",
  "date_produced": "20160914",
  "title": "NON-VOLATILE STATIC RANDOM ACCESS MEMORY",
  "filing_date": "20160317",
  "inventor_list": [
    {
      "inventor_name_last": "CHIOU",
      "inventor_name_first": "LIH-YIH",
      "inventor_city": "Tainan",
      "inventor_state": "",
      "inventor_country": "TW"
    },
    {
      "inventor_name_last": "CHIEN",
      "inventor_name_first": "TSAI-KAN",
      "inventor_city": "Tainan",
      "inventor_state": "",
      "inventor_country": "TW"
    },
    {
      "inventor_name_last": "TSOU",
      "inventor_name_first": "YI-SUNG",
      "inventor_city": "Tainan",
      "inventor_state": "",
      "inventor_country": "TW"
    }
  ],
  "ipcr_labels": [
    "G06F306"
  ],
  "main_ipcr_label": "G06F306",
  "summary": "<SOH> SUMMARY <EOH>One objective of the present invention is to provide a non-volatile static random access memory capable of determining whether the backup memory unit has stored correct data prior to data backup. Another objective of the present invention is to provide a non-volatile static random access memory with minimized power consumption. Still another objective of the present invention is to provide a non-volatile static random access memory capable of performing data backup completely and correctly. The present invention provides a non-volatile static random access memory. The non-volatile static random access memory has an operating mode, a data backup mode and a data restore mode. The non-volatile static random access memory includes a memory cell and a power saving module. The memory cell is electrically coupled to a word line, a bit line, a complementary bit line, a backup signal line, a backup signal transmission line and a backup setting line. The memory cell includes a latch, a set of latch switch units, a set of backup memory units, a set of backup activation units, a backup setting unit and a driving signal transmission unit. When the latch switch unit is turned on by a signal transmitted by the word line under the operating mode and, the bit line and the complementary bit line are electrically coupled to the latch and data written by the bit line or the complementary bit line is received by and stored in the latch. The set of backup memory units have a node voltage. The backup memory units are electrically coupled to the backup signal transmission line and configured to store backup data. When the backup data is different from the data stored in the latch, a backup driving signal is generated by the node voltage of the backup memory units and outputted via the backup signal transmission line. The set of backup activation units are configured to electrically couple the backup memory unit to the latch when the backup activation units are turned on ...",
  "patent_number": "9734909",
  "abstract": "A non-volatile static random access memory has an operating mode, a data backup mode and a data restore mode. The non-volatile static random access memory includes a memory cell and a power saving module. The memory cell includes a latch, a set of latch switch units, a set of backup memory units, a set of backup activation units, a backup setting unit and a driving signal transmission unit. The power saving module includes a control switch unit, a backup determination unit and a restore switch unit. When backup data is different from data stored in the latch, a backup driving signal is generated by a node voltage of the backup memory units and outputted to a backup determination unit, which drives the backup setting unit to turn on according to the backup driving signal, so as to change the backup data in the backup memory units and ensure correct backup.",
  "publication_number": "US20160283149A1-20160929",
  "_processing_info": {
    "original_size": 57215,
    "optimized_size": 3679,
    "reduction_percent": 93.57
  }
}