{
  "decision": "PENDING",
  "application_number": "15088093",
  "date_published": "20161006",
  "date_produced": "20160921",
  "title": "System Monitoring with Key Performance Indicators from Shared Base Search of Machine Data",
  "filing_date": "20160331",
  "inventor_list": [
    {
      "inventor_name_last": "Boe",
      "inventor_name_first": "Brent Stephen",
      "inventor_city": "San Francisco",
      "inventor_state": "CA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Gupta",
      "inventor_name_first": "Rochit",
      "inventor_city": "San Francisco",
      "inventor_state": "CA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Mulla",
      "inventor_name_first": "Rehan",
      "inventor_city": "Daly City",
      "inventor_state": "CA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Fletcher",
      "inventor_name_first": "Tristan Antonio",
      "inventor_city": "Pacifica",
      "inventor_state": "CA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Bhide",
      "inventor_name_first": "Alok Anant",
      "inventor_city": "Mountain View",
      "inventor_state": "CA",
      "inventor_country": "US"
    }
  ],
  "ipcr_labels": [
    "G06Q1006",
    "H04L1224"
  ],
  "main_ipcr_label": "G06Q1006",
  "summary": "<SOH> BRIEF DESCRIPTION OF THE DRAWINGS <EOH>The present disclosure will be understood more fully from the detailed description given below and from the accompanying drawings of various implementations of the disclosure. FIG. 1 illustrates a block diagram of an example of entities providing a service, in accordance with one or more implementations of the present disclosure. FIG. 2 is a block diagram of one implementation of a service monitoring system, in accordance with one or more implementations of the present disclosure. FIG. 3 is a block diagram illustrating an entity definition for an entity, in accordance with one or more implementations of the present disclosure. FIG. 4 is a block diagram illustrating a service definition that relates one or more entities with a service, in accordance with one or more implementations of the present disclosure. FIG. 5 is a flow diagram of an implementation of a method for creating one or more key performance indicators for a service, in accordance with one or more implementations of the present disclosure. FIG. 6 is a flow diagram of an implementation of a method for creating an entity definition for an entity, in accordance with one or more implementations of the present disclosure. FIG. 7 illustrates an example of a graphical user interface (GUI) for creating and/or editing entity definition(s) and/or service definition(s), in accordance with one or more implementations of the present disclosure. FIG. 8 illustrates an example of a GUI for creating and/or editing entity definitions, in accordance with one or more implementations of the present disclosure. FIG. 9A illustrates an example of a GUI for creating an entity definition, in accordance with one or more implementations of the present disclosure. FIG. 9B illustrates an example of input received via GUI for creating an entity definition, in accordance with one or more implementations of the present disclosure. FIG. 9C illustrates an example of a GUI of a service monitori...",
  "patent_number": "None",
  "abstract": "An automatic service monitor in an information technology environment has its operation controlled by information that, in part, define entities that perform services and define key performance indicators (KPIs) that indicate measures of performance of the services. KPIs are defined in terms of search queries applied against machine data by or about the entities that perform the services. The search query aspects of multiple KPI definitions may be tied to a shared base search. Implementation of the shared base search may permit improved performance of the service monitor and may permit a reduction in administrative burden.",
  "publication_number": "US20160292611A1-20161006",
  "_processing_info": {
    "original_size": 1195559,
    "optimized_size": 3836,
    "reduction_percent": 99.68
  }
}