{
  "decision": "REJECTED",
  "application_number": "15089790",
  "date_published": "20160728",
  "date_produced": "20160713",
  "title": "DISCOVERY METHOD FOR BUYERS, SELLERS OF REAL ESTATE",
  "filing_date": "20160404",
  "inventor_list": [
    {
      "inventor_name_last": "Goodrich",
      "inventor_name_first": "Paul",
      "inventor_city": "Seattle",
      "inventor_state": "WA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Marsh",
      "inventor_name_first": "Brian D.",
      "inventor_city": "Seattle",
      "inventor_state": "WA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Selner",
      "inventor_name_first": "Bryan J.",
      "inventor_city": "Seattle",
      "inventor_state": "WA",
      "inventor_country": "US"
    }
  ],
  "ipcr_labels": [
    "G06Q3006"
  ],
  "main_ipcr_label": "G06Q3006",
  "summary": "<SOH> BRIEF DESCRIPTION OF THE DRAWINGS <EOH>The foregoing aspects and many of the attendant advantages of this invention will become more readily appreciated as the same become better understood by reference to the following detailed description, when taken in conjunction with the accompanying drawings, wherein: FIG. 1 is a block diagram illustrating an exemplary system that allows sellers to discover buyers of real estate and buyers to discover sellers of real estate; FIG. 2 is a pictorial diagram illustrating an exemplary user interface that presents real estate search results; FIGS. 3A-3J are process diagrams illustrating an exemplary method for matching real estate buyers and sellers; and FIGS. 4A-4H are process diagrams illustrating another exemplary method for real estate buyers and sellers to discover one another. detailed-description description=\"Detailed Description\" end=\"lead\"?",
  "patent_number": "None",
  "abstract": "Sellers can, anonymously to buyers if they choose, expose to potential buyers a property that is or may be for sale, with or without a sales price or listing agreement, with as little or as much description of their property as the sellers wish to provide. Potential buyers can identify the location and/or types of properties that they would be interested in purchasing, with as little or as much specificity as they wish, and, at their option, provide information about themselves, such as their financial ability to complete a purchase, to the extent they wish. The system allows sellers to gauge demand for their properties and, if desired, initiate contact with potential buyers who have expressed an interest in purchasing those types of properties. Similarly, the system allows buyers to identify properties that match their interests and, if desired, initiate contact with potential sellers.",
  "publication_number": "US20160217523A1-20160728",
  "_processing_info": {
    "original_size": 53778,
    "optimized_size": 2635,
    "reduction_percent": 95.1
  }
}