{
  "date_produced": "20170915",
  "publication_number": "US20170278013A1-20170928",
  "main_ipcr_label": "G06N9900",
  "decision": "PENDING",
  "application_number": "15081278",
  "inventor_list": [
    {
      "inventor_name_last": "Yu",
      "inventor_name_first": "Jiangsheng",
      "inventor_city": "San Jose",
      "inventor_state": "CA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Zang",
      "inventor_name_first": "Hui",
      "inventor_city": "Cupertino",
      "inventor_state": "CA",
      "inventor_country": "US"
    }
  ],
  "abstract": "A processing device and method of classifying data are provided. The method comprises the computer-implemented steps of selecting a M number of model sets, a R number of data representation sets, and a T number of sampling sets, generating a M*R*T number of classifiers comprising a three-dimensional (3D) array of classifiers, testing each individual classifier in the 3D array of classifiers on a testing set to obtain accuracy scores for the each individual classifier, and assigning a weight value to the each individual classifier corresponding to each accuracy score, wherein the 3D array of classifiers comprises a 3D array of weighted classifiers.",
  "filing_date": "20160325",
  "patent_number": "None",
  "summary": "<SOH> BRIEF SUMMARY <EOH>A processing device and method of classifying data are provided. The method comprises the computer-implemented steps of selecting a M number of model sets, a R number of data representation sets, and a T number of sampling sets, generating a M*R*T number of classifiers comprising a three-dimensional (3D) array of classifiers, testing each individual classifier in the 3D array of classifiers on a testing set to obtain accuracy scores for each individual classifier, and assigning a weight value to each individual classifier corresponding to each accuracy score, wherein the 3D array of classifiers comprises a 3D array of weighted classifiers. A processing device is provided, comprising a non-transitory memory storage comprising instructions and one or more processors in communication with the memory. The one or more processors execute the instructions to select a M number of model sets, a R number of data representation sets, and a T number of sampling sets, generate a M*R*T number of classifiers comprising a three-dimensional (3D) array of classifiers, test each individual classifier in the 3D array of classifiers on a testing set to obtain accuracy scores for each individual classifier, and assign a weight value to each individual classifier corresponding to each accuracy score, wherein the 3D array of classifiers comprises a 3D array of weighted classifiers.",
  "date_published": "20170928",
  "title": "STEREOSCOPIC LEARNING FOR CLASSIFICATION",
  "ipcr_labels": [
    "G06N9900",
    "G06F1730"
  ],
  "_processing_info": {
    "original_size": 61076,
    "optimized_size": 2741,
    "reduction_percent": 95.51
  }
}