{
  "decision": "ACCEPTED",
  "application_number": "15085025",
  "date_published": "20160721",
  "date_produced": "20160706",
  "title": "Identifying and Delivering Tailored Content With Gift Options",
  "filing_date": "20160330",
  "inventor_list": [
    {
      "inventor_name_last": "WILLIAMS",
      "inventor_name_first": "TROY P.",
      "inventor_city": "HOLTSVILLE",
      "inventor_state": "NY",
      "inventor_country": "US"
    }
  ],
  "ipcr_labels": [
    "G06Q3006"
  ],
  "main_ipcr_label": "G06Q3006",
  "summary": "<SOH> SUMMARY <EOH>The present disclosure includes systems, methods, and articles of manufacture for identifying and/or delivering tailored content based upon a service dialog. In various embodiments, the methods described herein can be performed by a variety of computer-based systems, including computer-based systems for processing service dialogs. Such systems can comprise and/or operate with any non-transitory, tangible, computer-readable storage medium. Therefore, in various embodiments, the systems described herein may receive a request for tailored content, facilitate a service dialog to obtain information related to the request, and communicate a plurality of tailored content based upon the information related to the request. Further, in various embodiments, the systems may identify tailored content based upon a consumer profile, communicate the tailored content to a web client, and/or receive a selection of the tailored content. Further still, in various embodiments, the systems may modify a magazine (e.g., content that is presented electronically) based upon tailored content. In various embodiments, the methods described herein may comprise identifying tailored content, communicating the tailored content to a web client, and receiving a selection of the tailored content. Tailored content may be based upon a consumer profile, and a payment may be processed in association with the tailored content in response, for example, to the receiving the tailored content. The methods may further comprise identifying tailored content comprising a plurality of tailored options, identifying the tailored content based upon a reminder associated with a consumer, identifying, the tailored content in response to a request by a consumer, and/or communicating information associated with the tailored content to the web client. In various embodiments, the methods described herein may comprise identifying tailored content based upon a consumer profile, and modifying a magazine base...",
  "patent_number": "9501788",
  "abstract": "The present disclosure identifies and/or delivers tailored content based upon a service dialog. For example, the systems may receive a request for tailored content, facilitate a service dialog to obtain information related to the request, and communicate a plurality of tailored content based upon the information related to the request. Further, the systems may identify tailored content based upon a consumer profile, communicate the tailored content to a web client, and/or receive a selection of the tailored content. Further still, the systems may modify a magazine (e.g., content that is presented electronically) based upon tailored content.",
  "publication_number": "US20160210676A1-20160721",
  "_processing_info": {
    "original_size": 141938,
    "optimized_size": 3208,
    "reduction_percent": 97.74
  }
}