{
  "decision": "PENDING",
  "application_number": "15085588",
  "date_published": "20171005",
  "date_produced": "20170920",
  "title": "CROSS OBJECTS DE-DUPLICATION",
  "filing_date": "20160330",
  "inventor_list": [
    {
      "inventor_name_last": "DOAN",
      "inventor_name_first": "Dai Duong",
      "inventor_city": "Alameda",
      "inventor_state": "CA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "JAGOTA",
      "inventor_name_first": "Arun Kumar",
      "inventor_city": "Sunnyvale",
      "inventor_state": "CA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "KER",
      "inventor_name_first": "Chenghung",
      "inventor_city": "Burlingame",
      "inventor_state": "CA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "VAISHNAV",
      "inventor_name_first": "Parth",
      "inventor_city": "Cupertino",
      "inventor_state": "CA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "DVINOV",
      "inventor_name_first": "Danil",
      "inventor_city": "San Francisco",
      "inventor_state": "CA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Kudriavtsev",
      "inventor_name_first": "Dmytro",
      "inventor_city": "Belmont",
      "inventor_state": "CA",
      "inventor_country": "US"
    }
  ],
  "ipcr_labels": [
    "G06F1730"
  ],
  "main_ipcr_label": "G06F1730",
  "summary": "<SOH> BRIEF SUMMARY <EOH>For some embodiments, methods and systems for identifying duplicate records in multiple objects associated with a database system may include combining records associated with a first object with records associated with a second object to generate a third object, wherein the first object is related to the second object; performing de-duplication on the third object to generate a combined group of duplicate sets; and from the combined group of duplicate sets, identifying at least one duplicate set associated with both the first object and the second object based on the duplicate set having at least one record associated with the first object and at least one record associated with the second object. Other aspects and advantages of the present invention can be seen on review of the drawings, the detailed description and the claims, which follow.",
  "patent_number": "None",
  "abstract": "Some embodiments of the present invention include a method for determining duplicate records in multiple objects and may include combining records associated with a first object with records associated with a second object to generate a third object, wherein the first object is related to the second object; performing de-duplication on the third object to generate a combined group of duplicate sets; and from the combined group of duplicate sets, identifying at least one duplicate set associated with both the first object and the second object based on the duplicate set having at least one record associated with the first object and at least one record associated with the second object.",
  "publication_number": "US20170286441A1-20171005",
  "_processing_info": {
    "original_size": 95341,
    "optimized_size": 2836,
    "reduction_percent": 97.03
  }
}