{
  "decision": "PENDING",
  "application_number": "15086998",
  "date_published": "20160728",
  "date_produced": "20160713",
  "title": "ON-BOARDING FRAMEWORK",
  "filing_date": "20160331",
  "inventor_list": [
    {
      "inventor_name_last": "Maguire",
      "inventor_name_first": "Matthew",
      "inventor_city": "Fort Mill",
      "inventor_state": "SC",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Kallikadavil",
      "inventor_name_first": "Arun",
      "inventor_city": "Charlotte",
      "inventor_state": "NC",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Christopher",
      "inventor_name_first": "Hope A.",
      "inventor_city": "Charlotte",
      "inventor_state": "NC",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Gudapati",
      "inventor_name_first": "Praveen",
      "inventor_city": "New York",
      "inventor_state": "NY",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Martin",
      "inventor_name_first": "Adam S.",
      "inventor_city": "Charlotte",
      "inventor_state": "NC",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Purohit",
      "inventor_name_first": "Navneet",
      "inventor_city": "East Brunswick",
      "inventor_state": "NJ",
      "inventor_country": "US"
    }
  ],
  "ipcr_labels": [
    "G06Q3000",
    "G06F30484"
  ],
  "main_ipcr_label": "G06Q3000",
  "summary": "<SOH> SUMMARY <EOH>The following presents a simplified summary of one or more embodiments of the present invention, in order to provide a basic understanding of such embodiments. This summary is not an extensive overview of all contemplated embodiments, and is intended to neither identify key or critical elements of all embodiments nor delineate the scope of any or all embodiments. Its sole purpose is to present some concepts of one or more embodiments of the present invention in a simplified form as a prelude to the more detailed description that is presented later. Generally, systems, computer program products, and methods are described herein for an application and system integration framework that provides interoperability and scalability for user interfaces and workflow processes within and/or between institutions. Embodiments of the invention comprise systems, computer program products, and methods for an on-boarding framework invention comprising receiving an indication from a first user of an institution to log into an on-boarding application for on-boarding one or more entities to comply with compliance regulations; identifying an on-boarding template for the on-boarding application; determining first user profile data, wherein the first user profile data comprises a first user type and associated first user style-sheet; displaying an on-boarding interface to the first user based on the first user type and the first user style-sheet; receiving an entity selection from the first user to on-board an entity within the on-boarding interface; determining a plurality of first on-boarding questions and pre-defined answers; displaying the plurality of first on-boarding questions and pre-defined answers in the on-boarding interface based on the template; receiving an action from the first user that answers one or more of the plurality of first on-boarding questions; storing the answers to the one or more of the plurality of first on-boarding questions; determining o...",
  "patent_number": "None",
  "abstract": "The on-boarding framework consolidates and ensures consistent implementation of business compliance with regulatory policy across a global business that is required to comply with regulations of international, regional, country specific, local jurisdictions, or the like. The on-boarding framework facilitates the work flow, approvals, documents, reporting, and other information using dynamic rules that dictate the on-boarding elements based on customer type, booking entity, location of the authorized approval, special products, data collected, and the like, which are used to dynamically evaluate the client's on-boarding potential regulatory issues, and the actions used to mitigate potential regulatory issues with the entity being on-boarded.",
  "publication_number": "US20160217474A1-20160728",
  "_processing_info": {
    "original_size": 84168,
    "optimized_size": 4032,
    "reduction_percent": 95.21
  }
}