{
  "date_produced": "20170920",
  "publication_number": "US20170286829A1-20171005",
  "main_ipcr_label": "G06N308",
  "decision": "PENDING",
  "application_number": "15088198",
  "inventor_list": [
    {
      "inventor_name_last": "Chen",
      "inventor_name_first": "Gregory K.",
      "inventor_city": "Hillsboro",
      "inventor_state": "OR",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Kumar",
      "inventor_name_first": "Raghavan",
      "inventor_city": "Hillsboro",
      "inventor_state": "OR",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Sumbul",
      "inventor_name_first": "Huseyin E.",
      "inventor_city": "Hillsboro",
      "inventor_state": "OR",
      "inventor_country": "US"
    }
  ],
  "abstract": "Systems and methods for event-driven learning with spike timing dependent plasticity in neuromorphic computers are disclosed. A neuromorphic processor includes a synapse coupled to a pre-synaptic neuron and coupled to a post-synaptic neuron, the synapse including a synapse memory to store a synapse weight and synapse spike timing dependent plasticity (STDP) circuit coupled to the synapse memory. The pre-synaptic neuron includes a pre-synaptic neuron memory to store a pre-synaptic neuron spike history and a pre-synaptic neuron STDP circuit coupled to the pre-synaptic neuron memory, the pre-synaptic neuron STDP circuit to, in response to the pre-synaptic neuron firing, initiate performing long term potentiation. The post-synaptic neuron includes a post-synaptic neuron memory storing a post-synaptic neuron spike history and a post-synaptic neuron STDP circuit coupled to the post-synaptic neuron memory to, in response to the post-synaptic neuron firing, initiate performing long term depres...",
  "filing_date": "20160401",
  "patent_number": "None",
  "summary": "",
  "date_published": "20171005",
  "title": "Event-driven Learning and Reward Modulation with Spike Timing Dependent Plasticity in Neuromorphic Computers",
  "ipcr_labels": [
    "G06N308",
    "G06N3063"
  ],
  "_processing_info": {
    "original_size": 139436,
    "optimized_size": 1910,
    "reduction_percent": 98.63
  }
}