{
  "date_produced": "20161102",
  "publication_number": "US20160335547A1-20161117",
  "main_ipcr_label": "G06N504",
  "decision": "PENDING",
  "application_number": "15089659",
  "inventor_list": [
    {
      "inventor_name_last": "HASEGAWA",
      "inventor_name_first": "Eiji",
      "inventor_city": "Kawasaki",
      "inventor_state": "",
      "inventor_country": "JP"
    }
  ],
  "abstract": "An information processing device includes a processor configured to: acquire information of first status that represents a state of a first detection target; specify state transition in which the first status is changed based on the acquired information of the first status; acquire information of second status that represents a state of a second detection target; specify state transition in which the second status is changed based on the acquired information of the second status; specify a time point earlier than a first time point at which the state transition of the second status is specified as a second time point at which the state transition of the second status occurs; determine whether a combination of the second status and the first status at least at the second time point satisfies a predetermined condition; and perform predetermined processing according to a determination result indicating the condition is satisfied.",
  "filing_date": "20160404",
  "patent_number": "None",
  "summary": "<SOH> SUMMARY <EOH>According to an aspect of the invention, an information processing device includes a processor configured to: acquire information of first status that represents a state of a first detection target; specify state transition in which the first status is changed based on the acquired information of the first status; acquire information of second status that represents a state of a second detection target; specify state transition in which the second status is changed based on the acquired information of the second status; specify a time point earlier than a first time point at which the state transition of the second status is specified as a second time point at which the state transition of the second status occurs; determine whether a combination of the second status and the first status at least at the second time point satisfies a predetermined condition; and perform predetermined processing according to a determination result indicating the condition is satisfied. The object and advantages of the invention will be realized and attained by means of the elements and combinations particularly pointed out in the claims. It is to be understood that both the foregoing general description and the following detailed description are exemplary and explanatory and are not restrictive of the invention, as claimed.",
  "date_published": "20161117",
  "title": "INFORMATION PROCESSING DEVICE, METHOD, AND COMPUTER READABLE MEDIUM",
  "ipcr_labels": [
    "G06N504"
  ],
  "_processing_info": {
    "original_size": 101024,
    "optimized_size": 2835,
    "reduction_percent": 97.19
  }
}