{
  "date_produced": "20170920",
  "publication_number": "US20170286854A1-20171005",
  "main_ipcr_label": "G06N700",
  "decision": "PENDING",
  "application_number": "15085491",
  "inventor_list": [
    {
      "inventor_name_last": "ARDIS",
      "inventor_name_first": "Paul Alex",
      "inventor_city": "Niskayuna",
      "inventor_state": "NY",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "XU",
      "inventor_name_first": "Yunwen",
      "inventor_city": "Niskayuna",
      "inventor_state": "NY",
      "inventor_country": "US"
    }
  ],
  "abstract": "A method for automatic revision of a predictive damage model that assess a physical system and provides maintenance recommendations to a user platform includes evaluating the predictive model at periodic intervals, identifying alternate parameters for the model that satisfy real-world physical constraints, determining an impact of the alternate parameters on an accuracy of the predictive model, forecasting performance of a predictive model modified with the alternate parameters, optimizing data driven terms of the predictive model by deploying the alternate parameters, and providing updated maintenance recommendations to a user platform display based on the modified predictive model. The method can also include comparing the one or more maintenance recommendations to actual maintenance experiences on the physical system, and also performing a heuristic parameter search for the data-driven terms. A non-transitory computer readable medium containing executable instructions and a system f...",
  "filing_date": "20160330",
  "patent_number": "None",
  "summary": "<SOH> BRIEF DESCRIPTION OF THE DRAWINGS <EOH>FIG. 1 depicts a process for predictive performance improvement, in accordance with embodiments; and FIG. 2 depicts a high-level architecture of an exemplary system, in accordance with embodiments. detailed-description description=\"Detailed Description\" end=\"lead\"?",
  "date_published": "20171005",
  "title": "AUTOMATIC REVISION OF A PREDICTIVE DAMAGE MODEL",
  "ipcr_labels": [
    "G06N700",
    "G06N502"
  ],
  "_processing_info": {
    "original_size": 21872,
    "optimized_size": 2006,
    "reduction_percent": 90.83
  }
}