{
  "decision": "ACCEPTED",
  "application_number": "15081436",
  "date_published": "20170928",
  "date_produced": "20170914",
  "title": "MEMORY HEATER AND HEATING AID ARRANGEMENT",
  "filing_date": "20160325",
  "inventor_list": [
    {
      "inventor_name_last": "CHOU",
      "inventor_name_first": "Chun-Hung",
      "inventor_city": "New Taipei City",
      "inventor_state": "",
      "inventor_country": "TW"
    },
    {
      "inventor_name_last": "FANG",
      "inventor_name_first": "Chih-Liang",
      "inventor_city": "New Taipei City",
      "inventor_state": "",
      "inventor_country": "TW"
    }
  ],
  "ipcr_labels": [
    "G06F120",
    "G06F118",
    "H05K102",
    "H05B326",
    "H05K118"
  ],
  "main_ipcr_label": "G06F120",
  "summary": "<SOH> SUMMARY OF THE INVENTION <EOH>The present invention has been accomplished under the circumstances in view. It is therefore one object of the present invention to provide a memory heater and heating aid arrangement, which comprises a circuit module, which comprises a circuit board, a plurality of memory modules mounted at the circuit board, a memory heat sink wrapped around each memory module and a locating member mounted at the circuit board around the memory modules, a heating aid, which comprises a flat heat-transfer base panel bonded to a top side of the memory heat sinks, a mounting structure located at the border of the flat heat-transfer panel and affixed to the locating member to secure the heating aid to the circuit module, and a heater, which is attached to the top surface of the flat heat-transfer base panel of the heating aid and controllable by the circuit module to emit heat. Thus, the heater can emit heat through the heating aid to heat the memory heat sink and the memories, enabling the memories to work under a cold environment. It is another object of the present invention to provide a memory heater and heating aid arrangement, which utilizes the heating air to transfer heat energy from the heater to the memory modules for heating the memories, enabling the memories to work under a cold environment. Subject to the functioning of the heating aid, one single heater is sufficient to heat the memories, saving the cost. It is still another object of the present invention to provide a memory heater and heating aid arrangement, which enables the heater to be bonded to the top surface of the flat heat-transfer base panel of the heating aid, the planar heat spreader to be closely set between the rows of memory heat sinks of the circuit module and the heating aid, and the mounting structure of the heating aid to be affixed to the locating member of the circuit module, facilitating installation and minimizing installation cost. It is still another object ...",
  "patent_number": "9772664",
  "abstract": "A memory heater and heating air arrangement includes circuit module including circuit board, a plurality of memory modules mounted at the circuit board, memory heat sink wrapped around each memory module and locating member mounted at the circuit board around the memory modules, heating aid including flat heat-transfer base panel bonded to top side of the memory heat sinks, mounting structure located at the border of the flat heat-transfer panel and affixed to the locating member to secure the heating aid to the circuit module, and a heater attached to a top surface of the flat heat-transfer base panel of the heating aid and controllable by the circuit module to emit heat to the memory modules via the heating aid, enabling the memory modules to work under a cold environment. Subject to the functioning of the heating aid, one single heater is sufficient to heat the memories, saving the cost.",
  "publication_number": "US20170277234A1-20170928",
  "_processing_info": {
    "original_size": 24415,
    "optimized_size": 3639,
    "reduction_percent": 85.1
  }
}