{
  "date_produced": "20170906",
  "publication_number": "US20170270431A1-20170921",
  "main_ipcr_label": "G06N9900",
  "decision": "PENDING",
  "application_number": "15080030",
  "inventor_list": [
    {
      "inventor_name_last": "Hosabettu",
      "inventor_name_first": "Raghavendra",
      "inventor_city": "Bangalore",
      "inventor_state": "",
      "inventor_country": "IN"
    },
    {
      "inventor_name_last": "Ramanna",
      "inventor_name_first": "RamPrasad Kanakatte",
      "inventor_city": "Bangalore",
      "inventor_state": "",
      "inventor_country": "IN"
    },
    {
      "inventor_name_last": "Mannopantar",
      "inventor_name_first": "Raghottam",
      "inventor_city": "Bangalore",
      "inventor_state": "",
      "inventor_country": "IN"
    },
    {
      "inventor_name_last": "Ananthasankaranarayanan",
      "inventor_name_first": "Ponnusamy",
      "inventor_city": "Bangalore",
      "inventor_state": "",
      "inventor_country": "IN"
    },
    {
      "inventor_name_last": "Natarajan",
      "inventor_name_first": "Harihara Vinayakaram",
      "inventor_city": "Bangalore",
      "inventor_state": "",
      "inventor_country": "IN"
    }
  ],
  "abstract": "Methods, devices, and non-transitory computer readable media that add interoperable BOTs to a stored BOT inventory. Each of the BOTs is associated with a BOT type, has a common structure, and automates at least a portion of an enterprise process. Assembly rules are obtained. Each of the assembly rules includes one or more constraints for inclusion of one or more of the BOTs in one or more of a plurality of workflows based on the one of the BOT types associated with each of the one or more of the BOTs. The workflows are assembled based on one or more the assembly rules. Each of the workflows comprises a subset of the BOTs and each BOT of the subsets of the BOTs is included in one or more of the workflows based on at least one of an associated functionality, performance, or service level.",
  "filing_date": "20160324",
  "patent_number": "None",
  "summary": "<SOH> SUMMARY <EOH>A method for creating automated dynamic workflows of interoperable BOTs includes adding, by an enterprise BOT management computing device, a plurality of interoperable BOTs to a stored BOT inventory. Each of the BOTs is associated with one of a plurality of BOT types, has a common structure, and automates at least a portion of an enterprise process. A plurality of assembly rules is obtained by the enterprise BOT management computing device. Each of the assembly rules includes one or more constraints for inclusion of one or more of the BOTs in one or more of a plurality of workflows based on the one of the BOT types associated with each of the one or more of the BOTs. The plurality of workflows is assembled by the enterprise BOT management computing device based on one or more the assembly rules. Each of the workflows includes a subset of the BOTs and each BOT of the subsets of the BOTs is included in one or more of the workflows based on at least one of an associated functionality, performance, or service level. An enterprise bot management computing device includes memory comprising programmed instructions stored in the memory and one or more processors configured to be capable of executing the programmed instructions stored in the memory to add a plurality of interoperable BOTs to a stored BOT inventory. Each of the BOTs is associated with one of a plurality of BOT types, has a common structure, and automates at least a portion of an enterprise process. A plurality of assembly rules is obtained. Each of the assembly rules includes one or more constraints for inclusion of one or more of the BOTs in one or more of a plurality of workflows based on the one of the BOT types associated with each of the one or more of the BOTs. The plurality of workflows is assembled based on one or more the assembly rules. Each of the workflows includes a subset of the BOTs and each BOT of the subsets of the BOTs is included in one or more of the workflows based on a...",
  "date_published": "20170921",
  "title": "METHODS FOR CREATING AUTOMATED DYNAMIC WORKFLOWS OF INTEROPERABLE BOTS AND DEVICES THEREOF",
  "ipcr_labels": [
    "G06N9900",
    "G06F948"
  ],
  "_processing_info": {
    "original_size": 69194,
    "optimized_size": 4034,
    "reduction_percent": 94.17
  }
}