{
  "decision": "PENDING",
  "application_number": "15083630",
  "date_published": "20160825",
  "date_produced": "20160810",
  "title": "Method For Predicting Arc Flash Energy And PPE Category Within A Real-Time Monitoring System",
  "filing_date": "20160329",
  "inventor_list": [
    {
      "inventor_name_last": "Radibratovic",
      "inventor_name_first": "Branislav",
      "inventor_city": "San Diego",
      "inventor_state": "CA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Nasle",
      "inventor_name_first": "Ali",
      "inventor_city": "San Diego",
      "inventor_state": "CA",
      "inventor_country": "US"
    }
  ],
  "ipcr_labels": [
    "G06F1750",
    "G06F1710"
  ],
  "main_ipcr_label": "G06F1750",
  "summary": "<SOH> SUMMARY <EOH>Methods for making real-time predictions about an arc flash event on an electrical system are disclosed. In one aspect, a method for simulating an arc flash event on an electrical power system is disclosed. The virtual system model of the electrical system is modified to introduce a short circuiting feature. The standard to supply equations used in the arc flash event calculations is chosen. The arc flash event is simulated using the modified virtual system model in accordance with the chosen standard. The quantity of arc energy released by the arc flash event is calculated using results from the simulation. The report that forecasts an aspect of the arc flash event is communicated. These and other features, aspects, and embodiments of the invention are described below in the section entitled “Detailed Description.”",
  "patent_number": "None",
  "abstract": "Systems and methods for making real-time predictions about an arc flash event on an electrical system are disclosed. A virtual system model database is operable for providing a virtual system model for the electrical system and continuously update the virtual system model with real-time data from the electrical system. An analytics server comprises an arch flash simulation engine. The arch flash simulation engine is operable to modify the virtual system model to introduce a short-circuit feature to an uninterrupted power supply bypass circuit branch; choose a standard to supply equations used for arc flash event simulation and energy calculation; simulate an arc flash event utilizing the modified virtual system model; calculate a quantity of arc energy released by the arc flash event using results from the simulation; and communicate a report that forecasts an aspect of the arc flash event.",
  "publication_number": "US20160246905A1-20160825",
  "_processing_info": {
    "original_size": 130199,
    "optimized_size": 2503,
    "reduction_percent": 98.08
  }
}