{
  "date_produced": "20160706",
  "publication_number": "US20160210554A1-20160721",
  "main_ipcr_label": "G06N502",
  "decision": "PENDING",
  "application_number": "15082988",
  "inventor_list": [
    {
      "inventor_name_last": "Murphy",
      "inventor_name_first": "Robert Craig",
      "inventor_city": "Denver",
      "inventor_state": "CO",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Bacon",
      "inventor_name_first": "Bruce Allen",
      "inventor_city": "Castle Rock",
      "inventor_state": "CO",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Gallanis",
      "inventor_name_first": "Peter T.",
      "inventor_city": "Highlands Ranch",
      "inventor_state": "CO",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Teflian",
      "inventor_name_first": "Mark Samuel",
      "inventor_city": "Parker",
      "inventor_state": "CO",
      "inventor_country": "US"
    }
  ],
  "abstract": "A commercial process with a dependent variable can be associated with a set of independent variables. The commercial process can continuously provide data collection opportunities. An intervention is designed using a model to predict the dependent outcome. The actual outcome of the intervention can be determined within the window of utility for these data. One objective is to improve intervention outcomes with prediction. Purely random outcomes (no model prediction) and outcomes resulting from the intervention (model operations) are aggregated into separate files—a sequence of control model data files and a sequence of model data files of operational data. These model data files and control model data files are used to analyze model performance and to react automatically when identified conditions warrant.",
  "filing_date": "20160328",
  "patent_number": "None",
  "summary": "<SOH> SUMMARY <EOH>It is one aspect of the present disclosure to provide a complete Operational Intelligence Platform. In particular, it is one aspect of the present disclosure to provide a dynamic model data facility. It is another aspect of the present disclosure to provide techniques, algorithms, systems, and operational data management artifacts for building, using, and updating such dynamic models to be operative and accurate on a business real-time basis while increasing data mining and predictive analysis professionals' productivity by an order of magnitude.",
  "date_published": "20160721",
  "title": "DYNAMIC MODEL DATA FACILITY AND AUTOMATED OPERATIONAL MODEL BUILDING AND USAGE",
  "ipcr_labels": [
    "G06N502"
  ],
  "_processing_info": {
    "original_size": 65627,
    "optimized_size": 2420,
    "reduction_percent": 96.31
  }
}