{
  "decision": "PENDING",
  "application_number": "15081748",
  "date_published": "20161027",
  "date_produced": "20161012",
  "title": "Graphical User Interface and Methods of Use Thereof in a Multimedia Player",
  "filing_date": "20160325",
  "inventor_list": [
    {
      "inventor_name_last": "Robbin",
      "inventor_name_first": "Jeffrey L.",
      "inventor_city": "Los Altos",
      "inventor_state": "CA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Jobs",
      "inventor_name_first": "Steve",
      "inventor_city": "Palo Alto",
      "inventor_state": "CA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Wasko",
      "inventor_name_first": "Timothy",
      "inventor_city": "High River",
      "inventor_state": "",
      "inventor_country": "CA"
    },
    {
      "inventor_name_last": "Christie",
      "inventor_name_first": "Greg",
      "inventor_city": "San Jose",
      "inventor_state": "CA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Chaudhri",
      "inventor_name_first": "Imran",
      "inventor_city": "San Francisco",
      "inventor_state": "CA",
      "inventor_country": "US"
    }
  ],
  "ipcr_labels": [
    "G06F30482",
    "G06F316",
    "G06F1730",
    "G06F30485"
  ],
  "main_ipcr_label": "G06F30482",
  "summary": "<SOH> SUMMARY OF THE INVENTION <EOH>The invention described herein pertains to a user interface that provides for a user friendly and efficient retrieval of stored multimedia asset files. In one embodiment, a method of assisting user interaction with a multimedia asset player by way of a hierarchically ordered user interface is described. A first order user interface having a first list of user selectable items is displayed and a user selection of one of the user selectable items is received. Based upon the user selection, automatically transitioning to and displaying a second order user interface. In a portable media asset player, a method of selecting and playing a media asset from a group of media assets stored therein is described. A first user interface is displayed on the portable media asset player having a first number of items each of which is associated with a particular grouping of the stored media assets. A selection of one of the first number of items is received and based upon the selected one of the first number of items, automatically transitioning to a second user interface displayed on the portable media asset player that includes a second number of items each of which is associated with the selected item. In a portable, pocket-sized multimedia asset player, a method of selecting and playing a multimedia asset from a group of multimedia assets stored therein is described. At a home interface, displaying a playlist list item which points to a number of playlists stored in the multimedia asset player, wherein each playlist is a user customizable group of multimedia asset files, an artists item corresponding to all of a number of artists each of which is associated with at least one of the stored multimedia asset, and a songs list item associated with each of the stored multimedia assets. Highlighting a desired one of the playlist list item, the artists item, or the songs list item, selecting the highlighted item, and automatically transitioning to a ...",
  "patent_number": "None",
  "abstract": "In a portable multimedia device, a method, apparatus, and system for providing user supplied configuration data are described. In one embodiment, a hierarchically ordered graphical user interface is provided. A first order, or home, interface provides a highest order of user selectable items each of which, when selected, results in an automatic transition to a lower order user interface associated with the selected item. In one of the described embodiments, the lower order interface includes other user selectable items associated with the previously selected item from the higher order user interface.",
  "publication_number": "US20160313873A1-20161027",
  "_processing_info": {
    "original_size": 29248,
    "optimized_size": 3802,
    "reduction_percent": 87.0
  }
}