{
  "decision": "PENDING",
  "application_number": "15089905",
  "date_published": "20170323",
  "date_produced": "20170309",
  "title": "SYSTEMS AND METHODS FOR INTERFACING WITH A USER OF A NETWORK OF MOVING THINGS",
  "filing_date": "20160404",
  "inventor_list": [
    {
      "inventor_name_last": "Costa",
      "inventor_name_first": "Rui",
      "inventor_city": "S. Joao das Lampas",
      "inventor_state": "",
      "inventor_country": "PT"
    },
    {
      "inventor_name_last": "Figueiredo",
      "inventor_name_first": "Diogo",
      "inventor_city": "Ovar",
      "inventor_state": "",
      "inventor_country": "PT"
    }
  ],
  "ipcr_labels": [
    "H04L1224",
    "G06F30482",
    "G06F30484",
    "G06F9445",
    "H04L1226",
    "H04W2408"
  ],
  "main_ipcr_label": "H04L1224",
  "summary": "<SOH> SUMMARY <EOH>Various aspects of this disclosure provide systems and methods for interfacing with a user of a network of moving things. As a non-limiting example, various aspects of this disclosure provide communication network architectures, systems, and methods for supporting a communication network comprising a complex array of both static and moving communication nodes (e.g., the Internet of moving things).",
  "patent_number": "None",
  "abstract": "A system comprises network operations center (NOC) circuitry operable to communicate, over a network, with a plurality of mobile access points to collect data indicative of a status of each of the plurality of mobile access points. The NOC circuitry is operable to generate a plurality of graphical user interface elements of a graphical user interface, wherein each of the user interface elements presents a portion of the collected data and is configured to be transmitted over the network and is configured to be transmitted over the network. The NOC circuitry is operable to determine, based on one or more characteristics of the end-user device and/or of a user of the end-user device, which one or more of the user interface elements to generate and transmit over the network in response to a request.",
  "publication_number": "US20170085436A1-20170323",
  "_processing_info": {
    "original_size": 161998,
    "optimized_size": 1999,
    "reduction_percent": 98.77
  }
}