{
  "date_produced": "20170110",
  "publication_number": "US20170024653A1-20170126",
  "main_ipcr_label": "G06N504",
  "decision": "PENDING",
  "application_number": "15085939",
  "inventor_list": [
    {
      "inventor_name_last": "DESHMUKH",
      "inventor_name_first": "SACHIN NARHARI",
      "inventor_city": "PUNE",
      "inventor_state": "",
      "inventor_country": "IN"
    },
    {
      "inventor_name_last": "PRASAD",
      "inventor_name_first": "MALAY SAURABH",
      "inventor_city": "PUNE",
      "inventor_state": "",
      "inventor_country": "IN"
    },
    {
      "inventor_name_last": "DAMOJIPURAPU",
      "inventor_name_first": "VENKATA NAGA MAHESHWAR",
      "inventor_city": "PUNE",
      "inventor_state": "",
      "inventor_country": "IN"
    },
    {
      "inventor_name_last": "KOTHARI",
      "inventor_name_first": "NARESHKUMAR MADANLAL",
      "inventor_city": "IRVING",
      "inventor_state": "TX",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "NAMBIAR",
      "inventor_name_first": "SANJAY RAMCHANDRAN",
      "inventor_city": "BANGALORE",
      "inventor_state": "",
      "inventor_country": "IN"
    },
    {
      "inventor_name_last": "APTE",
      "inventor_name_first": "SHIVAJI BAL",
      "inventor_city": "BANGALORE",
      "inventor_state": "",
      "inventor_country": "IN"
    }
  ],
  "abstract": "A computer implemented method to optimize system process is disclosed. The received one or more input data is transformed into a predefined format based on transformation rules. The transformed one or more input data is analyzed at an analyzer, based on one or more pre-defined rules associated with a rule engine. A result associated with an inference is generated at the inference generator, from the analyzed one or more input data, based on automation rules. The generated inference may be one of a positive or a negative. When the generated inference is positive, one or more processes associated with the customer service optimization is simulated at the optimization engine, through a graphical processor. The result of the inference generator and the optimization engine are checked against the one or more processes. The result of the inference generator and the optimization engine may be stored at the data repository.",
  "filing_date": "20160330",
  "patent_number": "None",
  "summary": "<SOH> SUMMARY <EOH>Disclosed are a method, a system and/or an apparatus to optimize system process in a service environment. In one aspect, a computer implemented method to optimize system process is disclosed. A system may be a physical entity for computing one or more large software projects. The method involves receiving one or more of an input data and an iteration data from a data repository. The one or more input data may be one or more of a desktop data, a network data, an external feed data and/or a knowledge base data. The received one or more input data is transformed into a predefined format compatible with an inference generator. The transformation is performed at a data transformer based on one or more data transformation rules. The transformed one or more input data and the iteration data is analyzed at an analyzer, based on one or more pre-defined rules associated with a rule engine. The step of analysis may comprise identifying one or more patterns in the transformed one or more input data, quantifying the transformed one or more input data, and extracting one or more insights from the transformed one or more input data. A result associated with an inference is generated at the inference generator, from the analyzed one or more input data and the iteration data. The result associated with the inference is generated based on one or more of automation rules and/or collaboration rules. The generated inference may be one of a positive or a negative. When the generated inference is positive, one or more workflow processes associated with a customer service system and/or an enterprise is simulated at an optimization engine, through one or more graphical processors. The result of the inference generator and an output of the optimization engine are checked against the one or more workflow processes. The result of the inference generator and the output of the optimization engine may be stored at the data repository. In another aspect, a system process optimiz...",
  "date_published": "20170126",
  "title": "METHOD AND SYSTEM TO OPTIMIZE CUSTOMER SERVICE PROCESSES",
  "ipcr_labels": [
    "G06N504"
  ],
  "_processing_info": {
    "original_size": 93161,
    "optimized_size": 4251,
    "reduction_percent": 95.44
  }
}