{
  "date_produced": "20170920",
  "publication_number": "US20170286855A1-20171005",
  "main_ipcr_label": "G06N700",
  "decision": "PENDING",
  "application_number": "15089832",
  "inventor_list": [
    {
      "inventor_name_last": "HAO",
      "inventor_name_first": "Jianxiu",
      "inventor_city": "Acton",
      "inventor_state": "MA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Yin",
      "inventor_name_first": "Fenglin",
      "inventor_city": "Lexington",
      "inventor_state": "MA",
      "inventor_country": "US"
    }
  ],
  "abstract": "A device may receive first data items and second data items that may have been output by sensor devices. The device may add, to a node in a data structure, at least some of the first data items. The device may divide the node to create subnodes that correspond to subregions of a geographic region. The device may add, to at least one of the subnodes, at least some of the second data items. The device may generate a probability of a first relationship, between the first data items and the second data items, based on determining subnodes that include a first data item and determining subnodes that exhibit a predefined second relationship with a second data item. The device may send, to another device, the probability of the first relationship to support location-based services.",
  "filing_date": "20160404",
  "patent_number": "None",
  "summary": "<SOH> BRIEF DESCRIPTION OF THE DRAWINGS <EOH>FIGS. 1A and 1B are diagrams of an overview of an example implementation described herein; FIG. 2 is a diagram of an example environment in which systems and/or methods, described herein, may be implemented; FIG. 3 is a diagram of example components of one or more devices of FIG. 2 ; and FIG. 4 is a flow chart of an example process for determining a probability of a relationship between layers of geographic information system data. detailed-description description=\"Detailed Description\" end=\"lead\"?",
  "date_published": "20171005",
  "title": "DETERMINING A PROBABILITY OF A RELATIONSHIP BETWEEN LAYERS OF GEOGRAPHIC INFORMATION SYSTEM DATA",
  "ipcr_labels": [
    "G06N700",
    "H04W400",
    "H04W402"
  ],
  "_processing_info": {
    "original_size": 65318,
    "optimized_size": 2080,
    "reduction_percent": 96.82
  }
}