{
  "decision": "PENDING",
  "application_number": "15085926",
  "date_published": "20171005",
  "date_produced": "20170920",
  "title": "DEVICE, SYSTEM AND METHOD TO MITIGATE LOSS OF SIGNAL INTEGRITY IN A COMMUNICATION OF IMAGE INFORMATION",
  "filing_date": "20160330",
  "inventor_list": [
    {
      "inventor_name_last": "Bin Abdullah",
      "inventor_name_first": "Mohd Muhaiyiddin",
      "inventor_city": "Kepala Batas",
      "inventor_state": "",
      "inventor_country": "MY"
    },
    {
      "inventor_name_last": "Chew",
      "inventor_name_first": "Chee Kit",
      "inventor_city": "Georgetown",
      "inventor_state": "",
      "inventor_country": "MY"
    },
    {
      "inventor_name_last": "Chen",
      "inventor_name_first": "Chung-Hao",
      "inventor_city": "Portland",
      "inventor_state": "OR",
      "inventor_country": "US"
    }
  ],
  "ipcr_labels": [
    "H04N5213",
    "G06T520"
  ],
  "main_ipcr_label": "H04N5213",
  "summary": "<SOH> BRIEF DESCRIPTION OF THE DRAWINGS <EOH>The various embodiments of the present invention are illustrated by way of example, and not by way of limitation, in the figures of the accompanying drawings and in which: FIG. 1 is a perspective view of a device including circuit structures to communicate image information according to an embodiment. FIG. 2 is a flow diagram illustrating elements of a method to communicate image information according to an embodiment. FIG. 3 is a circuit diagram illustrating elements of a system to exchange image information according to an embodiment. FIG. 4 is a layout diagram illustrating circuit structures of a device to communicate image information according to an embodiment. FIG. 5 is a block diagram illustrating elements of a computing system for communicating sensor information according to an embodiment. FIG. 6 is a block diagram illustrating elements of a mobile device for communicating sensor information according to an embodiment. detailed-description description=\"Detailed Description\" end=\"lead\"?",
  "patent_number": "None",
  "abstract": "Techniques and mechanisms for exchanging image data via a three-wire data channel of an interconnect, at least a portion of which is disposed in or on a substrate of a printed circuit board. In an embodiment, three data signals are concurrently exchanged in parallel, each via a different respective trace portion of the data channel. The substrate has disposed therein or thereon three filter structures each to perform filtering of a different respective one of the three signals. The filter structures each include a respective sequence of corrugations to increase a stray capacitance provided by a substrate material. In another embodiment, the interconnect is compatible with a Mobile Industry Processor Interface (MIPI) camera physical layer interface (C-PHY) standard.",
  "publication_number": "US20170289410A1-20171005",
  "_processing_info": {
    "original_size": 51659,
    "optimized_size": 2744,
    "reduction_percent": 94.69
  }
}