{
  "date_produced": "20170920",
  "publication_number": "US20170286862A1-20171005",
  "main_ipcr_label": "G06N9900",
  "decision": "PENDING",
  "application_number": "15089859",
  "inventor_list": [
    {
      "inventor_name_last": "Mourabit",
      "inventor_name_first": "Mokhtar",
      "inventor_city": "New York",
      "inventor_state": "NY",
      "inventor_country": "US"
    }
  ],
  "abstract": "A computing and logic system for mirroring human memory involved in everyday role play, and printing a 3D clone of personality as an algorithm of prediction for feelings, thought patterns and behaviors in different situations of life. A user's computing device and mobile application installed on the user's device provide interaction between the user's device and a remote server running a server application, and a database, and aims to to help the user know themselves better through everyday situations. The server application is operatively coupled to the mobile application, which is adapted and configured to relay tailor-fitted text, audio and video content between the user and the server application via a web browser or the user's device. The server application and mobile application are adapted and configured to permit the user to interact anonymously with the server via a web site or the mobile application.",
  "filing_date": "20160404",
  "patent_number": "None",
  "summary": "<SOH> BRIEF DESCRIPTION OF THE DRAWINGS <EOH>FIG. 1 is a flowchart describing the logic behind the system of the present invention. FIG. 2 is a functional block diagram showing components of an embodiment fo the present invention. FIG. 3 is a flowchart describing an exemplary use of the system of the present invention. FIG. 4 is a simple sequential diagram illustrating principles of the present invention. FIG. 5 is a functional block diagram of an exemplary logical circuit for use with the present invention in which three sequential systems are described. FIG. 6 is a chronogram describing the logic of embodiments of the present invention. FIG. 7 is a block diagram describing an exemplary application using a system inherent to digicodes and elevators. FIG. 8 is a functional block diagram illustrating components of an embodiment of the present invention. FIG. 9 is a functional block diagram illustrating components of an embodiment of the present invention. FIG. 10 is a graphic describing logic sequences utilized in embodiments of the present invention. FIG. 11 is a depiction of various states of the system of the present invention. FIG. 12 depicts an example of an elevator shown with the interlocutor as the person answering the questions. FIG. 13 shows a logical circuit in which a state graph is designed from the initial state chosen. FIG. 14 is a state diagram illustrating another state of the system of the present invention. FIG. 15 is a state diagram illustrating another state of the system of the present invention. FIG. 16 is a state diagram illustrating another state of the system of the present invention. FIG. 17 is a Grafcet diagram describing elements of the system of the present invention. FIG. 18 is an illustration demonstrating the evolution of the Grafcet. FIG. 19 illustrates the package of steps and transitions for a single command within the application of the present invention. FIG. 20 shows a state diagram related to the illustration of FIG. 19 . FIG. ...",
  "date_published": "20171005",
  "title": "SYSTEM FOR MIRRORING HUMAN MEMORY AND GENERATING A THREE-DIMENSIONAL CLONE OF PERSONALITY",
  "ipcr_labels": [
    "G06N9900",
    "G06N310"
  ],
  "_processing_info": {
    "original_size": 66932,
    "optimized_size": 3516,
    "reduction_percent": 94.75
  }
}