{
  "decision": "PENDING",
  "application_number": "15092563",
  "date_published": "20171012",
  "date_produced": "20170927",
  "title": "PROCESS FOR ENHANCED CORROSION PROTECTION OF ANODIZED ALUMINUM",
  "filing_date": "20160406",
  "inventor_list": [
    {
      "inventor_name_last": "Curran",
      "inventor_name_first": "James A.",
      "inventor_city": "Morgan Hill",
      "inventor_state": "CA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Counts",
      "inventor_name_first": "William A.",
      "inventor_city": "Sunnyvale",
      "inventor_state": "CA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Paterson",
      "inventor_name_first": "Aaron D.",
      "inventor_city": "Livermore",
      "inventor_state": "CA",
      "inventor_country": "US"
    }
  ],
  "ipcr_labels": [
    "C25D1118",
    "C25D1120",
    "C25D1112",
    "H05K504",
    "G06F116"
  ],
  "main_ipcr_label": "C25D1118",
  "summary": "<SOH> SUMMARY <EOH>This paper describes various embodiments that relate to anodic oxide films and processes for enhancing the corrosion protection properties of anodic oxide films. The processes involve blocking pathways for water or other corrosion-inducing agents from reaching an underlying substrate via a crack or defect within an anodic oxide film. In particular embodiments, the methods involve thickening a barrier layer, or a portion of the barrier layer, of the anodic oxide film. According to one embodiment, a method of anodizing a substrate is described. The method includes performing a first anodizing operation on the substrate. The first anodizing operation forms an anodic film on the substrate. The method also includes performing an intermediate operation on the anodic film. The intermediate operation forms a defect within the anodic film that provides a pathway through the anodic film to substrate. The method further includes performing a second anodizing operation on the substrate. The second anodizing operation forms a metal oxide plug within the anodic film that blocks the pathway. According to another embodiment, an enclosure for an electronic device is described. The enclosure includes a metal substrate. The enclosure also includes an anodic coating covering a surface of the metal substrate. The anodic coating includes a defect region. The enclosure further includes a metal oxide plug within the defect region of the anodic film. According to a further embodiment, an enclosure for an electronic device is described. The enclosure includes a metal substrate having a surface with a surface feature. The enclosure also includes an anodic coating covering the surface of the metal substrate. The anodic coating includes a crack located near the surface feature of the metal substrate. The anodic coating includes a metal oxide plug within the crack. These and other embodiments will be described in detail below.",
  "patent_number": "None",
  "abstract": "Processes for enhancing the corrosion resistance of anodized substrates are disclosed. In some embodiments, the process involves a second anodizing operation that targets an area of the substrate that is left inadequately protected by a first anodizing operation, and also targets defects that may have been arisen from intermediate processing operations such as laser-marking operations. The second anodizing operation can be conducted in a non-pore-forming electrolyte, and grows a thick protective barrier film over inadequately protected areas of the substrate, such as laser-marking treated areas.",
  "publication_number": "US20170292202A1-20171012",
  "_processing_info": {
    "original_size": 59228,
    "optimized_size": 3453,
    "reduction_percent": 94.17
  }
}