{
  "decision": "PENDING",
  "application_number": "15095422",
  "date_published": "20161006",
  "date_produced": "20160921",
  "title": "SMARTPAD - DESKTOP",
  "filing_date": "20160411",
  "inventor_list": [
    {
      "inventor_name_last": "Sirpal",
      "inventor_name_first": "Sanjiv",
      "inventor_city": "Oakville",
      "inventor_state": "",
      "inventor_country": "CA"
    },
    {
      "inventor_name_last": "Gimpl",
      "inventor_name_first": "Martin",
      "inventor_city": "Helsinki",
      "inventor_state": "",
      "inventor_country": "FI"
    },
    {
      "inventor_name_last": "Milano",
      "inventor_name_first": "Eduardo Diego Torres",
      "inventor_city": "Burlington",
      "inventor_state": "",
      "inventor_country": "CA"
    }
  ],
  "ipcr_labels": [
    "G06F314",
    "H04B13827",
    "G09G512",
    "G06F3041",
    "G06F30488",
    "H04W6800",
    "G06F116"
  ],
  "main_ipcr_label": "G06F314",
  "summary": "<SOH> SUMMARY <EOH>There is a need for a dual multi-display handheld computing device that provides for enhanced power and/or versatility compared to conventional single display handheld computing devices. These and other needs are addressed by the various aspects, embodiments, and/or configurations of the present disclosure. Also, while the disclosure is presented in terms of exemplary embodiments, it should be appreciated that individual aspects of the disclosure can be separately claimed. Additionally, it is desirable to have the multi-display device be dockable or otherwise associatable with an additional device. In accordance with one exemplary embodiment, the multi-display device is dockable with a smartpad. The exemplary smartpad can include a screen, a touch sensitive display, a configurable area, a gesture capture region(s) and a camera. The smartpad can also include a port adapted to receive the device. The exemplary smartpad is able to cooperate with the device such that information displayable on the device is also displayable on the smartpad. Furthermore, any one or more of the functions on the device are extendable to the smartpad, with the smartpad capable of acting as an input/output interface or extension of the smartpad. Therefore, for example, information from one or more of the displays on the multi-screen device is displayable on the smartpad. The present disclosure can provide a number of advantages depending on the particular aspect, embodiment, and/or configuration. For example, the smartpad could provide additional display area to assist a user with viewing content on the device. Additionally, power sharing and management functions are available due to, for example, the larger size of the smartpad that could be used for power storage. Furthermore, the smartpad allows functions of a communications device to be extended to a tablet-like platform and/or form factor. Even further, the disclosure provides techniques directed toward translating or...",
  "patent_number": "None",
  "abstract": "A multi-display device is adapted to be dockable or otherwise associatable with an additional device. In accordance with one exemplary embodiment, the multi-display device is dockable with a smartpad. The exemplary smartpad can include a screen, a touch sensitive display, a configurable area, a gesture capture region(s) and a camera. The smartpad can also include a port adapted to receive the device. The exemplary smartpad is able to cooperate with the device such that information displayable on the device is also displayable on the smartpad. Furthermore, any one or more of the functions on the device are extendable to the smartpad, with the smartpad capable of acting as an input/output interface or extension of the smartpad. Therefore, for example, information from one or more of the displays on the multi-screen device is displayable on the smartpad.",
  "publication_number": "US20160291923A1-20161006",
  "_processing_info": {
    "original_size": 371031,
    "optimized_size": 3742,
    "reduction_percent": 98.99
  }
}