{
  "date_produced": "20170920",
  "publication_number": "US20170286865A1-20171005",
  "main_ipcr_label": "G06N9900",
  "decision": "PENDING",
  "application_number": "15091449",
  "inventor_list": [
    {
      "inventor_name_last": "Fang",
      "inventor_name_first": "Miaoqing",
      "inventor_city": "Menlo Park",
      "inventor_state": "CA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Arpat",
      "inventor_name_first": "Guven Burc",
      "inventor_city": "Los Altos",
      "inventor_state": "CA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Viscomi",
      "inventor_name_first": "Brendan Michael",
      "inventor_city": "New York",
      "inventor_state": "NY",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Wu",
      "inventor_name_first": "Shuye",
      "inventor_city": "Sunnyvale",
      "inventor_state": "CA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Singh",
      "inventor_name_first": "Varun",
      "inventor_city": "San Francisco",
      "inventor_state": "CA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Shen",
      "inventor_name_first": "Shuo",
      "inventor_city": "Sunnyvale",
      "inventor_state": "CA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Paves",
      "inventor_name_first": "Anthony Victor",
      "inventor_city": "San Francisco",
      "inventor_state": "CA",
      "inventor_country": "US"
    }
  ],
  "abstract": "Systems, methods, and non-transitory computer readable media are configured to determine scores regarding suitability of connections of a user for employment with an organization with which the user is employed based on a first machine learning model. Job titles for which the connections are suited are determined based on a second machine learning model. A user interface for presenting in real time information relating to the connections and associated job titles determined for the connections is generated.",
  "filing_date": "20160405",
  "patent_number": "None",
  "summary": "<SOH> SUMMARY <EOH>Various embodiments of the present technology can include systems, methods, and non-transitory computer readable media configured to determine scores regarding suitability of connections of a user for employment with an organization with which the user is employed based on a first machine learning model. Job titles for which the connections are suited are determined based on a second machine learning model. A user interface for presenting in real time information relating to the connections and associated job titles determined for the connections is generated. In an embodiment, the generation of a user interface is in response to a command by the user. In an embodiment, the determination of scores comprises: creating a laser table that maintains information relating to an ordered list of the scores and associated connections. In an embodiment, the determination of job titles comprises: creating a laser table that maintains information relating to the connections and associated job titles determined for the connections. In an embodiment, the generation of a user interface comprises: accessing from a first laser table information relating to an ordered list of scores and associated connections; accessing from a second laser table information relating to the connections and associated job titles determined for the connections; and presenting one or more of the connections and associated job titles determined for the one or more connections on a page for display on a client device of the user. In an embodiment, the generation of a user interface comprises: positioning selectable references on a page for display on a client device of the user, each reference relating to a job title associated with the organization; and in response to selection of a reference, displaying on the page connections determined to be suited for the job title corresponding to the reference. In an embodiment, the generation of a user interface comprises: displaying a number of ...",
  "date_published": "20171005",
  "title": "SYSTEMS AND METHODS TO IDENTIFY JOB TITLES FOR CONNECTIONS ON A SOCIAL NETWORKING SYSTEM",
  "ipcr_labels": [
    "G06N9900",
    "G06Q5000",
    "G06F1730"
  ],
  "_processing_info": {
    "original_size": 112030,
    "optimized_size": 4014,
    "reduction_percent": 96.42
  }
}