{
  "decision": "ACCEPTED",
  "application_number": "15094264",
  "date_published": "20170420",
  "date_produced": "20170405",
  "title": "ELECTROMAGNETIC INDUCTION PANEL, ELECTROMAGNETIC INDUCTION DEVICE INCLUDING THE SAME, AND DISPLAY DEVICE INCLUDING THE SAME",
  "filing_date": "20160408",
  "inventor_list": [
    {
      "inventor_name_last": "LIM",
      "inventor_name_first": "Sang-Hyun",
      "inventor_city": "Cheonan-si",
      "inventor_state": "",
      "inventor_country": "KR"
    },
    {
      "inventor_name_last": "JUNG",
      "inventor_name_first": "Chang-Sub",
      "inventor_city": "Hwaseong-si",
      "inventor_state": "",
      "inventor_country": "KR"
    },
    {
      "inventor_name_last": "JO",
      "inventor_name_first": "A-Ra",
      "inventor_city": "Seoul",
      "inventor_state": "",
      "inventor_country": "KR"
    },
    {
      "inventor_name_last": "CHOI",
      "inventor_name_first": "Eun-Gil",
      "inventor_city": "Cheonan-si",
      "inventor_state": "",
      "inventor_country": "KR"
    },
    {
      "inventor_name_last": "CHOI",
      "inventor_name_first": "Jae-Woo",
      "inventor_city": "Seoul",
      "inventor_state": "",
      "inventor_country": "KR"
    }
  ],
  "ipcr_labels": [
    "G06F3046",
    "H01Q700",
    "G06F3041",
    "H01F2728"
  ],
  "main_ipcr_label": "G06F3046",
  "summary": "<SOH> SUMMARY <EOH>Exemplary embodiments provide an electromagnetic induction panel having no shade area of magnetic field. Additional aspects will be set forth in the detailed description which follows, and, in part, will be apparent from the disclosure, or may be learned by practice of the inventive concept. Exemplary embodiments provide an electromagnetic induction device including the electromagnetic induction panel. Exemplary embodiments provide a display device including the electromagnetic induction panel. According to example embodiments, an electromagnetic induction panel may include a substrate including a first region, a second region, and a third region; a first induction coil arranged along an edge of the first region of the substrate and wound in a first winding direction; a second induction coil arranged along an edge of the second region and wound in a second winding direction opposite to the first winding direction, the second region surrounding the first region; and a third induction coil arranged along an edge of the third region and wound in the second winding direction, the third region surrounding the second region. In example embodiments, the second induction coil may generate a first sub magnetic field associated with a second current of the second induction coil, where the first sub magnetic field penetrates the first region. In example embodiments, the first induction coil and the third induction coil may generate a second sub magnetic field associated with a first current of the first induction coil and a third current of the third induction coil, where the second sub magnetic field penetrates at least one of the second region and the third region. In example embodiments, a terminal of the first induction coil may be electrically connected to a terminal of the third induction coil, and the first current may be the third current. According to example embodiments, an electromagnetic induction device may include an electromagnetic induction p...",
  "patent_number": "9874988",
  "abstract": "An electromagnetic induction panel includes a substrate including a first region, a second region, and a third region, a first induction coil arranged along an edge of the first region of the substrate and wound in a first winding direction, a second induction coil arranged along an edge of the second region and wound in a second winding direction opposite to the first winding direction, the second region surrounding the first region, and a third induction coil arranged along an edge of the third region and wound in the second winding direction, the third region surrounding the second region.",
  "publication_number": "US20170108969A1-20170420",
  "_processing_info": {
    "original_size": 75613,
    "optimized_size": 3819,
    "reduction_percent": 94.95
  }
}