{
  "decision": "PENDING",
  "application_number": "15092099",
  "date_published": "20171012",
  "date_produced": "20170927",
  "title": "LINKING EXTERNAL PROFESSION DATA TO SOCIAL NETWORK",
  "filing_date": "20160406",
  "inventor_list": [
    {
      "inventor_name_last": "Kenthapadi",
      "inventor_name_first": "Krishnaram",
      "inventor_city": "Sunnyvale",
      "inventor_state": "CA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Ambler",
      "inventor_name_first": "Stuart MacDonald",
      "inventor_city": "Longmont",
      "inventor_state": "CO",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Sandler",
      "inventor_name_first": "Ryan Wade",
      "inventor_city": "San Francisco",
      "inventor_state": "CA",
      "inventor_country": "US"
    }
  ],
  "ipcr_labels": [
    "G06Q5000",
    "G06F1730"
  ],
  "main_ipcr_label": "G06Q5000",
  "summary": "<SOH> BRIEF DESCRIPTION OF THE DRAWINGS <EOH>In the drawings, which are not necessarily drawn to scale, like numerals can describe similar components in different views. Like numerals having different letter suffixes can represent different instances of similar components. The drawings illustrate generally, by way of example, but not by way of limitation, various embodiments discussed herein. FIG. 1 illustrates, by way of example, a block diagram of an embodiment of a system including occupation data stored in accord with multiple, different taxonomies. FIG. 2 illustrates, by way of example, a block diagram of an embodiment of a system for mapping a job title determined in accord with a job title taxonomy with a profession title determined in accord with a different profession title taxonomy (or vice versa). FIG. 3 illustrates, by way of example, a block diagram of an embodiment of a system for mapping a job location determined in accord with a job location taxonomy to one or more profession location(s) determined in accord with a profession location taxonomy (or vice versa). FIG. 4 illustrates, by way of example, a logical block diagram of an embodiment of a system for generating a mapping between pairs of [profession location, profession title] to [job location, job title] (or vice versa). FIG. 5 illustrates, by way of example, a logical block diagram of an embodiment of a system for generating a job recommendation and/or salary data. FIG. 6 illustrates, by way of example, a block diagram of an embodiment of a method for providing career information to a user. FIG. 7 illustrates, by way of example, a block diagram of an embodiment of a computer network environment in which the systems and methods discussed herein can be deployed and/or performed. FIG. 8 illustrates, by way of example, a block diagram of an embodiment of a system including a software architecture, which may be used in conjunction with various hardware architectures herein described. FIG. 9 illustra...",
  "patent_number": "None",
  "abstract": "Generally discussed herein are methods, systems, and apparatuses for harmonizing information from different taxonomies and providing career information based on the harmonized information. A method can include receiving a request for the career information, the request including one or more job titles and one or more job locations associated with the job titles, mapping the one or more job titles to one or more profession titles, mapping the one or more job locations to one or more profession locations, executing a query for statistics associated with the career information, the query including the one or more profession titles and the one or more profession locations to which the one or more job titles and the one or more job locations respectively map, and providing the career information based on the statistics returned from executing the query.",
  "publication_number": "US20170293981A1-20171012",
  "_processing_info": {
    "original_size": 131764,
    "optimized_size": 3732,
    "reduction_percent": 97.17
  }
}