{
  "decision": "REJECTED",
  "application_number": "15093688",
  "date_published": "20170105",
  "date_produced": "20161220",
  "title": "SOCIAL FEED TREND VISUALIZATION",
  "filing_date": "20160407",
  "inventor_list": [
    {
      "inventor_name_last": "Deurloo",
      "inventor_name_first": "Marijn",
      "inventor_city": "Hoofddorp",
      "inventor_state": "",
      "inventor_country": "NL"
    }
  ],
  "ipcr_labels": [
    "H04L1258",
    "G06F1730"
  ],
  "main_ipcr_label": "H04L1258",
  "summary": "<SOH> BRIEF DESCRIPTION OF THE DRAWINGS <EOH>These and other objects, features and characteristics of the present invention will become more apparent to those skilled in the art from a study of the following detailed description in conjunction with the appended claims and drawings, all of which form a part of this specification. In the drawings: FIG. 1A is a block diagram of environment including a trending topics system. FIG. 1B illustrates a more detailed example of the trending topics system. FIG. 2A illustrates examples of trending topics on Twitter. FIG. 2B illustrates an example of a dynamic tag cloud. FIG. 3 is a bar diagram illustrating numbers of messages for a trending topic on a particular day. FIG. 4 illustrates time series of messages per second for a trending topic with different k (history) values. FIG. 5 illustrates acceleration of the number of messages per second for a trending topic with different k (history) values. FIGS. 6A and 6B illustrates visual representation of trending topics in dynamic squarified treemaps. FIG. 7 is a flow diagram illustrating an example of a process for visualizing trending topics using dynamic treemaps. FIG. 8 is a high-level block diagram illustrating an example of the architecture of a processing system, which may any electronic device or server mentioned herein. detailed-description description=\"Detailed Description\" end=\"lead\"?",
  "patent_number": "None",
  "abstract": "Technology for a visual representation of trending topics on social media platforms is disclosed herein. In some embodiments, a method for presenting a dynamic squarified treemap includes steps of retrieving multiple messages from a social networking service, the messages containing multiple trending topics; for each respective trending topic of the trending topics, determining a trending speed and a trending acceleration of the respective trending topic at a time point; and presenting a treemap including multiple shapes. Each respective shape of the shapes is associated with a corresponding trending topic of the trending topics. An area of the respective shape indicates a trending speed of the corresponding trending topic at the time point. A color of the respective shape indicates a trending acceleration of the corresponding trending topic at the time point.",
  "publication_number": "US20170005975A1-20170105",
  "_processing_info": {
    "original_size": 55542,
    "optimized_size": 2808,
    "reduction_percent": 94.94
  }
}