{
  "date_produced": "20170927",
  "publication_number": "US20170293853A1-20171012",
  "main_ipcr_label": "G06N700",
  "decision": "PENDING",
  "application_number": "15093662",
  "inventor_list": [
    {
      "inventor_name_last": "CHANDER",
      "inventor_name_first": "Ajay",
      "inventor_city": "San Francisco",
      "inventor_state": "CA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "SRINIVASAN",
      "inventor_name_first": "Ramya Malur",
      "inventor_city": "Sunnyvale",
      "inventor_state": "CA",
      "inventor_country": "US"
    }
  ],
  "abstract": "A method may include extracting feature information from a user history including multiple goal messages. Each of the multiple goal messages may include visual media and text, and may be associated with a goal indicated as completed. Extracting the feature information from the user history may include performing feature detection on the visual media of the multiple goal messages. The feature information from the user history may be analyzed for correlations between features and the completion indications of the associated goals. Feature information may be extracted from a generic goal message. A probability of a user indicating completion of a goal associated with the generic goal message may be determined based at least in part on the feature information from the generic goal message and the correlations between the features included in the multiple goal messages and the indications of the associated goals having been completed.",
  "filing_date": "20160407",
  "patent_number": "None",
  "summary": "<SOH> SUMMARY <EOH>According to an aspect of an embodiment, a method may include extracting feature information from a user history including multiple goal messages. Each of the multiple goal messages may include visual media and text, and may be associated with a goal indicated as completed. Extracting the feature information from the user history may include performing feature detection on the visual media of the multiple goal messages. The feature information from the user history may be analyzed for correlations between features and the completion indications of the associated goals. Feature information may be extracted from a generic goal message. A probability of a user indicating completion of a goal associated with the generic goal message may be determined based at least in part on the feature information from the generic goal message and the correlations between the features included in the multiple goal messages and the indications of the associated goals having been completed. The object and advantages of the embodiments will be realized and achieved at least by the elements, features, and combinations particularly pointed out in the claims. It is to be understood that both the foregoing general description and the following detailed description are exemplary and explanatory and are not restrictive of the claimed subject matter.",
  "date_published": "20171012",
  "title": "BEHAVIOR PREDICTION",
  "ipcr_labels": [
    "G06N700",
    "G06F1727",
    "G06F30481"
  ],
  "_processing_info": {
    "original_size": 56553,
    "optimized_size": 2994,
    "reduction_percent": 94.71
  }
}