{
  "date_produced": "20170927",
  "publication_number": "US20170293836A1-20171012",
  "main_ipcr_label": "G06N308",
  "decision": "PENDING",
  "application_number": "15095916",
  "inventor_list": [
    {
      "inventor_name_last": "Li",
      "inventor_name_first": "Hongfei",
      "inventor_city": "Briarcliff Manor",
      "inventor_state": "NY",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Sheopuri",
      "inventor_name_first": "Anshul",
      "inventor_city": "Teaneck",
      "inventor_state": "NJ",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Yi",
      "inventor_name_first": "Jinfeng",
      "inventor_city": "Ossining",
      "inventor_state": "NY",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Yu",
      "inventor_name_first": "Qi",
      "inventor_city": "Los Angeles",
      "inventor_state": "CA",
      "inventor_country": "US"
    }
  ],
  "abstract": "A method and system are provided. The method includes receiving by a computer having a processor and a memory, sequence data that includes labeled data and unlabeled data. The method further includes generating, by the computer having the processor and the memory, a recurrent neural network model of the sequence data, the recurrent neural network model having a recurrent layer and an aggregate layer. The recurrent neural network model feeds sequences generated from the recurrent layer into the aggregate layer for aggregation, stores temporal dependencies in the sequence data, and generates labels for at least some of the unlabeled data.",
  "filing_date": "20160411",
  "patent_number": "None",
  "summary": "<SOH> SUMMARY <EOH>According to an aspect of the present principles, a method is provided. The method includes receiving by a computer having a processor and a memory, sequence data that includes labeled data and unlabeled data. The method further includes generating, by the computer having the processor and the memory, a recurrent neural network model of the sequence data, the recurrent neural network model having a recurrent layer and an aggregate layer. The recurrent neural network model feeds sequences generated from the recurrent layer into the aggregate layer for aggregation, stores temporal dependencies in the sequence data, and generates labels for at least some of the unlabeled data. According to another aspect of the present principles, a system is provided. The system includes a computer, having a processor and a memory, configured to: receive by a computer having a processor and a memory, sequence data that includes labeled data and unlabeled data; and generate, by the computer having the processor and the memory, a recurrent neural network model of the sequence data, the recurrent neural network model having a recurrent layer and an aggregate layer. The recurrent neural network model feeds sequences generated from the recurrent layer into the aggregate layer for aggregation, stores temporal dependencies in the sequence data, and generates labels for at least some of the unlabeled data. These and other features and advantages will become apparent from the following detailed description of illustrative embodiments thereof, which is to be read in connection with the accompanying drawings.",
  "date_published": "20171012",
  "title": "CUSTOMER PROFILE LEARNING BASED ON SEMI-SUPERVISED RECURRENT NEURAL NETWORK USING PARTIALLY LABELED SEQUENCE DATA",
  "ipcr_labels": [
    "G06N308",
    "G06N304"
  ],
  "_processing_info": {
    "original_size": 56850,
    "optimized_size": 3314,
    "reduction_percent": 94.17
  }
}