{
  "decision": "ACCEPTED",
  "application_number": "15098640",
  "date_published": "20160811",
  "date_produced": "20160727",
  "title": "SYSTEM FOR COMMUNICATION ROUTING",
  "filing_date": "20160414",
  "inventor_list": [
    {
      "inventor_name_last": "Wawrzynowicz",
      "inventor_name_first": "Philip",
      "inventor_city": "Lebanon",
      "inventor_state": "CT",
      "inventor_country": "US"
    }
  ],
  "ipcr_labels": [
    "H04M351",
    "H04M324",
    "G06F1724",
    "G06F30481",
    "G06F30482",
    "G06F30484",
    "H04M3523",
    "H04L1226"
  ],
  "main_ipcr_label": "H04M351",
  "summary": "<SOH> SUMMARY OF THE INVENTION <EOH>According to some embodiments, systems, methods, apparatus, computer program code and means may provide a tool to facilitate the routing of telephone calls. In some embodiments, a telephone call is received. A telephone call routing matrix is accessed, from a relational database platform, to select a service representative for the received telephone call. It may then be arranged for the received telephone call to be routed in accordance with the selected service representative. Some embodiments provide: means for receiving a telephone call at a communications server; means for attempting to match information about the telephone call with at least one override flag to select a service representative terminal; if the information about the telephone call does not match the at least one override flag, means for accessing a telephone call routing matrix stored on a relational database platform to attempt to select a service representative terminal for the received telephone call; if a service representative terminal is not selected based on the telephone call routing matrix, means for selecting a service representative terminal in accordance with a default routing rule; and means for routing the received telephone to the selected service representative terminal. A technical effect of some embodiments of the invention is an improved and computerized method to route telephone calls. With these and other advantages and features that will become hereinafter apparent, a more complete understanding of the nature of the invention can be obtained by referring to the following detailed description and to the drawings appended hereto.",
  "patent_number": "9565308",
  "abstract": "A system, method, apparatus, means, and computer program code is provided wherein an electronic communication is received. A communication routing matrix is accessed, from a relational database platform, to select a service representative for the received communication. It may then be arranged for the received communication to be routed in accordance with the selected service representative.",
  "publication_number": "US20160234386A1-20160811",
  "_processing_info": {
    "original_size": 45465,
    "optimized_size": 2689,
    "reduction_percent": 94.09
  }
}