{
  "decision": "PENDING",
  "application_number": "15091524",
  "date_published": "20161110",
  "date_produced": "20161026",
  "title": "Data Generation and Formatting for Disparate Computer-Networked Information Systems",
  "filing_date": "20160405",
  "inventor_list": [
    {
      "inventor_name_last": "Debber",
      "inventor_name_first": "J Dale",
      "inventor_city": "Granite Bay",
      "inventor_state": "CA",
      "inventor_country": "US"
    }
  ],
  "ipcr_labels": [
    "G06Q4008"
  ],
  "main_ipcr_label": "G06Q4008",
  "summary": "<SOH> SUMMARY OF THE INVENTION <EOH>The present invention relates to providing technology, including a system and method, for electronically generating, formatting and transmitting data related to applications for insurance coverage across disparate computer-networked systems. Accordingly to one innovative aspects, the system comprises an application processing system, a risk information system, at least one insurer system and a plurality of agent terminals coupled by a network such as the Internet. The application processing system advantageously presents a user interface via an agent terminal to allow a producer to input information, including an applicant insurance risk. The application processing system generates a completed insurance application from the input information along with risk data retrieved from the risk information system. In one embodiment, the application processing system consults a computer database to determine that an agent working on behalf of an applicant is authorized to submit an applicant insurance risk information. The application processing system retrieves from an insurer data store data including a plurality of insurers to which applications may be submitted. The application processing system selects one or more insurers from a plurality of insurers to which an agent working on behalf of the applicant is authorized to submit an insurance application. The application processing system receives via a computer network information and format requirements specific to a first insurer from an insurer system associated with the first insurer application. The application processing system receives via a computer network information and format requirements specific to a second insurer from an insurer system associated with the second insurer application. The application processing system generates one or more applications and automatically submits them to respective insurer systems. The insurer system is coupled for communication with the appl...",
  "patent_number": "None",
  "abstract": "In an example embodiment, a system for electronically generating, formatting and transmitting data across disparate computer-networked systems is described. The system comprises an application processing system, a risk information system, at least one insurer system and a plurality of agent terminals coupled by a network such as the Internet. The application processing system advantageously presents a user interface via an agent terminal to allow a producer to input information. The application processing system retrieves data including a plurality of insurers from a data store. The application processing system receives information and format requirements and generates one or more of a plurality of documents each formatted and transmitted according to parameters prescribed by a respective system.",
  "publication_number": "US20160328800A1-20161110",
  "_processing_info": {
    "original_size": 98534,
    "optimized_size": 3384,
    "reduction_percent": 96.57
  }
}