{
  "date_produced": "20161019",
  "publication_number": "US20160321562A1-20161103",
  "main_ipcr_label": "G06N9900",
  "decision": "ACCEPTED",
  "application_number": "15096192",
  "inventor_list": [
    {
      "inventor_name_last": "Zeng",
      "inventor_name_first": "Xinchuan",
      "inventor_city": "Orem",
      "inventor_state": "UT",
      "inventor_country": "US"
    }
  ],
  "abstract": "Techniques are described herein for classifying an electronic message with a particular project from among a plurality of projects. In some embodiments, first and second users associated with the electronic message are identified, and one or more first projects associated with the first user and one and more second projects associated with the second user are determined. Projects that are in common between the first projects and the second projects are determined. When only a single project is in common, the electronic message is associated with the single project. When more than a single project is in common, features associated with each of the projects found to be in common are analyzed by a machine learning model to determine the most likely project to associate with the electronic message from among the projects found to be in common.",
  "filing_date": "20160411",
  "patent_number": "9582770",
  "summary": "<SOH> BRIEF DESCRIPTION OF THE DRAWINGS <EOH>The accompanying drawings illustrate several example embodiments of the invention. Together with the description, they serve to explain the principles of the invention according to the embodiments. One skilled in the art will recognize that the particular embodiments illustrated in the drawings are merely exemplary, and are not intended to limit the scope of the present invention. FIG. 1 illustrates an example system for determining a particular project to associate with an electronic message according to some embodiments. FIG. 2 illustrates example components and data included in the system of FIG. 1 according to some embodiments. FIGS. 3A-3B depict an example flow for automatic classification or categorization of an electronic message with a particular project, according to some embodiments. FIG. 4 illustrates a block diagram of an example computer system upon which embodiments of the present disclosure may be implemented. detailed-description description=\"Detailed Description\" end=\"lead\"? While each of the drawing illustrates a particular embodiment for purposes of illustrating a clear example, other embodiments may omit, add to, reorder, and/or modify any of the elements shown in the drawings. For purposes of illustrating clear examples, one or more figures may be described with reference to one or more other figures, but using the particular arrangement illustrated in the one or more other figures is not required in other embodiments.",
  "date_published": "20161103",
  "title": "Enhancement of Machine Learning Techniques for an Electronic Message System",
  "ipcr_labels": [
    "G06N9900"
  ],
  "_processing_info": {
    "original_size": 82507,
    "optimized_size": 2925,
    "reduction_percent": 96.45
  }
}