{
  "date_produced": "20170920",
  "publication_number": "US20170286856A1-20171005",
  "main_ipcr_label": "G06N700",
  "decision": "PENDING",
  "application_number": "15090874",
  "inventor_list": [
    {
      "inventor_name_last": "SEOW",
      "inventor_name_first": "Ming-Jung",
      "inventor_city": "Richmond",
      "inventor_state": "TX",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "XU",
      "inventor_name_first": "Gang",
      "inventor_city": "Katy",
      "inventor_state": "TX",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "YANG",
      "inventor_name_first": "Tao",
      "inventor_city": "Katy",
      "inventor_state": "TX",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "COBB",
      "inventor_name_first": "Wesley Kenneth",
      "inventor_city": "The Woodlands",
      "inventor_state": "TX",
      "inventor_country": "US"
    }
  ],
  "abstract": "Techniques are disclosed for detecting changes in a neuro-linguistic model. According to one embodiment, detecting changes in a neuro-linguistic model comprises receiving a first neuro-linguistic model, wherein the first neuro-linguistic model provides a set of statistical descriptions generated from a first set of input data received from one or more sensor devices during a first time period receiving a second neuro-linguistic model having a second set of statistical descriptions for second input data, wherein the second neuro-linguistic model provides a set of statistical descriptions of the second input data transmitted from the one or more sensor devices during a second time period, comparing the second set of statistical descriptions to the first set statistical descriptions to determine a set of matching statistical descriptions and generating a similarity score based on the matching statistical descriptions, and upon determining a trend change based on a comparison between the s...",
  "filing_date": "20160405",
  "patent_number": "None",
  "summary": "<SOH> SUMMARY <EOH>One embodiment presented herein includes a method for detecting changes in a neuro-linguistic model. The method generally includes receiving a first neuro-linguistic model, wherein the first neuro-linguistic model provides a set of statistical descriptions generated from a first set of input data received from one or more sensor devices during a first time period receiving a second neuro-linguistic model having a second set of statistical descriptions for second input data, wherein the second neuro-linguistic model provides a set of statistical descriptions of the second input data transmitted from the one or more sensor devices during a second time period. The method continues by comparing the second set of statistical descriptions to the first set statistical descriptions to determine a set of matching statistical descriptions and generating a similarity score based on the matching statistical descriptions. Upon determining a trend change based on a comparison between the similarity score and a threshold, outputting an alert indication of trend change. Another embodiment presented herein includes a computer-readable storage medium storing instructions, which, when executed on a processor, performs an operation for detecting changes in a neuro-linguistic model. The operation itself generally includes receiving a first neuro-linguistic model, wherein the first neuro-linguistic model provides a set of statistical descriptions generated from a first set of input data received from one or more sensor devices during a first time period receiving a second neuro-linguistic model having a second set of statistical descriptions for second input data, wherein the second neuro-linguistic model provides a set of statistical descriptions of the second input data transmitted from the one or more sensor devices during a second time period. The method continues by comparing the second set of statistical descriptions to the first set statistical descriptions to d...",
  "date_published": "20171005",
  "title": "TREND ANALYSIS FOR A NEURO-LINGUISTIC BEHAVIOR RECOGNITION SYSTEM",
  "ipcr_labels": [
    "G06N700",
    "G06N9900"
  ],
  "_processing_info": {
    "original_size": 63928,
    "optimized_size": 3999,
    "reduction_percent": 93.74
  }
}