{
  "decision": "PENDING",
  "application_number": "15097673",
  "date_published": "20170824",
  "date_produced": "20170809",
  "title": "PUSH NOTIFICATIONS FOR PRICE CHANGE ALERTS",
  "filing_date": "20160413",
  "inventor_list": [
    {
      "inventor_name_last": "Mathew",
      "inventor_name_first": "Shiju",
      "inventor_city": "Tiruvalla",
      "inventor_state": "",
      "inventor_country": "IN"
    },
    {
      "inventor_name_last": "Arunachalam",
      "inventor_name_first": "Prasanna",
      "inventor_city": "Royapuram",
      "inventor_state": "",
      "inventor_country": "IN"
    },
    {
      "inventor_name_last": "Bhoumick",
      "inventor_name_first": "Anurag",
      "inventor_city": "Allahabad",
      "inventor_state": "",
      "inventor_country": "IN"
    },
    {
      "inventor_name_last": "Panduranga",
      "inventor_name_first": "Chethan",
      "inventor_city": "Bangalore",
      "inventor_state": "",
      "inventor_country": "IN"
    }
  ],
  "ipcr_labels": [
    "G06Q3002",
    "H04L2908"
  ],
  "main_ipcr_label": "G06Q3002",
  "summary": "<SOH> SUMMARY <EOH>The principal object of the embodiments herein is to provide a method for notifying about a price change via a push notification. Another object of the embodiments herein is to provide a mechanism for receiving information about a product browsed in a client application on a mobile device. Another object of the embodiments herein is to provide a mechanism for detecting a change in price of a product. Another object of the embodiments herein is to provide a mechanism for determining whether a change in price exceeds a price threshold. Another object of the embodiments herein is to provide a mechanism for sending a push notification to a mobile device. Accordingly embodiments herein disclose a computer-implemented method for notifying about a price change. The method includes receiving, by a controller unit, information about a product browsed in a client application on a mobile device. Further, the method includes detecting, by the controller unit, a change in price of the product. Further, the method includes determining, by the controller unit, whether the change in price exceeds a price threshold. Furthermore, the method includes sending, by the controller unit, a push notification to the mobile device based on determining that the change in price exceeds the price threshold. Embodiments herein disclose a server for notifying about a price change. The server includes a controller unit configured to receive information about a product browsed in a client application on a mobile device. Further, the controller unit is configured to detect the change in price of the product. Further, the controller unit is configured to determine whether the change in price exceeds a price threshold. Furthermore, the controller unit is configured to send a push notification to the mobile device in response to determining that the change in price exceeds the price threshold. Accordingly the embodiment herein provides a computer program product including a computer e...",
  "patent_number": "None",
  "abstract": "Embodiments herein disclose a computer-implemented method for notifying about a price change. The method includes receiving information about a product browsed in a client application on a mobile device. Further, the method includes detecting a change in price of the product. Further, the method includes determining whether the change in price exceeds a price threshold. Furthermore, the method includes sending a push notification to the mobile device based on determining that the change in price exceeds the price threshold.",
  "publication_number": "US20170243247A1-20170824",
  "_processing_info": {
    "original_size": 46350,
    "optimized_size": 3520,
    "reduction_percent": 92.41
  }
}