{
  "date_produced": "20171004",
  "publication_number": "US20170300822A1-20171019",
  "main_ipcr_label": "G06N504",
  "decision": "PENDING",
  "application_number": "15091589",
  "inventor_list": [
    {
      "inventor_name_last": "Limonad",
      "inventor_name_first": "Lior",
      "inventor_city": "Nesher",
      "inventor_state": "",
      "inventor_country": "IL"
    },
    {
      "inventor_name_last": "Mashkif",
      "inventor_name_first": "Nir",
      "inventor_city": "Ein Carmel",
      "inventor_state": "",
      "inventor_country": "IL"
    },
    {
      "inventor_name_last": "Volcoff",
      "inventor_name_first": "Ari E.",
      "inventor_city": "Yokneam Ilit",
      "inventor_state": "",
      "inventor_country": "IL"
    },
    {
      "inventor_name_last": "Zeltyn",
      "inventor_name_first": "Sergey",
      "inventor_city": "Haifa",
      "inventor_state": "",
      "inventor_country": "IL"
    }
  ],
  "abstract": "A computer-implemented method, computerized apparatus and computer program product for activity recognition using adaptive window size segmentation of sensor data stream. A data stream generated by one or more sensors is obtained. A frequency analysis of the data in a first segment of the data stream is performed. A size of a second segment is determined based on the frequency analysis. Activity recognition is performed for the second segment by extracting one or more features of the data therein and applying a machine learning process on the extracted features to obtain a classification of the data into an activity class.",
  "filing_date": "20160406",
  "patent_number": "None",
  "summary": "<SOH> BRIEF SUMMARY <EOH>One exemplary embodiment of the disclosed subject matter is a computer- implemented method comprising: obtaining a data stream generated by one or more sensors; performing frequency analysis of the data in a first segment of the data stream; determining, based on the frequency analysis, a size of a second segment; and performing activity recognition for the second segment, wherein the activity recognition is performed by extracting one or more features of the data in the second segment and applying a machine learning process thereon to obtain a classification of the data into an o activity class. Another exemplary embodiment of the disclosed subject matter is a computerized apparatus having a processor, the processor being adapted to perform the steps of: obtaining a data stream generated by one or more sensors; performing frequency analysis of the data in a first segment of the data stream; determining, based s on the frequency analysis, a size of a second segment; and performing activity recognition for the second segment, wherein the activity recognition is performed by extracting one or more features of the data in the second segment and applying a machine learning process thereon to obtain a classification of the data into an activity class. Yet another exemplary embodiment of the disclosed subject matter is a computer program product comprising a computer readable storage medium retaining program instructions, which program instructions when read by a processor, cause the processor to perform a method comprising: obtaining a data stream generated by one or more sensors; performing frequency analysis of the data in a first segment of the data stream; determining, based on the frequency analysis, a size of a second segment; and performing activity recognition for the second segment, wherein the activity recognition is performed by extracting one or more features of the data in the second segment and applying a machine learning process th...",
  "date_published": "20171019",
  "title": "Adaptive window size segmentation for activity recognition",
  "ipcr_labels": [
    "G06N504",
    "G06N9900",
    "G06F1714"
  ],
  "_processing_info": {
    "original_size": 48837,
    "optimized_size": 3629,
    "reduction_percent": 92.57
  }
}