{
  "decision": "ACCEPTED",
  "application_number": "15098882",
  "date_published": "20161020",
  "date_produced": "20161005",
  "title": "DISPLAY DEVICE AND TOUCH DETECTION SYSTEM",
  "filing_date": "20160414",
  "inventor_list": [
    {
      "inventor_name_last": "TOGASHI",
      "inventor_name_first": "Masahiro",
      "inventor_city": "Tokyo",
      "inventor_state": "",
      "inventor_country": "JP"
    },
    {
      "inventor_name_last": "YAMAMOTO",
      "inventor_name_first": "Michio",
      "inventor_city": "Tokyo",
      "inventor_state": "",
      "inventor_country": "JP"
    }
  ],
  "ipcr_labels": [
    "G06F3041",
    "G06F3033"
  ],
  "main_ipcr_label": "G06F3041",
  "summary": "<SOH> SUMMARY <EOH>According to an aspect, a display device includes: a display unit that displays an image; a touch detection unit that detects an instruction input provided by a pointing device to a display surface of the display unit; an acquisition unit that acquires information indicating a display color at an instruction input position, the display color being detected by a color sensor included in the pointing device; and a determination unit that performs determination processing to determine the instruction input position based on a color of the image and the color indicated by the information acquired by the acquisition unit. According to another aspect, a touch detection system includes: a display device including a display unit that displays an image and a touch detection unit that detects an instruction input provided to a display surface of the display unit; and a pointing device that provides the instruction input to the display surface. The pointing device includes: a color sensor that detects a display color of the display surface at an instruction input position; and a transmission unit that transmits information indicating the display color at the instruction input position detected by the color sensor. The display device includes: an acquisition unit that acquires the information indicating the display color transmitted by the transmission unit; and a determination unit that determines the instruction input position based on the color of the image and the color indicated by the information acquired by the acquisition unit.",
  "patent_number": "10013079",
  "abstract": "According to an aspect, a display device includes: a display unit that displays an image; a touch detection unit that detects an instruction input provided by a pointing device to a display surface of the display unit; an acquisition unit that acquires information indicating a display color at an instruction input position, the display color being detected by a color sensor included in the pointing device; and a determination unit that performs determination processing to determine the instruction input position based on a color of the image and the color indicated by the information acquired by the acquisition unit.",
  "publication_number": "US20160306492A1-20161020",
  "_processing_info": {
    "original_size": 99961,
    "optimized_size": 2878,
    "reduction_percent": 97.12
  }
}