{
  "date_produced": "20170920",
  "publication_number": "US20170286863A1-20171005",
  "main_ipcr_label": "G06N9900",
  "decision": "PENDING",
  "application_number": "15091209",
  "inventor_list": [
    {
      "inventor_name_last": "SEOW",
      "inventor_name_first": "Ming-Jung",
      "inventor_city": "Richmond",
      "inventor_state": "TX",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "XU",
      "inventor_name_first": "Gang",
      "inventor_city": "Katy",
      "inventor_state": "TX",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "YANG",
      "inventor_name_first": "Tao",
      "inventor_city": "Katy",
      "inventor_state": "TX",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "COBB",
      "inventor_name_first": "Wesley Kenneth",
      "inventor_city": "The Woodlands",
      "inventor_state": "TX",
      "inventor_country": "US"
    }
  ],
  "abstract": "Techniques are disclosed for generating an anomaly score for a neuro-linguistic model of input data obtained from one or more sources. According to one embodiment, generating an anomaly score comprises receiving a score indicating how often a characteristic is observed in the input data. Upon receiving the score, comparing the score with an unusual score model to determine an unusualness score and comparing the unusualness score with an anomaly score model based on one or more unusual score models to generate the anomaly score indicating an overall unusualness for the input data.",
  "filing_date": "20160405",
  "patent_number": "None",
  "summary": "<SOH> SUMMARY <EOH>One embodiment presented herein includes a method for generating an anomaly score for a neuro-linguistic model of input data obtained from one or more sources. The method generally comprises receiving a score indicating how often a characteristic is observed in the input data. Upon receiving the score, comparing the score with an unusual score model to determine an unusualness score and comparing the unusualness score with an anomaly score model based on one or more unusual score models to generate the anomaly score indicating an overall unusualness for the input data. Another embodiment presented herein includes a computer-readable storage medium storing instructions, which, when executed on a processor, performs an operation for generating an anomaly score for a neuro-linguistic model of input data obtained from one or more sources. The operation itself generally includes receiving a score indicating how often a characteristic is observed in the input data. Upon receiving the score, comparing the score with an unusual score model to determine an unusualness score and comparing the unusualness score with an anomaly score model based on one or more unusual score models to generate the anomaly score indicating an overall unusualness for the input data. Yet another embodiment presented herein includes a system having a processor and a memory storing one or more application programs configured to perform an operation for generating an anomaly score for a neuro-linguistic model of input data obtained from one or more sources. The operation itself generally includes receiving a score indicating how often a characteristic is observed in the input data. Upon receiving the score, comparing the score with an unusual score model to determine an unusualness score and comparing the unusualness score with an anomaly score model based on one or more unusual score models to generate the anomaly score indicating an overall unusualness for the input data.",
  "date_published": "20171005",
  "title": "ANOMALY SCORE ADJUSTMENT ACROSS ANOMALY GENERATORS",
  "ipcr_labels": [
    "G06N9900",
    "G06N700",
    "G06F1730"
  ],
  "_processing_info": {
    "original_size": 60827,
    "optimized_size": 3568,
    "reduction_percent": 94.13
  }
}