{
  "date_produced": "20171004",
  "publication_number": "US20170300823A1-20171019",
  "main_ipcr_label": "G06N700",
  "decision": "PENDING",
  "application_number": "15097454",
  "inventor_list": [
    {
      "inventor_name_last": "Bostick",
      "inventor_name_first": "James E.",
      "inventor_city": "Cedar Park",
      "inventor_state": "TX",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Ganci, JR.",
      "inventor_name_first": "John M.",
      "inventor_city": "Cary",
      "inventor_state": "NC",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Keen",
      "inventor_name_first": "Martin G.",
      "inventor_city": "Cary",
      "inventor_state": "NC",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Rakshit",
      "inventor_name_first": "Sarbajit K.",
      "inventor_city": "Kolkata",
      "inventor_state": "",
      "inventor_country": "IN"
    },
    {
      "inventor_name_last": "Trim",
      "inventor_name_first": "Craig M.",
      "inventor_city": "Sylmar",
      "inventor_state": "CA",
      "inventor_country": "US"
    }
  ],
  "abstract": "One or more processor to receives content over distributed network media sources and isolated content, authored by one or more users of the plurality of users, in which the content and isolated content are directed to a plurality of topics. The content and isolated content are parsed into content segments and aggregated based on topics to which the content segments are directed, and users authoring the content segments are identified, the aggregated content segments forming at least part of a discussion thread. One or more processors determine a probability that the discussion thread is complete, based on a set of user behavioral pattern metrics generated by analysis of historical content, and one or more processors, in response to the discussion thread being substantially complete and exceeding a probability threshold, determines the discussion thread, including the content and the isolated content to be ready for a contextual relationship analysis.",
  "filing_date": "20160413",
  "patent_number": "None",
  "summary": "<SOH> SUMMARY <EOH>Embodiments of the present invention disclose a method, computer program product, and system. The method provides for one or more processor to gather content authored by a plurality of users over distributed network media sources, and isolated content authored by one or more users of the plurality of users, in which the content and isolated content are directed to a plurality of topics. One or more processors gather content authored by a plurality of users over distributed network media sources, and isolated content authored by one or more users of the plurality of users, wherein the content and isolated content are directed to a plurality of topics. One or more processors parse the content and the isolated content. One or more processors aggregate the content that is parsed and the isolated content that is parsed, which are directed to a topic of the plurality of topics, such that the parsed content and parsed isolated content, which are aggregated, form at least a portion of a discussion thread. One or more processors identify a set of users of the plurality of users, authoring the content that is parsed and the isolated content that is parsed, which are directed to the topic. One or more processors determine a probability of whether the discussion thread is at least substantially complete, based on a set of metrics of behavioral patterns of the plurality of users, identified by analysis of historical content and isolated historical content authored by the plurality of users, and in response to determining the probability of the discussion thread to exceed a probability threshold indicating the discussion thread to be at least substantially complete, one or more processors perform a contextual relationship analysis between instances of the parsed content and instances of the parsed isolated content that are directed to the topic, which are authored by the set of users of the plurality of users.",
  "date_published": "20171019",
  "title": "DETERMINING USER INFLUENCE BY CONTEXTUAL RELATIONSHIP OF ISOLATED AND NON-ISOLATED CONTENT",
  "ipcr_labels": [
    "G06N700",
    "H04L2908"
  ],
  "_processing_info": {
    "original_size": 94513,
    "optimized_size": 4087,
    "reduction_percent": 95.68
  }
}