{
  "decision": "PENDING",
  "application_number": "15093763",
  "date_published": "20171012",
  "date_produced": "20170927",
  "title": "METHOD OF DESIGNING AND MODIFYING LITHIUM ION BATTERY CATHODE MATERIALS",
  "filing_date": "20160408",
  "inventor_list": [
    {
      "inventor_name_last": "XIN",
      "inventor_name_first": "Jianzhuo",
      "inventor_city": "Hong Kong",
      "inventor_state": "",
      "inventor_country": "HK"
    },
    {
      "inventor_name_last": "CHAU",
      "inventor_name_first": "Wing Yu",
      "inventor_city": "Hong Kong",
      "inventor_state": "",
      "inventor_country": "HK"
    },
    {
      "inventor_name_last": "JIANG",
      "inventor_name_first": "Yingkai",
      "inventor_city": "Hong Kong",
      "inventor_state": "",
      "inventor_country": "HK"
    },
    {
      "inventor_name_last": "XU",
      "inventor_name_first": "Yeming",
      "inventor_city": "Hong Kong",
      "inventor_state": "",
      "inventor_country": "HK"
    },
    {
      "inventor_name_last": "HO",
      "inventor_name_first": "Kwok Keung",
      "inventor_city": "Hong Kong",
      "inventor_state": "",
      "inventor_country": "HK"
    }
  ],
  "ipcr_labels": [
    "G06F1750",
    "H01M41391",
    "H01M4525",
    "H01M4505",
    "H01M4131",
    "H01M100585",
    "H01M466",
    "H01M438",
    "H01M100525",
    "H01M100569",
    "H01M100568",
    "H01M404",
    "H01M462"
  ],
  "main_ipcr_label": "G06F1750",
  "summary": "<SOH> SUMMARY OF THE INVENTION <EOH>The aforementioned needs are met by various aspects and embodiments disclosed herein. In one aspect, provided herein is a method of designing and modifying electrode materials for a battery device, comprising the steps of: 1) building a first model for the basic structure of the electrode material regarding to its composition and lattice type; 2) calculating a series of factors by the first model for material parameters that relate to battery structural stability, voltage and capacity; 3) selecting an electrode material structure based on the derived parameters for the potential battery application; 4) developing a second model for a battery cell based on the selected electrode material; 5) prioritizing the importance of the electrode material property parameters by simulating and comparing the cell charging and discharging behavior in the second model; 6) optimizing the prioritized electrode material properties in the second model according to the battery application requirement; 7) applying compositional and structural modifications in the first model based on the required electrode properties optimized in the step 6); 8) optimizing the modifications in the first model with regarding to both material parameters and cell performance; 9) synthesizing the modified electrode material as optimized in step 6) and 8); 10) validating the synthesized material properties by material testing; 11) fabricating a battery cell by using synthesize electrode material; 12) validating the synthesized material performance as battery electrode by testing the charging/discharging behavior of the battery cell. In certain embodiments, the first model is an atomic scale model based on a first principal density function theory (DFT) or its equivalent. In some embodiments, the electrode material is a cathode material and wherein the cathode material is selected from the group consisting of LiCoO 2 , LiNiO 2 , LiNi x Mn 1−x O 2 , Li 1+z Ni x Mn y Co 1−x−y ...",
  "patent_number": "None",
  "abstract": "A method of designing and modifying electrode materials for a battery device is disclosed in this invention. The method includes constructing a first principle model for battery electrode material properties estimation and screening. The method also includes applying a structural and compositional modification on the first principle model. In some embodiments, the method includes developing a hybrid physical model to estimate the battery cell cycling behavior with the calculated and experimental parameters. The method and the simulation models have the advantage that both atomic level and physical structure will be considered for the battery electrode and its modified derivatives with small compositional or structural changes. Therefore, both the time consumption and accuracy for battery electrode material designing and modification for specific application requirements can be improved.",
  "publication_number": "US20170293707A1-20171012",
  "_processing_info": {
    "original_size": 79244,
    "optimized_size": 4197,
    "reduction_percent": 94.7
  }
}