{
  "decision": "ACCEPTED",
  "application_number": "15099544",
  "date_published": "20161027",
  "date_produced": "20161012",
  "title": "TOUCH PANEL AND DISPLAY DEVICE",
  "filing_date": "20160414",
  "inventor_list": [
    {
      "inventor_name_last": "SONG",
      "inventor_name_first": "BINBIN",
      "inventor_city": "Kunshan City",
      "inventor_state": "",
      "inventor_country": "CN"
    },
    {
      "inventor_name_last": "CHIU",
      "inventor_name_first": "FENGCHING",
      "inventor_city": "Taoyuan City",
      "inventor_state": "",
      "inventor_country": "TW"
    },
    {
      "inventor_name_last": "WANG",
      "inventor_name_first": "PENGFEI",
      "inventor_city": "Kunshan City",
      "inventor_state": "",
      "inventor_country": "CN"
    }
  ],
  "ipcr_labels": [
    "G06F3044",
    "G02F11333",
    "G02F11335",
    "G06F3041"
  ],
  "main_ipcr_label": "G06F3044",
  "summary": "<SOH> SUMMARY <EOH>The present disclosure accordingly provides a touch panel and a display device employing the touch panel, to solve the problems that the surface resistance at the nodes of the mesh structure of the sensing pattern is relatively large and the line width of the mesh structure cannot be designed to a lower level. In one aspect, the present disclosure provides a touch panel. The touch panel includes a transparent substrate and a sensing pattern formed on the transparent substrate. The sensing pattern is in the form of a mesh structure. The mesh structure includes a plurality of conductive wires intersecting with each other to form a plurality of grids and a plurality of nodes connected between the grids. The grids are formed by the conductive wires intersecting with each other, and the nodes are formed at the intersection points of the conductive wires. The node has an annular shape with a center hole being defined in a center portion of the node. In another aspect, the present disclosure provides a display device. The display device includes a display panel and a touch panel integrated with the display panel. The touch panel includes a transparent substrate and a sensing pattern formed on the transparent substrate. The sensing pattern is in the form of a mesh structure. The mesh structure includes a plurality of conductive wires intersecting with each other to form a plurality of grids and a plurality of nodes connected between the grids. The grids are formed by the conductive wires intersecting with each other, and the nodes are formed at the intersection points of the conductive wires. The node has an annular shape with a center hole being defined in a center portion of the node. The display panel may be a liquid crystal display panel, an OLED display panel, etc. Since the node has an annular shape with a center hole being defined in the center portion of the annular node, the surface resistance at the nodes can be almost the same as the surface re...",
  "patent_number": "9927935",
  "abstract": "A touch panel includes a transparent substrate and a sensing pattern formed on the transparent substrate. The sensing pattern is in the form of a mesh structure. The mesh structure includes a plurality of conductive wires intersecting with each other to form a plurality of grids and a plurality of nodes connected between the grids. The grids are formed by the conductive wires intersecting with each other, and the nodes are formed at the intersection points of the conductive wires. The node has an annular shape with a center hole being defined in a center portion of the node. Due to the nodes having an annular shape, the surface resistance at the nodes is decreased and the signal attenuation is accordingly reduced. The conductive wires are connected firmly without the risk of breakage after the sensing pattern is formed.",
  "publication_number": "US20160313827A1-20161027",
  "_processing_info": {
    "original_size": 46069,
    "optimized_size": 3689,
    "reduction_percent": 91.99
  }
}