{
  "decision": "ACCEPTED",
  "application_number": "15098705",
  "date_published": "20160811",
  "date_produced": "20160727",
  "title": "METHOD AND SYSTEM FOR IMPROVED E-COMMERCE SHOPPING",
  "filing_date": "20160414",
  "inventor_list": [
    {
      "inventor_name_last": "McDevitt",
      "inventor_name_first": "John",
      "inventor_city": "Clearwater",
      "inventor_state": "FL",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Bunner",
      "inventor_name_first": "Sean",
      "inventor_city": "St. Petersburg",
      "inventor_state": "FL",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Johnson",
      "inventor_name_first": "Gerard",
      "inventor_city": "Wesley Chapel",
      "inventor_state": "FL",
      "inventor_country": "US"
    }
  ],
  "ipcr_labels": [
    "G06Q3006"
  ],
  "main_ipcr_label": "G06Q3006",
  "summary": "<SOH> SUMMARY <EOH>In an exemplary embodiment of the present invention, a system may be provided that includes a video component, a processing component, and a communication component. For example, an example system may be implemented with a general purpose computer (“PC”). The 5 example system may be a desktop, laptop, cellular telephone, personal digital assistant (“PDA”), smart-phone, television with internal or attached processors (e.g., a “cable-box”), or any number of other systems that provide the essential elements of the present invention. The system may provide a combination of product presentation tools to facilitate a diversified shopping experience for the user. For example, the example systems and methods may provide three general presentation formats. First, a user may be able to browse through an electronic catalog of products. This catalog may contain all of the products available, may contain products that are not available in the other formats, or may lack some products that are available in the other formats. Second, the user may be able to see a live video feed. This may be an ongoing video presentation of different items for sale. Several companies already present products for sale on one or more television stations, in one or more broadcast areas. Example embodiments of the present invention may tie into that established service and present the live feed of that on-going program. The program itself may be live or pre-recorded, and the “live” format may present the live feed of the program. This program may have information embedded in the feed, such as a textual description about the product and terms of the offering. The information may include a phone number to call to order the product. When transmitted to a passive television, the embedded information may be the sole source of information about the product or ordering terms. However, when accessed via a system according to an example embodiment of the present invention, additional informat...",
  "patent_number": "9697549",
  "abstract": "An e-commerce system and method for presenting product information to a viewer, where a video feed and product information associated with a product that relates to the content in the video feed can be displayed or presented to the viewer on one or more remote display devices.",
  "publication_number": "US20160232587A1-20160811",
  "_processing_info": {
    "original_size": 66059,
    "optimized_size": 3165,
    "reduction_percent": 95.21
  }
}