{
  "date_produced": "20170906",
  "publication_number": "US20170270421A1-20170921",
  "main_ipcr_label": "G06N700",
  "decision": "PENDING",
  "application_number": "15092119",
  "inventor_list": [
    {
      "inventor_name_last": "Frank",
      "inventor_name_first": "Adam",
      "inventor_city": "New York City",
      "inventor_state": "NY",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Patron",
      "inventor_name_first": "Kyle",
      "inventor_city": "New York City",
      "inventor_state": "NY",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Pham",
      "inventor_name_first": "Khoa",
      "inventor_city": "New York City",
      "inventor_state": "NY",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Kesin",
      "inventor_name_first": "Maxim",
      "inventor_city": "Woodmere",
      "inventor_state": "NY",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Paul",
      "inventor_name_first": "Sanjay",
      "inventor_city": "New York City",
      "inventor_state": "NY",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Antihi",
      "inventor_name_first": "Alexandru Viorel",
      "inventor_city": "Surrey",
      "inventor_state": "",
      "inventor_country": "GB"
    }
  ],
  "abstract": "Aspects of the present disclosure relate to a machine determining a quality ranking of a subject. The machine accesses a current input representing answers to a plurality of questions about the subject, each answer representing a ranking of a quality of the subject at a specified time, where the subject has a geographic location. The machine determines, based on the current input, an overall ranking of the quality of the subject. The machine determines, based on the current input and based on one or more of input received about the subject at a time different from the specified time and input about other subjects proximate to the geographic location, a future ranking of the quality of the subject. The machine transmits a graphical output corresponding to the overall ranking and the determined future ranking of the quality of the subject.",
  "filing_date": "20160406",
  "patent_number": "None",
  "summary": "<SOH> BRIEF DESCRIPTION OF THE DRAWINGS <EOH>Various ones of the appended drawings merely illustrate example embodiments of the present inventive subject matter and cannot be considered as limiting its scope. FIG. 1 is a diagram of an example networking system for computing a quality ranking of a subject. FIG. 2 is a block diagram of an example of the data repository of FIG. 1 . FIG. 3 is a block diagram of an example of the server of FIG. 1 . FIGS. 4, 4A, and 4B are block diagrams of examples of the client computing device of FIG. 1 . FIG. 5 is a flowchart illustrating a method for computing a quality ranking of a subject. FIG. 6 is a diagrammatic representation of a machine in the example form of a computer system within which a set of instructions for causing the machine to perform any one or more of the methodologies discussed herein may be executed. FIGS. 7A-7C are diagrams of example user interfaces that may be displayed in conjunction with some implementations of the subject technology. detailed-description description=\"Detailed Description\" end=\"lead\"?",
  "date_published": "20170921",
  "title": "COMPUTING A QUALITY RANKING OF A SUBJECT",
  "ipcr_labels": [
    "G06N700",
    "G06F1730"
  ],
  "_processing_info": {
    "original_size": 70661,
    "optimized_size": 3209,
    "reduction_percent": 95.46
  }
}