{
  "date_produced": "20160928",
  "publication_number": "US20160300151A1-20161013",
  "main_ipcr_label": "G06N700",
  "decision": "REJECTED",
  "application_number": "15098381",
  "inventor_list": [
    {
      "inventor_name_last": "Bostick",
      "inventor_name_first": "James E.",
      "inventor_city": "Cedar Park",
      "inventor_state": "TX",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Cunico",
      "inventor_name_first": "Hernan A.",
      "inventor_city": "Holly Springs",
      "inventor_state": "NC",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Ganci, Jr.",
      "inventor_name_first": "John M.",
      "inventor_city": "Cary",
      "inventor_state": "NC",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Keen",
      "inventor_name_first": "Martin G.",
      "inventor_city": "Cary",
      "inventor_state": "NC",
      "inventor_country": "US"
    }
  ],
  "abstract": "A method, computer system and computer program product for predicting traffic is provided. A processor determines a content of a first message posted to a social network. A processor determines that the content of the first message describes a first event. A processor determines an amount of predicted traffic to be caused by the first event. A processor determines a content of a second message posted to a social network. A processor determines that the content of the second message describes the first event. A processor adjusts the amount of predicted traffic to be caused by the first event based, at least in part, on the content of the first and second message, where the amount of predicted traffic to be caused by the first event is increased based, at least in part, on the first and second message describing the first event.",
  "filing_date": "20160414",
  "patent_number": "None",
  "summary": "<SOH> SUMMARY <EOH>Embodiments of the present invention provide a method, system, and program product to provide predictive navigation. A processor determines a content of a first message posted to a social network. A processor determines that the content of the first message describes a first event, wherein the first message indicates one or more of (i) a type of the first event, (ii) a location of the first event, and (iii) a time frame that first event will occur. A processor determines an amount of predicted traffic to be caused by the first event. A processor determines a content of a second message posted to a social network. A processor determines that the content of the second message describes the first event. A processor adjusts the amount of predicted traffic to be caused by the first event based, at least in part, on the content of the first and second message, wherein the amount of predicted traffic to be caused by the first event is increased based, at least in part, on the first and second message describing the first event. A processor receives an observed amount of traffic caused by the first event. A processor determines a difference between (i) the amount of predicted traffic to be caused by the first event and (ii) the observed amount of traffic caused by the first event. In response to the difference being above a certain amount of traffic, a processor adjusts an amount of predicted traffic to be caused by a second event, wherein the second event occurs at a later time than the first event. A processor determines a content of a third message posted to a social network. A processor determines the content of the third message describes a third event. A processor receives a location as a destination to for navigation. A processor determines a route from a current location to the destination. A processor determines a portion of the route intersects with a location of the first event. A processor determines a first alternative route which bypasses th...",
  "date_published": "20161013",
  "title": "PREDICTIVE NAVIGATION",
  "ipcr_labels": [
    "G06N700",
    "H04L2908",
    "H04W402"
  ],
  "_processing_info": {
    "original_size": 72976,
    "optimized_size": 3820,
    "reduction_percent": 94.77
  }
}