{
  "decision": "PENDING",
  "application_number": "15091965",
  "date_published": "20170309",
  "date_produced": "20170223",
  "title": "TOUCH PANEL DEVICE",
  "filing_date": "20160406",
  "inventor_list": [
    {
      "inventor_name_last": "MAKIUCHI",
      "inventor_name_first": "Yuji",
      "inventor_city": "Tokyo",
      "inventor_state": "",
      "inventor_country": "JP"
    }
  ],
  "ipcr_labels": [
    "G06F3045",
    "G06F3041",
    "G06F3047"
  ],
  "main_ipcr_label": "G06F3045",
  "summary": "<SOH> SUMMARY <EOH>According to an aspect of the present invention, there is provided a touch panel device including: a first resistance film; a second resistance film opposed to the first resistance film; a pair of first electrodes that is arranged on the first resistance film, and applies a first voltage to the first resistance film; a pair of second electrodes that is arranged on both ends of the second resistance film in the same direction as an application direction of the first voltage; a first detector that is connected to the pair of the second electrodes, and detects voltages at the second electrodes, respectively; and a calculator that calculates coordinates of two points in the application direction of the first voltage based on the respective voltages detected by the first detector. The object and advantages of the invention will be realized and attained by means of the elements and combinations particularly pointed out in the claims. It is to be understood that both the foregoing general description and the following detailed description are exemplary and explanatory and are not restrictive of the invention, as claimed.",
  "patent_number": "None",
  "abstract": "A touch panel device including: a first resistance film; a second resistance film opposed to the first resistance film; a pair of first electrodes that is arranged on the first resistance film, and applies a first voltage to the first resistance film; a pair of second electrodes that is arranged on both ends of the second resistance film in the same direction as an application direction of the first voltage; a first detector that is connected to the pair of the second electrodes, and detects voltages at the second electrodes, respectively; and a calculator that calculates coordinates of two points in the application direction of the first voltage based on the respective voltages detected by the first detector.",
  "publication_number": "US20170068358A1-20170309",
  "_processing_info": {
    "original_size": 52738,
    "optimized_size": 2393,
    "reduction_percent": 95.46
  }
}