{
  "date_produced": "20170927",
  "publication_number": "US20170293855A1-20171012",
  "main_ipcr_label": "G06N9900",
  "decision": "PENDING",
  "application_number": "15092351",
  "inventor_list": [
    {
      "inventor_name_last": "PERINCHERRY",
      "inventor_name_first": "Vijay",
      "inventor_city": "Potomac",
      "inventor_state": "MD",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "GELBART",
      "inventor_name_first": "Janine",
      "inventor_city": "Bethesda",
      "inventor_state": "MD",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "INZELSTEIN",
      "inventor_name_first": "Marc",
      "inventor_city": "Rockville",
      "inventor_state": "MD",
      "inventor_country": "US"
    }
  ],
  "abstract": "Some embodiments relate generally to the processing of compressed multidimensional data and selection of engagement rules based on the compressed multidimensional data. In some embodiments, a method includes retrieving, via a processor, a multidimensional data profile that includes a set of first inclination distributions, each associated with a data dimension. The processor matches a first set of engagement rules to the multidimensional data profile to define a matched set, each engagement rule of the first set of engagement rules having a corresponding confidence level and a corresponding set of second inclination distributions. The processor selects an engagement rule from the matched set that has a corresponding confidence level no less than a corresponding confidence level for each remaining engagement rule from the matched set, and sends a signal causing display of a stimulus to a user according to the selected engagement rule and not according to the remaining engagement rules.",
  "filing_date": "20160406",
  "patent_number": "None",
  "summary": "<SOH> SUMMARY <EOH>Some embodiments described herein relate generally to the processing of user-specific compressed multidimensional data profiles and the selection of engagement rules based on the compressed multidimensional data profiles. In some embodiments, a method includes retrieving, via a processor, a compressed multidimensional data profile that includes a set of first inclination distributions, each associated with a data dimension. The processor matches a first set of engagement rules to the compressed multidimensional data profile to define a matched set, each engagement rule of the first set of engagement rules having a corresponding confidence level and a corresponding set of second inclination distributions. The processor selects an engagement rule from the matched set that has a corresponding confidence level no less than a corresponding confidence level for each remaining engagement rule from the matched set, and sends a signal causing display of a stimulus to a user according to the selected engagement rule and not according to the remaining engagement rules.",
  "date_published": "20171012",
  "title": "ADAPTIVE SYSTEMS, APPARATUS AND METHODS FOR CORRELATING COMPRESSED MULTIDIMENSIONAL DATA PROFILES TO ENGAGEMENT RULES",
  "ipcr_labels": [
    "G06N9900",
    "G06N502"
  ],
  "_processing_info": {
    "original_size": 42427,
    "optimized_size": 3006,
    "reduction_percent": 92.91
  }
}