{
  "date_produced": "20160928",
  "publication_number": "US20160300155A1-20161013",
  "main_ipcr_label": "G06N9900",
  "decision": "ACCEPTED",
  "application_number": "15095507",
  "inventor_list": [
    {
      "inventor_name_last": "Betz",
      "inventor_name_first": "Andreas",
      "inventor_city": "Cambridgeshire",
      "inventor_state": "",
      "inventor_country": "GB"
    },
    {
      "inventor_name_last": "Gonzalez-Zalba",
      "inventor_name_first": "Miguel Fernando",
      "inventor_city": "Cambridgeshire",
      "inventor_state": "",
      "inventor_country": "GB"
    }
  ],
  "abstract": "Quantum information processing apparatus and methods are described. The apparatus comprises a device for defining a qubit and a reflectometry circuit for reading out a state of the qubit. The device comprises a semiconductor nanowire extending along a first direction having first and second obtuse or acute edges running along the first direction, gate dielectric overlying the first and second edges of the nanowire and a split gate running across a section of the nanowire in a second, transverse direction, the split gate comprising first and second gates overlying the first and second edges respectively. The reflectometry circuit comprises a resonator coupled to the first or second gate.",
  "filing_date": "20160411",
  "patent_number": "9773208",
  "summary": "<SOH> SUMMARY <EOH>According to a first aspect of the present invention there is provided quantum information processing apparatus. The apparatus comprises a device for defining a qubit and a reflectometry circuit for reading out a state of the qubit. The device comprises a semiconductor nanowire extending along a first direction having first and second obtuse or acute edges running along the first direction, gate dielectric underlying or overlying the first and second edges of the nanowire and a split gate running across the nanowire in a second, transverse direction, the split gate comprising first and second gates underlying or overlying the first and second edges respectively. The reflectometry circuit comprises a resonator coupled to the first or second gate. The resonator has a resonant frequency which changes according to the impedance of the device. Thus, the device provides two edge (or “corner”) states which are formed at the edges of the nanowire which can be longitudinally constrained, for example using spacers, to form a double quantum dot. The double quantum dot can be used to define a charge qubit, a singlet-triplet qubit or spin qubit. The split gate can be used to provide a means of detuning and carry out initialisation, manipulation and read out of the qubit. The qubit can be readout with high sensitivity using one of the gates, without the need for any external charge sensors. Each edge may be an edge between a side face and a top or bottom face of the nanowire. An internal angle between the side face and the top or bottom face may be about 90°. For example, the nanowire may have a generally rectangular transverse cross section. The edge may be rounded, i.e. having a value of curvature κ=k/w where w is the width of the nanowire and k≧4. The device may comprise first and second barriers spaced apart along the nanowire so as to constrain lengths of the edges. The barriers may be steps in the nanowire. The barriers may be spacers. The barriers may be...",
  "date_published": "20161013",
  "title": "QUANTUM INFORMATION PROCESSING",
  "ipcr_labels": [
    "G06N9900",
    "H01L3902"
  ],
  "_processing_info": {
    "original_size": 82780,
    "optimized_size": 3426,
    "reduction_percent": 95.86
  }
}