{
  "date_produced": "20170405",
  "publication_number": "US20170109624A1-20170420",
  "main_ipcr_label": "G06N3063",
  "decision": "PENDING",
  "application_number": "15094033",
  "inventor_list": [
    {
      "inventor_name_last": "PARK",
      "inventor_name_first": "Sang-Su",
      "inventor_city": "Icheon",
      "inventor_state": "",
      "inventor_country": "KR"
    },
    {
      "inventor_name_last": "LEE",
      "inventor_name_first": "Hyung-Dong",
      "inventor_city": "Icheon",
      "inventor_state": "",
      "inventor_country": "KR"
    }
  ],
  "abstract": "A synapse and a neuromorphic device including the same are provided. The synapse includes: a first electrode; a second electrode spaced apart from the first electrode; an oxygen-containing layer disposed between the first electrode and the second electrode; a reactive metal layer disposed between the oxygen-containing layer and the second electrode and capable of reacting with oxygen ions from the oxygen-containing layer; and an oxygen diffusion-retarding layer provided between the oxygen-containing layer and the reactive metal layer, the oxygen diffusion-retarding layer hindering movement of oxygen ions from the oxygen-containing layer to the reactive metal layer.",
  "filing_date": "20160408",
  "patent_number": "None",
  "summary": "<SOH> SUMMARY <EOH>Embodiments of the present disclosure are directed to a synapse having enhanced symmetry and linearity, and to a neuromorphic device including the same. In accordance with an embodiment, a synapse includes: a first electrode; a second electrode spaced apart from the first electrode; an oxygen-containing layer disposed between the first electrode and the second electrode; a reactive metal layer disposed between the oxygen-containing layer and the second electrode and capable of reacting with oxygen ions from the oxygen-containing layer; and an oxygen diffusion-retarding layer provided between the oxygen-containing layer and the reactive metal layer, the oxygen diffusion-retarding layer hindering movement of oxygen ions from the oxygen-containing layer to the reactive metal layer. In the embodiment, electrical conductivity of the synapse changes depending on a thickness of a dielectric layer generated by a reaction between the oxygen-containing layer and the reactive metal layer. The thickness of the dielectric layer generated by a reaction between the oxygen-containing layer and the reactive metal layer increases with an increase in a number of electrical pulses having a first polarity, which are applied through the first and second electrodes, and the thickness of the dielectric layer decreases with an increase in a number of electrical pulses having a second polarity opposite to the first polarity, which are applied through the first and second electrodes. The first-polarity electrical pulses and the second-polarity electrical pulses have a constant width or constant magnitude, or both. The oxygen diffusion-retarding layer has a thickness that does not completely blocks the movement of the oxygen ions. The oxygen diffusion-retarding layer includes a dielectric material or a semiconductor material. The synapse further includes a resistance layer located between the first electrode and the oxygen-containing layer and/or between the second electrode...",
  "date_published": "20170420",
  "title": "SYNAPSE AND NEUROMORPHIC DEVICE INCLUDING THE SAME",
  "ipcr_labels": [
    "G06N3063",
    "G06N308"
  ],
  "_processing_info": {
    "original_size": 62005,
    "optimized_size": 3362,
    "reduction_percent": 94.58
  }
}