{
  "decision": "ACCEPTED",
  "application_number": "15091932",
  "date_published": "20160818",
  "date_produced": "20160803",
  "title": "DATA-DRIVEN STATE MACHINE FOR USER INTERACTIVE DISPLAYS",
  "filing_date": "20160406",
  "inventor_list": [
    {
      "inventor_name_last": "Chapman",
      "inventor_name_first": "Peter",
      "inventor_city": "Frisco",
      "inventor_state": "TX",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Foster",
      "inventor_name_first": "Andrew",
      "inventor_city": "Irving",
      "inventor_state": "TX",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Capps",
      "inventor_name_first": "Michael",
      "inventor_city": "Dallas",
      "inventor_state": "TX",
      "inventor_country": "US"
    }
  ],
  "ipcr_labels": [
    "G06F30484",
    "G06Q5000",
    "G06F30481"
  ],
  "main_ipcr_label": "G06F30484",
  "summary": "<SOH> BRIEF DESCRIPTION OF THE DRAWINGS <EOH>FIG. 1 illustrates an example of a system for implementing particular disclosed embodiments. FIG. 2 illustrates an example social network. FIG. 3 illustrates an example system for implementing particular disclosed embodiments. FIG. 4 illustrates an example flowchart of a method for implementing particular disclosed embodiments. FIG. 5 illustrates an example layout of a data-driven state machine architecture used in connection with particular disclosed embodiments. FIG. 6 illustrates an example flowchart of a method for establishing state machine definitions in connection with particular disclosed embodiments. FIG. 7 illustrates an example flowchart of a method for interpreting state machine definitions and performing actions based on the state machine definitions in connection with particular disclosed embodiments. FIG. 8 illustrates an example data flow in a system. FIG. 9 illustrates an example network environment. FIG. 10 illustrates an example computer system architecture. detailed-description description=\"Detailed Description\" end=\"lead\"?",
  "patent_number": "9821230",
  "abstract": "Systems and methods may be used to provide and implement a state machine in a display software user interface environment, and used to handle events and actions associated with the state machine. In one example embodiment, a virtual display environment provided by an engine is interfaced with a state machine that is configured to interpret various state machine definitions corresponding to states occurring in the virtual display environment. The state machine definitions may be used to determine how a particular state of a virtual item in the display environment may be represented, interacted with, and transitioned into another state. Use of the state machine definitions may enable representation of complex scenarios for virtual objects and events in the display environment in a unified definition format, without requiring specialized programming or scripting commands to implement the scenarios.",
  "publication_number": "US20160239184A1-20160818",
  "_processing_info": {
    "original_size": 115302,
    "optimized_size": 2875,
    "reduction_percent": 97.51
  }
}