{
  "date_produced": "20171004",
  "publication_number": "US20170300824A1-20171019",
  "main_ipcr_label": "G06N700",
  "decision": "PENDING",
  "application_number": "15098074",
  "inventor_list": [
    {
      "inventor_name_last": "Peng",
      "inventor_name_first": "Jufeng",
      "inventor_city": "Avon",
      "inventor_state": "CT",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Larsson",
      "inventor_name_first": "Gregory Patrick",
      "inventor_city": "Brooklyn",
      "inventor_state": "NY",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Kosednar",
      "inventor_name_first": "Michael F.",
      "inventor_city": "Overland Park",
      "inventor_state": "KS",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Gouin",
      "inventor_name_first": "Anne S.",
      "inventor_city": "Portland",
      "inventor_state": "CT",
      "inventor_country": "US"
    }
  ],
  "abstract": "According to some embodiments, a server may access a data store containing electronic records, each electronic record representing a risk association for an entity in connection with a plurality of relationships, and each electronic record may contain a set of record characteristic values. The server may automatically designate a first sub-set of the set of record characteristic values as fixed effect variables and a second sub-set as random effect variables. A data analytics mixed effect predictive model may then generate, based on the fixed and random effect variables, a future performance estimation value for the risk association of each entity in connection with its plurality of relationships. An indication associated with the future performance estimation value for the risk association of at least one entity in connection with its plurality of relationships may then be transmitted to generate an interactive user interface display.",
  "filing_date": "20160413",
  "patent_number": "None",
  "summary": "<SOH> SUMMARY OF THE INVENTION <EOH>According to some embodiments, systems, methods, apparatus, computer program code and means provide a future performance estimation assessment tool. In some embodiments, a server may access a data store containing electronic records, each electronic record representing a risk association for an entity in connection with a plurality of relationships, and each electronic record may contain a set of record characteristic values. The server may automatically designate a first sub-set of the set of record characteristic values as fixed effect variables and a second sub-set as random effect variables. A data analytics mixed effect predictive model may then generate, based on the fixed and random effect variables, a future performance estimation value for the risk association of each entity in connection with its plurality of relationships. An indication associated with the future performance estimation value for the risk association of at least one entity in connection with its plurality of relationships may then be transmitted to generate an interactive user interface display. Some embodiments comprise: means for accessing, by an automated back-end application computer server, a data store containing electronic records, each electronic record representing a risk association for an entity in connection with a plurality of relationships, wherein each electronic record contains a set of record characteristic values; means for automatically designating, by the back-end application computer server, a first sub-set of the set of record characteristic values as fixed effect variables; means for automatically designating, by the back-end application computer server, a second sub-set of the set of record characteristic values as random effect variables; means for generating, by a data analytics mixed effect predictive model based on the fixed effect variables and the random effect variables, a future performance estimation value for the risk as...",
  "date_published": "20171019",
  "title": "PERFORMANCE ESTIMATION SYSTEM UTILIZING A DATA ANALYTICS PREDICTIVE MODEL",
  "ipcr_labels": [
    "G06N700",
    "G06F1130",
    "G06F1134",
    "G06F1730"
  ],
  "_processing_info": {
    "original_size": 74002,
    "optimized_size": 3999,
    "reduction_percent": 94.6
  }
}