{
  "decision": "ACCEPTED",
  "application_number": "15094634",
  "date_published": "20160804",
  "date_produced": "20160720",
  "title": "Apparatus and Methods for Taking Blood Glucose Measurements and Recommending Insulin Doses",
  "filing_date": "20160408",
  "inventor_list": [
    {
      "inventor_name_last": "Bielawa",
      "inventor_name_first": "Holly",
      "inventor_city": "Ann Arbor",
      "inventor_state": "MI",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Demetris",
      "inventor_name_first": "Carissa",
      "inventor_city": "Ann Arbor",
      "inventor_state": "MI",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Goebel",
      "inventor_name_first": "James",
      "inventor_city": "Ypsilanti",
      "inventor_state": "MI",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Morton",
      "inventor_name_first": "Carol Treat",
      "inventor_city": "Bloomfield Township",
      "inventor_state": "MI",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Pomorski",
      "inventor_name_first": "Michelle",
      "inventor_city": "Pinckney",
      "inventor_state": "MI",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Puricelli",
      "inventor_name_first": "Thomas",
      "inventor_city": "Ann Arbor",
      "inventor_state": "MI",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Rodgers",
      "inventor_name_first": "Jim",
      "inventor_city": "Ann Arbor",
      "inventor_state": "MI",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Bashan",
      "inventor_name_first": "Eran",
      "inventor_city": "Ann Arbor",
      "inventor_state": "MI",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Hodish",
      "inventor_name_first": "Israel",
      "inventor_city": "Ann Arbor",
      "inventor_state": "MI",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Hindinger",
      "inventor_name_first": "John R.",
      "inventor_city": "Farmington Hills",
      "inventor_state": "MI",
      "inventor_country": "US"
    }
  ],
  "ipcr_labels": [
    "G06F1900"
  ],
  "main_ipcr_label": "G06F1900",
  "summary": "<SOH> SUMMARY <EOH>Certain embodiments are directed to apparatus and/or methods that allow the user to proceed automatically from the determined glucose level to the event menu. Such action prompts the user attention to the fact that the apparatus at hand is more than a regular glucose meter. This simplifies the learning process of how a new apparatus should be used. Certain embodiments describe apparatus and/or methods that connect a glucose meter and dose-calculator. These disclosed embodiments translate a drop of blood to an actionable item that is: a) whether or not insulin should be taken; and b) a recommended amount of insulin a user should take in case insulin is required. Certain embodiments are directed to apparatus and/or methods that with a single button press the user gets a personalized insulin recommendation. In certain embodiments, the present disclosure comprehends an apparatus for taking blood glucose measurements and recommending insulin doses, comprising: a body for housing: (a) a test strip port for receiving a test strip; (b) at least a first computer-readable memory; (c) a processor operatively connected to the at least first computer-readable memory; (d) a display screen operatively connected to the processor so as to successively display information displays corresponding to at least the following: (i) a patient's current blood glucose level measurement as determined from a sample of the patient's blood provided on a test strip; (ii) an event associated with the said current blood glucose level measurement; and (iii) a recommended insulin dose; and the display screen further operative to continuously display indicia corresponding to each of the said successive information displays; (e) a plurality of user-actuated buttons operatively connected to the processor and positioned adjacent the display screen, the plurality of buttons including a first button operative to enable a user to selectively cycle through the successive information displays...",
  "patent_number": "10007760",
  "abstract": "The present disclosure related to an apparatus that may be used for taking blood glucose measurements and providing individualized insulin dose recommendations wherein the apparatus is easy to use and facilitates improved diabetes control in patients. Also disclosed are related methods.",
  "publication_number": "US20160224751A1-20160804",
  "_processing_info": {
    "original_size": 121517,
    "optimized_size": 4226,
    "reduction_percent": 96.52
  }
}