{
  "date_produced": "20160928",
  "publication_number": "US20160300135A1-20161013",
  "main_ipcr_label": "G06N308",
  "decision": "PENDING",
  "application_number": "15098201",
  "inventor_list": [
    {
      "inventor_name_last": "Moudy",
      "inventor_name_first": "Christopher",
      "inventor_city": "Chandler",
      "inventor_state": "AZ",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Paterson",
      "inventor_name_first": "Todd",
      "inventor_city": "Phoenix",
      "inventor_state": "AZ",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Berns",
      "inventor_name_first": "Kevin",
      "inventor_city": "North Liberty",
      "inventor_state": "IA",
      "inventor_country": "US"
    }
  ],
  "abstract": "Sentiment analyzer systems may include feedback analytics servers configured to receive and analyze feedback data from various client devices. Feedback data may be received and analyzed to determine feedback context and sentiment scores. In some embodiments, natural language processing neural networks may be used to determine sentiment scores for the feedback data. Feedback data also may be grouped into feedback aggregations based on context, and sentiment scores may be calculated for each feedback aggregation. Sentiment analyzer outputs and corresponding output devices may be determined based on the sentiment scores and feedback contexts.",
  "filing_date": "20160413",
  "patent_number": "None",
  "summary": "<SOH> BRIEF SUMMARY <EOH>Various embodiments described herein may relate to systems and methods for capturing feedback data in a content distribution network and performing sentiment analyses. In some embodiments, sentiment analyzer systems may include feedback analytics servers configured to receive and analyze feedback data from various client devices. The feedback data may be received and analyzed to determine feedback context and a sentiment score for each feedback data. In some cases, natural language processing neural networks may be used to determine sentiment scores for feedback data. Feedback data also may be grouped into feedback aggregations based on context, and sentiment scores may be calculated for each feedback aggregation. Sentiment analyzer outputs and corresponding output devices may be determined based on the sentiment scores and feedback contexts. In some embodiments, the captured feedback data may include uni-modal and/or multimodal input data. In such systems, additional feedback capture devices and multimodal data analysis devices may be included in the sentiment analyzer. For example, audio, image, and video data capture devices and data analyzers may be incorporated to analyze multimodal feedback data, synchronize the feedback data, and calculate and sentiment scores. Additionally, the feedback data may be grouped into multiple feedback aggregations corresponding to the same feedback context but different time periods. In such cases, the feedback aggregations may be analyzed to determine trends and patters in feedback sentiment, and/or identify outlier data for specific system users, groups, or content. In certain embodiments, a sentiment analyzer system may determine sentiment scores in real-time or near real-time and transmit sentiment analyzer outputs to one or more presentation computing devices associated with a presenter of live content. As noted above, in some embodiments, various natural language processing (NLP) engines, such as sen...",
  "date_published": "20161013",
  "title": "RELATIVISTIC SENTIMENT ANALYZER",
  "ipcr_labels": [
    "G06N308",
    "H04L2906",
    "G06F1728",
    "G06F1730"
  ],
  "_processing_info": {
    "original_size": 229643,
    "optimized_size": 3500,
    "reduction_percent": 98.48
  }
}