{
  "decision": "PENDING",
  "application_number": "15097448",
  "date_published": "20161027",
  "date_produced": "20161012",
  "title": "DISPLAY APPARATUS AND METHOD FOR CONTROLLING THE SAME",
  "filing_date": "20160413",
  "inventor_list": [
    {
      "inventor_name_last": "LEE",
      "inventor_name_first": "Min-woo",
      "inventor_city": "Hwaseong-si",
      "inventor_state": "",
      "inventor_country": "KR"
    },
    {
      "inventor_name_last": "CHOE",
      "inventor_name_first": "Won-hee",
      "inventor_city": "Seoul",
      "inventor_state": "",
      "inventor_country": "KR"
    },
    {
      "inventor_name_last": "CHO",
      "inventor_name_first": "Seung-hwan",
      "inventor_city": "Yongin-si",
      "inventor_state": "",
      "inventor_country": "KR"
    },
    {
      "inventor_name_last": "CHO",
      "inventor_name_first": "Jae-hun",
      "inventor_city": "Suwon-si",
      "inventor_state": "",
      "inventor_country": "KR"
    },
    {
      "inventor_name_last": "CHOI",
      "inventor_name_first": "Jae-won",
      "inventor_city": "Suwon-si",
      "inventor_state": "",
      "inventor_country": "KR"
    }
  ],
  "ipcr_labels": [
    "G09G510",
    "G09G537",
    "G06T1160"
  ],
  "main_ipcr_label": "G09G510",
  "summary": "<SOH> SUMMARY <EOH>Exemplary embodiments may address the aforementioned and/or other problems and disadvantages occurring in the related art. Also, exemplary embodiments are not required to overcome the disadvantages described above, and an exemplary embodiment may not overcome any of the problems described above. According to an aspect of an exemplary embodiment, a display apparatus includes: a display configured to display content; a sensor configured to sense ambient light; and a processor configured to, in response to the ambient light satisfying a predetermined condition, divide the display content into at least a first area and a second area based on an attribute of the content and individually control a first output luminance of the first area and a second output luminance of the second area. The first output luminance may be different than the second output luminance. The processor may be further configured to individually control the first output luminance to reach a first target luminance value before the second output luminance area reaches a second target luminance value. The processor may be further configured to divide the display content into the first area and the second area in response to at least one among the ambient light satisfying the predetermined condition, an event in which the ambient light changes rapidly by an amount greater than a predetermined critical value, an event in which the display is converted from a dark screen to a bright screen while the ambient light is lower than a certain illuminance, and an event in which a state of the display is converted from an inactive state to an active state while the ambient light is lower than the certain illuminance. The first area may correspond to an interested area and the second area may correspond to an uninterested area, and the first area and the second area may be determined based on the attribute of the content. The processor may be further configured to, in response to a state of the ...",
  "patent_number": "None",
  "abstract": "A display apparatus includes a display configured to display content, a sensor configured to sense ambient light, and a processor configured to, in response to the ambient light satisfying a predetermined condition, divide the screen into at least a first area and a second area based on an attribute of the content and individually control a first output luminance of the first area and a second output luminance of the second area.",
  "publication_number": "US20160314762A1-20161027",
  "_processing_info": {
    "original_size": 77379,
    "optimized_size": 3567,
    "reduction_percent": 95.39
  }
}