{
  "decision": "PENDING",
  "application_number": "15091318",
  "date_published": "20160728",
  "date_produced": "20160713",
  "title": "DISPLAY APPARATUS WITH A CAMERA AND CONTROL METHOD THEREOF",
  "filing_date": "20160405",
  "inventor_list": [
    {
      "inventor_name_last": "JANG",
      "inventor_name_first": "Young-ick",
      "inventor_city": "Seoul",
      "inventor_state": "",
      "inventor_country": "KR"
    },
    {
      "inventor_name_last": "KIM",
      "inventor_name_first": "Se-jun",
      "inventor_city": "Suwon-si",
      "inventor_state": "",
      "inventor_country": "KR"
    },
    {
      "inventor_name_last": "KIM",
      "inventor_name_first": "Chang-yong",
      "inventor_city": "Yongin-si",
      "inventor_state": "",
      "inventor_country": "KR"
    }
  ],
  "ipcr_labels": [
    "H04N5232",
    "H04N714",
    "G06F316"
  ],
  "main_ipcr_label": "H04N5232",
  "summary": "<SOH> SUMMARY <EOH>Additional aspects and/or advantages of one or more embodiments will be set forth in part in the description which follows and, in part, will be apparent from the description, or may be learned by practice of one or more embodiments of disclosure. One or more embodiments are inclusive of such additional aspects. One or more exemplary embodiments may provide a display apparatus that may include: an image communication camera which may include an image sensor to sense an image passed through a lens, may be installed to be movable up and down at an upper portion of the display apparatus, and may upwardly and outwardly protrude from the display apparatus as moved up when being in use; an image processor which may process an image signal corresponding to an image sensed by the image sensor; a display which may display an image the processed image signal; a sensor which may sense whether the image communication camera is moved up or down; a power supply which may supply electric power to components of the display apparatus; and a controller which may control the power supply to supply electric power to the image communication camera if the sensor senses that the image communication camera is moved up, and cut off the electric power to the image communication camera if the sensor senses that the image communication camera is moved down. The display apparatus may further include a voice sensor to receive voice, and the controller may control the power supply to supply electric power to the voice sensor if the sensor senses that the image communication camera is moved up, and cut off the electric power to the voice sensor if the sensor senses that the image communication camera is moved down. The display apparatus may further include an insertion unit at the upper portion of the display apparatus, in which the image communication camera may be moved down and inserted, and an elastic member coupled to the insertion unit and the image communication camera, a...",
  "patent_number": "None",
  "abstract": "A display apparatus and a control method thereof include a display and a camera configured to be provided at an upper portion of the display apparatus to generate an image signal, the camera being movable to an up position or a down position. Also included are a voice sensor configured to receive a voice of a user, a power supply configured to supply electric power to the camera and a controller configured to control the camera to generate the image signal when the camera is in the up position. The controller is also configured to control the camera to disable the generation of the image signal and to output a message indicating that the camera is in the down position, when the camera is in the down position.",
  "publication_number": "US20160219219A1-20160728",
  "_processing_info": {
    "original_size": 54822,
    "optimized_size": 3571,
    "reduction_percent": 93.49
  }
}