{
  "date_produced": "20161214",
  "publication_number": "US20160379138A1-20161229",
  "main_ipcr_label": "G06N9900",
  "decision": "PENDING",
  "application_number": "15104197",
  "inventor_list": [
    {
      "inventor_name_last": "JAYADEVA",
      "inventor_name_first": ".",
      "inventor_city": "New Delhi",
      "inventor_state": "",
      "inventor_country": "IN"
    }
  ],
  "abstract": "Systems and methods for classifying test data based on maximum margin classifier are described. In one implementation, the method includes obtaining training data having a predefined sample size, wherein the training data is composed of separable data-sets. For the training data, a Vapnik-Chervonenkis (VC) dimension for the training data is determined. For the VC dimension, an exact bound is subsequently determined. The exact bound may be minimized for obtaining the minimum VC classifier for predicting at least one class to which samples of the training data belong.",
  "filing_date": "20160613",
  "patent_number": "None",
  "summary": "<SOH> SUMMARY <EOH>This summary is provided to introduce concepts related to systems and methods for cutting holes onto a sheet-metal assembly. The concepts are further described below in the detailed description. This summary is not intended to identify essential features of the claimed subject matter nor is it intended for use in determining or limiting the scope of the claimed subject matter. Systems and methods, for classifying data and enable learning of machines, are described. In one implementation, training data having a predefined sample size is obtained. In the present implementation, the training data is composed of separable datasets. Subsequently, a Vapnik-Chervonenkis (VC) dimension for the training data is determined. Based on the VC dimension, an exact bound on the VC dimension is further determined. On obtaining the exact bound on the VC dimension, the exact bound is minimized. Based on the minimizing of the exact, a classifier is obtained. The generated classifier may be used for predicting at least one class to which samples of the training data belong. These and other aspects of the present subject matter are further described in conjunction with the detailed description, as provided in the sections below:",
  "date_published": "20161229",
  "title": "CLASSIFYING TEST DATA BASED ON A MAXIMUM MARGIN CLASSIFIER",
  "ipcr_labels": [
    "G06N9900",
    "G06N502"
  ],
  "_processing_info": {
    "original_size": 72471,
    "optimized_size": 2369,
    "reduction_percent": 96.73
  }
}