{
  "decision": "PENDING",
  "application_number": "15102096",
  "date_published": "20161020",
  "date_produced": "20161005",
  "title": "ELECTRONIC BOARD",
  "filing_date": "20160606",
  "inventor_list": [
    {
      "inventor_name_last": "JUNG",
      "inventor_name_first": "Soon Hwa",
      "inventor_city": "Daejeon",
      "inventor_state": "",
      "inventor_country": "KR"
    },
    {
      "inventor_name_last": "HONG",
      "inventor_name_first": "Kyung Ki",
      "inventor_city": "Daejeon",
      "inventor_state": "",
      "inventor_country": "KR"
    },
    {
      "inventor_name_last": "CHANG",
      "inventor_name_first": "Yeong Rae",
      "inventor_city": "Daejeon",
      "inventor_state": "",
      "inventor_country": "KR"
    },
    {
      "inventor_name_last": "PARK",
      "inventor_name_first": "Jin Young",
      "inventor_city": "Daejeon",
      "inventor_state": "",
      "inventor_country": "KR"
    },
    {
      "inventor_name_last": "KANG",
      "inventor_name_first": "Joon Koo",
      "inventor_city": "Daejeon",
      "inventor_state": "",
      "inventor_country": "KR"
    },
    {
      "inventor_name_last": "JEONG",
      "inventor_name_first": "Hyeok",
      "inventor_city": "Daejeon",
      "inventor_state": "",
      "inventor_country": "KR"
    },
    {
      "inventor_name_last": "HER",
      "inventor_name_first": "Eun Kyu",
      "inventor_city": "Daejeon",
      "inventor_state": "",
      "inventor_country": "KR"
    }
  ],
  "ipcr_labels": [
    "G06F3041",
    "G02F11335",
    "G02F113363",
    "G02F11333"
  ],
  "main_ipcr_label": "G06F3041",
  "summary": "<SOH> SUMMARY OF THE INVENTION <EOH>It is an object of the invention to provide an electronic board that comprises a polarizing plate including a polarizer and a high hardness plastic film integrated with each other, and thus, has excellent surface hardness, impact resistance, durability and wear resistance, and yet, is light-weighted and thin. According to one aspect of the invention, the present invention provides an electronic board comprising a display panel; a polarizing plate disposed on the display panel, and including a polarizer and a high hardness plastic film integrated with each other; and a touch sensor recognizing input information through the contact of a user. If the polarizing plate comprising a high hardness plastic film according to the present invention is used, scratch resistance, impact resistance, high hardness and high durability may be secured without applying a separate cover plate consisting of glass or tempered glass, and a risk of damage that may be caused by using a separate glass or tempered glass cover plate may be prevented. And, the electronic board using an integrated polarizing plate may minimize the number of films or layers included in a device, thereby realizing a device that has high transmittance and visibility, and yet, is thin and light. In addition, since the present invention uses an integrated polarizing plate, a device assembly process may be simplified, thereby reducing cost, and lowering fraction defective of finished products.",
  "patent_number": "None",
  "abstract": "The present invention relates to an electronic board comprising a display panel; a polarizing plate disposed on the display panel, and including a polarizer and a high hardness plastic film integrated with each other; and a touch sensor recognizing input information through the contact of a user.",
  "publication_number": "US20160306452A1-20161020",
  "_processing_info": {
    "original_size": 92119,
    "optimized_size": 3194,
    "reduction_percent": 96.53
  }
}