{
  "decision": "PENDING",
  "application_number": "15105616",
  "date_published": "20161103",
  "date_produced": "20161019",
  "title": "ADVICE SYSTEM STRUCTURED TO IDENTIFY AN APPROPRIATE MEDICAL DEVICE BASED UPON GENETIC ANALYYSIS",
  "filing_date": "20160617",
  "inventor_list": [
    {
      "inventor_name_last": "GRASHOW",
      "inventor_name_first": "JONATHAN SAYER",
      "inventor_city": "CHESWICK",
      "inventor_state": "PA",
      "inventor_country": "US"
    }
  ],
  "ipcr_labels": [
    "G06F1900",
    "G06N504",
    "G06N700",
    "A61M1606"
  ],
  "main_ipcr_label": "G06F1900",
  "summary": "<SOH> SUMMARY OF THE INVENTION <EOH>An improved advice system is configured to employ a genetic analysis of a patient to identify one or more characteristics of the patient. The advice system employs the characteristics to identify one or more attributes of a medical device that would desirably exist in a medical device that is to be prescribed for the patient. The advice system then identifies from the one or more attributes one or more medical devices from among a plurality of medical devices whose features at least in part meet the one or more attributes. The advice system then outputs a recommendation of the one or more medical devices. The system employs known genes that are expressive of certain traits in a person, with the known traits being interpreted or evaluated in terms of characteristics that are relevant in selecting a medical device from among a plurality of medical devices, such as patient interface devices or other devices. Accordingly, an aspect of the disclosed and claimed concept is to provide an improved method of recommending a medical device from among a plurality of medical devices based upon a genetic analysis of the patient. Another aspect of the disclosed and claimed concept is to identify from the genetic analysis one or more characteristics of the patient and to, in turn, identify from the one or more characteristics one or more attributes that would be desirable in a medical device for the patient. Another aspect of the disclosed and claimed concept is to identify a medical device from among a plurality of medical devices that optimally or at least in part meets the one or more attributes and outputs a recommendation of the medical device for the patient. Another aspect of the disclosed and claimed concept is to provide an improved advice system for recommending a medical device such as a patient interface device for providing respiratory therapy to a patient. Accordingly, an aspect of the disclosed and claimed concept is to provide an ...",
  "patent_number": "None",
  "abstract": "An advice system employs a genetic analysis of a patient to identify one or more characteristics of the patient. The advice system employs the characteristics to identify one or more attributes of a medical device that would desirably exist in a medical device that is to be prescribed for the patient. The advice system then identifies from the one or more attributes one or more medical devices from among a plurality of medical devices whose features at least in part meet the one or more attributes. The advice system then outputs a recommendation of the one or more medical devices. The system employs known genes that are expressive of certain traits in a person, with the known traits being interpreted or evaluated in terms of characteristics that are relevant in selecting a medical device from among a plurality of medical devices, such as patient interface devices or other devices.",
  "publication_number": "US20160321429A1-20161103",
  "_processing_info": {
    "original_size": 41247,
    "optimized_size": 3521,
    "reduction_percent": 91.46
  }
}