{
  "decision": "PENDING",
  "application_number": "15105303",
  "date_published": "20161027",
  "date_produced": "20161012",
  "title": "WIRELESS COMMUNICATION OF PRINT CONTENT AND A MOBILE DEVICE IDENTIFIER",
  "filing_date": "20160616",
  "inventor_list": [
    {
      "inventor_name_last": "Arora",
      "inventor_name_first": "Puneet Kumar",
      "inventor_city": "New Delhi",
      "inventor_state": "",
      "inventor_country": "IN"
    },
    {
      "inventor_name_last": "Ganesan",
      "inventor_name_first": "Kumaravel",
      "inventor_city": "Chinnalapatti, Dindigul",
      "inventor_state": "",
      "inventor_country": "IN"
    }
  ],
  "ipcr_labels": [
    "G06F312",
    "H04W1208",
    "H04N100",
    "G06F2160"
  ],
  "main_ipcr_label": "G06F312",
  "summary": "<SOH> BRIEF DESCRIPTION OF THE DRAWINGS <EOH>The following detailed description references the drawings, wherein: FIG. 1 is a block diagram of an example computing device to authorize printing of print content received via direct wireless communication; FIG. 2 is a block diagram of an example printing environment to authorize printing of print content received via direct wireless communication at a printing device; FIG. 3 is a flowchart of an example method for providing a mobile device identifier to a printing device to authorize direct wireless printing by the mobile device; and FIG. 4 is a flowchart of an example method for providing a mobile device identifier, included in a remote printing request, to a printing device to authorize direct wireless printing by the mobile device. detailed-description description=\"Detailed Description\" end=\"lead\"?",
  "patent_number": "None",
  "abstract": "Examples disclosed herein relate to wireless communication of print content. Examples include a remote printing request acquired by a remote printing server from a mobile device, the remote printing request including first print content and identifying a mobile device identifier. Examples further include second print content and the mobile device identifier acquired via direct wireless communication.",
  "publication_number": "US20160313954A1-20161027",
  "_processing_info": {
    "original_size": 69462,
    "optimized_size": 2024,
    "reduction_percent": 97.09
  }
}