{
  "decision": "PENDING",
  "application_number": "15109459",
  "date_published": "20161110",
  "date_produced": "20161026",
  "title": "An Apparatus and/or Method",
  "filing_date": "20160701",
  "inventor_list": [
    {
      "inventor_name_last": "LESONEN",
      "inventor_name_first": "Janne",
      "inventor_city": "Helsinki",
      "inventor_state": "",
      "inventor_country": "FI"
    },
    {
      "inventor_name_last": "MAKELAINEN",
      "inventor_name_first": "Esa",
      "inventor_city": "Helsinki",
      "inventor_state": "",
      "inventor_country": "FI"
    }
  ],
  "ipcr_labels": [
    "G06F3044"
  ],
  "main_ipcr_label": "G06F3044",
  "summary": "<SOH> BRIEF SUMMARY <EOH>According to various, but not necessarily all, embodiments of the invention there is provided an apparatus comprising: a notched shield electrode portion comprising a notch at an edge; and an overlapping shield electrode portion, wherein the overlapping shield electrode portion overlaps the notch in the notched shield electrode portion. According to various, but not necessarily all, embodiments of the invention there is provided a method comprising: providing a notched electrically conductive portion, wherein the notched electrically conductive portion comprises a notch at an edge of the portion; providing a further electrically conductive portion overlapping the notch of the notched electrically conductive portion; providing for the electrical interconnection of the notched electrically conductive portion and the further electrically conductive portion to form a shield electrode for capacitive touch sensing.",
  "patent_number": "None",
  "abstract": "An apparatus including a notched shield electrode portion including a notch at an edge; and an overlapping shield electrode portion, wherein the overlapping shield electrode portion overlaps the notch in the notched shield electrode portion.",
  "publication_number": "US20160328049A1-20161110",
  "_processing_info": {
    "original_size": 28281,
    "optimized_size": 1844,
    "reduction_percent": 93.48
  }
}