{
  "decision": "PENDING",
  "application_number": "15107294",
  "date_published": "20170105",
  "date_produced": "20161220",
  "title": "FPC OF A CAPACITIVE TOUCHSCREEN AND A METHOD FOR MOUNTING THE FPC",
  "filing_date": "20160622",
  "inventor_list": [
    {
      "inventor_name_last": "LIU",
      "inventor_name_first": "Weiwei",
      "inventor_city": "KunShan, Jiangsu",
      "inventor_state": "",
      "inventor_country": "CN"
    },
    {
      "inventor_name_last": "HONG",
      "inventor_name_first": "Yao",
      "inventor_city": "KunShan, Jiangsu",
      "inventor_state": "",
      "inventor_country": "CN"
    }
  ],
  "ipcr_labels": [
    "G06F3041",
    "H05K118",
    "H05K102",
    "G06F3044"
  ],
  "main_ipcr_label": "G06F3041",
  "summary": "<SOH> SUMMARY OF THE INVENTION <EOH>Thus, the present invention is to solve the problem that the FPC of the capacitive touchscreen of prior art may occupy a large space, which is not in favor of making a compact arrangement, so as to waste substrate, lower the utilization rate of a substrate and cause a high cost, thereby providing an FPC of a capacitive touchscreen that is able to be arranged on the substrate in a compact manner, achieve a high utilization rate of a substrate and save the cost, and also provide a method of mounting the FPC, To solve the above mentioned problem, the present invention provides A FPC of a capacitive touchscreen, comprises a sensing circuit and a driving circuit, which respectively match with a sensing circuit layer and a driving circuit layer of a capacitive touchscreen panel and have several contacts for matching the sensing circuit layer and the driving circuit layer for corresponding connection; an IC driving chip, disposed between the sensing circuit and the driving circuit; wherein, the sensing circuit and the driving circuit are disposed in parallel or on the same line; the sensing circuit or the driving circuit is provided with a bending area, and the sensing circuit or the driving circuit is able to be turned towards the driving circuit or the sensing circuit, so as to allow the sensing circuit to match the sensing circuit layer and allow the driving circuit to match the driving circuit layer, a bending portion is located in the bending area after being turned over. Preferably, side lines of the sensing circuit and the driving circuit, where the contacts are provided, are located on the same line. Preferably, the bending area is arranged on the driving circuit and close to the IC driving chip. Preferably, the contacts are not located in the bending area. Preferably, the side lines of the sensing circuit and driving circuit, where no contact is provided, are located on different lines. Preferably, after the sensing circuit or d...",
  "patent_number": "None",
  "abstract": "An FPC of a capacitive touchscreen and a method for mounting the FPC. The FPC comprises a sensing circuit and a driving circuit which respectively matches with a sensing circuit layer and a driving circuit layer of a capacitive touchscreen panel and have several contacts for matching the sensing circuit layer and the driving circuit layer for corresponding connection; an IC driving chip, disposed between the sensing circuit and the driving circuit. The sensing circuit and the driving circuit are disposed in parallel or on the same line. The sensing circuit or the driving circuit is provided with a bending area, and the sensing circuit or the driving circuit is able to be turned towards the driving circuit or the sensing circuit, so as to allow the sensing circuit to match the sensing circuit layer and allow the driving circuit to match the driving circuit layer. According to the present invention, the FPCs of the capacitive touchscreen can be compactly arranged on a substrate, so that ...",
  "publication_number": "US20170003801A1-20170105",
  "_processing_info": {
    "original_size": 28317,
    "optimized_size": 3742,
    "reduction_percent": 86.79
  }
}