{
  "date_produced": "20161019",
  "publication_number": "US20160321545A1-20161103",
  "main_ipcr_label": "G06N502",
  "decision": "PENDING",
  "application_number": "15105796",
  "inventor_list": [
    {
      "inventor_name_last": "KREIS",
      "inventor_name_first": "Marius",
      "inventor_city": "Huenfeld",
      "inventor_state": "",
      "inventor_country": "DE"
    },
    {
      "inventor_name_last": "KRUZIC",
      "inventor_name_first": "David",
      "inventor_city": "Stanford",
      "inventor_state": "CA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "MOSALEM",
      "inventor_name_first": "Khaled",
      "inventor_city": "Los Altos Hills",
      "inventor_state": "CA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "SMIROLDO",
      "inventor_name_first": "Rigel",
      "inventor_city": "San Jose",
      "inventor_state": "CA",
      "inventor_country": "US"
    }
  ],
  "abstract": "A method for predicting an interface control action of a user with an in-vehicle user interface involves collecting and storing data. The data can be vehicle data about the vehicle and its environment collected from at least one sensor of the vehicle and user data about user interactions with the user interface and/or different applications inside the vehicle. Likelihoods are assigned to at least two possible interface control actions by the user based on the collected and stored data. At least one most likely interface control action is determined from the likelihoods and the user is presented with the at least one most likely interface control action so that it is selectable and performable with one single user interaction with the user interface.",
  "filing_date": "20160617",
  "patent_number": "None",
  "summary": "<SOH> BACKGROUND AND SUMMARY OF THE INVENTION <EOH>Exemplary embodiments of the present invention relate to a method for predicting an interface control action of a user with an in-vehicle user interface. Exemplary embodiments of the invention further relate to an in-vehicle user interface with a memory unit, a processing unit, and a display unit. Many vehicles currently have an in-vehicle user interface providing a user with a vast amount of possible interface control actions. For example, a single in-vehicle user interface and/or different applications inside the vehicle may be used to choose a variety of actions such as listen to music, make a phone call, and adjust the temperature in the vehicle. All these different interface control actions usually cannot be presented to a user at the same time. This results in complicated menus, where the user has to perform several tasks of choosing sub-menus and options, before an interface control action finally is selected. Several efforts have been met already to increase the usability of user interfaces. The European patent document EP 2 369 299 A1 and US patent document US 2013/0166096 A1 both disclose a predictive destination entry system for a vehicle navigation system to aid in obtaining destinations for a vehicle. The navigation system comprises a memory for storing data, a display coupled with the vehicle, and a processor coupled with the display and with a memory. The processor is configured to predict a destination for the vehicle based on the data stored in the memory. US patent document U.S. Pat. No. 8,429,103 B1 discloses an apparatus and methods for providing machine-learning services for a mobile platform. A machine-learning service executing on a mobile platform can receive data related to a plurality of features, wherein the received data comprises a called party of a telephone call to be originated by the mobile platform. The output by the machine-learning services comprises a prediction of a volume setti...",
  "date_published": "20161103",
  "title": "PREDICTING AN INTERFACE CONTROL ACTION OF A USER WITH AN IN-VEHICLE USER INTERFACE",
  "ipcr_labels": [
    "G06N502",
    "G06F30484"
  ],
  "_processing_info": {
    "original_size": 72647,
    "optimized_size": 3785,
    "reduction_percent": 94.79
  }
}