{
  "decision": "ACCEPTED",
  "application_number": "15103804",
  "date_published": "20161020",
  "date_produced": "20161005",
  "title": "METHODS OF DEVELOPING SELECTIVE PEPTIDE ANTAGONISTS",
  "filing_date": "20160610",
  "inventor_list": [
    {
      "inventor_name_last": "Azimi",
      "inventor_name_first": "Nazli",
      "inventor_city": "San Juan Capistrano",
      "inventor_state": "CA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Tagaya",
      "inventor_name_first": "Yutaka",
      "inventor_city": "Rockville",
      "inventor_state": "MD",
      "inventor_country": "US"
    }
  ],
  "ipcr_labels": [
    "G06F1916",
    "G01N3350",
    "C40B3002",
    "G06F1918"
  ],
  "main_ipcr_label": "G06F1916",
  "summary": "<SOH> SUMMARY OF THE INVENTION <EOH>Disclosed herein are methods and compositions related to the selective, specific disruption of multiple ligand-receptor signaling interactions. In some embodiments these interactions involve multiple cytokines in a single receptor family. In some embodiments multiple ligand receptor interactions from at least two distinct ligand-receptor families are disrupted. In some embodiments the compositions comprise polypeptides having composite sequences that comprise sequence fragments of two or more ligand binding sites. In some embodiments the sequence fragments of two or more ligand binding sites are arranged to conserve the secondary structure of each of the ligands from which the sequence fragments were taken. Methods and compositions disclosed herein relate to the selective blocking of specific ligand-receptor interactions within ligand-receptor families and, optionally, across two or more than two ligand-receptor families. One aspect of the disclosures provided herein relates to a method of designing an antagonist peptide against a family of cytokines that share a common receptor, in such a way to selectively inhibit binding interfaces of a first group of the cytokines among the family of the cytokines with the common receptor but not all of the cytokines of the family. The method may comprise obtaining amino-acid sequences of the first group of the cytokines, identifying, from the amino acid sequences of the first group of the cytokines, receptor binding sites or amino acids necessary to the binding of the first group of cytokines with the common receptor, and designing a composite peptide sequence that comprises at least part of the receptor binding sites and/or the amino acids necessary to the binding of the first group of the cytokines with the common receptor. Another aspect of the disclosures provided herein relates to a method of designing a first inhibitor polypeptide of a first ligand-receptor complex and a second ligand r...",
  "patent_number": "9959384",
  "abstract": "Methods and compositions related to the selective, specific disruption of multiple ligand-receptor signaling interactions, such as ligand-receptor interactions implicated in disease, are disclosed. These interactions may involve multiple cytokines in a single receptor family or multiple ligand receptor interactions from at least two distinct ligand-receptor families. The compositions may comprise polypeptides having composite sequences that comprise sequence fragments of two or more ligand binding sites. The methods and compositions may involve sequence fragments of two or more ligand binding sites that are arranged to conserve the secondary structure of each of the ligands from which the sequence fragments were taken.",
  "publication_number": "US20160306918A1-20161020",
  "_processing_info": {
    "original_size": 164427,
    "optimized_size": 3465,
    "reduction_percent": 97.89
  }
}