{
  "date_produced": "20170214",
  "publication_number": "US20170061295A1-20170302",
  "main_ipcr_label": "G06N504",
  "decision": "ACCEPTED",
  "application_number": "15119393",
  "inventor_list": [
    {
      "inventor_name_last": "HORABIN",
      "inventor_name_first": "Robert William",
      "inventor_city": "Chandlers Ford, Hampton",
      "inventor_state": "",
      "inventor_country": "GB"
    },
    {
      "inventor_name_last": "HOWARD",
      "inventor_name_first": "Julia Ann",
      "inventor_city": "Southampton, Hampshire",
      "inventor_state": "",
      "inventor_country": "GB"
    },
    {
      "inventor_name_last": "BEAVEN",
      "inventor_name_first": "Frank",
      "inventor_city": "Southampton, Hampshire",
      "inventor_state": "",
      "inventor_country": "GB"
    }
  ],
  "abstract": "A method of predicting a fault in an air-conditioning pack of an aircraft is disclosed. The air-conditioning pack includes one or more sensors outputting data related to air-conditioning pack temperature, air-conditioning pack pressure, or air-conditioning pack valve or actuator positions. The method includes transmitting data from at least one of the sensors operably coupled to the air-conditioning pack, comparing the transmitted data to a predetermined threshold, and predicting a fault in the air-conditioning pack based thereon.",
  "filing_date": "20160817",
  "patent_number": "9971969",
  "summary": "<SOH> BRIEF DESCRIPTION <EOH>Embodiments generally relate to a method of predicting a fault in an air-conditioning pack of an aircraft where the air-conditioning pack includes one or more sensors, including transmitting data from at least one of the sensors operably coupled to the air-conditioning pack, comparing the transmitted data to a predetermined threshold, predicting a fault in the air-conditioning pack based on the comparison, and providing an indication of the predicted fault.",
  "date_published": "20170302",
  "title": "METHOD FOR PREDICTING A FAULT IN AN AIR-CONDITIONING PACK OF AN AIRCRAFT",
  "ipcr_labels": [
    "G06N504",
    "B64D1308",
    "G05B2302"
  ],
  "_processing_info": {
    "original_size": 38242,
    "optimized_size": 1951,
    "reduction_percent": 94.9
  }
}