{
  "decision": "PENDING",
  "application_number": "15113541",
  "date_published": "20170112",
  "date_produced": "20161228",
  "title": "CONTINUOUS INTEGRATION WITH REUSABLE CONTEXT AWARE JOBS",
  "filing_date": "20160722",
  "inventor_list": [
    {
      "inventor_name_last": "Spektor",
      "inventor_name_first": "Adam",
      "inventor_city": "Yehud",
      "inventor_state": "",
      "inventor_country": "IL"
    },
    {
      "inventor_name_last": "Grunzweig",
      "inventor_name_first": "Nathan",
      "inventor_city": "Yehud",
      "inventor_state": "",
      "inventor_country": "IL"
    },
    {
      "inventor_name_last": "Feygin",
      "inventor_name_first": "Lena",
      "inventor_city": "Sunnyvale",
      "inventor_state": "CA",
      "inventor_country": "US"
    }
  ],
  "ipcr_labels": [
    "G06F944",
    "G06F1136"
  ],
  "main_ipcr_label": "G06F944",
  "summary": "<SOH> BRIEF DESCRIPTION OF THE DRAWINGS <EOH>The following detailed description references the drawings, wherein: FIG. 1 is a block diagram of an example computing environment in which: continuous integration with reusable context aware jobs may be useful; FIG. 2 is a flowchart of an example method for continuous integration with reusable context aware jobs; FIG. 3 is a flowchart of an example method for continuous integration with reusable context aware jobs; FIG. 4 is a block diagram of an example system for continuous integration with reusable context aware jobs; and FIG. 5 is a block diagram of an example code integration system for continuous integration with reusable context aware jobs. detailed-description description=\"Detailed Description\" end=\"lead\"?",
  "patent_number": "None",
  "abstract": "Example embodiments relate to continuous integration with reusable context aware jobs. An example method may include accessing a build pipeline that includes multiple jobs that are reusable and configurable. The method may include retrieving a version of code for a software application, where the version of code is related to a context. The method may include configuring the jobs of the build pipeline according to the context. The method may include testing the version of code using the build pipeline with the configured jobs,",
  "publication_number": "US20170010889A1-20170112",
  "_processing_info": {
    "original_size": 43220,
    "optimized_size": 2140,
    "reduction_percent": 95.05
  }
}