{
  "decision": "PENDING",
  "application_number": "15114904",
  "date_published": "20161124",
  "date_produced": "20161109",
  "title": "EYE AND HEAD TRACKING DEVICE",
  "filing_date": "20160728",
  "inventor_list": [
    {
      "inventor_name_last": "Shazly",
      "inventor_name_first": "Tarke A",
      "inventor_city": "Pittsburgh",
      "inventor_state": "PA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Abdelwahed",
      "inventor_name_first": "Salwa A",
      "inventor_city": "Pittsburgh",
      "inventor_state": "PA",
      "inventor_country": "US"
    }
  ],
  "ipcr_labels": [
    "G06F301",
    "A61B511",
    "G02C1100",
    "G06T1160",
    "G06K900",
    "A61B3113",
    "G06F303"
  ],
  "main_ipcr_label": "G06F301",
  "summary": "<SOH> BRIEF SUMMARY OF THE INVENTION <EOH>The present invention serves to meet these needs, in addition to having other beneficial properties such as compactness, accuracy and non-blocking of the eye view. According to one embodiment of the present invention, a compact apparatus comprises (1) at least one optoelectronic array sensor or optical flow sensor; (2) a body configured to support the optoelectronic array sensor with focusing means along with a source of light with collimating means in front of an eye of a user; (3) an optical focusing means to focus an image of the ocular surface of the user on the optoelectronic array sensor; (4) a focusing lens with a source of light; (5) means to detect blinking; and (6) a driver configured to receive signals from the sensor and to determine eye movements based on the received signals. The focusing means may include a plus powered focusing lens, mirror or pinhole. The apparatus may further comprise a means to detect user's additional input and gestures. The terms “optoelectronic array sensor” and “optical flow sensor” may be used interchangeably herein. The apparatus may further comprise a driver configured to receive signals from the sensor and to determine eye movements based on the received signals and a communication module to communicate with an external device typically a computer along with its software. In the preferred embodiment of the present invention, the optoelectronic array sensor is a complementary metal-oxide semiconductor (CMOS). In the preferred embodiment of the present invention, the apparatus may be wearable by the user. The apparatus may be wearable like eyeglasses. The apparatus may be wearable directly on the face of the user. The apparatus may be wearable over the glasses of the user. The body may be supported by the nose of the user and/or by one or two ears of the user. The sensor may be integrated with a lens of eyeglasses. Alternatively, the sensor may be attached to a lens of eyeglasses or ...",
  "patent_number": "None",
  "abstract": "An apparatus and method of use for tracking eye and head movement comprising (1) at least one optoelectronic array sensor or optical flow sensor formed of a plurality of optoelectronic sensor cells; (2) a body configured to support the optoelectronic array sensor with focusing means along with a source of light with collimating means in front of and in proximity to an eye of a user; (3) an optical focusing means to focus an image of the ocular surface of the user on the optoelectronic array sensor; (4) a focusing lens with a source of light; (5) a means to detect blinking; (6) a driver configured to receive signals from the sensor array to generate coordinate signals corresponding to changes in the position of the ocular surface relative to the sensor array; and (7) a means to detect user's additional input and gestures.",
  "publication_number": "US20160342206A1-20161124",
  "_processing_info": {
    "original_size": 95554,
    "optimized_size": 3593,
    "reduction_percent": 96.24
  }
}