{
  "date_produced": "20170104",
  "publication_number": "US20170017891A1-20170119",
  "main_ipcr_label": "G06N700",
  "decision": "PENDING",
  "application_number": "15114359",
  "inventor_list": [
    {
      "inventor_name_last": "Thompson",
      "inventor_name_first": "Ben",
      "inventor_city": "Sheffield Yorkshire",
      "inventor_state": "",
      "inventor_country": "GB"
    },
    {
      "inventor_name_last": "James",
      "inventor_name_first": "David",
      "inventor_city": "Sheffield Yorkshire",
      "inventor_state": "",
      "inventor_country": "GB"
    },
    {
      "inventor_name_last": "Clifford",
      "inventor_name_first": "Jerry",
      "inventor_city": "Tralee",
      "inventor_state": "",
      "inventor_country": "IE"
    }
  ],
  "abstract": "“A rapid, high throughput, method of predicting relative fed batch performance of a panel of clonal cells derived from a single host cell line”. A computer implemented method of predicting relative fed batch production titer of a panel of clonal producer cells derived from a single parental host cell population comprises the steps of assaying a level of growth of each clone in the presence and absence of at least three individual chemical cell stressors, comparing the level of growth of each clone in the presence and absence of the at least three chemical cell stressors to provide a normalised production titer response for each clone in each stressed microenvironment, and inputting a clone-specific production titer response profile comprising the normalised production titer response for each clone in each stressed microenvironments into a computational model. The computational model is generated from production titer response profiles obtained from a calibration set of clones with know...",
  "filing_date": "20160726",
  "patent_number": "None",
  "summary": "<SOH> BRIEF DESCRIPTION OF THE FIGURES <EOH>FIG. 1 : Maximum monoclonal antibody titre achieved in fed batch culture from a panel of 12 clonal cell lines from a common parental cell line. FIG. 2 : The range of product titres in the presence of specific chemical stressors achieved by a panel of 12 clonal cell lines. FIG. 3 : A visual representation of the goodness of fit of a multiple linear model to predict maximum MAb titre using chemical specific MAb responses. FIG. 4 : An illustration of the ability of the model to predict new data. Here, using the stated model parameters, Max MAb titre was predicted with new data using a “leave one out” cross validation function. detailed-description description=\"Detailed Description\" end=\"lead\"?",
  "date_published": "20170119",
  "title": "A METHOD OF PREDICTING RELATIVE FED BATCH PRODUCTION TITER OF A PANEL OF CLONALLY-DERIVED PRODUCER CELLS",
  "ipcr_labels": [
    "G06N700",
    "C12N5071"
  ],
  "_processing_info": {
    "original_size": 49420,
    "optimized_size": 2675,
    "reduction_percent": 94.59
  }
}