{
  "date_produced": "20161102",
  "publication_number": "US20160335536A1-20161117",
  "main_ipcr_label": "G06N308",
  "decision": "PENDING",
  "application_number": "15110362",
  "inventor_list": [
    {
      "inventor_name_last": "YAMAZAKI",
      "inventor_name_first": "Takashi",
      "inventor_city": "Tokyo",
      "inventor_state": "",
      "inventor_country": "JP"
    },
    {
      "inventor_name_last": "MATSUMOTO",
      "inventor_name_first": "Wataru",
      "inventor_city": "Tokyo",
      "inventor_state": "",
      "inventor_country": "JP"
    }
  ],
  "abstract": "Generating loosely coupled parts by forming couplings between partial nodes in a hierarchical neural network in accordance with a check matrix of an error correcting code.",
  "filing_date": "20160707",
  "patent_number": "None",
  "summary": "<SOH> BRIEF DESCRIPTION OF THE DRAWINGS <EOH>FIG. 1 is a block diagram showing a configuration of a hierarchical neural network apparatus of an embodiment 1 in accordance with the present invention; FIG. 2 is a diagram showing a structure of the hierarchical neural network in the embodiment 1; FIG. 3 is a diagram showing a structure of a conventional hierarchical neural network; FIG. 4 is a flowchart showing weight learning processing in the embodiment 1; FIG. 5 is a diagram illustrating a check matrix of a pseudorandom number code; FIG. 6 is a table showing the number of 1's and the rate of 1's for the number of rows or the number of columns of a check matrix of a Euclidean geometry code; FIG. 7 is a table showing the number of 1's and the rate of 1's for the number of rows or the number of columns of a check matrix of a projective geometry code; FIG. 8 is a table showing the number of 1's and the rate of 1's for the number of rows or the number of columns of a check matrix of a difference set cyclic code; FIG. 9 is a diagram illustrating a check matrix of a spatially-coupled code; FIG. 10 is a table showing a number of couplings between input nodes and intermediate nodes in neural networks A and B; FIG. 11 is a block diagram showing a configuration of a hierarchical neural network apparatus of an embodiment 2 in accordance with the present invention; FIG. 12 is a diagram showing a structure of a deep neural network in the embodiment 2; FIG. 13 is a diagram showing a structure of a conventional deep neural network; FIG. 14 is a flowchart showing weight learning processing by pre-learning and adjustment of weights in the embodiment 2; FIG. 15 is a diagram illustrating an outline of the weight learning processing by the pre-learning and adjustment of the weights when N=5; FIG. 16 is a flowchart showing the pre-learning processing of the weights; and FIG. 17 is a flowchart showing the adjustment processing of the weights. detailed-description description=\"Detailed Des...",
  "date_published": "20161117",
  "title": "HIERARCHICAL NEURAL NETWORK APPARATUS, CLASSIFIER LEARNING METHOD AND DISCRIMINATING METHOD",
  "ipcr_labels": [
    "G06N308",
    "G06N304"
  ],
  "_processing_info": {
    "original_size": 49942,
    "optimized_size": 2904,
    "reduction_percent": 94.19
  }
}