{
  "decision": "PENDING",
  "application_number": "15115616",
  "date_published": "20170615",
  "date_produced": "20170603",
  "title": "SYSTEM FOR A BRAIN-COMPUTER INTERFACE",
  "filing_date": "20160729",
  "inventor_list": [
    {
      "inventor_name_last": "Jackson",
      "inventor_name_first": "Andrew",
      "inventor_city": "Newcastle Upon Tyne",
      "inventor_state": "",
      "inventor_country": "GB"
    },
    {
      "inventor_name_last": "Constandinou",
      "inventor_name_first": "Tim",
      "inventor_city": "London",
      "inventor_state": "",
      "inventor_country": "GB"
    },
    {
      "inventor_name_last": "Eftekhar",
      "inventor_name_first": "Amir",
      "inventor_city": "London",
      "inventor_state": "",
      "inventor_country": "GB"
    },
    {
      "inventor_name_last": "Quiroga",
      "inventor_name_first": "Rodrigo Quian",
      "inventor_city": "Leicestershire",
      "inventor_state": "",
      "inventor_country": "GB"
    },
    {
      "inventor_name_last": "Ahumada",
      "inventor_name_first": "Joaquin Navajas",
      "inventor_city": "Leicestershire",
      "inventor_state": "",
      "inventor_country": "GB"
    }
  ],
  "ipcr_labels": [
    "A61B504",
    "A61B500",
    "G06F301"
  ],
  "main_ipcr_label": "A61B504",
  "summary": "<SOH> SUMMARY <EOH>Embodiments of the present invention adopt a hybrid approach in which some of the processing functionality is performed at an external device, but some is performed locally in the implantable device. This reduces communication overheads, since the spike detection process and the template matching process are performed locally at the implantable device, and only the result of a comparison, or an action potential profile which has not previously been detected, need to be transmitted to external devices. The speed of the invention is therefore increased relative to conventional systems, without complicating the implantable device. According to an aspect of the present invention there is provided a system for a brain-computer interface. According to an aspect of the present invention there is provided an implanted device. According to an aspect of the present invention there is provided a remote device. Optional features are set out in the dependent claims. Embodiments of the present invention provide a two-step approach to providing a wireless BCI system. In a first step a low-power implantable platform amplifies and filters an extracellular recording, performs analogue to digital conversion (ADC) and detects action potentials in real-time. The processor is wirelessly connected to an external receiver capable of performing the processor-intensive tasks of feature extraction and spike classification, thus generating a plurality of predetermined templates for each neuron to be used in a second processing step. In the second step the low-power implantable platform amplifies and filters the extracellular recording, performs ADC and detects action potentials, which can be matched on-chip to the predetermined templates generated by the external receiver in the first step. This two-step approach exploits the advantages of both offline and online processing, providing an effective and safer method for performing multiple wireless recordings of single-neuron ...",
  "patent_number": "None",
  "abstract": "The invention provides a two-step approach to providing a BCI system. In a first step the invention provides a low-power implantable platform for amplifying and filtering the extracellular recording, performing analogue to digital conversion (ADC) and detecting action potentials in real-time, which is connected to a remote device capable of performing the processor-intensive tasks of feature extraction and spike classification, thus generating a plurality of predetermined templates for each neuron to be used in a second processing step. In the second step the low-power implantable platform amplifies and filters the extracellular recording, performs ADC and detects action potentials, which can be matched on-chip to the predetermined templates generated by the external receiver in the first step. This two-step approach exploits the advantages of both offline and online processing, providing an effective and safe method for performing multiple recordings of single-neuron activity, for res...",
  "publication_number": "US20170164852A1-20170615",
  "_processing_info": {
    "original_size": 49669,
    "optimized_size": 4165,
    "reduction_percent": 91.61
  }
}