{
  "decision": "PENDING",
  "application_number": "15118589",
  "date_published": "20170216",
  "date_produced": "20170201",
  "title": "Adjusting Display Brightness Based on User Distance",
  "filing_date": "20160812",
  "inventor_list": [
    {
      "inventor_name_last": "KAKAPURI",
      "inventor_name_first": "VISHAL",
      "inventor_city": "BANGALORE",
      "inventor_state": "",
      "inventor_country": "IN"
    }
  ],
  "ipcr_labels": [
    "G06F301",
    "G09G510"
  ],
  "main_ipcr_label": "G06F301",
  "summary": "<SOH> BRIEF DESCRIPTION OF THE DRAWINGS <EOH>Some examples of the present application are described with respect to the following figures: FIG. 1 illustrates an example of a computing device including a controller to adjust a brightness of a display surface based on a distance of a user from the device; FIG. 2 illustrates an example of a computing device that adjusts a brightness of a display surface based on a distance of a user from the device; FIG. 3 is an example of a flowchart illustrating a method for adjusting a brightness of a display screen of a computing device based on a distance of a user from the device; FIG. 4 is another example of a flowchart illustrating a method for adjusting a brightness of a display screen of a computing device based on a distance of a user from the device; and FIG. 5 illustrates an example of a computing device including a computer-readable medium having instructions to adjust a brightness of a display screen based on a distance of a user from the device. detailed-description description=\"Detailed Description\" end=\"lead\"?",
  "patent_number": "None",
  "abstract": "A computing device in accordance with an example includes a display surface. The device also includes a first sensor to determine a distance of a user from the device, a second sensor to determine an ambient brightness of the device, and a controller to automatically adjust a brightness of the display surface based on the distance of the user from the device and the ambient brightness.",
  "publication_number": "US20170045936A1-20170216",
  "_processing_info": {
    "original_size": 26731,
    "optimized_size": 2014,
    "reduction_percent": 92.47
  }
}