{
  "date_produced": "20170119",
  "publication_number": "US20170032270A1-20170202",
  "main_ipcr_label": "G06N700",
  "decision": "PENDING",
  "application_number": "15118096",
  "inventor_list": [
    {
      "inventor_name_last": "LEE",
      "inventor_name_first": "Soo-Won",
      "inventor_city": "Seoul",
      "inventor_state": "",
      "inventor_country": "KR"
    },
    {
      "inventor_name_last": "BAIK",
      "inventor_name_first": "Jong-Bum",
      "inventor_city": "Seoul",
      "inventor_state": "",
      "inventor_country": "KR"
    }
  ],
  "abstract": "A method of predicting personality traits using a personal life log and an apparatus for performing the same are disclosed. The method of predicting personality traits comprises collecting personal life log in a social network, generating a user behavior matrix by defining an object about user's behavior through analysis of the collected personal life log in a triple structure and extracting a user behavior parameter through the generated user behavior matrix, obtaining interaction between a user and a friend by analyzing the personal life log and obtaining a friend relation characteristic parameter by using the obtained interaction, obtaining a moving path characteristic parameter by using location information made in a feed by the user through analysis of the personal life log, and predicting personality traits by applying the user behavior parameter, the friend relation characteristic parameter and the moving path characteristic parameter to four learned personality traits models.",
  "filing_date": "20161017",
  "patent_number": "None",
  "summary": "<SOH> SUMMARY <EOH>Accordingly, the invention is provided to substantially obviate one or more problems due to limitations and disadvantages of the related art. One embodiment of the invention provides a method of predicting personality traits by using a personal life log and an apparatus for performing the same. In addition, the invention provides a method of predicting personality traits for generating a new personality traits prediction model by using main personality traits used mainly in a consumer psychology theory through analysis of the personal life log and an apparatus for performing the same. In one aspect, the invention provides a personality traits prediction method for predicting personality traits by analyzing a personal life log. A method of predicting personality traits according to one embodiment of the invention comprises collecting personal life log in a social network; generating a user behavior matrix by defining an object about user's behavior through analysis of the collected personal life log in a triple structure and extracting a user behavior parameter through the generated user behavior matrix; obtaining interaction between a user and a friend by analyzing the personal life log and obtaining a friend relation characteristic parameter by using the obtained interaction; obtaining a moving path characteristic parameter by using location information made in a feed by the user through analysis of the personal life log; and predicting personality traits by applying the user behavior parameter, the friend relation characteristic parameter and the moving path characteristic parameter to four learned personality traits models. In another aspect, the invention provides a personality traits prediction apparatus for predicting personality traits by analyzing a personal life log. A personality traits prediction apparatus according to one embodiment of the invention comprises a collection unit configured to collect personal life log in a social network...",
  "date_published": "20170202",
  "title": "METHOD FOR PREDICTING PERSONALITY TRAIT AND DEVICE THEREFOR",
  "ipcr_labels": [
    "G06N700",
    "H04L2908",
    "G06F1900",
    "G06N502"
  ],
  "_processing_info": {
    "original_size": 45737,
    "optimized_size": 3714,
    "reduction_percent": 91.88
  }
}