{
  "date_produced": "20161116",
  "publication_number": "US20160350670A1-20161201",
  "main_ipcr_label": "G06N700",
  "decision": "ACCEPTED",
  "application_number": "15114684",
  "inventor_list": [
    {
      "inventor_name_last": "Poyyara",
      "inventor_name_first": "Ragi Lohidakshan",
      "inventor_city": "Pune",
      "inventor_state": "",
      "inventor_country": "IN"
    },
    {
      "inventor_name_last": "Patnana",
      "inventor_name_first": "Vijaya Kumar",
      "inventor_city": "Madurwada",
      "inventor_state": "",
      "inventor_country": "IN"
    }
  ],
  "abstract": "A system for selecting diversion techniques includes a memory storage device and a processor. The processor is configured to, for each of several well characteristics, assign a weight to each of the several well characteristics, where the weight is indicative of the importance of the well characteristic to the selection of a diversion technique, and where not all of the weights are the same. The processor is further configured to calculate a desirability of each of several diversion techniques based upon, at least partially, the weights and the several well characteristics, and select a diversion technique based upon, at least partially, the calculated desirability of the several diversion techniques.",
  "filing_date": "20160727",
  "patent_number": "9547825",
  "summary": "<SOH> BRIEF DESCRIPTION OF EXAMPLE EMBODIMENTS <EOH>Certain embodiments may be better understood, and their numerous objects, features, and advantages made apparent to those skilled in the art by referencing the accompanying drawings. The use of the same reference symbols in different drawings indicates similar or identical items. FIG. 1A is a diagram showing an example of a well for extracting deposits from the earth; FIG. 1B is a diagram showing a portion of the well of FIG. 1A while an example diversion technique is being used; FIG. 2 is a chart showing example suitability of various diversion techniques for use with various well characteristic options; FIG. 3 is a chart showing example weights for an example set of well characteristics being evaluated; FIG. 4 is a chart showing example confidence values for various diversion techniques, based upon well characteristics (e.g., the example set of well characteristics of FIG. 3 ), associated weights (e.g., the example weights of FIG. 3 ), and relative suitability values (e.g., the relative suitability values of FIG. 2 ). FIG. 5 is a flowchart showing an example method of selecting diversion techniques; FIG. 6 is a flowchart showing a more detailed example method of selecting diversion techniques than the example method of FIG. 5 ; and FIG. 7 is a diagram of an example system that may be used, for example, to carry out example methods disclosed in FIG. 5 and/or FIG. 6 . detailed-description description=\"Detailed Description\" end=\"lead\"?",
  "date_published": "20161201",
  "title": "SELECTION OF DIVERSION TECHNIQUES BASED UPON WEIGHTED WELL CHARACTERISTICS",
  "ipcr_labels": [
    "G06N700",
    "E21B33138",
    "G06F1716",
    "E21B4325"
  ],
  "_processing_info": {
    "original_size": 58974,
    "optimized_size": 2981,
    "reduction_percent": 94.95
  }
}