{
  "decision": "PENDING",
  "application_number": "15116606",
  "date_published": "20161124",
  "date_produced": "20161109",
  "title": "Ultraviolet-Curable Adhesive Composition For Touch Panel, Optical Member Producing Method Using Same, Cured Product, And Touch Panel",
  "filing_date": "20160804",
  "inventor_list": [
    {
      "inventor_name_last": "Motohashi",
      "inventor_name_first": "Hayato",
      "inventor_city": "Tokyo",
      "inventor_state": "",
      "inventor_country": "JP"
    },
    {
      "inventor_name_last": "Mizuguchi",
      "inventor_name_first": "Takafumi",
      "inventor_city": "Tokyo",
      "inventor_state": "",
      "inventor_country": "JP"
    },
    {
      "inventor_name_last": "Kametani",
      "inventor_name_first": "Hideaki",
      "inventor_city": "Tokyo",
      "inventor_state": "",
      "inventor_country": "JP"
    }
  ],
  "ipcr_labels": [
    "G06F3041",
    "B32B3706",
    "B32B3712",
    "C09J400",
    "C09J11500"
  ],
  "main_ipcr_label": "G06F3041",
  "summary": "<SOH> SUMMARY OF INVENTION <EOH>",
  "patent_number": "None",
  "abstract": "Provided herein is an ultraviolet-curable adhesive composition that causes little damage to an optical base material, and with which an optical member can be obtained with desirable curability and adhesion and good productivity while achieving high whitening resistance, and improving bonding strength even when an optical base material is laminated after the ultraviolet irradiation of the coating layer formed by applying the ultraviolet-curable adhesive composition to the optical base material. An optical member producing method using the composition is also provided. The composition contains a monofunctional acrylate (A) represented by the following formula (1), a photopolymerizable oligomer (B), a photopolymerizable monomer (C) other than (A), and a photopolymerization initiator (D), wherein R1 represents a hydrogen atom or the like, and n represents an integer of 1 to 3.",
  "publication_number": "US20160342254A1-20161124",
  "_processing_info": {
    "original_size": 109068,
    "optimized_size": 1872,
    "reduction_percent": 98.28
  }
}