{
  "decision": "REJECTED",
  "application_number": "15118531",
  "date_published": "20170223",
  "date_produced": "20170208",
  "title": "SMART DISPLAY WEAR",
  "filing_date": "20160812",
  "inventor_list": [
    {
      "inventor_name_last": "LEE",
      "inventor_name_first": "Seung Woo",
      "inventor_city": "Seoul",
      "inventor_state": "",
      "inventor_country": "KR"
    }
  ],
  "ipcr_labels": [
    "G06F314",
    "A41D300",
    "G09G536",
    "A61B500",
    "G06F116",
    "G06F3041",
    "A41D100",
    "A61B501"
  ],
  "main_ipcr_label": "G06F314",
  "summary": "<SOH> SUMMARY <EOH>Accordingly, an object of the present invention is to provide smart display wear that allows for various design implementations on clothes with the same shape, so as to present an enhanced degree of freedom to the designer and allows the user to enjoy the same clothing in a diversity of stylish manners. Further, according to another embodiment of the present invention, there are provided smart display wear that add a temperature sensor or location sensor to enable the user to check his health condition or location thereby leading to increased safely. Further, there are provided smart display wear that may wiredly or wirelessly connect with various external devices via a connector, thereby maximizing user convenience. The above object is achieved by smart display wear comprising a garment having a flexible display panel attached or fastened onto a whole or part of an outside of a lining of the garment or configuring the garment itself; and a controller storing, as an image or video, design information including various colors or textures for each portion of the garment and outputting the design information to the flexible display panel according to a setting. Here, the flexible display panel may be divided into a plurality of panel areas independently separated from each other, and the controller may independently control each of the panel areas. The smart display wear may further comprise a temperature sensor provided at, at least, one or more positions on the lining or the flexible display panel to measure a body temperature of a wearer of the garment, wherein the controller displays a temperature measurement sensed by the temperature sensor at a predetermined position on the flexible display panel. When the temperature measurement is not less than a set temperature previously entered and stored, the controller may display a color, flickering, or other alerts on the flexible display panel to externally notify. The smart display wear may comprise ...",
  "patent_number": "None",
  "abstract": "The present invention relates to smart wear using a flexible display panel and, particularly, the present invention comprises: clothes provided through any one method between a method by which the flexible display panel is attached and fixed to a portion of or over the entire outside of a lining of the clothes or a method by which the flexible display panel forms the clothes; and a control unit for storing design information containing various colors or textures for each pan of the clothes as a video or images and outputting the design information to the flexible display panel according to settings. Accordingly, various designs can be implemented for clothes having the same shape, and thus a higher degree of design freedom can be provided to a designer so as to increase the value of the clothes, and a person who wears the clothes can create various styles with the same clothes.",
  "publication_number": "US20170052749A1-20170223",
  "_processing_info": {
    "original_size": 34397,
    "optimized_size": 3470,
    "reduction_percent": 89.91
  }
}