{
  "decision": "PENDING",
  "application_number": "15114007",
  "date_published": "20161201",
  "date_produced": "20161117",
  "title": "CALIBRATION METHOD AND MEASUREMENT TOOL",
  "filing_date": "20160725",
  "inventor_list": [
    {
      "inventor_name_last": "AOKI",
      "inventor_name_first": "Shin",
      "inventor_city": "Kanagawa",
      "inventor_state": "",
      "inventor_country": "JP"
    },
    {
      "inventor_name_last": "KIIKUCHI",
      "inventor_name_first": "Naoki",
      "inventor_city": "Tokyo",
      "inventor_state": "",
      "inventor_country": "JP"
    },
    {
      "inventor_name_last": "NAGAO",
      "inventor_name_first": "Kagehiro",
      "inventor_city": "Tokyo",
      "inventor_state": "",
      "inventor_country": "JP"
    },
    {
      "inventor_name_last": "KISHIWADA",
      "inventor_name_first": "Jun",
      "inventor_city": "Tokyo",
      "inventor_state": "",
      "inventor_country": "JP"
    }
  ],
  "ipcr_labels": [
    "H04N1302",
    "B60R1104",
    "G06T700"
  ],
  "main_ipcr_label": "H04N1302",
  "summary": "<SOH> SUMMARY OF THE INVENTION <EOH>A calibration method calibrates a stereo camera. The calibration method includes: measuring a relative position between the stereo camera and an object that is placed so as to fall within an image capturing area of the stereo camera; acquiring a captured image that is captured by the stereo camera and includes the object; and determining a calibration parameter for calibrating the stereo camera based on the relative position and the captured image. A calibration method calibrates a stereo camera by using a measurement tool that includes a first member having a surface that includes a chart that is used to calibrate the stereo camera, a light source that is installed on the surface and that emits light with a uniform intensity regardless of a position on the surface, and a second member that covers the light source and emits the light through a plurality of holes. The calibration method includes: acquiring a captured image that is captured by the stereo camera and includes the measurement tool as an object; measuring a deviation of a direction of the measurement tool from a facing position of the stereo camera based on a position of maximum brightness in the captured image; and determining a calibration parameter for calibrating the stereo camera based on the deviation of the direction of the measurement tool and the captured image. A measurement tool includes: a first member that has a surface that includes a chart that is used to calibrate the stereo camera; a light source that is installed on the surface and that emits light with a uniform intensity regardless of a position on the surface; and a second member that covers the light source and emits the light through a plurality of holes.",
  "patent_number": "None",
  "abstract": "A calibration method calibrates a stereo camera. The calibration method includes: measuring a relative position between the stereo camera and an object that is placed so as to fall within an image capturing area of the stereo camera; acquiring a captured image that is captured by the stereo camera and includes the object; and determining a calibration parameter for calibrating the stereo camera based on the relative position and the captured image.",
  "publication_number": "US20160353083A1-20161201",
  "_processing_info": {
    "original_size": 110783,
    "optimized_size": 3173,
    "reduction_percent": 97.14
  }
}