{
  "decision": "PENDING",
  "application_number": "15124665",
  "date_published": "20170316",
  "date_produced": "20170301",
  "title": "TOUCH SCREEN PANEL AND TOUCH DISPLAY DEVICE",
  "filing_date": "20160908",
  "inventor_list": [
    {
      "inventor_name_last": "PENG",
      "inventor_name_first": "Chuan",
      "inventor_city": "Beijing",
      "inventor_state": "",
      "inventor_country": "CN"
    },
    {
      "inventor_name_last": "ZHANG",
      "inventor_name_first": "Feng",
      "inventor_city": "Beijing",
      "inventor_state": "",
      "inventor_country": "CN"
    },
    {
      "inventor_name_last": "KIM",
      "inventor_name_first": "Hwang",
      "inventor_city": "Beijing",
      "inventor_state": "",
      "inventor_country": "CN"
    },
    {
      "inventor_name_last": "LU",
      "inventor_name_first": "Youqiang",
      "inventor_city": "Beijing",
      "inventor_state": "",
      "inventor_country": "CN"
    }
  ],
  "ipcr_labels": [
    "G06F3041",
    "G02F11333",
    "G06F3044"
  ],
  "main_ipcr_label": "G06F3041",
  "summary": "<SOH> SUMMARY <EOH>A touch screen panel and a touch display device are provided in embodiments of the present disclosure, for reducing the risk for short circuits in the touch screen panel while ensuring display effects of the touch screen panel. The touch screen panel provided in the embodiments of the present disclosure comprises several touch electrodes arranged in a same layer and being mutually independent, wherein a plurality of isolation electrodes being mutually independent are arranged at least in gaps between parts of adjacent touch electrodes, the isolation electrodes and the touch electrodes being arranged in a same layer and insulated from each other. Optionally, in the touch screen panel provided in the embodiments of the present disclosure, opposite sides of the isolation electrodes and the touch electrodes adjacent to each other are parallel. Optionally, in the touch screen panel provided in the embodiments of the present disclosure, gap widths between the isolation electrodes and the touch electrodes adjacent thereto are smaller than 10 μm. Optionally, in the touch screen panel provided in the embodiments of the present disclosure, opposite sides of two adjacent ones of the isolation electrodes are parallel. Optionally, in the touch screen panel provided in the embodiments of the present disclosure, gap widths between two adjacent ones of the isolation electrodes are smaller than 10 μm. Optionally, in the touch screen panel provided in the embodiments of the present disclosure, widths of the isolation electrodes are smaller than 2000 μm in a first direction and smaller than 1000 μm in a second direction, wherein the first direction is perpendicular to the second direction. Optionally, in the touch screen panel provided in the embodiments of the present disclosure, opposite sides of two adjacent ones of the touch electrodes are parallel. Optionally, in the touch screen panel provided in the embodiments of the present disclosure, opposite sides of two...",
  "patent_number": "None",
  "abstract": "The present disclosure relates to a touch screen panel and a touch display device. Several isolation electrodes are arranged in gaps between adjacent touch electrodes, and the isolation electrodes and the touch electrodes are insulated from each other. Therefore, even if a touch electrode and an adjacent isolation electrode are short-circuited during production, such a short circuit will only integrate the isolation electrode into part of the touch electrode while the isolation electrode is still insulated from other touch electrodes, since the isolation electrode is isolated from both other isolation electrodes and other touch electrodes. In this way, the risk of short circuits in the touch screen panel will be greatly reduced.",
  "publication_number": "US20170075462A1-20170316",
  "_processing_info": {
    "original_size": 32709,
    "optimized_size": 3730,
    "reduction_percent": 88.6
  }
}