{
  "decision": "PENDING",
  "application_number": "15126176",
  "date_published": "20170323",
  "date_produced": "20170309",
  "title": "METHOD AND DEVICE FOR CONTROLLING MIRRORING SERVICES",
  "filing_date": "20160914",
  "inventor_list": [
    {
      "inventor_name_last": "SHIN",
      "inventor_name_first": "In-Young",
      "inventor_city": "Seoul",
      "inventor_state": "",
      "inventor_country": "KR"
    },
    {
      "inventor_name_last": "HAN",
      "inventor_name_first": "Se-Hee",
      "inventor_city": "Seoul",
      "inventor_state": "",
      "inventor_country": "KR"
    }
  ],
  "ipcr_labels": [
    "G06F314",
    "G09G512"
  ],
  "main_ipcr_label": "G06F314",
  "summary": "<SOH> SUMMARY <EOH>An embodiment of the present disclosure provides a method and device for seamlessly providing a mirroring service in a mirroring mode operating in different connection modes. According to an aspect of the present disclosure, there is provided a method by which a master device provided by one embodiment of the present invention controls mirroring services between the master device and a slave device, the method including storing information related to first connection mode mirroring when a termination event of mirroring connected in a first connection mode has occurred, and setting mirroring in a second connection mode by using the stored mirroring-related information. According to another aspect of the present disclosure, there is provided a device for controlling a mirroring service between a master device and a slave device, the device including a storing unit configured to store information related to first connection mode mirroring when a termination event of mirroring connected in the first connection mode has occurred, and a controller configured to set mirroring in a second connection mode by using the stored mirroring-related information.",
  "patent_number": "None",
  "abstract": "The present disclosure relates to a pre-5th-Generation (5G) or 5G communication system to be provided for supporting higher data rates Beyond 4th-Generation (4G) communication system such as Long Term Evolution (LTE). A method by which a master device provided by one embodiment of the present invention controls mirroring services between the master device and a slave device comprises the steps of: storing information related to first connection mode mirroring when a termination event of mirroring connected in a first connection mode has occurred; and setting mirroring in a second connection mode by using the stored mirroring-related information.",
  "publication_number": "US20170083275A1-20170323",
  "_processing_info": {
    "original_size": 28571,
    "optimized_size": 2517,
    "reduction_percent": 91.19
  }
}