{
  "decision": "PENDING",
  "application_number": "15129684",
  "date_published": "20170706",
  "date_produced": "20170621",
  "title": "GLOBAL MANAGEMENT FOR OIL GAS ASSETS",
  "filing_date": "20160927",
  "inventor_list": [
    {
      "inventor_name_last": "FINKEL",
      "inventor_name_first": "Charles",
      "inventor_city": "New York",
      "inventor_state": "NY",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "CAMPBELL",
      "inventor_name_first": "Mark",
      "inventor_city": "Lausanne",
      "inventor_state": "",
      "inventor_country": "CH"
    },
    {
      "inventor_name_last": "VAN NGOC TY",
      "inventor_name_first": "Christophe",
      "inventor_city": "Genève",
      "inventor_state": "",
      "inventor_country": "CH"
    },
    {
      "inventor_name_last": "CASET",
      "inventor_name_first": "Giorgio",
      "inventor_city": "Le Mont-sur-Lausanne",
      "inventor_state": "",
      "inventor_country": "CH"
    }
  ],
  "ipcr_labels": [
    "G06Q1006",
    "G06Q5006",
    "E21B4700"
  ],
  "main_ipcr_label": "G06Q1006",
  "summary": "<SOH> SUMMARY OF THE DISCLOSURE <EOH>The present disclosure, through one or more of its various aspects, embodiments, and/or specific features or sub-components, provides various systems, servers, methods, media, and programs for interfacing compiled codes, such as, for example, Java scripts or data mining algorithms. The disclosure relates to a global management system and method for managing oil and gas assets in a secure manner and to monitor, alert and respond to illegal activities along a supply chain. In one embodiment, there is a global management system for managing oil and gas assets, including a plurality of industrial control systems collecting data captured from at least one of a sensor and data collector; a data integration module receiving the collected data from the plurality of industrial control systems and transforming the collected data into clustered events; and a control center performing at least one of monitoring alerts, creating or confirming or classifying alerts and providing decisions based on the clustered events generated from the data integration module, and having a display and an interface configured to provide visualization of the clustered events and communicate with at least one of the data integration module, external operational support and personnel and resources. In another embodiment, there is a global management method for managing oil and gas assets, including collecting data, at a plurality of industrial systems, captured from at least one of a sensor and data collector; receiving the collected data, at a data integration module, from the plurality of industrial control systems and transforming the collected data into clustered events; performing, at a control center, at least one of monitoring alerts, creating or confirming or classifying alerts and providing decisions based on the clustered events generated from the data integration module; displaying, at the control center, a visualization of the clustered events; and in...",
  "patent_number": "None",
  "abstract": "The present disclosure generally relates to a global management system and method for managing oil and gas assets in a secure manner and for monitoring, alerting and responding to illegal activities along a supply chain. Industrial control systems collect data captured from at least one of a sensor and data collector. A data integration module receives the collected data and transforms the collected data into clustered events, and a control center monitors alerts, creates alerts and provides decisions based on the clustered events. The control center also has an interface configured to provide visualization of the clustered events and to communicate with the data integration module, external operational support and personnel and resources.",
  "publication_number": "US20170193414A1-20170706",
  "_processing_info": {
    "original_size": 73845,
    "optimized_size": 3756,
    "reduction_percent": 94.91
  }
}