{
  "decision": "PENDING",
  "application_number": "15122973",
  "date_published": "20170316",
  "date_produced": "20170301",
  "title": "USER-MANAGED EVIDENTIARY RECORD OF DRIVING BEHAVIOR AND RISK RATING",
  "filing_date": "20160901",
  "inventor_list": [
    {
      "inventor_name_last": "Sedlik",
      "inventor_name_first": "Scott",
      "inventor_city": "Mercer Island",
      "inventor_state": "WA",
      "inventor_country": "US"
    }
  ],
  "ipcr_labels": [
    "G06Q4008",
    "H04L932"
  ],
  "main_ipcr_label": "G06Q4008",
  "summary": "<SOH> SUMMARY <EOH>This Summary is provided to introduce a selection of concepts in a simplified form that are further described below in the Detailed Description. This Summary is not intended to identify key factors or essential features of the claimed subject matter, nor is it intended to be used to limit the scope of the claimed subject matter. Although third parties may request, apply, and utilize automated monitoring of a driving behavior of a user, the user may also wish to compile a record of his or her own driving behavior. For example, the user may wish to demonstrate evidence of driving safety, proficiency, and/or experience, such as a professional asset or as character evidence. The user may compile such a record utilizing a variety of devices, such as a vehicle-mounted camera, but the trustworthiness of such evidence may be diminished by the user's ability to edit and alter the contents of the record; i.e., the dependability of the evidence compiled by the user about his or her own driving record may be only as reliable as the user's own trustworthiness, as well as the user's objectivity in self-assessment of his or her own driving behavior. Accordingly, a third party who does not have a trust relationship with the user may be unable to trust the evidentiary record of the user. Conversely, a driving behavior evidentiary record that is compiled by an objective third party, such as an insurer, may be reliable, but the insurer may be unwilling to share the evidentiary record with others. For example, the user may seek to compare the rates and/or coverage of the user's current insurer with that of another insurer, but the current insurer may be unwilling to release such an evidentiary record. The user may therefore find that the evidentiary record about the user's driving behavior is not portable or applicable to the user's other interests that are not consistent with those of the holder of the record. Presented herein are techniques that enable a user to ge...",
  "patent_number": "None",
  "abstract": "A user driving a vehicle may be monitored by a device on behalf of a third party, such as employers and insurers. The device may generate an objective evidentiary record of the user's driving safety and/or proficiency for use by the third party. The user may wish to share the evidentiary record with other parties, but the third party that controls the record may not agree and/or release the record. A user-generated record of the user's driving behavior may be untrustworthy and/or unverifiable. Instead, a device of the user monitors the operation of the vehicle by the user, generates a driving profile of the user's driving behavior and risk rating, and cryptographically signs the driving profile. The cryptographically signed driving profile is transmitted to the user for sharing with third parties, e.g., potential employers and insurers, and the authenticity of the driving profile is verifiable using the cryptographic signature.",
  "publication_number": "US20170076395A1-20170316",
  "_processing_info": {
    "original_size": 82318,
    "optimized_size": 3513,
    "reduction_percent": 95.73
  }
}