{
  "decision": "PENDING",
  "application_number": "15125536",
  "date_published": "20170105",
  "date_produced": "20161220",
  "title": "TOUCH WINDOW AND DISPLAY WITH THE SAME",
  "filing_date": "20160912",
  "inventor_list": [
    {
      "inventor_name_last": "JEON",
      "inventor_name_first": "Eun Jung",
      "inventor_city": "Seoul",
      "inventor_state": "",
      "inventor_country": "KR"
    },
    {
      "inventor_name_last": "KIM",
      "inventor_name_first": "Seung Jin",
      "inventor_city": "Seoul",
      "inventor_state": "",
      "inventor_country": "KR"
    },
    {
      "inventor_name_last": "KIM",
      "inventor_name_first": "Jong Sun",
      "inventor_city": "Seoul",
      "inventor_state": "",
      "inventor_country": "KR"
    },
    {
      "inventor_name_last": "YOO",
      "inventor_name_first": "Kyoung Jong",
      "inventor_city": "Seoul",
      "inventor_state": "",
      "inventor_country": "KR"
    },
    {
      "inventor_name_last": "MOON",
      "inventor_name_first": "Byung Youl",
      "inventor_city": "Seoul",
      "inventor_state": "",
      "inventor_country": "KR"
    },
    {
      "inventor_name_last": "SEONG",
      "inventor_name_first": "Dong Mug",
      "inventor_city": "Seoul",
      "inventor_state": "",
      "inventor_country": "KR"
    },
    {
      "inventor_name_last": "SHIN",
      "inventor_name_first": "Jun Sik",
      "inventor_city": "Seoul",
      "inventor_state": "",
      "inventor_country": "KR"
    },
    {
      "inventor_name_last": "JEON",
      "inventor_name_first": "Yu Hong",
      "inventor_city": "Seoul",
      "inventor_state": "",
      "inventor_country": "KR"
    },
    {
      "inventor_name_last": "KOO",
      "inventor_name_first": "Chan Kyu",
      "inventor_city": "Seoul",
      "inventor_state": "",
      "inventor_country": "KR"
    }
  ],
  "ipcr_labels": [
    "G06F3041",
    "G06F3047"
  ],
  "main_ipcr_label": "G06F3041",
  "summary": "<SOH> BRIEF DESCRIPTION OF DRAWINGS <EOH>FIG. 1 is an exploded perspective view showing a touch window according to the embodiment. FIG. 2 is a plan view showing the touch window according to the embodiment. FIGS. 3 and 4 are plan views showing a touch window according to another embodiment. FIG. 5 is an enlarged view showing a part A of FIG. 4 . FIG. 6 is a plan view showing a touch window according to another embodiment. FIG. 7 is an enlarged view showing a part B of FIG. 6 . FIGS. 8 and 9 are plan views showing a touch window according to another embodiment. FIG. 10 is an enlarged view showing a part C of FIG. 9 . FIG. 11 is a plan view showing a touch window according to another embodiment. FIG. 12 is a plan view showing a region A of FIG. 11 . FIG. 13 is a sectional view taken along line I-I′ of FIG. 12 . FIG. 14 is a sectional view showing a touch window according to another embodiment. FIG. 15 is a sectional view showing a touch window according to another embodiment. FIGS. 16 and 17 are plan views showing a method of fabricating a touch window according to still another embodiment. FIGS. 18 and 19 are sectional views showing a method of fabricating the touch window according to still another embodiment. FIG. 20 is an exploded perspective view showing a touch window according to another embodiment. FIG. 21 is a plan view showing a touch window according to another embodiment. FIG. 22 is a plan view showing a touch window touch window according to another embodiment. FIG. 23 is an enlarged view showing a second sensing electrode provided in a region A of FIG. 22 . FIGS. 24 and 25 are plan view showing a touch window according to still another embodiment. FIG. 26 is a perspective view showing a display according to the embodiment. FIG. 27 is a sectional view taken along line I-I′ of FIG. 26 . FIG. 28 is a perspective view showing a display according to another embodiment. FIG. 29 is a sectional view taken along line II-IF of FIG. 28 . FIGS. 30 to 33 are perspec...",
  "patent_number": "None",
  "abstract": "Disclosed is a touch window including a substrate including a first region in which a touch is sensed and a second region provided at an edge of the first region, a sensing electrode to sense a touch position of the first region, and a wire connected with the sensing electrode. The wire includes comprises a first wire part provided in the first region and a second wire part provided in the second region.",
  "publication_number": "US20170003821A1-20170105",
  "_processing_info": {
    "original_size": 88574,
    "optimized_size": 4081,
    "reduction_percent": 95.39
  }
}