{
  "decision": "PENDING",
  "application_number": "15125424",
  "date_published": "20170330",
  "date_produced": "20170316",
  "title": "DISPLAYING AND DETERMINING CUSTOMER DATA",
  "filing_date": "20160912",
  "inventor_list": [
    {
      "inventor_name_last": "Bookallil",
      "inventor_name_first": "Phil",
      "inventor_city": "The Rocks",
      "inventor_state": "",
      "inventor_country": "AU"
    }
  ],
  "ipcr_labels": [
    "G06Q3002",
    "G06Q1010"
  ],
  "main_ipcr_label": "G06Q3002",
  "summary": "<SOH> BRIEF DESCRIPTION OF DRAWINGS <EOH>An example will be described with reference to FIG. 1 illustrates a computer system for displaying customer data. FIG. 2 illustrates a method for displaying customer data. FIG. 3 illustrates a user interface for providing request data. FIG. 4 illustrates an example scenario. FIG. 5 illustrates a user interface displaying customer data. FIG. 6 shows a user interface for entering an offer. FIG. 7 illustrates a profiling user interface. FIG. 8 illustrates a computer system for determining customer data. FIG. 9 illustrates a method for determining customer data. detailed-description description=\"Detailed Description\" end=\"lead\"?",
  "patent_number": "None",
  "abstract": "This disclosure relates to displaying and determining customer data relating to multiple customers. A merchant's device sends a request for customer data. The request comprises request data indicative of a query time and of a query distance. The device then receives customer data indicative of a number of customers that are located within the query distance from a merchant location at the query time based on itineraries defmed by schedule items of the multiple customers. Each of the schedule items is associated with location information and timing information. Finally, the device generates a display to display the customer data. The number of customers that are located within a query distance is according to schedule items, such as calendar entries, of the customers. As a result, the number of customers is predicted accurately based on the calendar entries and represents different travel routes between locations defmed in the schedule items.",
  "publication_number": "US20170091821A1-20170330",
  "_processing_info": {
    "original_size": 36263,
    "optimized_size": 2171,
    "reduction_percent": 94.01
  }
}