{
  "decision": "PENDING",
  "application_number": "15126434",
  "date_published": "20170323",
  "date_produced": "20170309",
  "title": "PERSISTENT AUTHENTICATION SYSTEM INCORPORATING ONE TIME PASS CODES",
  "filing_date": "20160915",
  "inventor_list": [
    {
      "inventor_name_last": "RICHARDSON",
      "inventor_name_first": "Ric B.",
      "inventor_city": "Ewingsdale NSW",
      "inventor_state": "",
      "inventor_country": "AU"
    }
  ],
  "ipcr_labels": [
    "H04L932",
    "H04L908",
    "G06F2131"
  ],
  "main_ipcr_label": "H04L932",
  "summary": "<SOH> BRIEF DESCRIPTION OF INVENTION <EOH>Broadly, the concept encapsulated in embodiments of the present invention is to rely on two pieces of information for a persistent authentication process and corresponding system and apparatus: In a preferred, detailed form, a new key pair is generated by the client and passed to the server for each session. Communication for a subsequent session is enabled only if there is a match between this server stored public key and the public key on the client matched to that user (user ID). Broadly, stated another way, in accordance with a preferred embodiment there is effected an unbroken chain of one-time pass codes to characterise the user when using the client side application which talks to the server. In a particular form the one-time pass codes are actually the public keys of the client generated key pairs. In a further particular preferred form, there is enabled an aspect of renewal whereby the one-time pass codes keep getting replaced at regular intervals (in a preferred form preferably once per connection session at least). Accordingly in one broad form of the invention there is provided a method of maintaining ongoing authentication of a user of an application without the need to enter and re-enter a username and a corresponding password for each session initiated between a client side application residing on a client side platform and a server; and wherein the password is not stored on the server; the method comprising utilising an unbroken chain of one-time pass codes; each pass code in the chain being unique to the username and client side application; each pass code renewed periodically and preferably at least once during each said session. Preferably the pass code comprises a client side public key which is maintained persistent on both the client side platform and the server until replaced by the next client side public key in the chain of pass codes. Preferably the client side public key comprises a public key of a...",
  "patent_number": "None",
  "abstract": "A method of maintaining ongoing authentication of a user of an application without the need to enter and re-enter a username and a corresponding password for each session initiated between a client side application residing on a client side platform and a server; and wherein the password is not stored on the server; the method comprising utilising an unbroken chain of one-time pass codes; each pass code in the chain being unique to the username and client side application; each pass code renewed periodically and preferably at least once during each said session.",
  "publication_number": "US20170085381A1-20170323",
  "_processing_info": {
    "original_size": 42488,
    "optimized_size": 3153,
    "reduction_percent": 92.58
  }
}