{
  "date_produced": "20161109",
  "publication_number": "US20160342895A1-20161124",
  "main_ipcr_label": "G06N502",
  "decision": "PENDING",
  "application_number": "15137179",
  "inventor_list": [
    {
      "inventor_name_last": "Gao",
      "inventor_name_first": "Haoyuan",
      "inventor_city": "Beijing",
      "inventor_state": "",
      "inventor_country": "CN"
    },
    {
      "inventor_name_last": "Mao",
      "inventor_name_first": "Junhua",
      "inventor_city": "Los Angeles",
      "inventor_state": "CA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Zhou",
      "inventor_name_first": "Jie",
      "inventor_city": "Beijing",
      "inventor_state": "",
      "inventor_country": "CN"
    },
    {
      "inventor_name_last": "Huang",
      "inventor_name_first": "Zhiheng",
      "inventor_city": "Sunnyvale",
      "inventor_state": "CA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Wang",
      "inventor_name_first": "Lei",
      "inventor_city": "Beijing",
      "inventor_state": "",
      "inventor_country": "CN"
    },
    {
      "inventor_name_last": "Xu",
      "inventor_name_first": "Wei",
      "inventor_city": "Saratoga",
      "inventor_state": "CA",
      "inventor_country": "US"
    }
  ],
  "abstract": "Embodiments of a multimodal question answering (mQA) system are presented to answer a question about the content of an image. In embodiments, the model comprises four components: a Long Short-Term Memory (LSTM) component to extract the question representation; a Convolutional Neural Network (CNN) component to extract the visual representation; an LSTM component for storing the linguistic context in an answer, and a fusing component to combine the information from the first three components and generate the answer. A Freestyle Multilingual Image Question Answering (FM-IQA) dataset was constructed to train and evaluate embodiments of the mQA model. The quality of the generated answers of the mQA model on this dataset is evaluated by human judges through a Turing Test.",
  "filing_date": "20160425",
  "patent_number": "None",
  "summary": "<SOH> BRIEF DESCRIPTION OF THE DRAWINGS <EOH>References will be made to embodiments of the invention, examples of which may be illustrated in the accompanying figures. These figures are intended to be illustrative, not limiting. Although the invention is generally described in the context of these embodiments, it should be understood that it is not intended to limit the scope of the invention to these particular embodiments. FIG. 1A (“ FIG. 1A ”) depicts a block diagram for image question answering model according to embodiments of the present disclosure. FIG. 1B depicts a sample answer to a visual question generated by an embodiment of a multimodal question answering (mQA) system according to embodiments of the present disclosure. FIG. 2 depicts a component diagram for a multimodal question answering (mQA) model according to embodiments of the present disclosure. FIG. 3 depicts a multimodal question answering (mQA) model architecture according to embodiments of the present disclosure. FIG. 4 depicts a component diagram for the first LSTM component and the second LSTM component according to embodiments of the present disclosure. FIG. 5 depicts an exemplary flow diagram for image question answering according to embodiments of the present disclosure. FIG. 6 depicts a method for generating the final answer using a fusion component of a mQA system according to embodiments of the present disclosure. FIG. 7A depicts a method of training the Convolutional Neural Network component according to embodiments of the present disclosure. FIG. 7B depicts a method of joint-training the first LSTM component, the second LSTM component, and the fusion component according to embodiments of the present disclosure. FIG. 8 depicts an example generated answer based upon an input question and input image according to embodiments of the present disclosure. FIG. 9 depicts a simplified block diagram of a computing system for the implementation of a multimodal question answering according to em...",
  "date_published": "20161124",
  "title": "MULTILINGUAL IMAGE QUESTION ANSWERING",
  "ipcr_labels": [
    "G06N502",
    "G06F1727"
  ],
  "_processing_info": {
    "original_size": 64342,
    "optimized_size": 4026,
    "reduction_percent": 93.74
  }
}