{
  "date_produced": "20171004",
  "publication_number": "US20170300821A1-20171019",
  "main_ipcr_label": "G06N504",
  "decision": "PENDING",
  "application_number": "15132064",
  "inventor_list": [
    {
      "inventor_name_last": "Hong",
      "inventor_name_first": "Jiang",
      "inventor_city": "San Jose",
      "inventor_state": "CA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Lin",
      "inventor_name_first": "Candice",
      "inventor_city": "Cupertino",
      "inventor_state": "CA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Wu",
      "inventor_name_first": "Yuwen",
      "inventor_city": "Campbell",
      "inventor_state": "CA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Ding",
      "inventor_name_first": "Yi",
      "inventor_city": "Saratoga",
      "inventor_state": "CA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Pan",
      "inventor_name_first": "Pingping",
      "inventor_city": "Sunnyvale",
      "inventor_state": "CA",
      "inventor_country": "US"
    }
  ],
  "abstract": "An approach is provided for managing processing rules used to process electronic data in computer networks. An application provides the capability for users to define and manage classifications for electronic data. The application also provides the capability for users to define and manage processing rules for each classification. This may include specifying, for each processing rule, a classification to which the processing rule corresponds, one or more conditions under which the processing rule is to be applied and optionally, not applied, a priority for the processing rule, and one or more actions to be performed. The priority may be used to determine which rule is to be applied when more than one rule corresponds to a classification. The application supports the definition and management of classifications and rules on a logical group-by-logical group basis.",
  "filing_date": "20160418",
  "patent_number": "None",
  "summary": "<SOH> SUMMARY <EOH>An approach is provided for processing electronic data and managing rules used to process the electronic data in computer networks. The approach includes receiving, by an application executing on a computing device, OCR data for an electronic document and classifying, by the application, based upon contents of the OCR data, the electronic document to determine a classification for the electronic document. A determination is made, by the application, of a processing rule that corresponds to the classification for the electronic document. An identification is made, by the application, an action specified by the processing rule that corresponds to the classification for the electronic document; and the action is performed on the electronic data by the application. The approach may be implemented as a computer-implemented method, by instructions stored on one or more non-transitory computer-readable media when executed by one or more processors, or by one or more apparatuses.",
  "date_published": "20171019",
  "title": "Processing Electronic Data In Computer Networks With Rules Management",
  "ipcr_labels": [
    "G06N504",
    "G06K962",
    "G06F1730",
    "G06K918",
    "G06N9900",
    "G06K966"
  ],
  "_processing_info": {
    "original_size": 92998,
    "optimized_size": 3059,
    "reduction_percent": 96.71
  }
}