{
  "date_produced": "20160803",
  "publication_number": "US20160239764A1-20160818",
  "main_ipcr_label": "G06N9900",
  "decision": "ACCEPTED",
  "application_number": "15138922",
  "inventor_list": [
    {
      "inventor_name_last": "Singer",
      "inventor_name_first": "Michael A.",
      "inventor_city": "Belmont",
      "inventor_state": "CA",
      "inventor_country": "US"
    }
  ],
  "abstract": "A machine learning system for evaluating at least one characteristic of a heart valve, an inflow tract, an outflow tract or a combination thereof may include a training mode and a production mode. The training mode may be configured to train a computer and construct a transformation function to predict an unknown anatomical characteristic and/or an unknown physiological characteristic of a heart valve, inflow tract and/or outflow tract, using a known anatomical characteristic and/or a known physiological characteristic the heart valve, inflow tract and/or outflow tract. The production mode may be configured to use the transformation function to predict the unknown anatomical characteristic and/or the unknown physiological characteristic of the heart valve, inflow tract and/or outflow tract, based on the known anatomical characteristic and/or the known physiological characteristic of the heart valve, inflow tract and/or outflow tract.",
  "filing_date": "20160426",
  "patent_number": "9953272",
  "summary": "<SOH> BRIEF SUMMARY OF THE PRESENT INVENTION <EOH>The machine learning system and method described in this disclosure facilitates the diagnosis and treatment of heart valve disease and diseases of the surrounding inflow/outflow tracts. Further, the system and method facilitate the evaluation and assessment of valvular repair and/or prosthetic performance in patients who have undergone heart valve treatment. In addition to using routine physiological and geometric data gathered through two- and/or three-dimensional imaging studies, the machine learning system may also incorporate hemodynamic data into the construction and utilization of an accurate geometric and functional understanding from which to assess valvular condition and function. In one aspect, a machine learning system for evaluating at least one characteristic of a heart valve, an inflow tract and/or an outflow tract may include a training mode and a production mode. The training mode may be configured to train a computer and construct a transformation function to predict an unknown anatomical characteristic and/or an unknown physiological characteristic of a heart valve, an inflow tract and/or an outflow tract, using a known anatomical characteristic and/or a known physiological characteristic of the heart valve, inflow tract and/or outflow tract. The production mode may be configured to use the transformation function to predict the unknown anatomical characteristic and/or the unknown physiological characteristic of the heart valve, inflow tract and/or outflow tract, based the known anatomical characteristic and/or the known physiological characteristic of the heart valve, inflow tract and/or outflow tract. In some embodiments, the training mode is configured to compute and store in a feature vector the known anatomical characteristic and/or known physiological characteristic of the heart valve, inflow tract and/or outflow tract. In some embodiments, the training mode is configured to calculate an appro...",
  "date_published": "20160818",
  "title": "MACHINE LEARNING SYSTEM FOR ASSESSING HEART VALVES AND SURROUNDING CARDIOVASCULAR TRACTS",
  "ipcr_labels": [
    "G06N9900",
    "G06F1711",
    "G06F1900"
  ],
  "_processing_info": {
    "original_size": 71135,
    "optimized_size": 3556,
    "reduction_percent": 95.0
  }
}