{
  "date_produced": "20171004",
  "publication_number": "US20170300805A1-20171019",
  "main_ipcr_label": "G06N304",
  "decision": "PENDING",
  "application_number": "15130902",
  "inventor_list": [
    {
      "inventor_name_last": "Bhattacharjee",
      "inventor_name_first": "Sandeep",
      "inventor_city": "Chennai",
      "inventor_state": "",
      "inventor_country": "IN"
    },
    {
      "inventor_name_last": "Subramanian",
      "inventor_name_first": "Ponnivalavan",
      "inventor_city": "Chennai",
      "inventor_state": "",
      "inventor_country": "IN"
    },
    {
      "inventor_name_last": "Subburaman",
      "inventor_name_first": "Ramprasad",
      "inventor_city": "Chennai",
      "inventor_state": "",
      "inventor_country": "IN"
    },
    {
      "inventor_name_last": "Bansal",
      "inventor_name_first": "Komal",
      "inventor_city": "New Delhi",
      "inventor_state": "",
      "inventor_country": "IN"
    },
    {
      "inventor_name_last": "Vangipuram",
      "inventor_name_first": "Shyam Rangachari",
      "inventor_city": "Chennai",
      "inventor_state": "",
      "inventor_country": "IN"
    },
    {
      "inventor_name_last": "Datta",
      "inventor_name_first": "Indrajit",
      "inventor_city": "Chennai",
      "inventor_state": "",
      "inventor_country": "IN"
    },
    {
      "inventor_name_last": "Subramanian",
      "inventor_name_first": "Chandrashekhar",
      "inventor_city": "Chennai",
      "inventor_state": "",
      "inventor_country": "IN"
    }
  ],
  "abstract": "Various systems, mediums, and methods may involve data engines configured to generate results associated with one or more entities based on neural network configurations. An exemplary system includes a data engine with a training module, a working module, an incremental training module, and a neural network. The data engine may process data associated with the one or more entities and transfer the processed data to an input layer of the neural network. Further, outputs from the input layer may be transferred to a hidden layer of the neural network. Yet further, outputs from the hidden layer may be transferred to an output layer of the neural network. As such, one or more results may be generated from an output layer of the neural network. The one or more results may include an assessment score of the one or more entities.",
  "filing_date": "20160415",
  "patent_number": "None",
  "summary": "<SOH> BRIEF DESCRIPTION OF THE DRAWINGS <EOH>FIG. 1 is a block diagram of an exemplary system, according to an embodiment; FIG. 2A illustrates an exemplary neural network, according to an embodiment; FIG. 2B illustrates an exemplary neural network with one or more additional edges, according to an embodiment; FIG. 2C illustrates an exemplary neural network with one or more additional input nodes, according to an embodiment; FIG. 3A illustrates an exemplary process, according to an embodiment; FIG. 3B illustrates an exemplary process, according to an embodiment; FIG. 4 illustrates an exemplary method, according to an embodiment; FIG. 5 is a block diagram of an exemplary system, according to an embodiment; FIG. 6A illustrates an exemplary system configured to support a set of trays, according to an embodiment; FIG. 6B illustrates an exemplary tray configured to support one or more components, according to an embodiment; and FIG. 7 illustrates an exemplary system with a client device, according to an embodiment. detailed-description description=\"Detailed Description\" end=\"lead\"? Embodiments of the present disclosure and their advantages may be understood by referring to the detailed description herein. It should be appreciated that reference numerals may be used to illustrate various elements and features provided in the figures. The figures may illustrate various examples for purposes of illustration and explanation related to the embodiments of the present disclosure and not for purposes of any limitation.",
  "date_published": "20171019",
  "title": "DATA ENGINES BASED ON NEURAL NETWORK CONFIGURATIONS",
  "ipcr_labels": [
    "G06N304",
    "G06F1107",
    "G06F1107",
    "G06N9900",
    "G06F9445"
  ],
  "_processing_info": {
    "original_size": 110103,
    "optimized_size": 3861,
    "reduction_percent": 96.49
  }
}