{
  "date_produced": "20171011",
  "publication_number": "US20170308805A1-20171026",
  "main_ipcr_label": "G06N9900",
  "decision": "PENDING",
  "application_number": "15133852",
  "inventor_list": [
    {
      "inventor_name_last": "Altamirano",
      "inventor_name_first": "Arturo E.",
      "inventor_city": "Stafford",
      "inventor_state": "TX",
      "inventor_country": "US"
    }
  ],
  "abstract": "The present disclosure introduces methods and systems for capturing knowledge and experience of wellsite operators. Sensors at a wellsite generate sensor data during a wellsite operation. Operator data indicative of human actions performed at the wellsite during the wellsite operation are also generated. The sensor and operator data is synchronized to capture job experience and knowledge pertaining to the wellsite operation.",
  "filing_date": "20160420",
  "patent_number": "None",
  "summary": "<SOH> SUMMARY OF THE DISCLOSURE <EOH>This summary is provided to introduce a selection of concepts that are further described below in the detailed description. This summary is not intended to identify indispensable features of the claimed subject matter, nor is it intended for use as an aid in limiting the scope of the claimed subject matter. The present disclosure introduces an apparatus that includes a wellsite system, input devices, and a processing device. The wellsite system includes multiple wellsite components. Each input device is associated with a corresponding one of the wellsite components, and is operable to generate sensor data and operator data. The sensor data is indicative of a parameter associated with a wellsite operation, and the operator data is indicative of a human action performed in association with the wellsite operation. The processing device includes a processor and a memory including computer program code, and is operable to synchronize the sensor and operator data generated by each of the input devices, and to output the synchronized sensor and operator data on an audiovisual output device. The present disclosure also introduces a method that includes operating a processing device comprising a processor and a memory including computer program code. Operating the processing device causes and/or comprises: recording sensor data comprising information generated by each of multiple sensors at a wellsite during a wellsite operation; recording operator data indicative of a human action performed at the wellsite during the wellsite operation; and synchronizing the sensor and operator data. The present disclosure also introduces a method that includes time-logging sensor data generated by multiple sensors at a wellsite during a wellsite operation. Each sensor is associated with a corresponding one of multiple wellsite components utilized during the wellsite operation. The sensor data is indicative of a corresponding parameter associated with op...",
  "date_published": "20171026",
  "title": "Job Experience Capture",
  "ipcr_labels": [
    "G06N9900",
    "E21B4326",
    "E21B3313",
    "E21B4100",
    "G05B1502",
    "E21B4700"
  ],
  "_processing_info": {
    "original_size": 93294,
    "optimized_size": 3007,
    "reduction_percent": 96.78
  }
}