{
  "decision": "PENDING",
  "application_number": "15139846",
  "date_published": "20161110",
  "date_produced": "20161026",
  "title": "COOLING MODULE AND ELECTRONIC DEVICE",
  "filing_date": "20160427",
  "inventor_list": [
    {
      "inventor_name_last": "SASABE",
      "inventor_name_first": "KENJI",
      "inventor_city": "Kawasaki",
      "inventor_state": "",
      "inventor_country": "JP"
    },
    {
      "inventor_name_last": "Kubo",
      "inventor_name_first": "Hideo",
      "inventor_city": "Kawasaki",
      "inventor_state": "",
      "inventor_country": "JP"
    },
    {
      "inventor_name_last": "So",
      "inventor_name_first": "Tsuyoshi",
      "inventor_city": "Kawasaki",
      "inventor_state": "",
      "inventor_country": "JP"
    },
    {
      "inventor_name_last": "Aoki",
      "inventor_name_first": "Nobumitsu",
      "inventor_city": "Kawasaki",
      "inventor_state": "",
      "inventor_country": "JP"
    },
    {
      "inventor_name_last": "Watanabe",
      "inventor_name_first": "Masayuki",
      "inventor_city": "Yokohama",
      "inventor_state": "",
      "inventor_country": "JP"
    },
    {
      "inventor_name_last": "TAWA",
      "inventor_name_first": "Fumihiro",
      "inventor_city": "Yokohama",
      "inventor_state": "",
      "inventor_country": "JP"
    },
    {
      "inventor_name_last": "Uzuka",
      "inventor_name_first": "Yoshinori",
      "inventor_city": "Kawasaki",
      "inventor_state": "",
      "inventor_country": "JP"
    }
  ],
  "ipcr_labels": [
    "G06F120",
    "F28F132",
    "F28F302",
    "F28D1053",
    "F28D1502",
    "F28F900"
  ],
  "main_ipcr_label": "G06F120",
  "summary": "<SOH> SUMMARY <EOH>According to an aspect of the invention, a cooling module includes: a heat exchanger mounted on an electronic part mounted on a board, and that cools the electronic part; a leaf spring including an overhang portion and an extension portion, the overhang portion overhanging outward beyond the heat exchanger from the heat exchanger, and the extension portion extending from the overhang portion in a direction intersecting an overhang direction of the overhang portion when viewed in a thickness direction of the board; and a support member located around the heat exchanger, and fixed to the board, the extension portion bent toward the board being attached to the support member. The object and advantages of the invention will be realized and attained by means of the elements and combinations particularly pointed out in the claims. It is to be understood that both the foregoing general description and the following detailed description are exemplary and explanatory and are not restrictive of the invention, as claimed.",
  "patent_number": "None",
  "abstract": "A cooling module includes: a heat exchanger mounted on an electronic part mounted on a board, and that cools the electronic part; a leaf spring including an overhang portion and an extension portion, the overhang portion overhanging outward beyond the heat exchanger from the heat exchanger, and the extension portion extending from the overhang portion in a direction intersecting an overhang direction of the overhang portion when viewed in a thickness direction of the board; and a support member located around the heat exchanger, and fixed to the board, the extension portion bent toward the board being attached to the support member.",
  "publication_number": "US20160327996A1-20161110",
  "_processing_info": {
    "original_size": 59586,
    "optimized_size": 3126,
    "reduction_percent": 94.75
  }
}