{
  "decision": "PENDING",
  "application_number": "15138095",
  "date_published": "20160818",
  "date_produced": "20160803",
  "title": "Interactive Collection Book for Mobile Devices",
  "filing_date": "20160425",
  "inventor_list": [
    {
      "inventor_name_last": "Roa",
      "inventor_name_first": "Humberto",
      "inventor_city": "Bainbridge Island",
      "inventor_state": "WA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Groves",
      "inventor_name_first": "Chris",
      "inventor_city": "Los Gatos",
      "inventor_state": "CA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Watson",
      "inventor_name_first": "Ron",
      "inventor_city": "Los Gatos",
      "inventor_state": "CA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Rangan",
      "inventor_name_first": "Ravi",
      "inventor_city": "Bothell",
      "inventor_state": "WA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Horne",
      "inventor_name_first": "James",
      "inventor_city": "Melrose",
      "inventor_state": "MA",
      "inventor_country": "US"
    }
  ],
  "ipcr_labels": [
    "G06Q3006",
    "H04L2908",
    "G06F30488",
    "G06F30484",
    "G06F30482",
    "H04W400",
    "H04B500"
  ],
  "main_ipcr_label": "G06Q3006",
  "summary": "<SOH> BRIEF SUMMARY OF THE INVENTION <EOH>A software-based interactive collection book for mobile devices provides producers of fashion items (e.g., fashion houses, designers, or others) to connect with their customers. This can be done early in the product lifecycle at the development stage. This will allow these producers to engage with their customers early and often with their ideas to drive more sales and receive feedback on their ideas. This will result in their products being more successful in the market when they are launched. An interactive collection book for mobile devices allows a user to browse products, provide feedback, support decision making, negotiating, and make purchases on a mobile device. These functions can be geographically limited. Some locations can include fashion shows, focus groups, trade shows, boutiques, and show rooms. Products can include product prototypes that have not been committed to be manufactured, but may be manufactured if there is enough interest from potential buyers. Feedback can include suggestions to improve the product, interest in buying the product, and special requests for changes to the product as a condition to purchase. Purchases can include pre-ordering the product. One of the benefits the system has over paper-based collection books are that the information presented in an interactive collection book for mobile devices is automatically aggregated from multiple information systems, and is automatically updated as the product information changes in the source systems (e.g., system maintained by a fashion house or designer). Another benefit is that information is not limited by physical space. User can access the information through multiple levels of detail to go from a brief summary to detailed explanations as needed. Also, the user can pan and zoom photos and other objects to observe details at different levels of zoom. Yet another benefit is that the choices of media that can be used is greater. The media tha...",
  "patent_number": "None",
  "abstract": "A software-based interactive collection book for mobile devices provides the users a way to connect their customers to products while the products are still being developed. This will allow a user to engage with their customers earlier to drive more sales. This will result in their products being more successful in the market at the time of launch.",
  "publication_number": "US20160239884A1-20160818",
  "_processing_info": {
    "original_size": 108288,
    "optimized_size": 3543,
    "reduction_percent": 96.73
  }
}