{
  "decision": "PENDING",
  "application_number": "15135936",
  "date_published": "20161103",
  "date_produced": "20161019",
  "title": "SWING SUPPORTING DEVICE, SWING SUPPORTING METHOD, SWING SUPPORTING SYSTEM, AND STORAGE MEDIUM",
  "filing_date": "20160422",
  "inventor_list": [
    {
      "inventor_name_last": "SAYO",
      "inventor_name_first": "Takefumi",
      "inventor_city": "Shiojiri-shi",
      "inventor_state": "",
      "inventor_country": "JP"
    }
  ],
  "ipcr_labels": [
    "G09B1900",
    "G06Q3002"
  ],
  "main_ipcr_label": "G09B1900",
  "summary": "<SOH> SUMMARY <EOH>An advantage of some aspects of the invention is to provide a technique that can achieve maintenance or improvement of the motivation of a user. A first aspect of the invention is directed to a swing supporting device including: an analyzer configured to analyze a predetermined indicator concerning a swing on the basis of information concerning a swing motion of at least one of an exercise instrument and a user who operates the exercise instrument; and a selector configured to select, according to a result of the analysis of the indicator, a type of swing support information for supporting a swing of the user and output the type of the swing support information. According to the first aspect, it is possible to achieve maintenance or improvement of the motivation of the user. The indicator may be at least one of a tendency of the swing, the number of times of the swing, and a practice frequency of the swing per predetermined period. With this configuration, it is possible to generate swing support information corresponding to at least one of a motion form of the swing, the number of times of the swing, and the practice frequency of the swing per predetermined period and provide the user with the swing support information. The swing support information may include at least one of advice information of the swing, information concerning the exercise instrument suitable for the user, information concerning a practice ground where the user practices the swing, and information concerning a sales store that sells the exercise instrument. With this configuration, the user can improve the swing of the user. The selector may output coupon information as the swing support information when the indicator reaches or exceeds a predetermined threshold. With this configuration, the user has motivation to swing in order to acquire the swing support information. The swing support information may include identification information for identifying the user, and the swi...",
  "patent_number": "None",
  "abstract": "An analyzer analyzes a predetermined indicator concerning a swing on the basis of information concerning a swing motion of at least one of an exercise instrument and a user who operates the exercise instrument. A selector selects, according to a result of the analysis of the indicator, a type of swing support information for supporting a swing of the user and outputs the type of the swing support information.",
  "publication_number": "US20160321949A1-20161103",
  "_processing_info": {
    "original_size": 86764,
    "optimized_size": 3009,
    "reduction_percent": 96.53
  }
}