{
  "decision": "PENDING",
  "application_number": "15131488",
  "date_published": "20160811",
  "date_produced": "20160727",
  "title": "REPRODUCING DATA FROM OBFUSCATED DATA RETRIEVED FROM A DISPERSED STORAGE NETWORK",
  "filing_date": "20160418",
  "inventor_list": [
    {
      "inventor_name_last": "Grube",
      "inventor_name_first": "Gary W.",
      "inventor_city": "Barrington Hills",
      "inventor_state": "IL",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Markison",
      "inventor_name_first": "Timothy W.",
      "inventor_city": "Mesa",
      "inventor_state": "AZ",
      "inventor_country": "US"
    }
  ],
  "ipcr_labels": [
    "G06F1110",
    "G06F306",
    "H04L2908"
  ],
  "main_ipcr_label": "G06F1110",
  "summary": "<SOH> BRIEF DESCRIPTION OF THE SEVERAL VIEWS OF THE DRAWING(S) <EOH>FIG. 1 is a schematic block diagram of an embodiment of a computing system in accordance with the invention; FIG. 2 is a schematic block diagram of an embodiment of a computing core in accordance with the invention; FIG. 3 is a schematic block diagram of an embodiment of a distributed storage processing unit in accordance with the invention; FIG. 4 is a schematic block diagram of an embodiment of a grid module in accordance with the invention; FIG. 5 is a diagram of an example embodiment of error coded data slice creation in accordance with the invention; FIG. 6A is a diagram illustrating an example of a plurality of sets of slices in accordance with the invention; FIG. 6B is a diagram illustrating an example of a plurality of subsets of slices in accordance with the invention; FIG. 6C is a diagram illustrating an example of a plurality of watermarked slices in accordance with the invention; FIG. 7A is a flowchart illustrating an example of watermarking sets of encoded data slices in accordance with the invention; FIG. 7B is a block diagram of a watermarking module in accordance with the invention; FIG. 8A is a flowchart illustrating an example of validating sets of watermarked encoded data slices in accordance with the invention; FIG. 8B is a block diagram of a validating module in accordance with the invention; FIG. 9 is a flowchart illustrating another example of validating sets of watermarked encoded data slices in accordance with the invention; FIG. 10A is a diagram illustrating an example of a plurality of sets of encoded data slices in accordance with the invention; FIG. 10B is a diagram illustrating an example of a plurality of sets of encoded secret slices in accordance with the invention; FIG. 10C is a diagram illustrating an example of a plurality of sets of encoded mixed slices in accordance with the invention; FIG. 11A is a diagram illustrating another example of a plurality of sets of ...",
  "patent_number": "None",
  "abstract": "A method includes first encoding first data into a first plurality of sets of encoded data slices, wherein the first encoding is in accordance with a first dispersed error encoding function. The method further includes second encoding second data into a second plurality of sets of encoded data slices, wherein the second encoding is in accordance with a second dispersed error encoding function. The method further includes creating a plurality of mixed sets of encoded data slices from the first and second plurality of sets of encoded data slices in accordance with a mixing pattern. The method further includes outputting the plurality of sets of mixed encoded data slices to storage units of the DSN for storage therein.",
  "publication_number": "US20160232056A1-20160811",
  "_processing_info": {
    "original_size": 142355,
    "optimized_size": 3474,
    "reduction_percent": 97.56
  }
}