{
  "decision": "PENDING",
  "application_number": "15133374",
  "date_published": "20171026",
  "date_produced": "20171011",
  "title": "AUTO-GENERATION OF ACTIONS OF A COLLABORATIVE MEETING",
  "filing_date": "20160420",
  "inventor_list": [
    {
      "inventor_name_last": "Lopez Venegas",
      "inventor_name_first": "Adalberto",
      "inventor_city": "Tepic",
      "inventor_state": "",
      "inventor_country": "MX"
    },
    {
      "inventor_name_last": "Marin Rodriguez",
      "inventor_name_first": "Alina Denise",
      "inventor_city": "Tepic",
      "inventor_state": "",
      "inventor_country": "MX"
    },
    {
      "inventor_name_last": "Martinez Hernandez Magro",
      "inventor_name_first": "Agueda",
      "inventor_city": "Zapopan",
      "inventor_state": "",
      "inventor_country": "MX"
    },
    {
      "inventor_name_last": "Rincón Ferrera",
      "inventor_name_first": "Orlando Ezequiel",
      "inventor_city": "Tiaquepaque",
      "inventor_state": "",
      "inventor_country": "MX"
    }
  ],
  "ipcr_labels": [
    "H04L2906",
    "G06Q1010",
    "H04L1258",
    "H04L2906"
  ],
  "main_ipcr_label": "H04L2906",
  "summary": "<SOH> SUMMARY <EOH>According to aspects of the present invention, there is a method, computer program product, and/or system for identifying and initiating actions of a meeting. The method includes one or more computer processors monitoring a meeting, where monitoring the meeting includes receiving input from at least a first computing device. The method further includes identifying a plurality of metadata triggers associated with the received input of the meeting. The method further includes identifying an occurrence of a first metadata trigger of the plurality of metadata triggers associated with the received input of the meeting. The method further includes analyzing a first portion of the received input of the meeting that includes an occurrence of the first metadata trigger, where analyzing the first portion of the received input includes identifying a first action. The method further includes determining a response criterion of the first metadata trigger. The method further includes responding to a determination that the first metadata trigger includes a response criterion indicating immediate action by initiating the first action.",
  "patent_number": "None",
  "abstract": "A method for identifying and initiating actions of a meeting. The method includes a computer processor monitoring a meeting where monitoring the meeting includes receiving input from at least a first computing device. The method further includes identifying a plurality of metadata triggers associated with the received input of meeting. The method further includes identifying an occurrence of a first metadata trigger of the plurality of metadata triggers associated with the received input of the meeting. The method further includes analyzing a first portion of the received input of the meeting that includes an occurrence of the first metadata trigger and identifying a first action associated with the first metadata trigger. The method further includes determining a response criterion of the first metadata trigger. The method further includes responding to a determination that the first metadata trigger includes a response criterion indicating immediate action by initiating the first act...",
  "publication_number": "US20170310716A1-20171026",
  "_processing_info": {
    "original_size": 92378,
    "optimized_size": 3226,
    "reduction_percent": 96.51
  }
}