{
  "decision": "PENDING",
  "application_number": "15139283",
  "date_published": "20161103",
  "date_produced": "20161019",
  "title": "Haptic Driving Apparatus and Electronic Device Having Haptic Function",
  "filing_date": "20160426",
  "inventor_list": [
    {
      "inventor_name_last": "SON",
      "inventor_name_first": "JiEun",
      "inventor_city": "Paju-si",
      "inventor_state": "",
      "inventor_country": "KR"
    },
    {
      "inventor_name_last": "KIM",
      "inventor_name_first": "KiDuk",
      "inventor_city": "Paju-si",
      "inventor_state": "",
      "inventor_country": "KR"
    },
    {
      "inventor_name_last": "HWANG",
      "inventor_name_first": "JongHee",
      "inventor_city": "Goyang-si",
      "inventor_state": "",
      "inventor_country": "KR"
    },
    {
      "inventor_name_last": "RYU",
      "inventor_name_first": "Je Ha",
      "inventor_city": "Gwangju",
      "inventor_state": "",
      "inventor_country": "KR"
    },
    {
      "inventor_name_last": "KIM",
      "inventor_name_first": "Hee Won",
      "inventor_city": "Gwangju",
      "inventor_state": "",
      "inventor_country": "KR"
    },
    {
      "inventor_name_last": "KANG",
      "inventor_name_first": "Jeong Goo",
      "inventor_city": "Gwangju",
      "inventor_state": "",
      "inventor_country": "KR"
    }
  ],
  "ipcr_labels": [
    "G06F3041",
    "G06F3044",
    "G06F301"
  ],
  "main_ipcr_label": "G06F3041",
  "summary": "<SOH> SUMMARY OF THE INVENTION <EOH>Accordingly, the present invention is directed to a haptic driving apparatus and an electronic device having a haptic function, which substantially obviate one or more problems due to limitations and disadvantages of the related art. An advantage of the present invention is to provide a haptic driving apparatus that may provide a user with electrovibration of certain strength regardless of a variance of a surrounding environment and an electronic device having a haptic function. Additional advantages and features of the invention will be set forth in part in the description which follows and in part will become apparent to those having ordinary skill in the art upon examination of the following or may be learned from practice of the invention. The objectives and other advantages of the invention may be realized and attained by the structure particularly pointed out in the written description and claims hereof as well as the appended drawings. To achieve these objects and other advantages and in accordance with the purpose of the invention, as embodied and broadly described herein, a haptic driving apparatus comprises a haptic electrode driver generating a haptic driving signal to supply the generated haptic driving signal to a haptic electrode through a current monitor and varying the haptic driving signal in accordance with the current supplied to the haptic electrode. In another aspect of the present invention, an electronic device having a haptic function comprises a touch panel driver including a touch panel arranged on a display panel, having a plurality of first electrodes and a plurality of second electrodes to sense a user touch and a haptic driver supplying a haptic driving signal to at least one of the first and second electrodes during a haptic driving mode, wherein the haptic driver includes a haptic electrode driver generating the haptic driving signal to supply the generated haptic driving signal to at least one of t...",
  "patent_number": "None",
  "abstract": "A haptic driving apparatus that may provide a user with electrovibration of certain strength regardless of a variance of a surrounding environment and an electronic device having a haptic function are disclosed. The haptic driving apparatus comprises a haptic electrode driver generating a haptic driving signal to supply the generated haptic driving signal to a haptic electrode through a current monitor and varying the haptic driving signal in accordance with the current supplied to the haptic electrode.",
  "publication_number": "US20160320901A1-20161103",
  "_processing_info": {
    "original_size": 72351,
    "optimized_size": 3791,
    "reduction_percent": 94.76
  }
}