{
  "date_produced": "20160803",
  "publication_number": "US20160239747A1-20160818",
  "main_ipcr_label": "G06N504",
  "decision": "PENDING",
  "application_number": "15137346",
  "inventor_list": [
    {
      "inventor_name_last": "Nakazawa",
      "inventor_name_first": "Katsuhito",
      "inventor_city": "Urawa",
      "inventor_state": "",
      "inventor_country": "JP"
    },
    {
      "inventor_name_last": "Shiota",
      "inventor_name_first": "Tetsuyoshi",
      "inventor_city": "Yokohama",
      "inventor_state": "",
      "inventor_country": "JP"
    },
    {
      "inventor_name_last": "Chiba",
      "inventor_name_first": "Hiroshi",
      "inventor_city": "Aikawa",
      "inventor_state": "",
      "inventor_country": "JP"
    },
    {
      "inventor_name_last": "Tomoko",
      "inventor_name_first": "Nagano",
      "inventor_city": "Isehara",
      "inventor_state": "",
      "inventor_country": "JP"
    },
    {
      "inventor_name_last": "Fujii",
      "inventor_name_first": "Hidemichi",
      "inventor_city": "Kawasaki",
      "inventor_state": "",
      "inventor_country": "JP"
    }
  ],
  "abstract": "An information presentation device includes a processor that executes a procedure. The procedure includes: for respective decision making entities, calculating assessment indexes of a plurality of respective assessment criteria, based on characteristic information representing a characteristic of each of the decision making entities; selecting, from the plurality of decision making entities, at least one decision making entity having a characteristic similar to that of an information presentation target decision making entity that is a target of information presentation, based on an assessment index calculated for each of the decision making entities; and acquiring and presenting information related to decision making by the selected decision making entity from a storage section storing information related to decision making for each of the plurality of decision making entities.",
  "filing_date": "20160425",
  "patent_number": "None",
  "summary": "<SOH> SUMMARY <EOH>According to an aspect of the embodiments, an information presentation method includes: for respective decision making entities, calculating assessment indexes of plural respective assessment criteria, based on characteristic information representing a characteristic of each of the decision making entities; by a processor, selecting, from the plural decision making entities, at least one decision making entity having a characteristic similar to that of an information presentation target decision making entity that is a target of information presentation, based on an assessment index calculated for each of the decision making entities; and acquiring and presenting information related to decision making by the selected decision making entity, from a storage section storing information related to decision making for each of the plural decision making entities. The object and advantages of the invention will be realized and attained by means of the elements and combinations particularly pointed out in the claims. It is to be understood that both the foregoing general description and the following detailed description are exemplary and explanatory and are not restrictive of the invention.",
  "date_published": "20160818",
  "title": "INFORMATION PRESENTATION METHOD, DEVICE, AND PROGRAM",
  "ipcr_labels": [
    "G06N504"
  ],
  "_processing_info": {
    "original_size": 83089,
    "optimized_size": 3228,
    "reduction_percent": 96.12
  }
}