{
  "date_produced": "20171011",
  "publication_number": "US20170308802A1-20171026",
  "main_ipcr_label": "G06N700",
  "decision": "PENDING",
  "application_number": "15134905",
  "inventor_list": [
    {
      "inventor_name_last": "Ramsøy",
      "inventor_name_first": "Tor J.",
      "inventor_city": "Oslo",
      "inventor_state": "",
      "inventor_country": "NO"
    },
    {
      "inventor_name_last": "Han",
      "inventor_name_first": "Robert",
      "inventor_city": "San Francisco",
      "inventor_state": "CA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Mathiesen",
      "inventor_name_first": "Mogens L.",
      "inventor_city": "Olso",
      "inventor_state": "",
      "inventor_country": "NO"
    },
    {
      "inventor_name_last": "Kindler",
      "inventor_name_first": "Noah B. S.",
      "inventor_city": "Atherton",
      "inventor_state": "CA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Lee",
      "inventor_name_first": "Martin J.",
      "inventor_city": "Sunnyvale",
      "inventor_state": "CA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Burriesci",
      "inventor_name_first": "Matthew S.",
      "inventor_city": "Half Moon Bay",
      "inventor_state": "CA",
      "inventor_country": "US"
    }
  ],
  "abstract": "Methods and accompanying systems are provided for predicting outcomes, such as industrial asset failures, in heavy industries. The predicted outcomes can be used by owners and operators of oil rigs, mines, factories, and other operational sites to identify potential failures and take preventive and/or remedial action with respect to industrial assets. In one implementation, historical data associated with a plurality of outcomes is received at one or more central site servers from one or more data sources, and datasets are generated from the historical data. Using the datasets, a set of models is trained to predict an outcome. A particular model includes sub-models corresponding to a hierarchy of components of an industrial asset. The set of models is combined into an ensemble model, which is transmitted to remote sites.",
  "filing_date": "20160421",
  "patent_number": "None",
  "summary": "<SOH> SUMMARY <EOH>Described herein are computer-implemented methods and accompanying systems to create models over a diverse group of data incompatible to be aggregated or commingled, protect the data with a computer security infrastructure, and transmit the models to a prediction server without transmission of the actual protected data while maintaining anonymity and data confidentiality. In one aspect, a computer-implemented method includes the steps of: receiving, at one or more central site servers from one or more data sources, historical data associated with a plurality of outcomes; generating, by the central site servers, a plurality of datasets from the historical data; training, by the central site servers and using the datasets, a set of models to predict an outcome, wherein a particular model in the set of models comprises a plurality of sub-models corresponding to a hierarchy of components of an industrial asset; combining, by the central site servers, the set of models into an ensemble model; and transmitting, from the central site servers, the ensemble model to one or more remote sites. In one implementation, each of the remote sites is configured to receive at least one of real-time data and historical data associated with operation of the remote site, and predict, using at least one of a customized model and the ensemble model, an outcome based on the at least one of real-time data and historical data. A particular predicted outcome can include at least one of a prediction that an asset or a component of an asset is likely to fail, a prediction that an asset or a component of an asset is likely to require maintenance, a prediction of uptime of an asset or a component of an asset, and a prediction of productivity of an asset or a component of an asset. particular predicted outcome can also include a decision relating to underwriting, pricing, or feature activation of an insurance or financial product associated with an industrial activity or installa...",
  "date_published": "20171026",
  "title": "SYSTEMS AND METHODS FOR FAILURE PREDICTION IN INDUSTRIAL ENVIRONMENTS",
  "ipcr_labels": [
    "G06N700",
    "H04L2906",
    "G06N9900"
  ],
  "_processing_info": {
    "original_size": 99591,
    "optimized_size": 4162,
    "reduction_percent": 95.82
  }
}