{
  "date_produced": "20160727",
  "publication_number": "US20160232453A1-20160811",
  "main_ipcr_label": "G06N700",
  "decision": "ACCEPTED",
  "application_number": "15134715",
  "inventor_list": [
    {
      "inventor_name_last": "Daly",
      "inventor_name_first": "Brian Kevin",
      "inventor_city": "Peachtree Corners",
      "inventor_state": "GA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Musgrove",
      "inventor_name_first": "Charles Peter",
      "inventor_city": "Henderson",
      "inventor_state": "NV",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Sennett",
      "inventor_name_first": "DeWayne A.",
      "inventor_city": "Redmond",
      "inventor_state": "WA",
      "inventor_country": "US"
    }
  ],
  "abstract": "A network device may receive a subscriber's activity data for a plurality of network resources associated with the subscriber. The subscriber's activity data may be analyzed and a tailored notification instruction may be provided for alerting the subscriber.",
  "filing_date": "20160421",
  "patent_number": "9607269",
  "summary": "<SOH> SUMMARY <EOH>This summary is provided to introduce a selection of concepts in a simplified form that are further described below in the Detailed Description. This summary is not intended to identify key features or essential features of the claimed subject matter, nor is it intended to be used to limit the scope of the claimed subject matter. Furthermore, the claimed subject matter is not limited to limitations that solve any or all disadvantages noted in any part of this disclosure. A subscriber's activity data may include implicit responses to an alert message from a plurality of network resources. The subscriber's activity data may be analyzed and a tailored notification instruction may be created based on the analyzed subscriber data. In an embodiment, the notification instruction may comprise confidence levels that pertain to the likelihood an alert message may reach a network resource. A notification instruction may instruct a device on whether to send an alert message to a network resource based on the confidence level of the network resource.",
  "date_published": "20160811",
  "title": "INTELLIGENT SUBSCRIBER NOTIFICATION",
  "ipcr_labels": [
    "G06N700",
    "H04L2908"
  ],
  "_processing_info": {
    "original_size": 71881,
    "optimized_size": 2184,
    "reduction_percent": 96.96
  }
}