{
  "decision": "PENDING",
  "application_number": "15139954",
  "date_published": "20161110",
  "date_produced": "20161026",
  "title": "SYSTEM, INFORMATION PROCESSING DEVICE, AND METHOD",
  "filing_date": "20160427",
  "inventor_list": [
    {
      "inventor_name_last": "Tanimoto",
      "inventor_name_first": "Teruo",
      "inventor_city": "Kawasaki",
      "inventor_state": "",
      "inventor_country": "JP"
    },
    {
      "inventor_name_last": "MIYOSHI",
      "inventor_name_first": "TAKASHI",
      "inventor_city": "Ohta",
      "inventor_state": "",
      "inventor_country": "JP"
    }
  ],
  "ipcr_labels": [
    "G06F952",
    "G06F1208",
    "G06F1324"
  ],
  "main_ipcr_label": "G06F952",
  "summary": "<SOH> SUMMARY <EOH>According to an aspect of the invention, a system includes a first device configured to transmit a first request; and a second device coupled to the first device, the second device including a processor configured to execute a program, a memory, and a communicating device, wherein the communicating device is configured to: receive the first request, when a lock variable is not stored at a given address in the memory, write the lock variable at the given address, and perform processing of the first request, and when the communicating device is unable to write the lock variable at the given address within a set time due to the lock variable stored at the given address, notify an interrupt to the program, and hand over the processing of the first request to the processor. The object and advantages of the invention will be realized and attained by means of the elements and combinations particularly pointed out in the claims. It is to be understood that both the foregoing general description and the following detailed description are exemplary and explanatory and are not restrictive of the invention, as claimed.",
  "patent_number": "None",
  "abstract": "A system includes: a first device configured to transmit a first request; and a second device coupled to the first device, the second device including a processor configured to execute a program, a memory, and a communicating device. The communicating device is configured to: receive the first request, when a lock variable is not stored at a given address in the memory, write the lock variable at the given address, and perform processing of the first request, and when the communicating device is unable to write the lock variable at the given address within a set time due to the lock variable stored at the given address, notify an interrupt to the program, and hand over the processing of the first request to the processor.",
  "publication_number": "US20160328276A1-20161110",
  "_processing_info": {
    "original_size": 90830,
    "optimized_size": 2573,
    "reduction_percent": 97.17
  }
}