{
  "decision": "PENDING",
  "application_number": "15130919",
  "date_published": "20160811",
  "date_produced": "20160727",
  "title": "Zone Scene Activation",
  "filing_date": "20160415",
  "inventor_list": [
    {
      "inventor_name_last": "Lambourne",
      "inventor_name_first": "Robert A.",
      "inventor_city": "Santa Barbara",
      "inventor_state": "CA",
      "inventor_country": "US"
    }
  ],
  "ipcr_labels": [
    "H04R2700",
    "G06F30484",
    "G06F316"
  ],
  "main_ipcr_label": "H04R2700",
  "summary": "<SOH> SUMMARY OF THE INVENTION <EOH>This section is for the purpose of summarizing some aspects of the present invention and to briefly introduce some preferred embodiments. Simplifications or omissions in this section as well as in the abstract or the title of this description may be made to avoid obscuring the purpose of this section, the abstract and the title. Such simplifications or omissions are not intended to limit the scope of the present invention. In general, the present invention pertains to controlling a plurality of multimedia players, or simply players, in groups. According to one aspect of the present invention, a mechanism is provided to allow a user to group some of the players according to a theme or scene, where each of the players is located in a zone. When the scene is activated, the players in the scene react in a synchronized manner. For example, the players in the scene are all caused to play an audio source or music in a playlist, wherein the audio source may be located anywhere on a network. According to another aspect of the present invention, the scene may be activated at any time or a specific time. A user may activate the scene at any time so that only some selected zones in an entertainment system facilitate a playback of an audio source. When the scene is activated at a specific time, the scene may be used as an alarm or buzzer. According to still another aspect of the present invention, a controlling device (also referred to herein as controller) is provided to facilitate a user to select any of the players in the system to form respective groups each of which is set up per a scene. Although various scenes may be saved in any of the members in a group, commands are preferably sent from the controller to the rest of the members when one of the scenes is executed. Depending on implementation, the commands include parameters pertaining to identifiers of the players, volumes settings, audio source and etc. According to yet another aspec...",
  "patent_number": "None",
  "abstract": "In general, techniques of controlling a plurality of multimedia players in groups are disclosed. According to one aspect of the present invention, a mechanism is provided to allow a user to group some of the players according to a theme or scene, where each of the players is located in a zone. When the scene is activated, the players in the scene react in a synchronized manner. For example, the players in the scene are all caused to play a multimedia source or music in a playlist, wherein the multimedia source may be located anywhere on a network.",
  "publication_number": "US20160234615A1-20160811",
  "_processing_info": {
    "original_size": 50674,
    "optimized_size": 3099,
    "reduction_percent": 93.88
  }
}