{
  "decision": "PENDING",
  "application_number": "15133636",
  "date_published": "20161020",
  "date_produced": "20161005",
  "title": "METHOD AND SYSTEM FOR SECURE REMOTE ACCESS AND CONTROL USING SHARED RESOURCES",
  "filing_date": "20160420",
  "inventor_list": [
    {
      "inventor_name_last": "HOLBROOK",
      "inventor_name_first": "Brandon Wilson",
      "inventor_city": "Ridgeland",
      "inventor_state": "MS",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "SMITH",
      "inventor_name_first": "John Burns",
      "inventor_city": "Charlotte",
      "inventor_state": "NC",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "DURHAM",
      "inventor_name_first": "David William",
      "inventor_city": "Raymond",
      "inventor_state": "MS",
      "inventor_country": "US"
    }
  ],
  "ipcr_labels": [
    "H04L2906",
    "G06F9455"
  ],
  "main_ipcr_label": "H04L2906",
  "summary": "<SOH> BRIEF DESCRIPTION OF THE DRAWINGS <EOH>FIG. 1A is a diagram of a system and associated process for providing a secure remote support using shared resources, according to certain embodiments; FIG. 1B is a flowchart of a system and associated process for providing a secure remote support using shared resources, according to certain embodiments; FIG. 2 is an exemplary hardware architecture of a shared hardware 101 , according to one embodiment; FIG. 3 is a flowchart of a process for providing a secure remote support using shared resources, according to one example embodiment; FIG. 4 is a flowchart of a process for selecting at least one shared resource, and configuring at least one agent, according to one example embodiment; FIG. 5 is a flowchart of a process for downloading and configuring an agent, and migrating virtual appliance, according to one example embodiment; FIG. 6 illustrates a computer system 600 upon which an embodiment according to the invention can be implemented; and FIG. 7 illustrates a chip set 700 upon which an embodiment of the invention may be implemented. detailed-description description=\"Detailed Description\" end=\"lead\"?",
  "patent_number": "None",
  "abstract": "An approach is provided for a secure remote access and control in a shared resource model. The approach involves initiating a logically separate instance of a virtual appliance using one or more shared computing resources of at least one shared resource provider. The approach also involves initiating an agent at an administrator system associated with the logically separate instance of the virtual appliance, wherein the agent services authentication requests directed to the virtual appliance by acting as a proxy or a push agent to the at least one shared resource provider.",
  "publication_number": "US20160308867A1-20161020",
  "_processing_info": {
    "original_size": 44231,
    "optimized_size": 2637,
    "reduction_percent": 94.04
  }
}