{
  "date_produced": "20171011",
  "publication_number": "US20170308794A1-20171026",
  "main_ipcr_label": "G06N502",
  "decision": "PENDING",
  "application_number": "15135959",
  "inventor_list": [
    {
      "inventor_name_last": "Fischerström",
      "inventor_name_first": "Ludvig",
      "inventor_city": "Stockholm",
      "inventor_state": "",
      "inventor_country": "SE"
    }
  ],
  "abstract": "In accordance with an embodiment, described herein is a system and method for predicting artists that create media content who are more likely to increase in popularity. Users are determined who requested playback of media content items associated with one or more generators of popular media content within a window of time. One or more early adopters are determined from these users based on a quantity of the one or more generators of popular media content whose media content items were requested for playback by the users. Artists that create media content who are more likely to increase in popularity than other artists that create media content are then predicted based on following further requested playback of media content items by the one or more early adopters.",
  "filing_date": "20160422",
  "patent_number": "None",
  "summary": "<SOH> SUMMARY <EOH>In accordance with an embodiment, described herein is a system and method for predicting artists that create media content who are more likely to increase in popularity. Users are determined who requested playback of media content items associated with one or more generators of popular media content within a window of time. One or more early adopters are determined from these users based on a quantity of the one or more generators of popular media content whose media content items were requested for playback by the users. Artists that create media content who are more likely to increase in popularity than other artists that create media content are then predicted based on following further requested playback of media content items by the one or more early adopters.",
  "date_published": "20171026",
  "title": "SYSTEM AND METHOD FOR BREAKING ARTIST PREDICTION IN A MEDIA CONTENT ENVIRONMENT",
  "ipcr_labels": [
    "G06N502",
    "G06F1730",
    "G06F1730"
  ],
  "_processing_info": {
    "original_size": 54954,
    "optimized_size": 2167,
    "reduction_percent": 96.06
  }
}