{
  "date_produced": "20171011",
  "publication_number": "US20170308806A1-20171026",
  "main_ipcr_label": "G06N9900",
  "decision": "PENDING",
  "application_number": "15135405",
  "inventor_list": [
    {
      "inventor_name_last": "Chao",
      "inventor_name_first": "John",
      "inventor_city": "FosterCity",
      "inventor_state": "CA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Hoang",
      "inventor_name_first": "Huan",
      "inventor_city": "San Jose",
      "inventor_state": "CA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Liu",
      "inventor_name_first": "Yan",
      "inventor_city": "Sunnyvale",
      "inventor_state": "CA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Zhu",
      "inventor_name_first": "Qiang",
      "inventor_city": "Sunnyvale",
      "inventor_state": "CA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Zhang",
      "inventor_name_first": "Wenjing",
      "inventor_city": "Menlo Park",
      "inventor_state": "CA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Blanchard",
      "inventor_name_first": "Clay",
      "inventor_city": "Danville",
      "inventor_state": "CA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Fuller",
      "inventor_name_first": "Christopher",
      "inventor_city": "Oakland",
      "inventor_state": "CA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Zhou",
      "inventor_name_first": "Xing",
      "inventor_city": "Mountain View",
      "inventor_state": "CA",
      "inventor_country": "US"
    }
  ],
  "abstract": "Techniques are provided for determining a propensity or likelihood that a person in a social network will perform a particular action. A statistical model that is trained based on multiple features of each member in a first plurality of members of a social network is stored. The multiple features include a subset pertaining to profile information provided by the first plurality of members and stored in a plurality of profiles of the first plurality of members. For each member of a second plurality of members of the social network, multiple feature values that correspond to the plurality of features are identified, the statistical model is used to generate a score for the member. The score indicates a likelihood that the member will perform the particular action.",
  "filing_date": "20160421",
  "patent_number": "None",
  "summary": "<SOH> BRIEF DESCRIPTION OF THE DRAWINGS <EOH>In the drawings: FIG. 1 is a block diagram that depicts a system for managing user profiles and information about organizations, in an embodiment; FIG. 2 is a flow diagram that depicts an example process for generating an individual propensity score, in an embodiment; FIG. 3 is a flow diagram that depicts an example process for generating an organization propensity score, in an embodiment; FIG. 4A is diagram that depicts an example screenshot of a user interface that lists organizations based on organization propensity scores, in an embodiment; FIG. 4B is diagram that depicts an example screenshot of a user interface that lists individuals that are associated with an organization and factors that were used to generate individual propensity scores for the individuals, in an embodiment; FIG. 5 is a flow diagram that depicts a process for presenting information about organizations and individuals, in an embodiment; FIG. 6 is a block diagram that illustrates a computer system upon which an embodiment of the invention may be implemented. detailed-description description=\"Detailed Description\" end=\"lead\"?",
  "date_published": "20171026",
  "title": "USING MACHINE LEARNING TECHNIQUES TO DETERMINE PROPENSITIES OF ENTITIES IDENTIFIED IN A SOCIAL GRAPH",
  "ipcr_labels": [
    "G06N9900",
    "G06N700",
    "G06F1730",
    "G06F1730",
    "G06Q5000",
    "G06Q1010"
  ],
  "_processing_info": {
    "original_size": 118544,
    "optimized_size": 3600,
    "reduction_percent": 96.96
  }
}