{
  "decision": "PENDING",
  "application_number": "15134235",
  "date_published": "20161222",
  "date_produced": "20161208",
  "title": "Method and System for Utilizing Proximity Lighting And Plug Controls For Real Time Location Sensing",
  "filing_date": "20160420",
  "inventor_list": [
    {
      "inventor_name_last": "Fitch",
      "inventor_name_first": "John Edward",
      "inventor_city": "Woodway",
      "inventor_state": "TX",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Steward",
      "inventor_name_first": "James M.",
      "inventor_city": "Crawford",
      "inventor_state": "TX",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Holland",
      "inventor_name_first": "James",
      "inventor_city": "Waco",
      "inventor_state": "TX",
      "inventor_country": "US"
    }
  ],
  "ipcr_labels": [
    "G06F132",
    "G06F128"
  ],
  "main_ipcr_label": "G06F132",
  "summary": "<SOH> SUMMARY OF THE INVENTION <EOH>An object of the present invention is to provide a system for monitoring user or equipment location in or around a building or buildings based on the detection of their proximity to various light fixtures or electrical plugs located regularly and ubiquitously throughout or around a facility or group of facilities. Another object of the present invention is to provide continuous tracking of the user or equipment as it moves through a facility in proximity to the lighting and electrical plugs. Another object of the present invention is to provide controls to the system to allow flexibility in temporal and spatial resolution of the solution based on user established requirements. These objects of the invention enable various solutions that may not be achievable by other systems for tracking accuracy, tracking large numbers of items, tracking of a high spatial density of individual items, or for rapidly tracking individual devices. To achieve these objectives, the present invention utilizes lighting and plug load controllers as described in patent application Ser. No. 14/011,565. That system consists of a proximity tag (PTAG) similar to an active RFID tag on the object, equipment, or person being located and tracked, and a series of lighting and plug controllers which sense the PTAG for proximity based lighting and plug control purposes. In addition there are software systems and algorithms which enable integration of individual light and plug proximity information. Each of the described components has unique functions that can be used to optimize a user's desired results for location and tracking of individual or groups of objects, equipment, or, personnel.",
  "patent_number": "nan",
  "abstract": "The invention pertains to a method and system which utilizes individual lighting fixtures and electrical plug controls to provide a rigorous and ubiquitous grid of sensors within or around a facility or facilities. The system utilizes a variety of parameters at the tag, lighting and plug controllers and central processor level to provide unique location and tracking information on objects, equipment, and personnel in the facility. The unique aspects of the system provide higher spatial and temporal accuracy and the ability to track high spatial densities of devices.",
  "publication_number": "US20160370842A1-20161222",
  "_processing_info": {
    "original_size": 55658,
    "optimized_size": 3178,
    "reduction_percent": 94.29
  }
}