{
  "decision": "ACCEPTED",
  "application_number": "15135465",
  "date_published": "20161027",
  "date_produced": "20161012",
  "title": "Outlier Detection on Pattern of Interest Image Populations",
  "filing_date": "20160421",
  "inventor_list": [
    {
      "inventor_name_last": "Banerjee",
      "inventor_name_first": "Saibal",
      "inventor_city": "Fremont",
      "inventor_state": "CA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Kulkarni",
      "inventor_name_first": "Ashok V.",
      "inventor_city": "San Jose",
      "inventor_state": "CA",
      "inventor_country": "US"
    }
  ],
  "ipcr_labels": [
    "G06T700"
  ],
  "main_ipcr_label": "G06T700",
  "summary": "<SOH> SUMMARY OF THE INVENTION <EOH>The following description of various embodiments is not to be construed in any way as limiting the subject matter of the appended claims. One embodiment relates to a system configured to identify outliers in multiple instances of a pattern of interest (POI) on a specimen. The system includes an imaging subsystem that includes at least an energy source and a detector. The energy source is configured to generate energy that is directed to a specimen. The detector is configured to detect energy from the specimen and to generate images responsive to the detected energy. The system also includes one or more computer subsystems configured for acquiring images generated by the imaging subsystem at multiple instances of a POI within a die formed on the specimen. The multiple instances include two or more instances that are located at aperiodic locations within the die. The one or more computer subsystems are also configured for determining a feature of each of the images generated at the multiple instances of the POI. In addition, the one or more computer subsystems are configured for identifying one or more outliers in the multiple instances of the POI based on the determined features. The system may be further configured as described herein. Another embodiment relates to a computer-implemented method for identifying outliers in multiple instances of a POI on a specimen. The method includes the steps described above. The steps of the method are performed by one or more computer systems. Each of the steps of the method described above may be further performed as described further herein. In addition, the embodiment of the method described above may include any other step(s) of any other method(s) described herein. Furthermore, the method described above may be performed by any of the systems described herein. Another embodiment relates to a non-transitory comp r-readable medium storing program instructions executable on a computer system ...",
  "patent_number": "9767548",
  "abstract": "Methods and systems for identifying outliers in multiple instances of a pattern of interest (POI) are provided. One system includes one or more computer subsystems configured for acquiring images generated by an imaging subsystem at multiple instances of a POI within a die formed on the specimen. The multiple instances include two or more instances that are located at aperiodic locations within the die. The computer subsystem(s) are also configured for determining a feature of each of the images generated at the multiple instances of the POI. In addition, the computer subsystem(s) are configured for identifying one or more outliers in the multiple instances of the POI based on the determined features.",
  "publication_number": "US20160314578A1-20161027",
  "_processing_info": {
    "original_size": 93123,
    "optimized_size": 3411,
    "reduction_percent": 96.34
  }
}