{
  "date_produced": "20161019",
  "publication_number": "US20160321550A1-20161103",
  "main_ipcr_label": "G06N504",
  "decision": "PENDING",
  "application_number": "15135735",
  "inventor_list": [
    {
      "inventor_name_last": "NAGAO",
      "inventor_name_first": "Manabu",
      "inventor_city": "Kawasaki",
      "inventor_state": "",
      "inventor_country": "JP"
    }
  ],
  "abstract": "According to an embodiment, a lattice finalization device finalizes a portion of a lattice that is generated by pattern recognition with respect to a signal on a frame-by-frame basis in chronological order. The device includes a detector and a finalizer. The detector is configured to detect, as a splitting position, a frame in the lattice in which the number of nodes and passing arcs is equal to or smaller than a reference value set in advance. The finalizer is configured to finalize nodes and arcs in paths from a start node to the splitting position in the lattice.",
  "filing_date": "20160422",
  "patent_number": "None",
  "summary": "<SOH> BRIEF DESCRIPTION OF THE DRAWINGS <EOH>FIG. 1 is configuration diagram of a pattern recognition device; FIG. 2 is a diagram illustrating an exemplary lattice generated by a decoder; FIG. 3 is a diagram for explaining a pruning operation performed by the decoder; FIG. 4 is a diagram illustrating a configuration of the lattice finalization device; FIG. 5 is a diagram for explaining a flow of operations performed by the lattice finalization device; FIG. 6 is a diagram illustrating an exemplary splitting position in a lattice; FIG. 7 is a diagram illustrating an exemplary residual element in the lattice; FIG. 8 is a diagram illustrating an example of nodes and arcs deleted from the lattice; FIG. 9 is a diagram illustrating an example of finalized nodes and arcs; FIG. 10 is a diagram illustrating an example of splitting the lattice; FIG. 11 is a diagram illustrating an example of a word lattice and the splitting position; FIG. 12 is a diagram illustrating an exemplary pseudocode representing the operations performed by the pattern recognition device; FIG. 13 is a diagram illustrating a configuration of the lattice finalization device according to a modification example; FIG. 14 is a diagram illustrating an exemplary pseudocode representing the operations performed by a converter according to the modification example; and FIG. 15 is a hardware block diagram of the pattern recognition device. detailed-description description=\"Detailed Description\" end=\"lead\"?",
  "date_published": "20161103",
  "title": "LATTICE FINALIZATION DEVICE, PATTERN RECOGNITION DEVICE, LATTICE FINALIZATION METHOD, AND COMPUTER PROGRAM PRODUCT",
  "ipcr_labels": [
    "G06N504",
    "G06F1730"
  ],
  "_processing_info": {
    "original_size": 66192,
    "optimized_size": 2666,
    "reduction_percent": 95.97
  }
}