{
  "date_produced": "20171011",
  "publication_number": "US20170308808A1-20171026",
  "main_ipcr_label": "G06N9900",
  "decision": "PENDING",
  "application_number": "15138307",
  "inventor_list": [
    {
      "inventor_name_last": "Kobylkin",
      "inventor_name_first": "Egor",
      "inventor_city": "Berlin",
      "inventor_state": "",
      "inventor_country": "DE"
    }
  ],
  "abstract": "Methods, systems, and computer program products are included for providing a predicted outcome to a user interface. An exemplary method includes receiving, from a user interface, a plurality of identifiers that identify objects. At the user interface, a target success function is selected corresponding to the plurality of identifiers. The target success function is mapped to at least one attribute of one or more attributes of the objects. The at least one attribute of the objects and one or more other attributes are queried. Data values are retrieved corresponding to the queried at least one attribute and the one or more other attributes. Based on the data values, an outcome of the target success function is predicted. The predicted outcome is provided to the user interface.",
  "filing_date": "20160426",
  "patent_number": "None",
  "summary": "<SOH> BRIEF DESCRIPTION OF THE DRAWINGS <EOH>The present invention is illustrated by way of example and not limitation in the figures of the accompanying drawings. FIG. 1 is a block diagram illustrating a system architecture for determining predictive outcomes using machine learning techniques, in accordance with various examples of the present disclosure. FIG. 2 is a block diagram illustrating a computer system suitable for implementing one or more computing devices. FIG. 3 is a flow diagram illustrating a machine learning technique, in accordance with various examples of the present disclosure. FIG. 4A is a block diagram illustrating a user interface suitable for selecting a plurality of identifiers, in accordance with various examples of the present disclosure. FIG. 4B is a block diagram illustrating a plurality of customer objects that include identifiers and data values corresponding to attributes, in accordance with various examples of the present disclosure. FIG. 4C is a block diagram illustrating a user interface suitable for selecting a target success function, which is mapped to attributes of one or more objects, in accordance with various examples of the present disclosure. detailed-description description=\"Detailed Description\" end=\"lead\"?",
  "date_published": "20171026",
  "title": "MACHINE LEARNING SYSTEM",
  "ipcr_labels": [
    "G06N9900",
    "G06N700",
    "G06N504"
  ],
  "_processing_info": {
    "original_size": 45995,
    "optimized_size": 2588,
    "reduction_percent": 94.37
  }
}