{
  "date_produced": "20171018",
  "publication_number": "US20170316328A1-20171102",
  "main_ipcr_label": "G06N504",
  "decision": "PENDING",
  "application_number": "15139548",
  "inventor_list": [
    {
      "inventor_name_last": "Dong",
      "inventor_name_first": "Jin",
      "inventor_city": "BEIJING",
      "inventor_state": "",
      "inventor_country": "CN"
    },
    {
      "inventor_name_last": "Liu",
      "inventor_name_first": "Liang",
      "inventor_city": "BEIJING",
      "inventor_state": "",
      "inventor_country": "CN"
    },
    {
      "inventor_name_last": "Qu",
      "inventor_name_first": "Jun Mei",
      "inventor_city": "BEIJING",
      "inventor_state": "",
      "inventor_country": "CN"
    },
    {
      "inventor_name_last": "Zhuang",
      "inventor_name_first": "Wei",
      "inventor_city": "BEIJING",
      "inventor_state": "",
      "inventor_country": "CN"
    }
  ],
  "abstract": "Embodiments of the present disclosure allow accuracy of prediction of pollution to be improved. In operation, a prediction of pollution in a future time period is determined. The prediction of pollution indicates predicted data related to a pollution index. Then, matching historical data for the predicted data is determined from historical data related to the pollution index. The matching historical data is obtained in a historical time period corresponding to the future time period. Based on the matching historical data, the prediction of pollution is refined.",
  "filing_date": "20160427",
  "patent_number": "None",
  "summary": "<SOH> SUMMARY <EOH>In one aspect, a computer-implemented method is proposed. According to the method, a prediction of pollution in a future time period is determined. The prediction of pollution indicates predicted data related to a pollution index. Then, matching historical data for the predicted data is determined from historical data related to the pollution index. The matching historical data is obtained in a historical time period corresponding to the future time period. Based on the matching historical data, the prediction of pollution is refined. In another aspect, a device is proposed. The device includes one or more processors and a memory coupled to at least one of the processors. A set of computer program instructions are stored in the memory and executed by at least one of the processors in order to perform actions. The actions include obtaining a prediction of pollution in a future time period, the prediction of pollution indicating predicted data related to a pollution index; determining matching historical data for the predicted data from historical data related to the pollution index, the matching historical data being obtained in a historical time period corresponding to the future time period; and refining the prediction of pollution based on the matching historical data. In yet another embodiment, a computer program product is proposed. The computer program product is tangibly stored on a non-transient machine readable medium and comprising executable instructions which, when executed on a device, cause the device to obtain a prediction of pollution in a future time period, the prediction of pollution indicating predicted data related to a pollution index; determine matching historical data for the predicted data from historical data related to the pollution index, the matching historical data being obtained in a historical time period corresponding to the future time period; and refine the prediction of pollution based on the matching historical ...",
  "date_published": "20171102",
  "title": "POLLUTION PREDICTION",
  "ipcr_labels": [
    "G06N504"
  ],
  "_processing_info": {
    "original_size": 67544,
    "optimized_size": 3486,
    "reduction_percent": 94.84
  }
}