{
  "date_produced": "20170524",
  "publication_number": "US20170161636A1-20170608",
  "main_ipcr_label": "G06N9900",
  "decision": "PENDING",
  "application_number": "15138227",
  "inventor_list": [
    {
      "inventor_name_last": "LU",
      "inventor_name_first": "XIN",
      "inventor_city": "Shenzhen",
      "inventor_state": "",
      "inventor_country": "CN"
    },
    {
      "inventor_name_last": "ZHANG",
      "inventor_name_first": "HUAN-HUAN",
      "inventor_city": "Shenzhen",
      "inventor_state": "",
      "inventor_country": "CN"
    },
    {
      "inventor_name_last": "LIU",
      "inventor_name_first": "XUE-SHUN",
      "inventor_city": "Shenzhen",
      "inventor_state": "",
      "inventor_country": "CN"
    },
    {
      "inventor_name_last": "ZHANG",
      "inventor_name_first": "YU-YONG",
      "inventor_city": "Shenzhen",
      "inventor_state": "",
      "inventor_country": "CN"
    }
  ],
  "abstract": "A learning system based on behavior analysis includes a plurality of collecting terminals and a server coupled to the plurality of collecting terminals. The server obtains at least one related group within the plurality of data-collecting terminals and information as to user demands relevant to the at least one related group. The demands information is analyzed to determine a triggering event and a corresponding triggering result and the system monitors whether information collected by a collecting terminal is in accord with a triggering event. A triggering result corresponding to the trigger event is executed when the information collected by a collecting terminal is in accord with the triggering event. A behavior analysis learning method is also provided.",
  "filing_date": "20160426",
  "patent_number": "None",
  "summary": "<SOH> BRIEF DESCRIPTION OF THE DRAWINGS <EOH>Many aspects of the embodiments can be better understood with reference to the following drawings. The components in the drawings are not necessarily drawn to scale, the emphasis instead being placed upon clearly illustrating the principles of the embodiments. Moreover, in the drawings, like reference numerals designate corresponding parts throughout the several views. FIG. 1 is a diagram of an application environment of a behavior analysis learning system of an embodiment. FIG. 2 is a function module diagram of the behavior analysis learning system of FIG. 1 . FIG. 3 is a diagram of an example embodiment of a user interface of the behavior analysis learning system of FIG. 1 . FIG. 4 is a diagram of an example embodiment of data analysis process of the behavior analysis learning system of FIG. 1 . FIG. 5 is a flowchart of an analysis learning method for the behavior analysis learning system of FIG. 1 . detailed-description description=\"Detailed Description\" end=\"lead\"?",
  "date_published": "20170608",
  "title": "BEHAVIOR ANALYSIS LEARNING SYSTEM BASED THEREON AND METHOD",
  "ipcr_labels": [
    "G06N9900",
    "G06N504"
  ],
  "_processing_info": {
    "original_size": 22634,
    "optimized_size": 2779,
    "reduction_percent": 87.72
  }
}