{
  "decision": "PENDING",
  "application_number": "15132135",
  "date_published": "20171019",
  "date_produced": "20171004",
  "title": "LOW CAPACITY LATENCY STORAGE ENCLOSURE WITH LOGIC DEVICE",
  "filing_date": "20160418",
  "inventor_list": [
    {
      "inventor_name_last": "TSENG",
      "inventor_name_first": "Kelvin",
      "inventor_city": "San Jose",
      "inventor_state": "CA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "SHIH",
      "inventor_name_first": "Trina",
      "inventor_city": "San Francisco",
      "inventor_state": "CA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "LIANG",
      "inventor_name_first": "Lawrence H.",
      "inventor_city": "San Jose",
      "inventor_state": "CA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "CHEN",
      "inventor_name_first": "Richard",
      "inventor_city": "San Jose",
      "inventor_state": "CA",
      "inventor_country": "US"
    }
  ],
  "ipcr_labels": [
    "G06F306",
    "G06F1316",
    "G06F306",
    "G06F306",
    "G06F1340",
    "G06F1320"
  ],
  "main_ipcr_label": "G06F306",
  "summary": "<SOH> SUMMARY OF THE INVENTION <EOH>One embodiment of the present invention sets forth a storage enclosure, including a first expander configured to receive input/output (I/O) data from a host computer system, and a plurality of hard drives coupled to the first expander via a plurality of cables, wherein the plurality of cables routes the I/O data between the first expander and the plurality of hard drives to perform memory access operations. At least one advantage of the disclosed approach is that the storage enclosure may support a greater number of hard drives than possible with conventional approaches. Specifically, the dual-pass cables are shielded, and so crosstalk may be reduced significantly compared to previous approaches that rely on PCB traces.",
  "patent_number": "None",
  "abstract": "A storage enclosure includes a plurality of hard drive sub-boards, each configured to include a plurality of hard drives. Each hard drive sub-board is coupled to one or more expanders, via and interface unit, with a set of dual-pass shielded cables. The expander includes a plurality of chipsets coupled to a complex logic device. Each chipset may communicate with a different subset of hard drives with potentially different timing characteristics. The dual-pass shielded cables may be arranged to mitigate these differences. In addition, pin assignments associated with the cables may be set in order to further mitigate the timing differences.",
  "publication_number": "US20170300237A1-20171019",
  "_processing_info": {
    "original_size": 34558,
    "optimized_size": 2452,
    "reduction_percent": 92.9
  }
}