{
  "decision": "PENDING",
  "application_number": "15135473",
  "date_published": "20160818",
  "date_produced": "20160803",
  "title": "GRAPHICAL USER INTERFACE WINDOW SPACING MECHANISMS",
  "filing_date": "20160421",
  "inventor_list": [
    {
      "inventor_name_last": "Weber",
      "inventor_name_first": "Arnaud Claude",
      "inventor_city": "Saratoga",
      "inventor_state": "CA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Ainslie",
      "inventor_name_first": "Alex Nelly",
      "inventor_city": "San Francisco",
      "inventor_state": "CA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Shah",
      "inventor_name_first": "Roma Rajni",
      "inventor_city": "San Francisco",
      "inventor_state": "CA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Murphy",
      "inventor_name_first": "Glen",
      "inventor_city": "Palo Alto",
      "inventor_state": "CA",
      "inventor_country": "US"
    }
  ],
  "ipcr_labels": [
    "G06F30484",
    "G06F30488",
    "G06F30483",
    "G06F30482"
  ],
  "main_ipcr_label": "G06F30484",
  "summary": "<SOH> SUMMARY <EOH>According to one embodiment of the present disclosure, a computer-implemented method for adjusting a display of multiple web page windows oriented in an overlaid configuration in a web browser is provided. The method includes receiving a selection of a visible portion of a first web page window in an overlaid configuration with a second web page window with a first touch input, receiving a selection of a visible portion of the second web page window in the overlaid configuration with a second touch input, and receiving a dragging motion of the first touch input and the second touch input to alter the visible portion of at least one of the first and second web page windows in the overlaid configuration. When the dragging motion includes dragging the touch inputs away from one another, the visible portion of the first web page window is increased and the visible portion of the second web page window is decreased, and when the dragging motion includes dragging the touch inputs towards one another, the visible portion of the first web page window is decreased and the visible portion of the second web page window is increased. According to another embodiment of the present disclosure, a system for adjusting a display of multiple web page windows oriented in an overlaid configuration in a web browser is provided. The system includes a memory that includes a first web page and a second web page, and a processor. The processor is configured to execute instructions to receive a selection of a visible portion of a first web page window displaying the first web page in an overlaid configuration with a second web page window displaying the second web page with a first touch input, receive a selection of a visible portion of the second web page window in the overlaid configuration with a second touch input, and receive a dragging motion of the first touch input and the second touch input to alter the visible portion of at least one of the first and second web ...",
  "patent_number": "None",
  "abstract": "Computer-implemented methods for adjusting a display of multiple web page windows in a web browser are provided. In one aspect, a method includes receiving selections of visible portions of first and second web page windows oriented in an overlaid configuration with first and second touch inputs, and receiving a dragging motion of the touch inputs to alter the visible portion of at least one of the windows. When the dragging motion includes dragging the touch inputs away from one another, the visible portion of the first web page window is increased and the visible portion of the second web page window is decreased, and when the dragging motion includes dragging the touch inputs towards one another, the visible portion of the first web page window is decreased and the visible portion of the second web page window is increased. Systems, graphical user interfaces, and machine-readable media are also provided.",
  "publication_number": "US20160239189A1-20160818",
  "_processing_info": {
    "original_size": 51908,
    "optimized_size": 3961,
    "reduction_percent": 92.37
  }
}