{
  "date_produced": "20171004",
  "publication_number": "US20170300816A1-20171019",
  "main_ipcr_label": "G06N502",
  "decision": "PENDING",
  "application_number": "15130539",
  "inventor_list": [
    {
      "inventor_name_last": "Ferrara",
      "inventor_name_first": "Stephen F.",
      "inventor_city": "Washington",
      "inventor_state": "DC",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Reilly",
      "inventor_name_first": "Amy A.",
      "inventor_city": "Dripping Springs",
      "inventor_state": "TX",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Steedle",
      "inventor_name_first": "Jeffrey T.",
      "inventor_city": "Maitland",
      "inventor_state": "FL",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Kinsman",
      "inventor_name_first": "Amy L.",
      "inventor_city": "Carpentersville",
      "inventor_state": "IL",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Frantz",
      "inventor_name_first": "Roger S.",
      "inventor_city": "Austin",
      "inventor_state": "TX",
      "inventor_country": "US"
    }
  ],
  "abstract": "Systems and methods for remote intervention are disclosed herein. The system can include memory including: a user profile database; a content database; and a model database. The system can include a supervisor device including: a network interface; and an I/O subsystem. The system can include a content management server that can: receive a first electrical signal from the supervisor device; generate and send an electrical signal to the supervisor device directing the launch of the content authoring interface; receive a second electrical signal including content received by the content authoring interface from the supervisor device; identify a plurality of response demands in the received content; determine a level of the received content based on the identified plurality of response demands; determine the acceptability of the received content based on the identified plurality of response demands; and generate and send an alert to the supervisor device.",
  "filing_date": "20160415",
  "patent_number": "None",
  "summary": "<SOH> BRIEF SUMMARY <EOH>One aspect of the present disclosure relates to a system for remote intervention. The system includes memory including: a user profile database including information identifying one or several attributes of a user; a content database including data identifying predetermined content levels and data identifying some of the predetermined content levels as acceptable; and a model database including data identifying a plurality of response demands and data identifying algorithms for determining the plurality of response demands. The system includes a supervisor device including: a network interface that can exchange data via the communication network; and an I/O subsystem that can convert electrical signals to user-interpretable outputs via a user interface. The system includes a content management server. The content management server can: receive a first electrical signal from the supervisor device, which first electrical signal includes a request for access to a content authoring interface; generate and send an electrical signal to the supervisor device directing the launch of the content authoring interface; receive a second electrical signal from the supervisor device, which second electrical signal includes content received by the content authoring interface; identify a plurality of response demands in the received content; determine a level of the received content based on the identified plurality of response demands; determine the acceptability of the received content based on the identified plurality of response demands; and generate and send an alert to the supervisor device, which alert includes computer code to trigger activation of the I/O subsystem of the supervisor device to provide an indication of the acceptability of the received content and a change recommendation for the received content. In some embodiments, the response demands include a plurality of linguistic response demands and a plurality of cognitive response demands. ...",
  "date_published": "20171019",
  "title": "CONTENT BASED REMOTE DATA PACKET INTERVENTION",
  "ipcr_labels": [
    "G06N502",
    "G06N9900",
    "G06F1730"
  ],
  "_processing_info": {
    "original_size": 172948,
    "optimized_size": 4135,
    "reduction_percent": 97.61
  }
}