{
  "date_produced": "20171018",
  "publication_number": "US20170316331A1-20171102",
  "main_ipcr_label": "G06N700",
  "decision": "PENDING",
  "application_number": "15142947",
  "inventor_list": [
    {
      "inventor_name_last": "Joshi",
      "inventor_name_first": "Neel",
      "inventor_city": "Kirkland",
      "inventor_state": "WA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Holmes",
      "inventor_name_first": "William Hart",
      "inventor_city": "Seattle",
      "inventor_state": "WA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Tischhauser",
      "inventor_name_first": "Paul David",
      "inventor_city": "Redmond",
      "inventor_state": "WA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Jain",
      "inventor_name_first": "Chandresh K.",
      "inventor_city": "Sammamish",
      "inventor_state": "WA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Benmouffok",
      "inventor_name_first": "Lamia",
      "inventor_city": "Bellevue",
      "inventor_state": "WA",
      "inventor_country": "US"
    }
  ],
  "abstract": "Techniques enable contextually-aware selections of event forums. Scheduling data can be analyzed to identify a context associated with an appointment. A forum that is appropriate for the identified context can be selected and utilized. The analysis can also utilize traffic data, map data, weather data, user preferences, and other contextual data to select one or more forums. A forum can be a place or communication medium. A service provider can associate one or more forums with a particular skill set. For example, a legal office can associate an online forum, such a videoconference, with a first category of services, and an on-site location for a second category of services. Depending on a category of services identified in one or more user preferences and/or meeting requests, a forum can be selected. Other factors, which may include weather conditions, traffic conditions, and commute times can also influence the selection of a forum.",
  "filing_date": "20160429",
  "patent_number": "None",
  "summary": "<SOH> SUMMARY <EOH>The techniques disclosed herein utilize contextual data from a number of resources to select event forums. In some configurations, data defining a meeting request or a calendar event can be analyzed to identify a context associated with an appointment. One or more forums that are most appropriate for the identified context can be selected and utilized. A forum can be a place or medium where information can be exchanged in real time. The analysis can also utilize location data, traffic data, map data, weather data, user preferences, skill set data, and other contextual data to select one or more forums that meet one or more criteria. In some configurations, a service provider can associate one or more locations with a particular skill set, service category, or any suitable subject. For example, an automotive repair shop can associate an off-site location for a first category of repair services, and an on-site location for a second category repair services. In another example, a legal office can associate an online forum, such a videoconference or teleconference, with a first category of legal services, an off-site location for a second category of legal services, and an on-site location for a third category of legal services. Depending on the needs, e.g., a category of services, identified in one or more user preferences, calendar events, and/or meeting requests, one or more forums can be selected. Other factors, which may include weather conditions, traffic conditions, and commute times can also influence the selection of one or more forums. In some configurations, the techniques disclosed herein generate a ranked list of forums for a particular meeting request. The techniques disclosed herein can also continuously analyze scheduling data to dynamically modify forums for various calendar events based on changed circumstances. For example, a system can analyze scheduling data for a number of appointments to identify one or more conflicts. Based on ...",
  "date_published": "20171102",
  "title": "CONTEXTUALLY-AWARE SELECTION OF EVENT FORUMS",
  "ipcr_labels": [
    "G06N700",
    "G06N300"
  ],
  "_processing_info": {
    "original_size": 121978,
    "optimized_size": 4093,
    "reduction_percent": 96.64
  }
}