{
  "decision": "PENDING",
  "application_number": "15148728",
  "date_published": "20170406",
  "date_produced": "20170323",
  "title": "MULTI MODE TEXTURE SAMPLER FOR FLEXIBLE FILTERING OF GRAPHICAL TEXTURE DATA",
  "filing_date": "20160506",
  "inventor_list": [
    {
      "inventor_name_last": "PENG",
      "inventor_name_first": "LIANG LEON",
      "inventor_city": "SAN JOSE",
      "inventor_state": "CA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "SPANGLER",
      "inventor_name_first": "STEVEN",
      "inventor_city": "EL DORADO HILLS",
      "inventor_state": "CA",
      "inventor_country": "US"
    }
  ],
  "ipcr_labels": [
    "G06T1504",
    "G06T120",
    "G06T160",
    "G06T1500"
  ],
  "main_ipcr_label": "G06T1504",
  "summary": "<SOH> BRIEF DESCRIPTION OF THE DRAWINGS <EOH>The material described herein is illustrated by way of example and not by way of limitation in the accompanying figures. For simplicity and clarity of illustration, elements illustrated in the figures are not necessarily drawn to scale. For example, the dimensions of some elements may be exaggerated relative to other elements for clarity. Further, where considered appropriate, reference labels have been repeated among the figures to indicate corresponding or analogous elements. In the figures: FIG. 1A , is a conventional system architecture including a central processor and a graphics processor; FIG. 1B is flow diagram depicting particular texture mapping operations in a typical graphics rendering pipeline within a graphics processor; FIG. 1C is a conventional graphics processor architecture employing a shader for texture filtering; FIG. 1D is a graph comparing certain texture filtering architectures that may be utilized in a graphics processor; FIG. 1E is a graphics processor architecture employing a multi-mode texture sampler, in accordance with an embodiment; FIG. 2 is a functional block diagram further illustrating a system including a graphics processor with a multi-mode flexible texture sampler, in accordance with an embodiment; FIG. 3 illustrates how multi-mode flexible texture filtering methods may be performed by a system having an architecture as in FIG. 2 , in accordance with one or more embodiments; FIG. 4 is a flow diagram illustrating a multi-mode flexible texture filter method, in accordance with one or more embodiments; FIG. 5A illustrates a variety of exemplary programmable footprints that may be implemented through application of a texel quad performed as part the method depicted in FIG. 4 , in accordance with one or more embodiments FIG. 5B depicts a plurality of footprints and corresponding bounding regions that may be employed in a multi-mode flexible texture sampler when performing the method depicte...",
  "patent_number": "None",
  "abstract": "For a given texture address, a texture sampler fetches and reduces texture data with a filter accumulator suitable for providing a weighted average over a variety of filter footprints. A multi-mode texture sampler is configurable to provide both a wide variety of footprints in either a separable or non-separable filter modes and allow for a filter footprint significantly wider than the bi-linear (2×2 texel) footprint. In embodiments, sub-sample addresses are generated by the texture sampler logic to accommodate a desired footprint. The sub-sample addresses may be generated and sequenced by multi-texel units, such as 2×2 texel quads, for efficient filtering. In embodiments, filter coefficients are cached from coefficient tables stored in memory.",
  "publication_number": "US20170098328A1-20170406",
  "_processing_info": {
    "original_size": 113158,
    "optimized_size": 3520,
    "reduction_percent": 96.89
  }
}