{
  "date_produced": "20171025",
  "publication_number": "US20170323199A1-20171109",
  "main_ipcr_label": "G06N308",
  "decision": "PENDING",
  "application_number": "15147823",
  "inventor_list": [
    {
      "inventor_name_last": "Wu",
      "inventor_name_first": "Shuang",
      "inventor_city": "Fremont",
      "inventor_state": "CA",
      "inventor_country": "US"
    }
  ],
  "abstract": "According to one embodiment, a first set of features is received, where each of the features in the first set being associated with a predetermined category. A bloom filter is applied to the first set of features to generate a second set of features. A neural network model is trained by applying the second set of features to a first layer of nodes of the neural network model to generate an output, the neural network model including a plurality of layers of nodes coupled to each other via a connection. The output of the neural network model is compared with a target value associated with the predetermined category to determine whether the neural network model satisfies a predetermined condition.",
  "filing_date": "20160505",
  "patent_number": "None",
  "summary": "<SOH> BRIEF DESCRIPTION OF THE DRAWINGS <EOH>Embodiments of the invention are illustrated by way of example and not limitation in the figures of the accompanying drawings in which like references indicate similar elements. FIG. 1 is a block diagram illustrating a typical neural network model. FIG. 2 is a block diagram illustrating a neural network model which may be used with an embodiment of the invention. FIGS. 3A and 3B are block diagram illustrating an example of system configuration for searching content according to some embodiments of the invention. FIG. 4 is a block diagram illustrating an example of a classification model training system according to one embodiment of the invention. FIG. 5 is a block diagram an example of a classification system according to one embodiment of the invention. FIG. 6 is a flow diagram illustrating a process of training classification models according to one embodiment of the invention. FIG. 7 is a flow diagram illustrating a process of classifying users using a classification model according to one embodiment of the invention. FIG. 8 is a flow diagram illustrating a process of classifying content using a classification model according to one embodiment of the invention. FIG. 9 is a block diagram illustrating a data processing system according to one embodiment. detailed-description description=\"Detailed Description\" end=\"lead\"?",
  "date_published": "20171109",
  "title": "METHOD AND SYSTEM FOR TRAINING AND NEURAL NETWORK MODELS FOR LARGE NUMBER OF DISCRETE FEATURES FOR INFORMATION RERTIEVAL",
  "ipcr_labels": [
    "G06N308",
    "G06N304"
  ],
  "_processing_info": {
    "original_size": 69140,
    "optimized_size": 2707,
    "reduction_percent": 96.08
  }
}