{
  "decision": "PENDING",
  "application_number": "15142108",
  "date_published": "20171102",
  "date_produced": "20171018",
  "title": "AUTOMATION OF WORKFLOW EVENTS",
  "filing_date": "20160429",
  "inventor_list": [
    {
      "inventor_name_last": "Joshi",
      "inventor_name_first": "Neel",
      "inventor_city": "Kirkland",
      "inventor_state": "WA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Holmes",
      "inventor_name_first": "William Hart",
      "inventor_city": "Seattle",
      "inventor_state": "WA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Tischhauser",
      "inventor_name_first": "Paul David",
      "inventor_city": "Redmond",
      "inventor_state": "WA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Jain",
      "inventor_name_first": "Chandresh K.",
      "inventor_city": "Sammamish",
      "inventor_state": "WA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Persett",
      "inventor_name_first": "Tor-Helge",
      "inventor_city": "Seattle",
      "inventor_state": "WA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Guerrero",
      "inventor_name_first": "Ricardo Alberto Rosales",
      "inventor_city": "Seattle",
      "inventor_state": "WA",
      "inventor_country": "US"
    }
  ],
  "ipcr_labels": [
    "G06Q1010",
    "G06Q1006",
    "G06Q1006"
  ],
  "main_ipcr_label": "G06Q1010",
  "summary": "<SOH> SUMMARY <EOH>Techniques described herein provide the automation of workflow events. Generally described, input data can be processed with contextual data to generate workflow data. Workflow data can define a multi-stage process describing aspects of an orchestrated pattern of activity. For example, workflow data can define a timeline of stages that enable a systematic organization of resources that can transform materials, provide services, or process information. In some configurations, input data indicating a calendar event can be received by one or more computing devices. The input data can define a date and time, and a description of the calendar event. In some configurations, input data can include a voice input or text description indicating a desire to initiate a project, define a goal, achieve one or more metrics, etc. In some configurations, input data including a text description can be analyzed to determine a topic, goal, or one or more metrics. In response to receiving the input data, contextual data can be received from a number of resources, including specialized resources having a knowledgebase for particular topics. For instance, if the input data indicates that a medical appointment is to be scheduled, the system may gather contextual data from the American Medical Association and other resources, such as a database of medical records, and other expert resources. The techniques disclosed herein utilize the contextual data to generate workflow data that can define a multi-stage process. In the current example, if the medical appointment includes a regular checkup for a child, the techniques disclosed herein can identify and schedule other checkups and other appointments, such as immunization shots, that are recommended by one or more resources. The techniques disclosed herein can generate many different forms of communication to coordinate aspects of each stage. For instance, one or more computing devices can generate emails, notifications, rem...",
  "patent_number": "None",
  "abstract": "Techniques described herein provide the automation of workflow events. Input data can be processed with contextual data to generate workflow data. Workflow data can define a multi-stage process describing aspects of an orchestrated pattern of activity. In some configurations, input data indicating a calendar event can be received by one or more computing devices. The input data can include a voice input or text description indicating a desire to initiate a project, define a goal, achieve one or more metrics, etc. In response to receiving the input data, contextual data can be received from a number of resources, including specialized resources having a knowledgebase for particular topics. The techniques disclosed herein utilize the contextual data to generate workflow data that can define a multi-stage process. Calendar events, reminders and other forms of communication can be generated from the workflow data.",
  "publication_number": "US20170316387A1-20171102",
  "_processing_info": {
    "original_size": 120633,
    "optimized_size": 4232,
    "reduction_percent": 96.49
  }
}