{
  "decision": "PENDING",
  "application_number": "15149210",
  "date_published": "20171109",
  "date_produced": "20171025",
  "title": "SOFTWARE VERSION CONTROL WITHOUT AFFECTING A DEPLOYED CONTAINER",
  "filing_date": "20160509",
  "inventor_list": [
    {
      "inventor_name_last": "Chen",
      "inventor_name_first": "Xiang",
      "inventor_city": "Beijing",
      "inventor_state": "",
      "inventor_country": "CN"
    },
    {
      "inventor_name_last": "Gu",
      "inventor_name_first": "Bin",
      "inventor_city": "Beijing",
      "inventor_state": "",
      "inventor_country": "CN"
    },
    {
      "inventor_name_last": "Wang",
      "inventor_name_first": "Cheng Fang",
      "inventor_city": "Beijing",
      "inventor_state": "",
      "inventor_country": "CN"
    },
    {
      "inventor_name_last": "Zhong",
      "inventor_name_first": "WuMi",
      "inventor_city": "Beijing",
      "inventor_state": "",
      "inventor_country": "CN"
    },
    {
      "inventor_name_last": "Zou",
      "inventor_name_first": "Jia",
      "inventor_city": "Beijing",
      "inventor_state": "",
      "inventor_country": "CN"
    }
  ],
  "ipcr_labels": [
    "G06F1730",
    "H04L2908",
    "G06F944"
  ],
  "main_ipcr_label": "G06F1730",
  "summary": "<SOH> SUMMARY <EOH>Aspects of the present invention disclose a method, computer program product, and/or system for executing multiple versions of an application within a computing environment. In an embodiment, the method includes one or more computer processors identifying a request to execute an instance of a first version of an application within a computing environment. The method further includes one or more computer processors determining that an instance of a second version of the application is active within the computing environment. The method further includes one or more computer processors accessing a data structure that includes information associated with the application to obtain a first set of data corresponding to the first version of the application. The method further includes one or more computer processors copying one or more executable objects associated with the first version of the application, from a network accessible storage device, based on the first set of data to the computing environment. The method further includes one or more computer processors executing the copied one or more executable objects associated with the first version that comprise the requested instance of the first version of the application within the computing environment.",
  "patent_number": "None",
  "abstract": "A method for executing multiple versions of an application within a computing environment. The method includes a computer processor identifying a request to execute an instance of a first version of an application within a computing environment and determining that an instance of a second version of the application is active within the computing environment. The method further includes accessing a data structure including information associated with the application to obtain a first set of data corresponding to the first version of the application. The method further includes copying one or more executable objects associated with the first version of the application based, at least in part, on the first set of data to the computing environment. The method further includes executing the copied one or more executable objects associated with the first version that comprise the requested instance of the first version of the application within the computing environment.",
  "publication_number": "US20170322934A1-20171109",
  "_processing_info": {
    "original_size": 100921,
    "optimized_size": 3395,
    "reduction_percent": 96.64
  }
}