{
  "decision": "PENDING",
  "application_number": "15142667",
  "date_published": "20161103",
  "date_produced": "20161019",
  "title": "METHODS AND SYSTEMS FOR MESSAGE-BASED BILL PAYMENT",
  "filing_date": "20160429",
  "inventor_list": [
    {
      "inventor_name_last": "Brunner",
      "inventor_name_first": "Christopher J.",
      "inventor_city": "El Segundo",
      "inventor_state": "CA",
      "inventor_country": "US"
    }
  ],
  "ipcr_labels": [
    "G06Q2010",
    "G06Q2040",
    "H04W414"
  ],
  "main_ipcr_label": "G06Q2010",
  "summary": "<SOH> SUMMARY <EOH>The methods and systems disclosed in the present disclosure relate to a bill payment platform, which in some cases may comprise a debt collection platform for an overdue bill or other debt. References to a “bill” throughout this disclosure should be understood to encompass, except where context indicates otherwise, any form of outstanding payable between a consumer and a merchant. The bill payment platform may enable consumers to make bill payments using simplified methods of communication, such as by using text messages or short messaging service (SMS) messages and the like, through message interfaces provided by a bill payment platform. The bill payment platform may also provide a facility for the billing service or biller to allow collection of debts in compliance with regulations that relate to various regulatory requirements for debt collection, such as by maintaining a clear, auditable record of the delivery and acknowledgement of required communications in connection with the payment of a debt. The terms “biller,” “merchant,” “vendor,” and the like should be understood to encompass, except where context indicates otherwise, any party that provides a bill to a party, such as a consumer, for goods, services, or the like. The devices, systems, and methods discussed herein may enable billers to allow their customers to undertake simplified bill payments, such as through a simple message interface (e.g., SMS), as well as to ensure billers the ability to facilitate collection of debts, while also complying with regulations that relate to the emerging regulatory requirements for debt collection. The methods and systems described herein may include methods and systems for a bill payment computing platform enabled by a host server module. Such methods and system may include a bill handling component for handling a plurality of bills of a plurality of merchants; a short messaging communications component for presenting at least one bill of a merchant...",
  "patent_number": "None",
  "abstract": "Provided herein are methods and systems for a bill payment platform that enables consumers to make bill payments using simplified methods of communication, such as by using text messages or short messaging service (SMS) messages and the like, through message interfaces provided by the bill payment platform, which may include components for context-based notification, intelligent message interpretation, and regulatory compliance.",
  "publication_number": "US20160321624A1-20161103",
  "_processing_info": {
    "original_size": 154339,
    "optimized_size": 3046,
    "reduction_percent": 98.03
  }
}