{
  "date_produced": "20171018",
  "publication_number": "US20170316330A1-20171102",
  "main_ipcr_label": "G06N700",
  "decision": "PENDING",
  "application_number": "15140998",
  "inventor_list": [
    {
      "inventor_name_last": "Cohen",
      "inventor_name_first": "Guy M.",
      "inventor_city": "Ossining",
      "inventor_state": "NY",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Hecht",
      "inventor_name_first": "Jae-lyn",
      "inventor_city": "Boston",
      "inventor_state": "MA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Kozloski",
      "inventor_name_first": "James R.",
      "inventor_city": "New Fairfield",
      "inventor_state": "CT",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Pickover",
      "inventor_name_first": "Clifford A.",
      "inventor_city": "Yorktown Heights",
      "inventor_state": "NY",
      "inventor_country": "US"
    }
  ],
  "abstract": "A cognitive state prediction method, system, and non-transitory computer readable medium, include a receiving circuit configured to receive an electronic message sent by a first user, a labeling circuit configured to query a second user to associate a label with the electronic message based on a cognitive state of the first user, and a correlating circuit configured to correlate the label with user data at a time of sending the electronic message, the user data corresponding to data output by at least one of the wearable and an external sensor in a database.",
  "filing_date": "20160428",
  "patent_number": "None",
  "summary": "<SOH> SUMMARY <EOH>The inventors have considered the technical solution to the technical problem in which recipients of messages, upon interpreting the cognitive state, label the message accordingly. These labels are then stored in a database, which also receives wearable or external sensor data about the sender. Analytics applied to the wearables data is used to predict the label in subsequent settings. Specifically, when a user of the system sends a second message to the recipient, the wearable or external sensor data may be analyzed to predict the label according to past training with recipient labels. This solution can allow the recipient to have a machine-generated prediction of a cognitive state of the sender, thus eliminating risks of error, temporary biases, misinterpretation, conflicting memories, and/or noise from the new context in which the message was sent. In an exemplary embodiment, the present invention can provide a cognitive state prediction system including a receiving circuit configured to receive an electronic message sent by a first user, a labeling circuit configured to query a second user to associate a label with the electronic message based on a cognitive state of the first user, and a correlating circuit configured to correlate the label with user data at a time of sending the electronic message, the user data corresponding to data output by at least one of a wearable, and an external sensor in a database. Further, in another exemplary embodiment, the present invention can provide a cognitive state prediction method including receiving an electronic message sent by a first user, querying a second user to associate a label with the electronic message based on a cognitive state of the first user, and correlating the label with user data at a time of sending the electronic message, the user data corresponding to data output by at least one of a wearable, and an external sensor in a database. Even further, in another exemplary embodiment, the ...",
  "date_published": "20171102",
  "title": "SYSTEM, METHOD, AND RECORDING MEDIUM FOR PREDICTING COGNITIVE STATES OF A SENDER OF AN ELECTRONIC MESSAGE",
  "ipcr_labels": [
    "G06N700",
    "H04L1258",
    "G06F116"
  ],
  "_processing_info": {
    "original_size": 51489,
    "optimized_size": 3639,
    "reduction_percent": 92.93
  }
}