{
  "decision": "ACCEPTED",
  "application_number": "15145819",
  "date_published": "20171109",
  "date_produced": "20171025",
  "title": "CIRCUIT AND STYLUS FOR CAPACITIVE TOUCHSCREEN",
  "filing_date": "20160504",
  "inventor_list": [
    {
      "inventor_name_last": "Kao",
      "inventor_name_first": "Ting-Kuo",
      "inventor_city": "Yilan",
      "inventor_state": "",
      "inventor_country": "TW"
    },
    {
      "inventor_name_last": "Wu",
      "inventor_name_first": "Hsin Hsueh",
      "inventor_city": "Taipei",
      "inventor_state": "",
      "inventor_country": "TW"
    },
    {
      "inventor_name_last": "Lin",
      "inventor_name_first": "Chien-Pang",
      "inventor_city": "Taipei",
      "inventor_state": "",
      "inventor_country": "TW"
    }
  ],
  "ipcr_labels": [
    "G06F30354",
    "G06F3044",
    "G06F3038"
  ],
  "main_ipcr_label": "G06F30354",
  "summary": "<SOH> SUMMARY OF THE PRIOR ART <EOH>Generally speaking, styluses for use with capacitive touchscreens require a minimum level of capacitance between the stylus and the touchscreen for the capacitive sensor in the touchscreen to accurately detect the position of the stylus. Nowadays, most such styluses are passive, having a wide conductive tip that is electrically coupled to the stylus body, such that when the body is gripped by a user, the user is electrically coupled to the tip. This allows the capacitance of the user's body to be sensed by the touchscreen across a large enough area to simulate a fingertip touch. Touchscreens on many of the most popular devices today require such large touches and capacitances in order to function; contacts by smaller capacitances or across smaller contact regions are ignored by the devices' firmware in order to reject capacitive noise, thereby helping to lower complexity and cost. Precisely locating and “touching” points on a screen is aided by having a stylus with a small, non-deforming tip. Not only does a small tip allow the surrounding screen to be seen by the user, thereby helping the user to position the tip precisely, but also a non-deforming tip means that the firmware will have a consistent contact shape from which to determine the centroid. Higher resolution touchscreens exist, but generally require a stylus that is specifically designed to interact with the given touchscreen so that the touchscreen can ignore other touches as noise. This eliminates the user's ability to use a fingertip to interact with the touchscreen, drastically reducing convenience and requiring that special hardware (the stylus) be developed and kept with the device. Touchpad capacitive sensors are designed to require close proximity to avoid accidental touch detection, further limiting their capabilities. For example, custom hardware has been developed by some manufacturers that enable a stylus to be detected at some distance from the screen, thus ...",
  "patent_number": "9891724",
  "abstract": "Embodiments of a circuit and a stylus for interacting with a capacitive sensor are disclosed. The stylus includes a stylus body, a circuit disposed within the stylus body, a tip, and a power source. The circuit includes an input terminal, an amplifier, and an output terminal. The tip includes a sensing electrode and an emitting electrode, and the tip is disposed on a proximal end of the stylus body. The power source is electrically coupled to the circuit. The input terminal of the circuit is electrically coupled to the sensing electrode of the tip, and the output terminal of the circuit is electrically coupled to the emitting electrode of the tip. The circuit receives a signal through the sensing electrode, amplifies and inverts the signal, and outputs the signal through the emitting electrode. The amplifier of the circuit amplifies only a portion of the signal that exceeds a threshold voltage.",
  "publication_number": "US20170322645A1-20171109",
  "_processing_info": {
    "original_size": 47736,
    "optimized_size": 3761,
    "reduction_percent": 92.12
  }
}