{
  "date_produced": "20161026",
  "publication_number": "US20160328658A1-20161110",
  "main_ipcr_label": "G06N700",
  "decision": "PENDING",
  "application_number": "15147615",
  "inventor_list": [
    {
      "inventor_name_last": "Goyal",
      "inventor_name_first": "Bharat",
      "inventor_city": "San Jose",
      "inventor_state": "CA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Korada",
      "inventor_name_first": "Pavan",
      "inventor_city": "San Mateo",
      "inventor_state": "CA",
      "inventor_country": "US"
    }
  ],
  "abstract": "Certain embodiments may generally relate to systems and methods for rapidly deploying predictive scoring models on a platform that allows for easy integration. A method may include selecting one or more dynamic models for evaluating a scoring request. The method may also include receiving, at a scoring node, a scoring request from at least one requester. The method may further include separating the scoring request into one or more scoring requests, in which each of the one or more score requests may assigned to each of the selected one or more dynamic models. The method may also include combining results from each of the one or more dynamic models. The method may further include evaluating the combined results. The method may also include providing a response to the scoring request based on the evaluation of the combined results.",
  "filing_date": "20160505",
  "patent_number": "None",
  "summary": "<SOH> SUMMARY OF THE INVENTION <EOH>Example embodiments of the present subject matter include the following. One embodiment is directed to a method that may include selecting one or more dynamic models for evaluating a scoring request. The method may also include receiving, at a scoring node, a scoring request from at least one requester. The method may further include separating the scoring request into one or more scoring requests, in which each of the one or more score requests may be assigned to each of the selected one or more dynamic models. The method may also include combining results from each of the one or more dynamic models. The method may further include evaluating the combined results. The method may also include providing a response to the scoring request based on the evaluation of the combined results. In an embodiment, the evaluation may be performed by one or more evaluator nodes. In another embodiment, the method may further include determining a lead quality based on the results from each of the one or more dynamic models. In yet another embodiment, the method may also include retrieving a release of one or more of the dynamic models, and persisting the one or more dynamic models to file modules. According to an embodiment, at least one of the selecting, receiving, separating, combining, evaluating, and providing may be provided on an existing lead-sourcing infrastructure. Another embodiment is directed to an apparatus, which may include at least one processor, and at least one memory including computer program code. The at least one memory and the computer program code may be configured, with the at least one processor, to cause the apparatus at least to select one or more dynamic models for evaluating a scoring request. The at least one memory and the computer program code may also be configured, with the at least one processor, to cause the apparatus at least to receive, at a scoring node, a scoring request from at least one requester. The at ...",
  "date_published": "20161110",
  "title": "PREDICTIVE MODELING AND ANALYTICS INTEGRATION PLATFORM",
  "ipcr_labels": [
    "G06N700"
  ],
  "_processing_info": {
    "original_size": 46633,
    "optimized_size": 3529,
    "reduction_percent": 92.43
  }
}