{
  "date_produced": "20160810",
  "publication_number": "US20160247085A1-20160825",
  "main_ipcr_label": "G06N700",
  "decision": "PENDING",
  "application_number": "15144075",
  "inventor_list": [
    {
      "inventor_name_last": "Harper, III",
      "inventor_name_first": "David Tennyson",
      "inventor_city": "Seattle",
      "inventor_state": "WA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Peterson",
      "inventor_name_first": "Eric C.",
      "inventor_city": "Woodinville",
      "inventor_state": "WA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Harris",
      "inventor_name_first": "Shaun L.",
      "inventor_city": "Sammamish",
      "inventor_state": "WA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Belady",
      "inventor_name_first": "Christian L.",
      "inventor_city": "Mercer Island",
      "inventor_state": "WA",
      "inventor_country": "US"
    }
  ],
  "abstract": "A method described herein includes an act of receiving data that is indicative of predicted weather conditions for a particular geographic region, wherein the particular geographic region has an energy generation system therein, and wherein the energy generation system utilizes at least one renewable energy resource to generate electrical power. The method also includes the act of scheduling a computational workload for at least one computer in a data center based at least in part upon the data that is indicative of the predicted weather conditions for the particular geographic region.",
  "filing_date": "20160502",
  "patent_number": "None",
  "summary": "<SOH> SUMMARY <EOH>The following is a brief summary of subject matter that is described in greater detail herein. This summary is not intended to be limiting as to the scope of the claims. Described herein are various aspects pertaining to power systems that utilize renewable resources to generate electrical power. More particularly, described herein are various aspects pertaining to selecting a site to construct a power system that utilizes renewable resources to generate electrical power and aspects pertaining to managing computational workloads of computers that are powered by such a power system. One or more computer-implemented predictive weather/climate models can be employed to select a site for placement of a power system that generates electrical power through utilization of a renewable energy resource. With more specificity, computer-based simulation of meteorological and climate systems can be employed to model availability of renewable energy resources at localized geographic regions. Moreover, the computer-based simulation can utilize topographical models in connection with modeling availability of renewable energy resources at localized geographies. In an exemplary embodiment, selection of a site for a power system that utilizes renewable energy resources to generate electrical power can comprise utilization of a global model and a local model. The global model can be configured to model/simulate weather/climate conditions in a relatively large area, such as a ten mile by ten mile area, to facilitate locating a more precise geographic region to place a power system. Once such global model has been executed via simulation, a local model can be employed to more granularly model weather/climate conditions at a prospective site. The local model, for instance, can be configured to model/simulate weather/climate conditions in a smaller area, such as over a one mile by one mile region or smaller. These models can leverage historical weather data that is gener...",
  "date_published": "20160825",
  "title": "MANAGING COMPUTATIONAL WORKLOADS OF COMPUTING APPARATUSES POWERED BY RENEWABLE RESOURCES",
  "ipcr_labels": [
    "G06N700",
    "G01W110"
  ],
  "_processing_info": {
    "original_size": 55607,
    "optimized_size": 3649,
    "reduction_percent": 93.44
  }
}