{
  "date_produced": "20161116",
  "publication_number": "US20160350645A1-20161201",
  "main_ipcr_label": "G06N304",
  "decision": "PENDING",
  "application_number": "15148627",
  "inventor_list": [
    {
      "inventor_name_last": "Brothers",
      "inventor_name_first": "John W.",
      "inventor_city": "Calistoga",
      "inventor_state": "CA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Lee",
      "inventor_name_first": "Joohoon",
      "inventor_city": "East Palo Alto",
      "inventor_state": "CA",
      "inventor_country": "US"
    }
  ],
  "abstract": "Executing a neural network includes generating an output tile of a first layer of the neural network by processing an input tile to the first layer and storing the output tile of the first layer in an internal memory of a processor. An output tile of a second layer of the neural network can be generated using the processor by processing the output tile of the first layer stored in the internal memory.",
  "filing_date": "20160506",
  "patent_number": "None",
  "summary": "<SOH> SUMMARY <EOH>An embodiment includes a method of executing a neural network. The method includes generating an output tile of a first layer of the neural network by processing an input tile to the first layer and storing the output tile of the first layer in an internal memory of a processor. The method also includes generating, using the processor, an output tile of a second layer of the neural network by processing the output tile of the first layer stored in the internal memory. Another embodiment includes an apparatus for executing a neural network. The apparatus includes an internal memory within a processor and a first compute unit, within the processor, coupled to the internal memory and configured to initiate executable operations. The executable operations include generating an output tile of a first layer of the neural network by processing an input tile of the first layer and storing the output tile of the first layer in the internal memory. The executable operations also include generating an output tile of a next layer of the neural network by processing the output tile of the first layer stored in the internal memory. Another embodiment includes a computer program product having a computer readable storage medium having program code stored thereon for executing a neural network. The program code is executable by a processor to perform operations. The operations include generating an output tile of a first layer of the neural network by processing an input tile to the first layer and storing the output tile of the first layer in an internal memory of a processor. The executable operations also include generating, using the processor, an output tile of a second layer of the neural network by processing the output tile of the first layer stored in the internal memory. This Summary section is provided merely to introduce certain concepts and not to identify any key or essential features of the claimed subject matter. Many other features and embodiment...",
  "date_published": "20161201",
  "title": "DATA-OPTIMIZED NEURAL NETWORK TRAVERSAL",
  "ipcr_labels": [
    "G06N304",
    "G06N308"
  ],
  "_processing_info": {
    "original_size": 86327,
    "optimized_size": 3096,
    "reduction_percent": 96.41
  }
}