{
  "date_produced": "20171025",
  "publication_number": "US20170323208A1-20171109",
  "main_ipcr_label": "G06N504",
  "decision": "PENDING",
  "application_number": "15145149",
  "inventor_list": [
    {
      "inventor_name_last": "AL-MOHSSEN",
      "inventor_name_first": "HUSAIN",
      "inventor_city": "Dedham",
      "inventor_state": "MA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "MAIN",
      "inventor_name_first": "ELIZABETH J.",
      "inventor_city": "Cambridge",
      "inventor_state": "MA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "BASSA",
      "inventor_name_first": "ANGELA S.",
      "inventor_city": "Stoneham",
      "inventor_state": "MA",
      "inventor_country": "US"
    }
  ],
  "abstract": "An apparatus for determining occupancy of a facility is provided. The apparatus includes a facility model processor and a global model module. The facility model processor is configured to generate occupancy components for the facility by processing a first data set comprising energy consumption and outside temperature data for the facility, the energy consumption and outside temperature data taken at a prescribed time increment over a first plurality of days, and is configured to generate a normalized first data set by employing the occupancy components to remove effects of occupancy of the facility from the first data set. The occupancy components include: a lower bound of energy consumption as a function of outside temperature; a normalized occupancy profile component as a function of the prescribed time increment; a marginal energy consumption component as a function of outside temperature; and a daily occupancy level component for each of the first plurality of days. The global mo...",
  "filing_date": "20160503",
  "patent_number": "None",
  "summary": "<SOH> SUMMARY OF THE INVENTION <EOH>The present invention, among other applications, is directed to solving the above-noted problems and addresses other problems, disadvantages, and limitations of the prior art. The present invention provides a superior technique for determining building occupancy levels as a function of energy consumption. In one embodiment, an apparatus for determining occupancy of a facility is provided. The apparatus includes a facility model processor and a global model module. The facility model processor is configured to generate occupancy components for the facility by processing a first data set comprising energy consumption and outside temperature data for the facility, the energy consumption and outside temperature data taken at a prescribed time increment over a first plurality of days, and is configured to generate a normalized first data set by employing the occupancy components to remove effects of occupancy of the facility from the first data set. The occupancy components include: a lower bound of energy consumption as a function of outside temperature; a normalized occupancy profile component as a function of the prescribed time increment; a marginal energy consumption component as a function of outside temperature; and a daily occupancy level component for each of the first plurality of days. The global model module is configured to receive the normalized first data set and a forecasted data set, the forecasted data set being generated by the facility model processor from the occupancy components and forecasted outside temperature data taken at the prescribed time increment over a second plurality of days, and is configured to generate and display comparisons of the forecasted data set with the normalized first data set over the second plurality of days. One aspect of the present invention contemplates a computer data signal embodied in a non-transitory storage medium that includes computer readable program code for providing an ap...",
  "date_published": "20171109",
  "title": "APPARATUS AND METHOD FOR FORECASTING OCCUPANCY BASED ON ENERGY CONSUMPTION",
  "ipcr_labels": [
    "G06N504",
    "G06F1750"
  ],
  "_processing_info": {
    "original_size": 150683,
    "optimized_size": 3878,
    "reduction_percent": 97.43
  }
}