{
  "date_produced": "20171018",
  "publication_number": "US20170316344A1-20171102",
  "main_ipcr_label": "G06N9900",
  "decision": "PENDING",
  "application_number": "15144686",
  "inventor_list": [
    {
      "inventor_name_last": "DRAKOULIS",
      "inventor_name_first": "NIKO",
      "inventor_city": "ARLINGTON HEIGHTS",
      "inventor_state": "IL",
      "inventor_country": "US"
    }
  ],
  "abstract": "A data driven intelligent learning and development apparatus and method using an assessment of various traits of an individual to develop skill practice areas, each with one or more development strategies to enhance and/or maintain selected skills of an individual related to the practice areas.",
  "filing_date": "20160502",
  "patent_number": "None",
  "summary": "<SOH> SUMMARY <EOH>A data driven intelligent learning and development method includes accessing assessments of an individual relating to at least one trait of the individual, preparing a list of skill practice areas for the individual relating to personal skills and characteristics of the at least one trait, providing for each practice area, at least one development strategy for enhancing and/or maintaining the skills of the individual in each practice area, and presenting at least one practice area with at least one development strategy associated to the individual. The method can include presenting a list of practice areas to the individual by ranking the practice areas from the practice areas requiring the most learning of the individual to the practice areas requiring a lesser amount of learning. The method can also allow customizing of the ranking of the of the listed practice areas by the individual. The method can include providing of a learning schedule for the individual for at least one of each practice area and at least one development strategy. The method can include providing at least two individually selectable learning schedules, each learning schedule presenting one of a new practice area or a new development strategy to the individual at different time intervals. The method can also include providing the at least two learning schedules as providing one of a selectable self-pace learning schedule by the individual, and an automatic learning schedule presenting at least one of a practice and at least one development strategy to the individual on a periodic time basis. The method can further include allowing access to a knowledge center by the individual, where the knowledge center contains selectable media to enhance and/or maintain the individual's skill for at least one of a practice area and a development strategy. The method can include visually presenting a plurality of practice areas for selection by the individual. The method can allow the indi...",
  "date_published": "20171102",
  "title": "DATA DRIVEN INTELLIGENT LEARNING AND DEVELOPMENT APPARATUS AND METHOD",
  "ipcr_labels": [
    "G06N9900"
  ],
  "_processing_info": {
    "original_size": 44406,
    "optimized_size": 2864,
    "reduction_percent": 93.55
  }
}