{
  "date_produced": "20171018",
  "publication_number": "US20170316305A1-20171102",
  "main_ipcr_label": "G06N300",
  "decision": "PENDING",
  "application_number": "15143420",
  "inventor_list": [
    {
      "inventor_name_last": "Liensberger",
      "inventor_name_first": "Christian",
      "inventor_city": "Bellevue",
      "inventor_state": "WA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Mahadevan",
      "inventor_name_first": "Varsha",
      "inventor_city": "Sammamish",
      "inventor_state": "WA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Hamaker",
      "inventor_name_first": "Jonathan E.",
      "inventor_city": "Issaquah",
      "inventor_state": "WA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Plumpe",
      "inventor_name_first": "Michael D.",
      "inventor_city": "Seattle",
      "inventor_state": "WA",
      "inventor_country": "US"
    }
  ],
  "abstract": "Techniques are described herein that are capable of implementing a context-aware digital personal assistant (DPA) that supports multiple accounts and/or facilitating interaction among digital personal assistants. For example, a user may be signed-in with accounts of a DPA. Content from content streams associated with the respective accounts may be selectively combined based on at least the user's context. In another example, users who are signed-in with accounts of a DPA may share a user experience provided by the DPA. Content from content streams associated with the respective accounts may be selectively combined based on at least one or more of the users' context. In yet another example, a first DPA associated with a first user may be caused to perform an operation on behalf of a second DPA associated with a second user or to delegate the operation to the second DPA.",
  "filing_date": "20160429",
  "patent_number": "None",
  "summary": "<SOH> SUMMARY <EOH>Various approaches are described herein for, among other things, implementing a context-aware digital personal assistant that supports multiple accounts and/or facilitating interaction among digital personal assistants. A context-aware digital personal assistant is a digital personal assistant that is capable of being aware of context (e.g., context of a user). For instance, the context-aware digital personal assistant may determine the context based on any one or more suitable factors. Examples of such a factor include but are not limited to a location, voice signals, an interaction pattern, a scheduled event, a communication (e.g., email, text message, short message service (SMS) message, and/or social update), network information, a device on which the digital personal assistant is used, an application and/or service that is connected to the device, and one or more people with whom a user interacts. In a first example approach, a determination is made that a user is signed-in with accounts of a digital personal assistant. Content from content streams that are associated with the respective accounts is selectively combined based on at least a context of the user to generate a selectively combined content stream. The digital personal assistant is caused to provide the selectively combined content stream for presentation to the user. In a second example approach, a determination is made that users who are signed-in with accounts of a digital personal assistant share a shared user experience provided by the digital personal assistant. Content from content streams that are associated with the respective accounts is selectively combined based on at least a context of one or more of the users to generate a selectively combined content stream. The digital personal assistant is caused to provide the selectively combined content stream for presentation to the users in the shared user experience. In a third example approach, a determination is made that a...",
  "date_published": "20171102",
  "title": "CONTEXT-AWARE DIGITAL PERSONAL ASSISTANT SUPPORTING MULTIPLE ACCOUNTS",
  "ipcr_labels": [
    "G06N300",
    "G06F1730",
    "H04L2906",
    "H04L2908"
  ],
  "_processing_info": {
    "original_size": 213422,
    "optimized_size": 3933,
    "reduction_percent": 98.16
  }
}