{
  "date_produced": "20171025",
  "publication_number": "US20170323194A1-20171109",
  "main_ipcr_label": "G06N304",
  "decision": "PENDING",
  "application_number": "15144862",
  "inventor_list": [
    {
      "inventor_name_last": "WANG",
      "inventor_name_first": "Chen",
      "inventor_city": "Singapore",
      "inventor_state": "",
      "inventor_country": "SG"
    }
  ],
  "abstract": "A technology for path determination using robust optimization is provided. In accordance with one aspect, a network graph of a network is generated. The network graph comprises nodes corresponding to points in the network, and edges which connect the nodes. Costs for each edge of the network are determined and modeled using reference point, upper bound and lower bound parameters. A user input which includes a source node, destination node, and cost target may be received from a client device. A resultant path connecting the source node and destination node are determined by solving a target-oriented robust optimization problem, which optimizes a cost of the resultant path based on the modeled costs of the edges. The resultant path is displayed on a user interface of the client device.",
  "filing_date": "20160503",
  "patent_number": "None",
  "summary": "<SOH> SUMMARY <EOH>A technology for path determination using robust optimization is provided. In accordance with one aspect, a network graph of a network is generated. The network graph includes nodes corresponding to points in the network, and edges which connect the nodes. Costs for each edge of the network are determined and modeled using reference point, upper bound and lower bound parameters. A user input which includes a source node, destination node, and cost target may be received from a client device. A resultant path connecting the so de and destination node are determined by solving a target-oriented robust optimization problem, which optimizes a cost of the resultant path based on the modeled costs of the edges. The resultant path is displayed on a user interface of the client device. With these and other advantages and features that will become hereinafter apparent, further information may be obtained by reference to the following detailed description and appended claims, and to the figures attached hereto.",
  "date_published": "20171109",
  "title": "PATH DETERMINATION USING ROBUST OPTIMIZATION",
  "ipcr_labels": [
    "G06N304"
  ],
  "_processing_info": {
    "original_size": 51778,
    "optimized_size": 2354,
    "reduction_percent": 95.45
  }
}