{
  "date_produced": "20170214",
  "publication_number": "US20170061315A1-20170302",
  "main_ipcr_label": "G06N700",
  "decision": "PENDING",
  "application_number": "15146697",
  "inventor_list": [
    {
      "inventor_name_last": "Leonard",
      "inventor_name_first": "Michael James",
      "inventor_city": "Cary",
      "inventor_state": "NC",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Chien",
      "inventor_name_first": "Yung-Hsin",
      "inventor_city": "Apex",
      "inventor_state": "NC",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Wang",
      "inventor_name_first": "Pu",
      "inventor_city": "Charlotte",
      "inventor_state": "NC",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Li",
      "inventor_name_first": "Yue",
      "inventor_city": "Cary",
      "inventor_state": "NC",
      "inventor_country": "US"
    }
  ],
  "abstract": "Disclosed are methods, system, and computer program products useful for generating summary statistics for data predictions based on the aggregation of data from past time intervals. Summary statistics such as prediction standard errors, variances, confidence limits, and other statistical measures, may be generated in a way that preserves the basic distributional properties of the original data sets, to allow, for example, a reduction of the multiple data sets through the aggregation process, which may be useful for a prediction process, while determining statistical information for the predicted data.",
  "filing_date": "20160504",
  "patent_number": "None",
  "summary": "<SOH> SUMMARY <EOH>In accordance with the teachings described herein, systems, methods, and computer program products are provided for dynamically aggregating multiple data sets and identifying a prediction based on the aggregated data. For example, the disclosed methods, system, and computer program products are useful for generating prediction statistics for the predictions of data for upcoming time period based on the aggregation of data from past time intervals, including prediction statistics such as prediction standard errors, variances, confidence limits, and other statistical measures, in a way that preserves the basic distributional properties of the original data sets. In this way, a reduction of the multiple data sets can be achieved through the aggregation process, while statistical information can be determined for the predicted data for upcoming time periods in order to provide a measure of confidence in the predicted data. For example, disaggregate data sets may be generated and filtered to create a subset of the disaggregate data sets. Each disaggregate data set may include actual data corresponding to past measurements, as well as modeled data corresponding to data generated by a model, for example. The subset of the disaggregate data sets may be aggregated and a prediction based on the aggregated past data may be determined, such as a prediction based on the aggregated past data and/or a prediction based on the aggregated modeled data. The prediction of the aggregated data may be reconciled with the actual data and/or modeled data in order to determine prediction statistics for the prediction. In a first aspect, systems are provided, such as systems for generating data predictions and prediction statistics associated with the data predictions. In one embodiment, a system of this aspect comprises one or more processors; a non-transitory computer readable storage medium positioned in data communication with the one or more processors and including in...",
  "date_published": "20170302",
  "title": "DYNAMIC PREDICTION AGGREGATION",
  "ipcr_labels": [
    "G06N700",
    "G06F1730"
  ],
  "_processing_info": {
    "original_size": 146100,
    "optimized_size": 3562,
    "reduction_percent": 97.56
  }
}