{
  "decision": "PENDING",
  "application_number": "15142325",
  "date_published": "20161103",
  "date_produced": "20161019",
  "title": "INPUT DEVICE AND DISPLAY DEVICE",
  "filing_date": "20160429",
  "inventor_list": [
    {
      "inventor_name_last": "NAKANISHI",
      "inventor_name_first": "Takayuki",
      "inventor_city": "Tokyo",
      "inventor_state": "",
      "inventor_country": "JP"
    },
    {
      "inventor_name_last": "Yata",
      "inventor_name_first": "Tatsuya",
      "inventor_city": "Tokyo",
      "inventor_state": "",
      "inventor_country": "JP"
    },
    {
      "inventor_name_last": "Tamaki",
      "inventor_name_first": "Masaya",
      "inventor_city": "Tokyo",
      "inventor_state": "",
      "inventor_country": "JP"
    }
  ],
  "ipcr_labels": [
    "G06F3041",
    "G09G334",
    "G09G336",
    "G06F3044"
  ],
  "main_ipcr_label": "G06F3041",
  "summary": "<SOH> SUMMARY <EOH>According to an aspect, an input device includes a first substrate, a light-emitting element unit, and third conductive layers. The first substrate includes first and second surfaces. The light-emitting element unit includes: first conductive layers formed in one layer on the second surface side; second conductive layers formed in one layer on the second surface side different from the layer in which the first conductive layers are formed; and at least one luminescent layer provided between the first and the second conductive layers and electrically in contact therewith. The third conductive layers are formed so as to be insulated from the first and the second conductive layers and not to intersect with the second conductive layers in planar view, and are configured to detect a change in an electric field between the first and the third conductive layers depending on the coordinates of a proximity object present at a position overlapping with the first conductive layers and the first surface in planar view. According to another aspect, a display device comprising: an input device that comprises: a first substrate including a first surface and a second surface; a light-emitting element unit including: a plurality of first conductive layers formed in one layer on the second surface side; a plurality of second conductive layers formed in one layer on the second surface side different from the layer in which the first conductive layers are formed; and at least one luminescent layer provided between the first conductive layers and the second conductive layers and electrically in contact with the first conductive layers and the second conductive layers; and a plurality of third conductive layers that are formed so as to be insulated from the first conductive layers and the second conductive layers and not to intersect with the second conductive layers in planar view, and are configured to detect a change in an electric field between the first conductive...",
  "patent_number": "None",
  "abstract": "An input device includes a first substrate, a light-emitting element unit, and third conductive layers. The first substrate includes first and second surfaces. The light-emitting element unit includes: first conductive layers formed in one layer on the second surface side; second conductive layers formed in one layer on the second surface side different from the layer of the first conductive layers; and a luminescent layer provided between the first and the second conductive layers and electrically in contact therewith. The third conductive layers are formed to be insulated from the first and the second conductive layers and not to intersect with the second conductive layers in planar view, and are configured to detect a change in an electric field between the first and the third conductive layers depending on coordinates of a proximity object at a position overlapping with the first conductive layers and the first surface in planar view.",
  "publication_number": "US20160320903A1-20161103",
  "_processing_info": {
    "original_size": 139991,
    "optimized_size": 3788,
    "reduction_percent": 97.29
  }
}