{
  "decision": "PENDING",
  "application_number": "15145376",
  "date_published": "20161110",
  "date_produced": "20161026",
  "title": "SYSTEMS, METHODS, DEVICES, AND COMPUTER READABLE MEDIA FOR ENABLING DIRECT ELECTRONIC PAYMENT TRANSFERS",
  "filing_date": "20160503",
  "inventor_list": [
    {
      "inventor_name_last": "Bortolotto",
      "inventor_name_first": "Paolo",
      "inventor_city": "Singapore",
      "inventor_state": "",
      "inventor_country": "SG"
    },
    {
      "inventor_name_last": "Libus",
      "inventor_name_first": "Anna",
      "inventor_city": "Surrey",
      "inventor_state": "",
      "inventor_country": "GB"
    },
    {
      "inventor_name_last": "McGuire",
      "inventor_name_first": "John",
      "inventor_city": "Galway",
      "inventor_state": "",
      "inventor_country": "IE"
    }
  ],
  "ipcr_labels": [
    "G06Q2032",
    "G06Q3002",
    "G06Q2036",
    "G06Q2040"
  ],
  "main_ipcr_label": "G06Q2032",
  "summary": "<SOH> SUMMARY <EOH>This section provides a general summary of the disclosure, and is not a comprehensive disclosure of its full scope or all of its features. Aspects and embodiments of the disclosure are also set out in the accompanying claims. Methods, systems, devices, and computer readable media for enabling electronic payment transfers between payers and payees are disclosed. According to a first aspect, a computer-implemented method for requesting an electronic payment transfer from a payer is provided. The method comprises receiving, from a first application installed on an electronic device, identification information of a payer based on a user selection at the electronic device; receiving, via a second application installed on the electronic device, a user identification of a payment amount, wherein the second application is different from the first application; capturing, at a biometrics reader associated with the electronic device, biometric data of the user; comparing the captured biometric data to authorized biometric data to authenticate the user; and initiating from the electronic device, upon successful authentication of the user, a request for the electronic payment transfer from the payer to the user for the payment amount. In this manner, the user of the electronic device is enabled to initiate a request for an electronic payment transfer from a payer, whom he or she can easily identify through application(s) already installed at the electronic device, in a simple and direct manner that does not require special trips by the user to a bank or detailed information about the payer. Such an electronic payment transfer advantageously can be initiated by the means of the electronic device, such as a smart mobile device, anywhere, at any time, for any amount, and in a secure manner. In some example embodiments, the method further comprises invoking the second application in response to receiving the identification information of the payer from the first a...",
  "patent_number": "None",
  "abstract": "Systems, methods, devices, and computer readable media for enabling direct electronic payment transfers are disclosed. Identification information of a payer, based on a user selection at a mobile device, is received from a first application installed on the mobile device. A user identification of a payment amount is received via a second application installed on the mobile device. The second application is different from the first application. Biometric data of the user is captured at a biometrics reader of the mobile device, and then compared to authorized biometric data to authenticate the user. Upon successful authentication of the user, a request for the electronic payment transfer from the payer to the user for the payment amount is initiated from the mobile device.",
  "publication_number": "US20160328700A1-20161110",
  "_processing_info": {
    "original_size": 128467,
    "optimized_size": 3692,
    "reduction_percent": 97.13
  }
}