{
  "decision": "PENDING",
  "application_number": "15149928",
  "date_published": "20160901",
  "date_produced": "20160817",
  "title": "POINT OF SALE SYSTEM WITH DATA ADAPTER",
  "filing_date": "20160509",
  "inventor_list": [
    {
      "inventor_name_last": "CIABARRA",
      "inventor_name_first": "Christopher",
      "inventor_city": "Sausalito",
      "inventor_state": "CA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "FALZONE",
      "inventor_name_first": "Lisa",
      "inventor_city": "San Francisco",
      "inventor_state": "CA",
      "inventor_country": "US"
    }
  ],
  "ipcr_labels": [
    "G06Q2020",
    "G06F1342"
  ],
  "main_ipcr_label": "G06Q2020",
  "summary": "<SOH> BRIEF DESCRIPTION OF THE DRAWINGS <EOH>References will be made to embodiments of the invention, examples of which may be illustrated in the accompanying figures. These figures are intended to be illustrative, not limiting. Although the invention is generally described in the context of these embodiments, it should be understood that it is not intended to limit the scope of the invention to these particular embodiments. FIG. 1 shows an exemplary point of sale system in accordance with various embodiments of the present disclosure. FIG. 2 shows a representation of an exemplary data processing system that may be used in connection with various embodiments of the present disclosure. FIG. 3 shows a point of sale system comprising a data processing system and a data adapter in accordance with various embodiments of the present disclosure. FIG. 4 illustrates one or more peripheral devices communicating with a data processing system using data converted between a first data protocol and a standardized communication protocol in accordance with various embodiments of the present disclosure. detailed-description description=\"Detailed Description\" end=\"lead\"?",
  "patent_number": "None",
  "abstract": "Methods, systems, and computer program products for facilitating point-of-sale transactions and payment transactions using a data adapter device. In embodiments, a data adapter device receives a communication in first data protocol format and converts data from the communication into a second data protocol format.",
  "publication_number": "US20160253645A1-20160901",
  "_processing_info": {
    "original_size": 121976,
    "optimized_size": 2185,
    "reduction_percent": 98.21
  }
}