{
  "decision": "PENDING",
  "application_number": "15148840",
  "date_published": "20160901",
  "date_produced": "20160817",
  "title": "CONSTRUCTION PAYMENT MANAGEMENT SYSTEM AND METHOD WITH AUTOMATIC NOTIFICATION WORKFLOW FEATURES",
  "filing_date": "20160506",
  "inventor_list": [
    {
      "inventor_name_last": "Allin",
      "inventor_name_first": "Patrick J.",
      "inventor_city": "Lake Bluff",
      "inventor_state": "IL",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Cherry",
      "inventor_name_first": "Charles C.",
      "inventor_city": "Glenview",
      "inventor_state": "IL",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Eichhorn",
      "inventor_name_first": "William H.",
      "inventor_city": "Hinsdale",
      "inventor_state": "IL",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Niden",
      "inventor_name_first": "Howard L.",
      "inventor_city": "Chicago",
      "inventor_state": "IL",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Pedersen",
      "inventor_name_first": "Richard P.",
      "inventor_city": "DePere",
      "inventor_state": "WI",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Bagley",
      "inventor_name_first": "Matthew R.",
      "inventor_city": "Green Bay",
      "inventor_state": "WI",
      "inventor_country": "US"
    }
  ],
  "ipcr_labels": [
    "G06Q2010",
    "G06Q1010",
    "G06F30484",
    "G06Q1006"
  ],
  "main_ipcr_label": "G06Q2010",
  "summary": "<SOH> SUMMARY OF THE INVENTION <EOH>In one embodiment, the invention provides a construction payment management system including an application server. The application server has a processor and a memory storing instructions. The memory also stores a plurality of notification workflows. Each notification workflow defines a sequence of automatic electronic notifications that are transmitted from the application server to one or more participants in a construction project in response to one or more predetermined events. When the instructions are executed by the processor, the application server receives an input relating to the construction project from a first participant and access one of the plurality of stored notification workflows based on the information received from the first participant. The application server then identifies, based on the accessed notification workflow, a second participant associated with the construction project to receive a first notification. The application server automatically transmits the first notification to the second participant. The first notification includes a textual description of the input received from the first participant, a textual description of an action to be performed by the second participant as a next step in the accessed notification workflow, and a selectable link to an electronic form. The application server receives a response to the first notification from the second participant through the electronic form. The application automatically processes the content of the response from the second participant and automatically transmits a second notification to a third participant based on the accessed notification workflow. In another embodiment, the invention provides a method of managing a construction project payment process. An input is received from a first participant and one of a plurality of stored notification workflows is accessed from a memory based on the information received from the first participant....",
  "patent_number": "None",
  "abstract": "Systems and method for managing a construction payment process. An input is received from a first participant and one of a plurality of stored notification workflows is accessed from a memory based on the information received from the first participant. Each stored notification workflow defines a sequence of automatic electronic notifications that are transmitted from the application server to one or more participants in the construction project in response to one or more predetermined events. Based on the accessed notification workflow, a second participant is identified and a first notification is automatically transmitted to the second participant. A response to the first notification is received from the second participant through an electronic form. The content of the response is automatically processed and a second notification is transmitted to a third participant based on the accessed notification workflow.",
  "publication_number": "US20160253640A1-20160901",
  "_processing_info": {
    "original_size": 151757,
    "optimized_size": 4305,
    "reduction_percent": 97.16
  }
}