{
  "date_produced": "20160810",
  "publication_number": "US20160247091A1-20160825",
  "main_ipcr_label": "G06N9900",
  "decision": "ACCEPTED",
  "application_number": "15142099",
  "inventor_list": [
    {
      "inventor_name_last": "McCaffrey",
      "inventor_name_first": "Anthony",
      "inventor_city": "West Brookfield",
      "inventor_state": "MA",
      "inventor_country": "US"
    }
  ],
  "abstract": "Sensors are used to generate sample set data representing objects in a sample set. A computer system analyzes the sample set data to determine the frequencies with which features in a feature set are observed in the objects in the sample set. An example of such output is a bar chart representing the frequency of observation of features in the feature set in a particular object. The feature output may be used to identify one or more obscure (i.e., low frequency) features in the particular object. Machine learning may be used to learn associations between sample set data and features in the feature set, thereby improving the accuracy and efficiency of future uses of the computer system.",
  "filing_date": "20160429",
  "patent_number": "9646266",
  "summary": "<SOH> SUMMARY <EOH>Sensors are used to generate sample set data representing objects in a sample set. A computer system analyzes the sample set data to determine the frequencies with which features in a feature set are observed in the objects in the sample set. An example of such output is a bar chart representing the frequency of observation of features in the feature set in a particular object. The feature output may be used to identify one or more obscure (i.e., low frequency) features in the particular object. Machine learning may be used to learn associations between sample set data and features in the feature set, thereby improving the accuracy and efficiency of future uses of the computer system.",
  "date_published": "20160825",
  "title": "Feature Type Spectrum Technique",
  "ipcr_labels": [
    "G06N9900",
    "G06F1728"
  ],
  "_processing_info": {
    "original_size": 95287,
    "optimized_size": 1950,
    "reduction_percent": 97.95
  }
}