{
  "date_produced": "20171025",
  "publication_number": "US20170323215A1-20171109",
  "main_ipcr_label": "G06N700",
  "decision": "PENDING",
  "application_number": "15147805",
  "inventor_list": [
    {
      "inventor_name_last": "Lada",
      "inventor_name_first": "Akos",
      "inventor_city": "San Francisco",
      "inventor_state": "CA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Peysakhovich",
      "inventor_name_first": "Alexander",
      "inventor_city": "San Francisco",
      "inventor_state": "CA",
      "inventor_country": "US"
    }
  ],
  "abstract": "Systems, methods, and non-transitory computer-readable media can acquire a set of individual time series associated with a set of users. Each of the individual time series can be associated with a respective user out of the set of the users. A plurality of variables represented via the set of individual time series can be selected. The plurality of variables can include at least a first variable and a second variable. One or more regression techniques can be applied to at least the first variable and the second variable. A set of sensitivity metrics for the set of users can be determined based on the one or more regression techniques. A respective sensitivity metric out of the set of sensitivity metrics can be determined for each of the users.",
  "filing_date": "20160505",
  "patent_number": "None",
  "summary": "<SOH> SUMMARY <EOH>Various embodiments of the present disclosure can include systems, methods, and non-transitory computer readable media configured to acquire a set of individual time series associated with a set of users. Each of the individual time series can be associated with a respective user out of the set of the users. A plurality of variables represented via the set of individual time series can be selected. The plurality of variables can include at least a first variable and a second variable. One or more regression techniques can be applied to at least the first variable and the second variable. A set of sensitivity metrics for the set of users can be determined based on the one or more regression techniques. A respective sensitivity metric out of the set of sensitivity metrics can be determined for each of the users. In an embodiment, a set of feature values for a set of features associated with the set of users can be acquired. Machine learning can be applied to the set of feature values and the set of sensitivity metrics to develop a sensitivity model. One or more target users can be identified based on the sensitivity model. In an embodiment, each target user out of the one or more target users can be identified based on a respective set of particular feature values associated with each target user. In an embodiment, the sensitivity model can be indicative of one or more correlations between the set of features and the set of sensitivity metrics. In an embodiment, the set of features can be associated with at least one of a social networking utilization feature, a page inventory feature, a page like feature, a page access amount feature, a location feature, or a device feature. In an embodiment, one or more social networking policies can be applied to the one or more target users. In an embodiment, the one or more social networking policies can be associated with at least one of receiving page suggestions, ranking feed content, interacting with posts,...",
  "date_published": "20171109",
  "title": "SYSTEMS AND METHODS FOR PROVIDING DATA ANALYSIS BASED ON APPLYING REGRESSION",
  "ipcr_labels": [
    "G06N700",
    "G06N9900"
  ],
  "_processing_info": {
    "original_size": 82734,
    "optimized_size": 3490,
    "reduction_percent": 95.78
  }
}