{
  "decision": "ACCEPTED",
  "application_number": "15147598",
  "date_published": "20160922",
  "date_produced": "20160908",
  "title": "OBJECT DETECTION AND CLASSIFICATION",
  "filing_date": "20160505",
  "inventor_list": [
    {
      "inventor_name_last": "Kant",
      "inventor_name_first": "Shashi",
      "inventor_city": "Wellesley",
      "inventor_state": "MA",
      "inventor_country": "US"
    }
  ],
  "ipcr_labels": [
    "G06K962",
    "G06K920"
  ],
  "main_ipcr_label": "G06K962",
  "summary": "<SOH> SUMMARY <EOH>At least one aspect is directed to a system of object detection across disparate fields of view. The system includes a data processing system having at least one of an object detection component, an object classification component, an object forecast component, and an object matching component. The data processing system can obtain a first image generated by a first recording device, the first recording device having a first field of view. The object detection component of the data processing system can detect, from the first image, a first object present within the first field of view. The object classification component of the data processing system can determine a first level classification category of the first object and determines a second level classification category of the first object. The data processing system can generate a descriptor of the first object based on at least one of the first level classification category of the first object and the second level classification category of the first object. The data processing system can obtain a second image generated by a second recording device, the second recording device having a second field of view different than the first field of view. The object detection component of the data processing system can detect, from the second image, a second object present within the second field of view. The data processing system can generate a descriptor of the second object based on at least one of a first level classification category of the second object and a second level classification category of the second object. The object matching component of the data processing system can identify a correlation of the first object with the second object based on the descriptor of the first object and the descriptor of the second object. The object forecast component of the data processing system can determine a characteristic of at least one of the first object and the second object based on the correl...",
  "patent_number": "9922271",
  "abstract": "Object detection and across disparate fields of view are provided. A first image generated by a first recording device with a first field of view, and a second image generated by a second recording device with a second field of view can be obtained. An object detection component can detect a first object within the first field of view, and a second object within the second field of view. An object classification component can determine first and second level classification categories of the first object. Object components can correlate the first object with the second object based on the descriptor of the first object or a descriptor of the second object, and can determine a characteristic or the first object or the second object based on the correlation.",
  "publication_number": "US20160275376A1-20160922",
  "_processing_info": {
    "original_size": 138632,
    "optimized_size": 3302,
    "reduction_percent": 97.62
  }
}