{
  "date_produced": "20160810",
  "publication_number": "US20160247068A1-20160825",
  "main_ipcr_label": "G06N502",
  "decision": "PENDING",
  "application_number": "15144373",
  "inventor_list": [
    {
      "inventor_name_last": "LIN",
      "inventor_name_first": "FEN",
      "inventor_city": "Shenzhen",
      "inventor_state": "",
      "inventor_country": "CN"
    }
  ],
  "abstract": "A system and method for automatic question answering is provided. The system includes: a user inputting module configured to receive question information; a question analyzing module configured to analyze the question information, and determine a set of keywords, a question type and a user intention type corresponding to the question information; a syntax retrieving and ranking module configured to retrieve, in a question and answer library and a category tree, answer candidates based on the question information, the set of keywords, the question type and the user intention type, determine a retrieval relevance between each of the answer candidates and the question information and rank the answer candidates according to the retrieval relevance, each of the answer candidates having a sequence number; and an outputting module configured to output an answer candidate ranked with a specified sequence number. By using the application, lower costs for collection and improve successful rate o...",
  "filing_date": "20160502",
  "patent_number": "None",
  "summary": "<SOH> SUMMARY OF THE APPLICATION <EOH>The application provides a system and method for automatic question answering, in order to lower costs for collection and improve successful rate of results answered by the system for automatic question answering. One aspect of the application provides a system for automatic question answering. The system comprises: a user inputting module configured to receive question information; a question analyzing module configured to analyze the question information, and determine a set of keywords, a question type and a user intention type corresponding to the question information; a syntax retrieving and ranking module configured to retrieve, in a question and answer library and a category tree, answer candidates based on the question information, the set of keywords, the question type and the user intention type, determine a retrieval relevance between each of the answer candidates and the question information, and rank the answer candidates according to the retrieval relevance, each of the answer candidates having a sequence number; and an outputting module configured to output one of the answer candidates ranked with a specified sequence number. After receiving question information input by a user, technical solutions provided by the application determine not only keywords but also a question type and a user intention type; retrieve, in a question and answer library and a category tree, answer candidates matching the question according to the question information, the keywords, question type and user intention type; determine a retrieval relevance between each of the answer candidates and the question and rank the answer candidates based on the retrieval relevance; and output an answer candidate ranked with a specified sequence number (generally, an answer candidate ranking first). Accordingly, the technical solutions analyze the question type and the user intention type, and introduce the category tree matching method. Therefore, wh...",
  "date_published": "20160825",
  "title": "SYSTEM AND METHOD FOR AUTOMATIC QUESTION ANSWERING",
  "ipcr_labels": [
    "G06N502",
    "G10L1522",
    "G06N9900",
    "G06F1727"
  ],
  "_processing_info": {
    "original_size": 67467,
    "optimized_size": 3569,
    "reduction_percent": 94.71
  }
}