{
  "date_produced": "20171018",
  "publication_number": "US20170316316A1-20171102",
  "main_ipcr_label": "G06N502",
  "decision": "PENDING",
  "application_number": "15141299",
  "inventor_list": [
    {
      "inventor_name_last": "FINK",
      "inventor_name_first": "PETER",
      "inventor_city": "Bremen",
      "inventor_state": "",
      "inventor_country": "DE"
    }
  ],
  "abstract": "The invention relates to a system for visualizing and simulating personal knowledge structures in a company which has one or more business units. It comprises a first server for storing a first dataset, which describes a model of the company structure, wherein for each employee position in the company an employee target profile is defined, which comprises an employee target competence profile; and for storing a second dataset, which specifies the sales achieved for the individual business units; and for storing a third dataset, which depicts recorded employee actual competence profiles. Furthermore, it contains a second server which comprises a program that calculates a plurality of indexes based on the data of the first dataset, second dataset, and third datasets, in particular the human potential and/or the economic temperature. In addition, the system has a graphic user interface, which displays the calculated indexes for each employee actual profile and/or each business unit at a c...",
  "filing_date": "20160428",
  "patent_number": "None",
  "summary": "<SOH> BRIEF DESCRIPTION <EOH>The object of the present invention is therefore to provide a system and method for visualizing and simulating personal knowledge structures in a company, which allows to sustain control of the strategic personnel development in a company, while making the individual knowledge of each employee quantifiable and thus manageable and monitorable. This objective is achieved by a system of the aforementioned type with a first server for storing a first set of data describing a model of a company structure, whereby in the company for each staff position an employee target profile is defined, which includes an employee target competence profile; and for storing a second data set, which indicates the revenue generated for the individual company units and employees; and for storing a third set of data collected, which contains employees actual competence profiles; with a second server having a program that calculates a plurality of indexes, based on the data of the first, second and third data sets, in particular, the human potential, the economic temperature and the competence quality, and which has a graphical user interface, which displays the calculated indexes for each employee actual competence profile and/or for each company unit in a corresponding location in the above given company structure. The invention is based on the recognition that the complexity of today's company structures, especially in companies with a large number of employees, steadily increases, what makes the management of strategic personnel development increasingly difficult. It is a common practice, however, to use in purchasing or inventory management computer-based surveillance and control programs under the maxim of economic optimization, there are no such computer-based control programs in the field of strategic personnel development in a company so far. The model of the company structure reflects the company's existing hierarchies and divides the company into units...",
  "date_published": "20171102",
  "title": "SYSTEM AND METHOD FOR VISUALIZING AND SIMULATING PERSONAL KNOWLEDGE STRUCTURES IN A COMPANY",
  "ipcr_labels": [
    "G06N502"
  ],
  "_processing_info": {
    "original_size": 70066,
    "optimized_size": 3575,
    "reduction_percent": 94.9
  }
}