{
  "date_produced": "20170419",
  "publication_number": "US20170124481A1-20170504",
  "main_ipcr_label": "G06N9900",
  "decision": "PENDING",
  "application_number": "15141752",
  "inventor_list": [
    {
      "inventor_name_last": "Crabtree",
      "inventor_name_first": "Jason",
      "inventor_city": "Vienna",
      "inventor_state": "VA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Sellers",
      "inventor_name_first": "Andrew",
      "inventor_city": "Colorado Springs",
      "inventor_state": "CO",
      "inventor_country": "US"
    }
  ],
  "abstract": "A system for fully integrated collection of business impacting data, analysis of that data and generation of both analysis driven business decisions and analysis driven simulations of alternate candidate business action comprising a business data retrieval engine stored in a memory of and operating on a processor of a computing device, a business data analysis engine stored in a memory of and operating on a processor of a computing device and a business decision and business action path simulation engine stored in a memory of and operating on a processor of one of more computing devices has been developed.",
  "filing_date": "20160428",
  "patent_number": "None",
  "summary": "<SOH> SUMMARY OF THE INVENTION <EOH>Accordingly, the inventor has developed a distributed system for the fully integrated retrieval, and deep analysis of business operational information from a plurality of sources. The system further uses results of business information analytics to optimize the making of business decisions and allow for alternate action pathways to be simulated using the latest data and machine mediated prediction algorithms. According to a preferred embodiment of the invention, a system for comprising: a business data retrieval engine stored in a memory of and operating on a processor of a computing device, a business data analysis engine stored in a memory of and operating on a processor of a computing device and a business decision and business action path simulation engine stored in a memory of and operating on a processor of one of more computing devices. Wherein, the business information retrieval engine: retrieves a plurality of business related data from a plurality of sources, accepts a plurality of analysis parameters and control commands directly from human interface devices or from one or more command and control storage devices, and stores accumulated retrieved information for processing by data analysis engine or predetermined data timeout. The business information analysis engine: retrieves a plurality of data types from the business information retrieval engine, performs a plurality of analytical functions and transformations on retrieved data based upon the specific goals and needs set forth in a current campaign by business process analysis authors. Wherein the business decision and business action path simulation engine: employs results of data analyses and transformations performed by the business information analysis engine, together with available supplemental data from a plurality of sources as well as any current campaign specific machine learning, commands and parameters from business process analysis authors to formulate ...",
  "date_published": "20170504",
  "title": "SYSTEM FOR FULLY INTEGRATED CAPTURE, AND ANALYSIS OF BUSINESS INFORMATION RESULTING IN PREDICTIVE DECISION MAKING AND SIMULATION",
  "ipcr_labels": [
    "G06N9900",
    "G06N502"
  ],
  "_processing_info": {
    "original_size": 99515,
    "optimized_size": 3396,
    "reduction_percent": 96.59
  }
}