{
  "date_produced": "20161026",
  "publication_number": "US20160328660A1-20161110",
  "main_ipcr_label": "G06N9900",
  "decision": "PENDING",
  "application_number": "15146043",
  "inventor_list": [
    {
      "inventor_name_last": "Huang",
      "inventor_name_first": "Yi Sun",
      "inventor_city": "Cupertino",
      "inventor_state": "CA",
      "inventor_country": "US"
    }
  ],
  "abstract": "A machine learning innovation for point of sale systems is provided which includes a scanner component, which can scan at least one of the following codes: Barcode, QR code, RFID or any other new code and id, a camera component, which can get image or picture of objects, and a compute component with prediction algorithm to classify the object. The system also includes a method with prediction and learning capability that sends the classified labels to central controller or server. A central controller or server gathers classified labels and analyze and learn from classified labels information, and sends updated a scanner component, which can scan at least one of the codes.",
  "filing_date": "20160504",
  "patent_number": "None",
  "summary": "<SOH> BRIEF DESCRIPTION OF THE DRAWINGS <EOH>The present invention is illustrated by way of example, and not by way of limitation, in the figures of the accompanying drawings and in which like reference numerals refer to similar elements and in which: FIG. 1 illustrates an exemplary flow diagram for machine learning, in accordance with an embodiment of the present invention; FIG. 2 illustrates an exemplary flow diagram for machine learning with key entry, in accordance with an embodiment of the present invention; FIG. 3 illustrates an exemplary prediction, in accordance with an embodiment of the present invention; FIG. 4 illustrates an exemplary neural network architecture, in accordance with an embodiment of the present invention; FIG. 5 illustrates an exemplary integrated machine learning system, in accordance with an embodiment of the present invention; FIG. 6 illustrates an exemplary device with scanner and camera capability, in accordance with an embodiment of the present invention; FIG. 7 illustrates an exemplary block diagram of a device with scanner and camera capability, in accordance with an embodiment of the present invention; FIG. 8 illustrates an exemplary block diagram of a surveillance system, in the prior art; FIG. 9 illustrates an exemplary block diagram of a surveillance system, in accordance with an embodiment of the present invention; FIG. 10 illustrates an exemplary block diagram of a surveillance system, in accordance with an embodiment of the present invention; FIG. 11 illustrates an exemplary method for a search, in accordance with an embodiment of the present invention; and FIG. 12 is a block diagram depicting an exemplary client/server system which may be used by an exemplary web-enabled/networked embodiment of the present invention. detailed-description description=\"Detailed Description\" end=\"lead\"? Unless otherwise indicated illustrations in the figures are not necessarily drawn to scale.",
  "date_published": "20161110",
  "title": "Machine Learning System, Method, and Program Product for Point of Sale Systems",
  "ipcr_labels": [
    "G06N9900",
    "G06K710",
    "G06K714",
    "G06Q2020",
    "G06F1730"
  ],
  "_processing_info": {
    "original_size": 110071,
    "optimized_size": 3245,
    "reduction_percent": 97.05
  }
}