{
  "date_produced": "20170906",
  "publication_number": "US20170270432A1-20170921",
  "main_ipcr_label": "G06N9900",
  "decision": "PENDING",
  "application_number": "15149279",
  "inventor_list": [
    {
      "inventor_name_last": "Sachdev",
      "inventor_name_first": "Ravi",
      "inventor_city": "Mumbai",
      "inventor_state": "",
      "inventor_country": "IN"
    },
    {
      "inventor_name_last": "Bijani",
      "inventor_name_first": "Pramodsing",
      "inventor_city": "Mumbai",
      "inventor_state": "",
      "inventor_country": "IN"
    },
    {
      "inventor_name_last": "Bandkar",
      "inventor_name_first": "Mahesh",
      "inventor_city": "Mumbai",
      "inventor_state": "",
      "inventor_country": "IN"
    },
    {
      "inventor_name_last": "Parulkar",
      "inventor_name_first": "Anand",
      "inventor_city": "Mumbai",
      "inventor_state": "",
      "inventor_country": "IN"
    },
    {
      "inventor_name_last": "Subramaniam",
      "inventor_name_first": "Ravichandran",
      "inventor_city": "Bangalore",
      "inventor_state": "",
      "inventor_country": "IN"
    }
  ],
  "abstract": "Methods, systems, and apparatus, including computer programs encoded on a computer storage medium, for system modernization using machine learning are disclosed. In one aspect, a method includes the actions of generating training data. The actions include generating a first model, a second model, and a third model. The actions include receiving data that is related to technological capabilities of an application and data that is related to business priorities of the application. The actions include applying the first model to the data that is related to the technological capabilities of the application and the second model to the data that is related to business priorities of the application. The actions include generating a modification recommendation for the application. The actions further include providing, for output, the modification recommendation for the application. The actions include receiving feedback data that indicates a level of acceptance of the modification recommendat...",
  "filing_date": "20160509",
  "patent_number": "None",
  "summary": "<SOH> SUMMARY <EOH>An entity may be using systems and applications that are out of date and need to be upgraded. For various reasons, however, the entity may be unaware that the systems and application are out of date. To identify out of date applications, the entity may provide data to three models that are trained using supervised and unsupervised machine learning. The training data for the models is based on an analysis of other systems and applications. The models process the data provided by the entity and generate recommendations regarding upgrading the systems and applications. The entity may choose to enact any of the recommendations provided. Using machine learning again, the models may be updated based on whether or not the entity accepted the recommendations. An innovative aspect of the subject matter described in this specification may be implemented in a method that includes the actions of generating training data; based on the training data and using supervised machine learning, generating a first model, a second model, and a third model; receiving data that is related to technological capabilities of an application and data that is related to business priorities of the application; applying the first model to the data that is related to the technological capabilities of the application and the second model to the data that is related to business priorities of the application; based on applying the first model and the second model, generating a modification recommendation for the application; providing, for output, the modification recommendation for the application; receiving feedback data that indicates a level of acceptance of the modification recommendation for the application; and based on the feedback data that indicates the level of acceptance of the modification recommendation for the application, modifying, using unsupervised machine learning, the third model. These and other implementations can each optionally include one or more of the follo...",
  "date_published": "20170921",
  "title": "SYSTEM MODERNIZATION USING MACHINE LEARNING",
  "ipcr_labels": [
    "G06N9900",
    "G06Q1006",
    "G06F954"
  ],
  "_processing_info": {
    "original_size": 73704,
    "optimized_size": 4142,
    "reduction_percent": 94.38
  }
}