{
  "decision": "PENDING",
  "application_number": "15144025",
  "date_published": "20170202",
  "date_produced": "20170119",
  "title": "SYSTEMS AND METHODS FOR MANAGING A MEDICAL SUPPLY CHAIN",
  "filing_date": "20160502",
  "inventor_list": [
    {
      "inventor_name_last": "Skoda",
      "inventor_name_first": "Brent M.",
      "inventor_city": "Irving",
      "inventor_state": "TX",
      "inventor_country": "US"
    }
  ],
  "ipcr_labels": [
    "G06F1900"
  ],
  "main_ipcr_label": "G06F1900",
  "summary": "<SOH> SUMMARY <EOH>The present disclosure relates to systems and methods for managing a medical supply chain. According to one aspect, a remote medical management environment can include a medical management system intermediary to a plurality of patients and a plurality of medical care providers. The medical management system can communicate with medical dispensing devices configured to dispense medication to patients. Further, the medical management system can communicate with provider devices through which medical care providers can provide information regarding services provided to users or instructions associated with medication use. The medical management system can detect medication supply events based on information communicated by the medical dispensing devices and/or provider devices or based on information stored at the medical management system. Upon detecting a supply/refill event, the medical management system can initiate a supply refill process for supplying medication or medical device(s) to a patient. In some implementations, the medical management system can be configured to determine supply/refill events based on a remotely monitored medication dispensing rate. The medical management system can estimate or calculate the medication dispensing rate based on reported dispensing events. Using the medication dispensing rate, the medical management system can determine an expected supply/refill date. In some implementations, the medical management system can detect a supply/refill event based on communications from provider devices including explicit requests for supply/refill, indication of a new prescription, or reminder of an approaching refill date. According to at least one aspect, the medial management system can execute a supply/refill process based on patient location. The medical management system can be configured to determine a patient location, for instance, based on GPS data provided by communication device or medical dispensing device of t...",
  "patent_number": "None",
  "abstract": "The present disclosure relates to systems and methods for managing a medical supply chain. According to one aspect, a remote medical management environment can include a medical management system intermediary to a plurality of patients and a plurality of medical care providers. The medical management system can communicate with medical dispensing devices configured to dispense medication to patients. Further, the medical management system can communicate with provider devices through which medical care providers can provide information regarding services provided to users or instructions associated with medication use. The medical management system can detect medication supply events based on information communicated by the medical dispensing devices and/or provider devices or based on information stored at the medical management system. Upon detecting a supply/refill event, the medical management system can initiate a supply refill process for supplying medication or medical device(s)...",
  "publication_number": "US20170032101A1-20170202",
  "_processing_info": {
    "original_size": 161272,
    "optimized_size": 3547,
    "reduction_percent": 97.8
  }
}