{
  "decision": "ACCEPTED",
  "application_number": "15145663",
  "date_published": "20160825",
  "date_produced": "20160810",
  "title": "Gesture-Based Device",
  "filing_date": "20160503",
  "inventor_list": [
    {
      "inventor_name_last": "Beadle",
      "inventor_name_first": "Henry William Peter",
      "inventor_city": "Chipping Norton",
      "inventor_state": "",
      "inventor_country": "AU"
    },
    {
      "inventor_name_last": "Denton",
      "inventor_name_first": "Matthew Charles",
      "inventor_city": "Bronte",
      "inventor_state": "",
      "inventor_country": "AU"
    }
  ],
  "ipcr_labels": [
    "G06Q2032",
    "G06F30346",
    "G06Q2040",
    "G06F301"
  ],
  "main_ipcr_label": "G06Q2032",
  "summary": "<SOH> SUMMARY <EOH>Disclosed embodiments include devices and methods for using gestures on a user device to interact with and obtain functionality from remote communication hub devices. In various embodiments a user device includes an accelerometer or other motion detection device and a wireless communications capability. The device is small enough to be placed conveniently about the person or unobtrusively attached to an object, and is configured to communicate with a communication hub device in order to perform context-dependent actions. In operation the user makes a gestural command to the device (for example by tapping it twice in quick succession). The device using an internal processor (or an external processor connected by a wireless link) interprets the gesture and undertakes some activity on the user's behalf because of the gesture. The gestural sensing device may be a motion switch, a multi-axis accelerometer, a video camera, a variable capacitance device, a magnetic field sensor, an electrical field sensor or other sensing device. When combined with business logic running on a remote computer system, the device can be used to implement a range of applications and services including information services, security services including access control, stored value or credit card electronic payment systems, points or objects in a game, remote controls for consumer electronics, retail loyalty schemes, industrial equipment and so forth.",
  "patent_number": "9547855",
  "abstract": "The use of gestures on a user device to interact with and obtain functionality from remote communication hub devices is disclosed. A user device includes an accelerometer or other motion detection device and a wireless communications capability. The device is small enough to be placed conveniently about the person and communicates with a communication hub device to perform context-dependent actions. A user makes a gestural command to the device. The device interprets the gesture and undertakes activity. The gestural sensing device may be a motion switch, a multi-axis accelerometer, a video camera, a variable capacitance device, a magnetic field sensor, an electrical field sensor etc. When combined with business logic running on a remote computer system, the device can be used to implement a range of applications and services.",
  "publication_number": "US20160247137A1-20160825",
  "_processing_info": {
    "original_size": 44807,
    "optimized_size": 3016,
    "reduction_percent": 93.27
  }
}