{
  "date_produced": "20171018",
  "publication_number": "US20170316340A1-20171102",
  "main_ipcr_label": "G06N9900",
  "decision": "PENDING",
  "application_number": "15142798",
  "inventor_list": [
    {
      "inventor_name_last": "Kafai",
      "inventor_name_first": "Mehran",
      "inventor_city": "Redwood City",
      "inventor_state": "CA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Eshghi",
      "inventor_name_first": "Kave",
      "inventor_city": "Los Altos",
      "inventor_state": "CA",
      "inventor_country": "US"
    }
  ],
  "abstract": "In some examples, a system includes an access engine and a hyperplane determination engine. The access engine may access a training vector set that includes sparse binary training vectors and a set of labels classifying each of the sparse binary training vectors through a positive label or a negative label. The hyperplane determination engine may initialize a candidate hyperplane vector and maintain a scoring vector including scoring vector elements to track separation variances of the sparse binary training vectors with respect to the candidate hyperplane vector. Through iterations of identifying, according to the scoring vector, a particular sparse binary training vector with a greatest separation variance with respect to the candidate hyperplane vector, the hyperplane determination engine may incrementally update the candidate hyperplane vector and incrementally update the scoring vector to adjust separation variances affected by updates to the candidate hyperplane vector.",
  "filing_date": "20160429",
  "patent_number": "None",
  "summary": "<SOH> BRIEF DESCRIPTION OF THE DRAWINGS <EOH>Certain examples are described in the following detailed description and in reference to the drawings. FIG. 1 shows an example of a system that supports hyperplane determination through sparse binary training vectors. FIG. 2 shows an example of an architecture that supports hyperplane determination through sparse binary training vectors. FIG. 3 shows a flow chart of an example method for hyperplane determination through sparse binary training vectors. FIG. 4 shows a flow chart of another example method for hyperplane determination through sparse binary training vectors. FIG. 5 shows an example of a system that supports hyperplane determination through sparse binary training vectors. detailed-description description=\"Detailed Description\" end=\"lead\"?",
  "date_published": "20171102",
  "title": "HYPERPLANE DETERMINATION THROUGH SPARSE BINARY TRAINING VECTORS",
  "ipcr_labels": [
    "G06N9900"
  ],
  "_processing_info": {
    "original_size": 55237,
    "optimized_size": 2496,
    "reduction_percent": 95.48
  }
}