{
  "date_produced": "20161026",
  "publication_number": "US20160328642A1-20161110",
  "main_ipcr_label": "G06N3063",
  "decision": "PENDING",
  "application_number": "15148706",
  "inventor_list": [
    {
      "inventor_name_last": "Himebaugh",
      "inventor_name_first": "Bryce D.",
      "inventor_city": "Bloomington",
      "inventor_state": "IN",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Mattes",
      "inventor_name_first": "Gregory W.",
      "inventor_city": "Nashville",
      "inventor_state": "TN",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Yoshida",
      "inventor_name_first": "Kenichi",
      "inventor_city": "Carmel",
      "inventor_state": "IN",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Bertram",
      "inventor_name_first": "Michael J.",
      "inventor_city": "Indianapolis",
      "inventor_state": "IN",
      "inventor_country": "US"
    }
  ],
  "abstract": "The present disclosure relates to sensor signal processing using an analog neural network. In an embodiment, a sensor signal processing system comprises: an analog neural network communicatively coupled to at least one sensor and a digital processor communicatively coupled to the analog neural network. The analog neural network is configured to receive a plurality of analog signals wherein the plurality of analog signals are associated with a plurality of sensor signals output by the at least one sensor. The analog neural network also determines an analog signal of the plurality of analog signals that is indicative of an event of interest and generates an activation signal to the digital processor in response to determining an analog signal is indicative of an event of interest. The digital processor is configured to receive the activation signal and transition to a higher-power state from a lower-power state in response to the activation signal.",
  "filing_date": "20160506",
  "patent_number": "None",
  "summary": "<SOH> SUMMARY <EOH>The embodiments disclosed herein present a possible solution to needs identified above. In an embodiment, a sensor signal processing system comprises: an analog neural network communicatively coupled to at least one sensor, the analog neural network being configured to: receive a plurality of analog signals, the plurality of analog signals being associated with a plurality of sensor signals output by the at least one sensor; determine an analog signal of the plurality of analog signals that is indicative of an event of interest; and generate an activation signal in response to determining an analog signal is indicative of an event of interest; and a digital processor communicatively coupled to the analog neural network, the digital processor being configured to: receive the activation signal; and transition to a higher-power state from a lower-power state in response to the activation signal. In another embodiment, a method of processing a sensor signal comprises: receiving, by an analog neural network, a plurality of analog signals, the plurality of analog signals being associated with a plurality of sensor signals output by at least one sensor; determining, by the analog neural network, an analog signal of the plurality of analog signals that is indicative of an event of interest; and sending, by the analog neural network, an activation signal to a digital processor for each analog signal that is determined to be indicative of an event of interest, the activation signal initiating a transition of the digital processor to a high-power state from a lower-power state. In even another embodiment, a circuit comprises: at least one sensor input communicatively coupled to at least one sensor output of at least one sensor; at least one memory input communicatively coupled to an external memory device; at least one digital processor output communicatively coupled to at least one digital processor input of a digital processor; an analog neural network bei...",
  "date_published": "20161110",
  "title": "SENSOR SIGNAL PROCESSING USING AN ANALOG NEURAL NETWORK",
  "ipcr_labels": [
    "G06N3063",
    "G06F132",
    "G06N308"
  ],
  "_processing_info": {
    "original_size": 71604,
    "optimized_size": 3987,
    "reduction_percent": 94.43
  }
}