{
  "date_produced": "20160817",
  "publication_number": "US20160253595A1-20160901",
  "main_ipcr_label": "G06N700",
  "decision": "ACCEPTED",
  "application_number": "15149888",
  "inventor_list": [
    {
      "inventor_name_last": "MATHUR",
      "inventor_name_first": "Ankur",
      "inventor_city": "Chicago",
      "inventor_state": "IL",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Barsamian",
      "inventor_name_first": "Paul M.",
      "inventor_city": "Glenview",
      "inventor_state": "IL",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Garrison",
      "inventor_name_first": "Daniel P.",
      "inventor_city": "Washington",
      "inventor_state": "MI",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Mullan",
      "inventor_name_first": "Pramila",
      "inventor_city": "Los Gatos",
      "inventor_state": "CA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Mendez",
      "inventor_name_first": "Juan C.",
      "inventor_city": "Weston",
      "inventor_state": "FL",
      "inventor_country": "US"
    }
  ],
  "abstract": "A device may receive sensor data from a sensor device located on a particular farm. The device may identify an alert, associated with the particular farm, based on the sensor data and using a model. The model may be created based on imagery data and numeric data relating to a group of farms. The device may determine, using the model, a recommended course of action to address the alert, and provide, to a user device associated with the particular farm, the recommended course of action.",
  "filing_date": "20160509",
  "patent_number": "9959507",
  "summary": "<SOH> SUMMARY <EOH>According to some possible implementations, a method may include receiving, by a processor of a device, data, the data including first data and second data, the first data being received from a plurality of sensor devices located on one or more farms, and the second data being received from one or more devices located external to the one or more farms; creating, by the processor and using the data, a model; receiving, by the processor, sensor data, the sensor data relating to a particular farm of the one or more farms; identifying, by the processor, an alert, associated with the particular farm, based on the sensor data and using the model; determining, by the processor and using the model, a recommended course of action to address the alert; and providing, by the processor and to a user device associated with the particular farm, the recommended course of action. According to some possible implementations, a computer-readable medium may store instructions, the instructions including a group of instructions, which, when executed by a processor of a device, cause the processor to receive data, the data including first data and second data, the first data including sensor-related data received from sensor devices located on one or more farms, and the second data including farming-related data received from devices that are located external to the one or more farms; create a model using the data; receive, after creating the model, sensor data, the sensor data being received from a sensor device located on a particular farm; identify an alert, associated with the particular farm, based on the sensor data and using the model; determine, using the model, a recommended course of action to address the alert; and provide, to a user device associated with the particular farm, the recommended course of action. According to some possible implementations, a device may include a memory to store instructions; and a processor to execute the instructions to receiv...",
  "date_published": "20160901",
  "title": "PRECISION AGRICULTURE SYSTEM",
  "ipcr_labels": [
    "G06N700",
    "G06F1750",
    "G06N9900"
  ],
  "_processing_info": {
    "original_size": 107951,
    "optimized_size": 3627,
    "reduction_percent": 96.64
  }
}