{
  "decision": "PENDING",
  "application_number": "15141677",
  "date_published": "20160825",
  "date_produced": "20160810",
  "title": "MANAGING GRID INTERACTION WITH INTERCONNECT SOCKET ADAPTER CONFIGURED FOR AN ENERGY STORAGE DEVICE",
  "filing_date": "20160428",
  "inventor_list": [
    {
      "inventor_name_last": "Parks",
      "inventor_name_first": "Ken",
      "inventor_city": "San Diego",
      "inventor_state": "CA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "COLBURN",
      "inventor_name_first": "Michael",
      "inventor_city": "San Diego",
      "inventor_state": "CA",
      "inventor_country": "US"
    }
  ],
  "ipcr_labels": [
    "G06Q3002"
  ],
  "main_ipcr_label": "G06Q3002",
  "summary": "<SOH> BRIEF SUMMARY OF THE EMBODIMENTS <EOH>According to various embodiments of the disclosed technology, a system for connecting multiple electrical devices to an electrical power grid is provided, comprising an interconnection meter socket adapter having a housing enclosing a set of electrical connections. The interconnection meter socket adapter may be configured to be coupled to a standard distribution panel and a standard electrical meter. A power regulation module coupled to a connector enables a plurality of electrical sources and/or sinks to be connected to the interconnection meter socket adapter. In various embodiments, the power regulation module may include one or more switches that may be disabled or enabled according to the net power exchange of the customer, as measured by the utility revenue meter. The power regulation module may obtain data on the net power production/consumption (from customer loads and power sources and/or sinks connected to the power regulation module) and determine which of the plurality of connected electrical devices (sources and/or sinks) to allow to connect to the power grid. Other features and aspects of the invention will become apparent from the following detailed description, taken in conjunction with the accompanying drawings, which illustrate, by way of example, the features in accordance with embodiments of the invention. The summary is not intended to limit the scope of the invention, which is defined solely by the claims attached hereto.",
  "patent_number": "None",
  "abstract": "A system for managing grid interaction with an energy storage device includes an energy exchange server, a plurality of energy storage devices, a plurality of interconnect socket adapters, and a plurality of energy exchange controllers, each energy exchange controller coupling to one of the plurality of interconnect socket adapters and dictating energy consumption based on energy pricing data received from the energy exchange server. Each interconnect socket adapter electrically couples to the power grid, one or more energy sinks, and an energy storage device, and the energy exchange server receives a real-time energy consumption data set, a real-time energy production data set, a set of environmental parameters and a starting energy price, and generates a current aggregate electricity demand value as a function of the real-time energy consumption data set and the environmental parameters, a current aggregate electricity supply value as a function of the real-time energy production dat...",
  "publication_number": "US20160247171A1-20160825",
  "_processing_info": {
    "original_size": 81816,
    "optimized_size": 3246,
    "reduction_percent": 96.03
  }
}