{
  "decision": "REJECTED",
  "application_number": "15145458",
  "date_published": "20161110",
  "date_produced": "20161026",
  "title": "METHOD, SYSTEM AND APPLICATION FOR ACKNOWLEDGING CONTENT AND PROVIDING REWARD OPPORTUNITIES TO A USER DEVICE",
  "filing_date": "20160503",
  "inventor_list": [
    {
      "inventor_name_last": "Salamon",
      "inventor_name_first": "Adam A.",
      "inventor_city": "Austin",
      "inventor_state": "TX",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Niyogi",
      "inventor_name_first": "Surojit",
      "inventor_city": "Austin",
      "inventor_state": "TX",
      "inventor_country": "US"
    }
  ],
  "ipcr_labels": [
    "G06Q3002"
  ],
  "main_ipcr_label": "G06Q3002",
  "summary": "<SOH> SUMMARY <EOH>The innovations described herein solve the aforementioned problems by rewarding users who engage with and acknowledge the content (e.g., advertisements) they encounter. It should be appreciated that while the following description refers to advertisements and advertisers, these are merely examples in which the disclosed principles may be applied to. That is, the disclosed principles also apply to other content such as e.g., audio, video, and textual content on any form of media in which the publisher/producer of said content desires someone to listen to, view, read and/or interact with. In accordance with the disclosed principles, by rewarding users who engage with and acknowledge the content (e.g., advertisements) they encounter, producers of the content (e.g., advertisers) increase user engagement with their content (e.g., advertisements) while users are provided a benefit as well. The disclosed embodiments relate to and provide for the acknowledgement of content (e.g., an advertisement) and any reward opportunities (e.g., discount coupons, gift cards, cash, currency, free items and virtual goods, videos, access to premium content, the unlocking of features to a website or other service, or various forms of vouchers or loyalty points that can be exchanged for any of the foregoing) when the user views/interacts/senses/engages with the content (e.g., advertisement). In the field of advertisements, for example, a direct reward may also be given by the advertiser, such as a free item, coupon, digital reward, digital coupon, voucher, etc., if the user acknowledges the advertisement. In one embodiment, the disclosed principles provide a method of acknowledging content from a user device. The method comprises using a component of the user device to detect an indicator associated with the content; transmitting, from the user device, an acknowledgement that the indicator has been detected, the acknowledgement being transmitted to a server computer adapte...",
  "patent_number": "None",
  "abstract": "Methods, systems and/or applications for providing reward and other opportunities to a user and/or user device for acknowledging content such as e.g., advertisements, audio, video, and textual content.",
  "publication_number": "US20160328730A1-20161110",
  "_processing_info": {
    "original_size": 32113,
    "optimized_size": 2945,
    "reduction_percent": 90.83
  }
}