{
  "decision": "ACCEPTED",
  "application_number": "15146848",
  "date_published": "20161110",
  "date_produced": "20161026",
  "title": "GLOBAL GEOGRAPHIC INFORMATION RETRIEVAL, VALIDATION, AND NORMALIZATION",
  "filing_date": "20160504",
  "inventor_list": [
    {
      "inventor_name_last": "Thompson",
      "inventor_name_first": "Stephen Michael",
      "inventor_city": "Oceanside",
      "inventor_state": "CA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Amtrup",
      "inventor_name_first": "Jan W.",
      "inventor_city": "Silver Spring",
      "inventor_state": "MD",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Macciola",
      "inventor_name_first": "Anthony",
      "inventor_city": "Irvine",
      "inventor_state": "CA",
      "inventor_country": "US"
    }
  ],
  "ipcr_labels": [
    "G06K900",
    "G06K948",
    "G06K903",
    "G06F1730",
    "G06K918"
  ],
  "main_ipcr_label": "G06K900",
  "summary": "<SOH> SUMMARY <EOH>According to one embodiment, a computer-implemented method includes: capturing an image of a document using a camera of a mobile device; performing optical character recognition (OCR) on the image of the document; extracting an identifier of the document from the image based at least in part on the OCR; comparing the identifier with content from one or more reference data sources, wherein the content from the one or more reference data sources comprises global address information; and determining whether the identifier is valid based at least in part on the comparison. In another embodiment, a computer program product includes a computer readable storage medium having stored/encoded thereon computer readable program instructions. The computer readable program instructions are configured to cause a processor, upon execution thereof, to: receive an image of a document; perform optical character recognition (OCR) on the image of the document; extract an identifier of the document from the image based at least in part on the OCR; compare the identifier with content from one or more reference data sources, wherein the content from the one or more reference data sources comprises global address information; and determine whether the identifier is valid based at least in part on the comparison. In still another embodiment, a computer-implemented method includes: capturing an image using a camera of a mobile device; classifying the image as an image of a document, wherein the classifying comprises: generating a first feature vector representative of the document, based on analyzing the image; and comparing the first feature vector to a plurality of reference feature matrices. The method further includes performing optical character recognition (OCR) on the image of the document; extracting an identifier of the document from the image based at least in part on the OCR; associating the image of the document with metadata descriptive of one or more of the do...",
  "patent_number": "9767354",
  "abstract": "According to one embodiment, a computer-implemented method includes: capturing an image of a document using a camera of a mobile device; performing optical character recognition (OCR) on the image of the document; extracting an identifier of the document from the image based at least in part on the OCR; comparing the identifier with content from one or more reference data sources, wherein the content from the one or more reference data sources comprises global address information; and determining whether the identifier is valid based at least in part on the comparison. The method may optionally include normalizing the extracted identifier, retrieving additional geographic information, correcting OCR errors, etc. based on comparing extracted information with reference content. Corresponding systems and computer program products are also disclosed.",
  "publication_number": "US20160328610A1-20161110",
  "_processing_info": {
    "original_size": 142240,
    "optimized_size": 3775,
    "reduction_percent": 97.35
  }
}