{
  "date_produced": "20170316",
  "publication_number": "US20170091612A1-20170330",
  "main_ipcr_label": "G06N300",
  "decision": "PENDING",
  "application_number": "15141716",
  "inventor_list": [
    {
      "inventor_name_last": "GRUBER",
      "inventor_name_first": "Thomas R.",
      "inventor_city": "Emerald Hills",
      "inventor_state": "CA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "SKINDER",
      "inventor_name_first": "Jason A.",
      "inventor_city": "Los Altos",
      "inventor_state": "CA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "VESCOVI",
      "inventor_name_first": "Marcos Regis",
      "inventor_city": "Cupertino",
      "inventor_state": "CA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "GUZZONI",
      "inventor_name_first": "Didier R.",
      "inventor_city": "Cupertino",
      "inventor_state": "CA",
      "inventor_country": "US"
    }
  ],
  "abstract": "A non-transitory computer-readable storage medium stores one or more programs including instructions, which when executed by an electronic device of a user, cause the electronic device to generate at least one experiential data structure accessible to a virtual assistant; modify at least one experiential data structure with one or more annotations associated with the experiential data structure, utilizing the virtual assistant; store at least one experiential data structure; receive a natural-language user request for service from the virtual assistant, and output information responsive to the user request using at least one experiential data structure. The experiential data structure is a data structure that includes an organized set of data associated with at least one of the user and the electronic device at a particular point in time.",
  "filing_date": "20160428",
  "patent_number": "None",
  "summary": "<SOH> BRIEF SUMMARY <EOH>Some techniques for remembering user data and generating recommendations, however, are generally cumbersome and inefficient. For example, existing techniques use a complex and time-consuming user interface, which may include multiple key presses or keystrokes. Such a user interface may be impractical or impossible in certain circumstances, such as when the user is operating a motor vehicle or has his or her hands full. Existing techniques require more time than necessary, wasting user time and device energy. This latter consideration is particularly important in battery-operated devices. Accordingly, there is a need for electronic devices with faster, more efficient methods and interfaces for remembering user data and generating recommendations. Such methods and interfaces optionally complement or replace other methods for remembering user data and generating recommendations based on a nonspecific, unstructured natural language request. Such methods and interfaces reduce the cognitive burden on a user and produce a more efficient human-machine interface. For battery-operated computing devices, such methods and interfaces conserve power and increase the time between battery charges. Example non-transitory computer-readable storage media are disclosed herein. An example non-transitory computer-readable storage medium stores one or more programs, the one or more programs comprising instructions, which when executed by an electronic device of a user, cause the electronic device to: generate, in response to a trigger, at least one experiential data structure accessible to a virtual assistant, wherein the experiential data structure comprises an organized set of data associated with at least one of the user and the electronic device at a particular point in time; store at least one experiential data structure; modify at least one experiential data structure with one or more annotations associated with the experiential data structure, utilizing the...",
  "date_published": "20170330",
  "title": "PROACTIVE ASSISTANT WITH MEMORY ASSISTANCE",
  "ipcr_labels": [
    "G06N300",
    "G10L1522",
    "G06F30488",
    "G06F30484",
    "G06F1724",
    "G06N504",
    "G06F1728"
  ],
  "_processing_info": {
    "original_size": 299549,
    "optimized_size": 3916,
    "reduction_percent": 98.69
  }
}