{
  "decision": "PENDING",
  "application_number": "15157127",
  "date_published": "20170112",
  "date_produced": "20161228",
  "title": "DYNAMICALLY SWITCHING BETWEEN DATA SOURCES",
  "filing_date": "20160517",
  "inventor_list": [
    {
      "inventor_name_last": "Hyde",
      "inventor_name_first": "Justin",
      "inventor_city": "Oakland",
      "inventor_state": "CA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Titmas",
      "inventor_name_first": "Jeff",
      "inventor_city": "Berkshire",
      "inventor_state": "",
      "inventor_country": "GB"
    },
    {
      "inventor_name_last": "Vasireddy",
      "inventor_name_first": "Gunaranjan",
      "inventor_city": "Hyderabad",
      "inventor_state": "",
      "inventor_country": "IN"
    }
  ],
  "ipcr_labels": [
    "G06F1730"
  ],
  "main_ipcr_label": "G06F1730",
  "summary": "<SOH> BRIEF SUMMARY OF THE DISCLOSURE <EOH>The following portion of this disclosure presents a simplified summary of one or more innovations, embodiments, and/or examples found within this disclosure for at least the purpose of providing a basic understanding of the subject matter. This summary does not attempt to provide an extensive overview of any particular embodiment or example. Additionally, this summary is not intended to identify key/critical elements of an embodiment or example or to delineate the scope of the subject matter of this disclosure. Accordingly, one purpose of this summary may be to present some innovations, embodiments, and/or examples found within this disclosure in a simplified form as a prelude to a more detailed description presented later. A further understanding of the nature of and equivalents to the subject matter of this disclosure (as well as any inherent or express advantages and improvements provided) should be realized in addition to the above section by reference to the remaining portions of this disclosure, any accompanying drawings, and the claims. In some examples, a method, implemented by a computing system, a system, and/or a computer-readable medium are provided. The method, system, and/or medium may be configured to identify a plurality of data sources comprising a first data source and a second data source of data to be loaded to a data warehouse, the first data source comprising a business intelligence server and the second data source comprising a local table of the computing system. In some examples, the method, system, and/or medium may receive information about the plurality of data sources and one or more data types of the data associated with the plurality of data sources and/or identify that the data is to be loaded from the second data source. Further, the method, system, and/or medium may also select a transport mechanism from among a plurality of selectable transport mechanisms based at least in part on the seco...",
  "patent_number": "None",
  "abstract": "In various embodiments, a data integration system is disclosed which enables dynamically switching between sources for loading data into a data warehouse by utilizing a source-dependent data store at the data warehouse.",
  "publication_number": "US20170011087A1-20170112",
  "_processing_info": {
    "original_size": 96192,
    "optimized_size": 3043,
    "reduction_percent": 96.84
  }
}