{
  "date_produced": "20171108",
  "publication_number": "US20170337486A1-20171123",
  "main_ipcr_label": "G06N9900",
  "decision": "PENDING",
  "application_number": "15157138",
  "inventor_list": [
    {
      "inventor_name_last": "Zang",
      "inventor_name_first": "Hui",
      "inventor_city": "Cupertino",
      "inventor_state": "CA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Wu",
      "inventor_name_first": "Zonghuan",
      "inventor_city": "Cupertino",
      "inventor_state": "CA",
      "inventor_country": "US"
    }
  ],
  "abstract": "A method includes receiving an original feature-set for training a machine learning system, the feature-set including multiple records each having a set of original features with original feature values and a result, querying a knowledge base based on the set of original features, receiving a set of knowledge features with knowledge feature values responsive to the querying of the knowledge base, generating a first augmented feature-set that includes the multiple records of the original feature set and the knowledge features for the multiple records, and training the machine learning system based on the first augmented feature-set.",
  "filing_date": "20160517",
  "patent_number": "None",
  "summary": "<SOH> SUMMARY <EOH>A method includes receiving an original feature-set for training a machine learning system, the feature-set including multiple records each having a set of original features with original feature values and a result, querying a knowledge base based on the set of original features, receiving a set of knowledge features with knowledge feature values responsive to the querying of the networked knowledge base, generating a first augmented feature-set that includes the multiple records of the original feature set and the knowledge features for the multiple records, and training the machine learning system based on the first augmented feature-set. A non-transitory machine readable storage device has instructions for execution by a processor of the machine to perform operations. The operations include receiving an original feature-set for training a machine learning system, the feature-set including multiple records each having a set of original features with original feature values and a result, querying a knowledge base based on the set of original features, receiving a set of knowledge features with knowledge feature values responsive to the querying of the knowledge base, generating a first augmented feature-set that includes the multiple records of the original feature set and the knowledge features for the multiple records, and training the machine learning system based on the first augmented feature-set. A device comprises a processor and a memory device coupled to the processor and having a program stored thereon for execution by the processor to perform operations. The operations include receiving an original feature-set for training a machine learning system, the feature-set including multiple records each having a set of original features with original feature values and a result, querying a knowledge base based on the set of original features, receiving a set of knowledge features with knowledge feature values responsive to the querying of th...",
  "date_published": "20171123",
  "title": "FEATURE-SET AUGMENTATION USING KNOWLEDGE ENGINE",
  "ipcr_labels": [
    "G06N9900",
    "G06N502",
    "G06F1730"
  ],
  "_processing_info": {
    "original_size": 45673,
    "optimized_size": 3340,
    "reduction_percent": 92.69
  }
}