{
  "decision": "PENDING",
  "application_number": "15158378",
  "date_published": "20171123",
  "date_produced": "20171108",
  "title": "DISTRIBUTED PRODUCT DEVELOPMENT AND FUNDING SYSTEM",
  "filing_date": "20160518",
  "inventor_list": [
    {
      "inventor_name_last": "Hairston",
      "inventor_name_first": "Jason",
      "inventor_city": "Dixon",
      "inventor_state": "CA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Hairston",
      "inventor_name_first": "Adam",
      "inventor_city": "Garden City",
      "inventor_state": "ID",
      "inventor_country": "US"
    }
  ],
  "ipcr_labels": [
    "G06Q1010",
    "G06F30484",
    "G06T1100",
    "G06Q3002",
    "G06T1160"
  ],
  "main_ipcr_label": "G06Q1010",
  "summary": "<SOH> SUMMARY <EOH>One aspect of the present disclosure relates to a method of distributed product development. The method may include outputting project data indicative of a product under development to a user, the project data including fixed feature data indicative of one of more fixed features of the product under development that are not changeable by the user and optional feature data indicative of one or more optional features of the product under development that are changeable by the user, receiving user preference data indicative of one or more optional features to include in a proposed product, generating proposed product data based at least in part on the project data and the user preference data, the proposed product data including the fixed feature data and a subset of the optional feature data indicated by the user preference data, generating an image of the proposed product based at least in part on the proposed product data, the image showing the features of the proposed product including the fixed features and the one or more optional features included in the user preference data, and outputting the image to the user. The method may also include generating the image by layering one or more feature images together. The method may also include selecting the one or more feature images from a feature image database based at least in part on the proposed product data. The image may be generated immediately upon receiving user preference data. The method may also include determining that the proposed product is ready to be reviewed by other users. The method may also include outputting the image to the plurality of users prior to receiving user feedback data, and receiving a plurality of votes from the plurality of users, the votes being used to determine which proposed product of the project will be produced. The method may also include determining whether the proposed product will be produced based at least in part on feedback data received from a plur...",
  "patent_number": "None",
  "abstract": "Technologies for distributed gear development is shown. Users generate proposed products through a development process based on project data. A community of users may provide feedback about the plurality of proposed products in a particular project. Conditional funding may be received from the users as a pre-purchase of a proposed product. A subset of the plurality of proposed projects may be selected for production.",
  "publication_number": "US20170337516A1-20171123",
  "_processing_info": {
    "original_size": 92573,
    "optimized_size": 3156,
    "reduction_percent": 96.59
  }
}