{
  "decision": "PENDING",
  "application_number": "15153719",
  "date_published": "20160908",
  "date_produced": "20160824",
  "title": "INFORMATION PROCESSING SYSTEM, POPULATION FLOW RATE ESTIMATION APPARATUS, COMPUTER-READABLE MEDIUM, INFORMATION PROCESSING METHOD AND METHOD OF ESTIMATING POPULATION FLOW RATE",
  "filing_date": "20160512",
  "inventor_list": [
    {
      "inventor_name_last": "YAMADA",
      "inventor_name_first": "Yutaka",
      "inventor_city": "Tokyo",
      "inventor_state": "",
      "inventor_country": "JP"
    },
    {
      "inventor_name_last": "SHIBAYAMA",
      "inventor_name_first": "Kazuhisa",
      "inventor_city": "Tokyo",
      "inventor_state": "",
      "inventor_country": "JP"
    },
    {
      "inventor_name_last": "SOGA",
      "inventor_name_first": "Yuji",
      "inventor_city": "Tokyo",
      "inventor_state": "",
      "inventor_country": "JP"
    },
    {
      "inventor_name_last": "WATAMORI",
      "inventor_name_first": "Hirofusa",
      "inventor_city": "Tokyo",
      "inventor_state": "",
      "inventor_country": "JP"
    }
  ],
  "ipcr_labels": [
    "H04W402",
    "G06Q3002"
  ],
  "main_ipcr_label": "H04W402",
  "summary": "<SOH> BRIEF DESCRIPTION OF THE DRAWINGS <EOH>FIG. 1 schematically shows one example of a communication status analyzing system 100 . FIG. 2 schematically shows one example of a communication terminal 110 . FIG. 3 schematically shows one example of a log information data table 300 . FIG. 4 schematically shows one example of an operation of the communication terminal 110 . FIG. 5 schematically shows another example of an operation of the communication terminal 110 . FIG. 6 schematically shows one example of a communication terminal 610 . FIG. 7 schematically shows one example of an operation of the communication terminal 610 FIG. 8 schematically shows one example of a communication terminal 810 . FIG. 9 schematically shows one example of an attribute analyzing unit 832 . FIG. 10 schematically shows one example of information processing in an attribute deciding unit 916 . FIG. 11 schematically shows one example of an information distributing system 1100 . FIG. 12 schematically shows one example of an information distributing server 1120 . FIG. 13 schematically shows one example of a presence probability information data table 1300 . FIG. 14 schematically shows one example of a presence probability information data table 1400 . FIG. 15 schematically shows one example of a presence probability information data table 1500 . FIG. 16 schematically shows one example of an information collecting server 120 . detailed-description description=\"Detailed Description\" end=\"lead\"?",
  "patent_number": "None",
  "abstract": "In conventional techniques, obtained information is not utilized sufficiently. A system comprises: a movement history acquiring unit that acquires one or more pieces of movement history information in which terminal identification information identifying each of one or more communication terminals, terminal positional information indicating a position at which a communication terminal is present, and acquisition clock time information indicating a clock time at which the terminal positional information has been acquired are associated; and a presence probability generating unit that generates, based on the one or more pieces of movement history information, each of one or more pieces of presence probability information about a probability that a communication terminal present in a first area from among one or more areas having predetermined geographical ranges is present in a second area from among the one or more areas after each of one or more predetermined periods of time has elapse...",
  "publication_number": "US20160261991A1-20160908",
  "_processing_info": {
    "original_size": 142429,
    "optimized_size": 3591,
    "reduction_percent": 97.48
  }
}