{
  "date_produced": "20171103",
  "publication_number": "US20170330102A1-20171116",
  "main_ipcr_label": "G06N9900",
  "decision": "PENDING",
  "application_number": "15152973",
  "inventor_list": [
    {
      "inventor_name_last": "BRUSH",
      "inventor_name_first": "RYAN ALAN",
      "inventor_city": "OVERLAND PARK",
      "inventor_state": "KS",
      "inventor_country": "US"
    }
  ],
  "abstract": "Methods, systems, and computer-storage media are provided for generating and populating a feature catalog for use in predictive modeling applications. The feature catalog may be populated with features extracted from data warehoused in a nested, hierarchical data structure. Extraction of features may result from applying a set of rules-based algorithms to warehoused data. Updated features may be extracted from a queue of data updates by applying the same rules-based algorithms. Predictions of future outcomes may be generated by applying predictive models to features.",
  "filing_date": "20160512",
  "patent_number": "None",
  "summary": "<SOH> SUMMARY <EOH>This Summary is provided to introduce a selection of concepts in a simplified form that are further described below in the Detailed Description. This Summary is not intended to identify key features or essential features of the claimed subject matter, nor is it intended to be used as an aid in determining the scope of the claimed subject matter. The present invention is defined by the claims. At a high level, the present disclosure is directed towards methods, systems, and computer-readable media for populating a feature catalog with features extracted from raw population data stored in a data warehousing structure. The feature catalog may be useful for providing features to predictive modelling applications that would otherwise be incapable of accessing the warehoused data. The data warehousing structure may be a nested, hierarchical structure. Features may be representations of the warehoused data. In some embodiments, features may include simplified projections of more complex warehoused data. The feature catalog may be an organized collection of one or more tables. The catalog may be accessible to predictive modeling applications which would not be able to readily extract data directly from the data warehousing structure. In some embodiments the predictive modeling applications are developed in a rule-based system. The predictive modeling applications may use the feature catalog to generate and improve data models. In some embodiments the predictive modeling applications are developed in a markup language, such as predictive model markup language (PMML), or a structures document, such as JavaScript Object Notation (JSON), or some other XML-based structure, which is both human and machine readable. After a predictive model is created and verified using features in the feature catalog, the model may be applied against new data to make useful predictions. Updated data may be structured and normalized similar to the warehoused data and a queue of ...",
  "date_published": "20171116",
  "title": "RULE-BASED FEATURE ENGINEERING, MODEL CREATION AND HOSTING",
  "ipcr_labels": [
    "G06N9900",
    "G06F1900"
  ],
  "_processing_info": {
    "original_size": 75950,
    "optimized_size": 3140,
    "reduction_percent": 95.87
  }
}