{
  "date_produced": "20171103",
  "publication_number": "US20170330098A1-20171116",
  "main_ipcr_label": "G06N700",
  "decision": "PENDING",
  "application_number": "15153021",
  "inventor_list": [
    {
      "inventor_name_last": "Best",
      "inventor_name_first": "Rodney D.",
      "inventor_city": "Valencia",
      "inventor_state": "CA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Johnson",
      "inventor_name_first": "Randy S.",
      "inventor_city": "O'Fallon",
      "inventor_state": "MO",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Northway",
      "inventor_name_first": "Tedrick N.",
      "inventor_city": "High Springs",
      "inventor_state": "FL",
      "inventor_country": "US"
    }
  ],
  "abstract": "From a sequence of answers, a last remaining answer is selected. A set of answers in the sequence of answers are responsive to a set of questions resolved during an analysis of a reported problem in a data processing environment. An answer pair is formed using the last remaining answer and another answer which immediately precedes the last remaining answer in the sequence of answers. A probability is determined of the last remaining answer being caused by the other answer in the answer pair. When the probability is below a threshold value, a review workflow is triggered corresponding to a portion of the analysis. The portion includes a question corresponding to an answer in the answer pair.",
  "filing_date": "20160512",
  "patent_number": "None",
  "summary": "<SOH> SUMMARY <EOH>The illustrative embodiments provide a method, system, and computer program product. An embodiment includes a method that selects, from a sequence of answers, a last remaining answer, wherein a set of answers in the sequence of answers are responsive to a set of questions resolved during an analysis of a reported problem in a data processing environment. The embodiment forms an answer pair using the last remaining answer and another answer which immediately precedes the last remaining answer in the sequence of answers. The embodiment determines a probability of the last remaining answer being caused by the other answer in the answer pair. The embodiment triggers, responsive to the probability being below a threshold value, a review workflow corresponding to a portion of the analysis, wherein the portion includes a question corresponding to an answer in the answer pair. An embodiment includes a computer program product. The computer program product includes one or more computer-readable storage devices, and program instructions stored on at least one of the one or more storage devices. An embodiment includes a computer system. The computer system includes one or more processors, one or more computer-readable memories, and one or more computer-readable storage devices, and program instructions stored on at least one of the one or more storage devices for execution by at least one of the one or more processors via at least one of the one or more memories.",
  "date_published": "20171116",
  "title": "ROOT CAUSE ANALYSIS VALIDATION THROUGH INVERSE CAUSATION",
  "ipcr_labels": [
    "G06N700",
    "G06N300"
  ],
  "_processing_info": {
    "original_size": 68362,
    "optimized_size": 3052,
    "reduction_percent": 95.54
  }
}