{
  "decision": "PENDING",
  "application_number": "15153975",
  "date_published": "20171116",
  "date_produced": "20171103",
  "title": "DETECTION AND WARNING OF IMPOSTER WEB SITES",
  "filing_date": "20160513",
  "inventor_list": [
    {
      "inventor_name_last": "Hardee",
      "inventor_name_first": "Christopher J.",
      "inventor_city": "Raleigh",
      "inventor_state": "NC",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Joroff",
      "inventor_name_first": "Steven R.",
      "inventor_city": "Minato-ku",
      "inventor_state": "",
      "inventor_country": "JP"
    },
    {
      "inventor_name_last": "Nesbitt",
      "inventor_name_first": "Pamela A.",
      "inventor_city": "Ridgefield",
      "inventor_state": "CT",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Schneider",
      "inventor_name_first": "Scott E.",
      "inventor_city": "Rolesville",
      "inventor_state": "NC",
      "inventor_country": "US"
    }
  ],
  "ipcr_labels": [
    "H04L2906",
    "G06K900",
    "G06K900",
    "G06K918"
  ],
  "main_ipcr_label": "H04L2906",
  "summary": "<SOH> SUMMARY <EOH>Embodiments are directed to a computer-implemented method of identifying an imposter web page. The method includes extracting, using a processor system, visited web page data from a visited web page. The method further includes determining, using the processor system, that the visited web page is an imposter web page, based at least in part on determining, using the processor system, that website location data of the visited web page does not match website location data of at least one legitimate web page, as well as determining that text data associated with image data of the visited web page matches text data associated with image data of the at least one legitimate web page. Embodiments are further directed to a system for identifying an imposter web page. The system includes a memory and a processor system communicatively coupled to the memory. The processor system is configured to perform a method that includes extracting visited web page data from a visited web page. The method further includes determining that the visited web page is an imposter web page, based at least in part on determining that website location data of the visited web page does not match web site location data of at least one legitimate web page, as well as determining that text data associated with image data of the visited web page matches text data associated with image data of the at least one legitimate web page. Embodiments are directed to a computer program product for identifying an imposter web page. The computer program product includes a computer readable storage medium having program instructions embodied therewith, wherein the computer readable storage medium is not a transitory signal per se. The program instructions are readable by a processor system to cause the processor system to perform a method that includes extracting visited web page data from a visited web page. The method further includes determining that the visited web page is an imposter web pa...",
  "patent_number": "None",
  "abstract": "Embodiments are directed to a computer-implemented method of identifying an imposter web page. The method includes extracting, using a processor system, visited web page data from a visited web page. The method further includes determining, using the processor system, that the visited web page is an imposter web page, based at least in part on determining, using the processor system, that website location data of the visited web page does not match website location data of at least one legitimate web page, as well as determining that text data associated with image data of the visited web page matches text data associated with image data of the at least one legitimate web page.",
  "publication_number": "US20170331855A1-20171116",
  "_processing_info": {
    "original_size": 59147,
    "optimized_size": 3712,
    "reduction_percent": 93.72
  }
}