{
  "decision": "PENDING",
  "application_number": "15153308",
  "date_published": "20160908",
  "date_produced": "20160824",
  "title": "Method and Apparatus for Tiered Storage",
  "filing_date": "20160512",
  "inventor_list": [
    {
      "inventor_name_last": "Clash",
      "inventor_name_first": "Daniel",
      "inventor_city": "Pittsburgh",
      "inventor_state": "PA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Kazar",
      "inventor_name_first": "Michael L.",
      "inventor_city": "Pittsburgh",
      "inventor_state": "PA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Boyles",
      "inventor_name_first": "John R.",
      "inventor_city": "Cranberry Township",
      "inventor_state": "PA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Butler",
      "inventor_name_first": "Jeffrey",
      "inventor_city": "Sewickley",
      "inventor_state": "PA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Hosteny, IV",
      "inventor_name_first": "Joseph",
      "inventor_city": "Pittsburgh",
      "inventor_state": "PA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Nydick",
      "inventor_name_first": "Daniel S.",
      "inventor_city": "Wexford",
      "inventor_state": "PA",
      "inventor_country": "US"
    }
  ],
  "ipcr_labels": [
    "H04L2908",
    "G06F1208",
    "G06F1730",
    "G06F306"
  ],
  "main_ipcr_label": "H04L2908",
  "summary": "<SOH> BRIEF SUMMARY OF THE INVENTION <EOH>The present invention pertains to a system for storing file data and directory data received over a network. The system comprises a network interface in communication with the network which receives NAS requests containing data to be written to files from the network. The system comprises a first type of storage. The system comprises a second type of storage different from the first type of storage. The system comprises a policy specification which specifies a first portion of one or more files' data which is less than all of the files' data is stored in the first type of storage and a second portion of the data which is less than all of the data of the files is stored in the second type of store. The system comprises a processing unit which executes the policy and causes the first portion to be stored in the first type of storage and a second portion to be stored in the second type of storage. The present invention pertains to a method for storing file data and directory data received over a network. The method comprises the steps of receiving NAS requests containing data to be written to files from the network at a network interface. There is the step of executing with a processing unit the policy specification which specifies a first portion of one or more files' data which is less than all of the files' data is stored in a first type of storage and a second portion of the data which is less than all of the data of the files stored in the second type of data which is different from the first type of storage. There is the step of causing with the processing unit the first portion to be stored in the first type of storage and the second portion to be stored in the second type of storage. The present invention pertains to a system for storing file data and directory data received over a network. The system comprises a network interface in communication with the network which receives the NAS requests from the network, includ...",
  "patent_number": "None",
  "abstract": "A system for storing file data and directory data received over a network includes a network interface in communication with the network which receives NAS requests containing data to be written to files from the network. The system includes a first type of storage. The system includes a second type of storage different from the first type of storage. The system includes a policy specification n which specifies a first portion of one or more files' data which is less than all of the files' data is stored in the first type of storage and a second portion of the data which is less than all of the data of the files is stored in the second type of store. The system comprises a processing unit which executes the policy and causes the first portion to be stored in the first type of storage and a second portion to be stored in the second type of storage. A method for storing file data and directory data received over a network.",
  "publication_number": "US20160261694A1-20160908",
  "_processing_info": {
    "original_size": 97151,
    "optimized_size": 4256,
    "reduction_percent": 95.62
  }
}