{
  "decision": "PENDING",
  "application_number": "15158114",
  "date_published": "20171123",
  "date_produced": "20171108",
  "title": "SYSTEM AND METHOD FOR TRANSMISSION OF APPOINTMENT DATA",
  "filing_date": "20160518",
  "inventor_list": [
    {
      "inventor_name_last": "SPENCER",
      "inventor_name_first": "Sandra",
      "inventor_city": "Melbourne",
      "inventor_state": "FL",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "SHOAFF",
      "inventor_name_first": "William",
      "inventor_city": "Melbourne",
      "inventor_state": "FL",
      "inventor_country": "US"
    }
  ],
  "ipcr_labels": [
    "G06Q1010",
    "H04L2908",
    "G06Q5022"
  ],
  "main_ipcr_label": "G06Q1010",
  "summary": "<SOH> SUMMARY <EOH>One embodiment provides a method for transmission of appointment data. The method includes receiving an available appointment at a server sent from a medical provider over a communications network. The server includes a processor and a memory that stores patient data and medical provider data. The processor is configured to prioritize a list of waiting patients for the available appointment based upon a priority value determined from the patient data and the medical provider data, identify a compatible patient for the available appointment based upon a highest priority on the list of waiting patients, generate an appointment alert that contains a date and time for the available appointment, format the appointment alert according to an appointment format, and transmit the formatted appointment alert over a wireless communication channel to a wireless device associated with the compatible patient based upon a destination address associated therewith. Another embodiment provides a system for transmission of appointment data. The system includes a server comprising a processor and a memory coupled thereto, where the server is configured to receive an available appointment sent from a medical provider over a communications network. The memory is configured to store patient data and medical provider data, and the processor is configured to prioritize a list of waiting patients for the available appointment based upon a priority value determined from the patient data and the medical provider data. In addition, the processor is configured to identify a compatible patient for the available appointment based upon a highest priority on the list of waiting patients, generate an appointment alert that contains a date and time for the available appointment, format the appointment alert according to an appointment format, and transmit the formatted appointment alert over a wireless communication channel to a wireless device associated with the compatible patient...",
  "patent_number": "None",
  "abstract": "A method for transmission of appointment data includes receiving an available appointment at a server sent from a medical provider over a communications network. The server includes a processor and a memory that stores patient data and medical provider data. The processor is configured to prioritize a list of waiting patients for the available appointment based upon a priority value determined from the patient data and the medical provider data, identify a compatible patient for the available appointment based upon a highest priority on the list of waiting patients, generate an appointment alert that contains a date and time for the available appointment, format the appointment alert according to an appointment format, and transmit the formatted appointment alert over a wireless communication channel to a wireless device associated with the compatible patient based upon a destination address associated therewith.",
  "publication_number": "US20170337520A1-20171123",
  "_processing_info": {
    "original_size": 50001,
    "optimized_size": 3644,
    "reduction_percent": 92.71
  }
}