{
  "date_produced": "20160824",
  "publication_number": "US20160260010A1-20160908",
  "main_ipcr_label": "G06N304",
  "decision": "ACCEPTED",
  "application_number": "15158472",
  "inventor_list": [
    {
      "inventor_name_last": "George",
      "inventor_name_first": "Dileep",
      "inventor_city": "Union City",
      "inventor_state": "CA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Kansky",
      "inventor_name_first": "Kenneth",
      "inventor_city": "Union City",
      "inventor_state": "CA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Phoenix",
      "inventor_name_first": "D Scott",
      "inventor_city": "Union City",
      "inventor_state": "CA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Marthi",
      "inventor_name_first": "Bhaskara",
      "inventor_city": "Union City",
      "inventor_state": "CA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Laan",
      "inventor_name_first": "Christopher",
      "inventor_city": "Union City",
      "inventor_state": "CA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Lehrach",
      "inventor_name_first": "Wolfgang",
      "inventor_city": "Union City",
      "inventor_state": "CA",
      "inventor_country": "US"
    }
  ],
  "abstract": "A system includes: a recursively architected network of sub-networks organized into a hierarchical layers; the sub-networks including at least a parent feature node, a pool node, a parent-specific child feature (PSCF) node, and a child feature node; the parent feature node of at least one sub-network configured with a selection function actionable on at least two pool nodes connected to the parent feature node of the at least one sub-network; the pool node of the at least one sub-network configured with a selection function actionable on at least two PSCF nodes connected to the pool node of the at least one sub-network; the PSCF node of the at least one sub-network configured to activate a connected child feature node; the child feature node connectable to at least a parent feature node of a sub-network at a lower hierarchical layer.",
  "filing_date": "20160518",
  "patent_number": "9607263",
  "summary": "<SOH> BRIEF DESCRIPTION OF THE FIGURES <EOH>FIGS. 1A and 1B are schematic representations of systems of a preferred embodiment; FIG. 2 is a schematic representation of a generalized representation of a system of a preferred embodiment; FIG. 3 is a schematic representation of a sub-network of a preferred embodiment; FIG. 4 is a schematic representation of a sub-network for generating patterns with lateral constraint nodes of a preferred embodiment; FIG. 5 is a schematic representation of a sub-network for generating patterns with external constraint nodes of a preferred embodiment; FIG. 6 is a schematic representation of a sub-network for generating patterns with temporal constraint nodes of a preferred embodiment; FIG. 7 is a schematic representation of a sub-network for inferring patterns of a preferred embodiment; FIG. 8 is a schematic representation of a network variation with two sub-networks sharing child feature nodes of a preferred embodiment; FIG. 9 is an exemplary schematic representation of a network variation with multiple sub-networks divided between two layers, some of which share child feature nodes; FIG. 10 is a schematic representation of a method for creating a network of a preferred embodiment; FIG. 11 is an exemplary implementation of a method for creation of a network; FIG. 12 is a schematic representation of a method for generating a pattern of a preferred embodiment; FIG. 13 is a schematic representation of a method for inferring patterns from a network of a preferred embodiment; FIG. 14 is a schematic representation of a network with a variety of constraint nodes. detailed-description description=\"Detailed Description\" end=\"lead\"?",
  "date_published": "20160908",
  "title": "SYSTEM AND METHOD FOR A RECURSIVE CORTICAL NETWORK",
  "ipcr_labels": [
    "G06N304",
    "G06N9900"
  ],
  "_processing_info": {
    "original_size": 90888,
    "optimized_size": 3834,
    "reduction_percent": 95.78
  }
}