{
  "date_produced": "20161102",
  "publication_number": "US20160335549A1-20161117",
  "main_ipcr_label": "G06N504",
  "decision": "PENDING",
  "application_number": "15155033",
  "inventor_list": [
    {
      "inventor_name_last": "Ahuja-Cogny",
      "inventor_name_first": "Shruti",
      "inventor_city": "Brooklyn",
      "inventor_state": "NY",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Cogny",
      "inventor_name_first": "Adrien",
      "inventor_city": "Brooklyn",
      "inventor_state": "NY",
      "inventor_country": "US"
    }
  ],
  "abstract": "A method for automating knowledge-based processes and operations includes a computer receiving an information dataset comprising knowledge and organizing the information dataset into a plurality of information elements. The computer maps the plurality of information elements into knowledge processes expressed in a knowledge process modeling language. Then, the computer converts the knowledge processes into a knowledge process executable language. Alternatively (or additionally), the computer translates the knowledge processes in a business process model language and converts the translated knowledge processes into a business process executable language.",
  "filing_date": "20160515",
  "patent_number": "None",
  "summary": "<SOH> SUMMARY <EOH>Embodiments of the present invention address and overcome one or more of the above shortcomings and drawbacks, by providing methods, systems, and apparatuses related to a knowledge process modeling and automation tool which enables end-to-end and full scope automation of various knowledge-related work and other knowledge-intensive operations. The proposed technology extends the general ideas of business process modeling to the domain of knowledge processes in order to provide for expertise sharing and work performance in the knowledge-based space. This technology also, in some embodiments, develops a specific knowledge process modeling language and a computer executable knowledge process language for such expertise sharing and work performance. Further, in some embodiments, the technology builds a specific kind of AI especially adapted to the field of knowledge processes and operations, due to the high level of structuring and logic in business related thought processes and the rigorous construction of knowledge processes, which can lead to decision making algorithms. The proposed technology applies to knowledge processes in the business and professional environments and is described within these environments. Additionally, it may also apply to knowledge activities in non-business environments as it caters to all knowledge based operations and their processes. According to some embodiments, a method for automating knowledge-based processes and operations includes a computer receiving an information dataset comprising knowledge and organizing the information dataset into a plurality of information elements. The computer maps the plurality of information elements into knowledge processes expressed in a knowledge process modeling language. Then, the computer converts the knowledge processes into a knowledge process executable language. Alternatively (or additionally), the computer translates the knowledge processes in a business process model languag...",
  "date_published": "20161117",
  "title": "KNOWLEDGE PROCESS MODELING AND AUTOMATION",
  "ipcr_labels": [
    "G06N504",
    "G06N9900"
  ],
  "_processing_info": {
    "original_size": 70614,
    "optimized_size": 3352,
    "reduction_percent": 95.25
  }
}