{
  "decision": "PENDING",
  "application_number": "15155771",
  "date_published": "20180118",
  "date_produced": "20180103",
  "title": "Reverse Digital Information Disbursement Method",
  "filing_date": "20160714",
  "inventor_list": [
    {
      "inventor_name_last": "Aldridge",
      "inventor_name_first": "James Elliott",
      "inventor_city": "East Rutherford",
      "inventor_state": "NJ",
      "inventor_country": "US"
    }
  ],
  "ipcr_labels": [
    "G06Q1010"
  ],
  "main_ipcr_label": "G06Q1010",
  "summary": "<SOH> BRIEF SUMMARY OF THE INVENTION <EOH>The invention (Portrayed in this Patent as the iCard phone application, but is not limited to the iCard iOS and Android phone application) is a digital medium that connects stored digital information to a Container-Name (iCard ID) that is to be requested by any person who is aware of that specific Container-Name (iCard ID). In this process, there are two active individuals using the invention: The Owner of the Container-Name (iCard ID) and the Recipient of the information. Specific information connected to the Container-Name (iCard ID) is only transferred to the Recipient after the Owner (of the Container-Name) sends the Recipient the specific information attached to the Container-Name (iCard ID) by choosing which information to release only after the Recipient has first requested information from the Owner. Presented through the iCard Phone Application there are three (but not limited to only three in future designs) distinct categories that are set up to determine what list of information should be sent to the Recipient from the Owner. The first iCard category is labeled Business, and it establishes which information from the list of digital information is directly connected to the Business category. Therefore, if the Recipient is to ask the Owner for information (using an iCard Request), and the Owner chooses to only send Business related material to the Recipient, then the Recipient will receive all of the information connected to the Container-Name (iCard ID) that correlates with the Business category. The second iCard category is labeled Personal, and it establishes which information from the list of digital information is directly connected to the Personal category. Therefore, if the Recipient is to ask the Owner for information (using an iCard Request), and the Owner chooses to only send Personal related material to the Recipient, then the Recipient will receive all of the information connected to the Container-Name ...",
  "patent_number": "None",
  "abstract": "Action 1—Design a database of information whose main overall title is considered the container-ID. In this database, create titled options that follow vertically one after the other. Action 2—Design a correlating database that has the ability to insert each single option into an unlimited amount of distinguished categories. Action 3—Decide which options correlate with which categories. Action 4—Design an online database that allows a user to sync their online profile with another user's online profile by providing the container-ID, which will allow for the owner of the container-ID to then send all of the information contained in the owner's options by the owner selecting which category that the owner would like to send to the recipient once the recipient has requested information from the owner. Action 5—Send and receive the information.",
  "publication_number": "US20180018631A1-20180118",
  "_processing_info": {
    "original_size": 24903,
    "optimized_size": 3428,
    "reduction_percent": 86.23
  }
}