{
  "decision": "PENDING",
  "application_number": "15158505",
  "date_published": "20171123",
  "date_produced": "20171108",
  "title": "DEVICE FOR GENERATING AUDIO OUTPUT",
  "filing_date": "20160518",
  "inventor_list": [
    {
      "inventor_name_last": "Kim",
      "inventor_name_first": "Lae-Hoon",
      "inventor_city": "San Diego",
      "inventor_state": "CA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Park",
      "inventor_name_first": "Hyun Jin",
      "inventor_city": "San Diego",
      "inventor_state": "CA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Visser",
      "inventor_name_first": "Erik",
      "inventor_city": "San Diego",
      "inventor_state": "CA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Peri",
      "inventor_name_first": "Raghuveer",
      "inventor_city": "San Diego",
      "inventor_state": "CA",
      "inventor_country": "US"
    }
  ],
  "ipcr_labels": [
    "H04R504",
    "H04R5033",
    "G06F316",
    "H04R2900"
  ],
  "main_ipcr_label": "H04R504",
  "summary": "<SOH> SUMMARY <EOH>In a particular aspect, a headset device includes a first earpiece configured to receive a reference sound and to generate a first reference audio signal based on the reference sound. The headset device further includes a second earpiece configured to receive the reference sound and to generate a second reference audio signal based on the reference sound. The headset device further includes a controller coupled to the first earpiece and to the second earpiece. The controller is configured to generate a first signal and a second signal based on a phase relationship between the first reference audio signal and the second reference audio signal. The controller is further configured to output the first signal to the first earpiece and output the second signal to the second earpiece. In a particular aspect, a headset device includes a first earpiece. The first earpiece includes a first reference microphone configured to generate a first reference audio signal based on a reference sound from a source external to the first earpiece. The first earpiece further includes a first speaker and a first feedback microphone configured to generate a first feedback audio signal based on an output of the first speaker. The headset device further includes a second earpiece and an adaptive filter. The adaptive filter is configured to provide a filtered audio signal to the first speaker, the filtered audio signal based on the first reference audio signal and the first feedback audio signal and based on an indication of sound detected at the second earpiece. In a particular aspect, a headset device includes a first earpiece. The first earpiece includes a first reference microphone configured to generate a first reference audio signal based on a reference sound from a source external to the first earpiece. The first earpiece further includes a first user-customized filter configured to generate a first customized audio signal based on the first reference audio signal. Th...",
  "patent_number": "None",
  "abstract": "A headset device includes a first earpiece configured to receive a reference sound and to generate a first reference audio signal based on the reference sound. The headset device further includes a second earpiece configured to receive the reference sound and to generate a second reference audio signal based on the reference sound. The headset device further includes a controller coupled to the first earpiece and to the second earpiece. The controller is configured to generate a first signal and a second signal based on a phase relationship between the first reference audio signal and the second reference audio signal. The controller is further configured to output the first signal to the first earpiece and output the second signal to the second earpiece.",
  "publication_number": "US20170339491A1-20171123",
  "_processing_info": {
    "original_size": 85918,
    "optimized_size": 3762,
    "reduction_percent": 95.62
  }
}