{
  "date_produced": "20171103",
  "publication_number": "US20170330069A1-20171116",
  "main_ipcr_label": "G06N3063",
  "decision": "PENDING",
  "application_number": "15152528",
  "inventor_list": [
    {
      "inventor_name_last": "Liu",
      "inventor_name_first": "Chun-Chen",
      "inventor_city": "San Diego",
      "inventor_state": "CA",
      "inventor_country": "US"
    }
  ],
  "abstract": "A multi-layer artificial neural network including a plurality of artificial neurons, a storage device, and a controller is provided. The plurality of artificial neurons are used for performing computation based on plural parameters. The storage device is used for storing plural sets of parameters, each set of parameters being corresponding to a respective layer. At a first time instant, the controller controls the storage device to provide a set of parameters corresponding to a first layer to the plurality of artificial neurons so that the plurality of artificial neurons form at least part of the first layer. At a second time instant, the controller controls the storage device to provide a set of parameters corresponding to a second layer to the plurality of artificial neurons so that the plurality of artificial neurons format least part of the second layer.",
  "filing_date": "20160511",
  "patent_number": "None",
  "summary": "<SOH> SUMMARY OF THE INVENTION <EOH>To solve the aforementioned problem, a new multi-layer artificial neural network and controlling method thereof are provided. One embodiment according to the invention is a multi-layer artificial neural network including a plurality of artificial neurons, a storage device, and a controller. The plurality of artificial neurons are used for performing computation based on plural parameters. The storage device is used for storing plural sets of parameters; each set of parameters is corresponding to a respective layer. At a first time instant, the controller controls the storage device to provide a set of parameters corresponding to a first layer to the plurality of artificial neurons so that the plurality of artificial neurons format least part of the first layer. At a second time instant, the controller controls the storage device to provide a set of parameters corresponding to a second layer to the plurality of artificial neurons so that the plurality of artificial neurons form at least part of the second layer. Another embodiment according to the invention is a controlling method for a multi-layer artificial neural network. The multi-layer artificial neural network includes a plurality of artificial neurons for performing computation based on plural parameters. According to the controlling method, at a first time instant, a set of parameters corresponding to a first layer is provided to the plurality of artificial neurons so that the plurality of artificial neurons form at least part of the first layer. Further, at a second time instant, a set of parameters corresponding to a second layer is provided to the plurality of artificial neurons so that the plurality of artificial neurons form at least part of the second layer. Another embodiment according to the invention is a non-transitory computer-readable storage medium encoded with a computer program for controlling a multi-layer artificial neural network. The multi-layer artificia...",
  "date_published": "20171116",
  "title": "MULTI-LAYER ARTIFICIAL NEURAL NETWORK AND CONTROLLING METHOD THEREOF",
  "ipcr_labels": [
    "G06N3063",
    "G06N304"
  ],
  "_processing_info": {
    "original_size": 43253,
    "optimized_size": 3440,
    "reduction_percent": 92.05
  }
}