{
  "date_produced": "20160831",
  "publication_number": "US20160267385A1-20160915",
  "main_ipcr_label": "G06N502",
  "decision": "PENDING",
  "application_number": "15158878",
  "inventor_list": [
    {
      "inventor_name_last": "SHIRCLIFF",
      "inventor_name_first": "Thomas",
      "inventor_city": "Charlotte",
      "inventor_state": "NC",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "MURCHISON",
      "inventor_name_first": "Robert",
      "inventor_city": "Charlotte",
      "inventor_state": "NC",
      "inventor_country": "US"
    }
  ],
  "abstract": "An information analytic system including a plurality of automation units each connected to a plurality of monitoring and control devices and connected to a network and configured to collect environmental information, a facility information unit connected to the network and configured to store information relating to locations of devices related to the facility, an information gathering unit connected to the network and communicatively coupled to at least one of the automation units and the facility information unit that retrieves a listing of all monitoring and control devices connected to each automation unit and relates each monitoring and control device to at least one device in at least one facility, an information analysis unit that analyzes the information from the facility information unit and logically relates the devices in the facility based on physical locations of the devices in the facility.",
  "filing_date": "20160519",
  "patent_number": "None",
  "summary": "<SOH> SUMMARY OF THE INVENTION <EOH>Various embodiments of the present disclosure provide an information analytic system including an information gathering unit configured to gather at least one piece of information from at least one of a plurality of devices connected to a network, an information analysis unit configured to analyze the gathered information, and a rule generation unit configured to generate at least one rule based on the analysis performed by the information analysis unit. The rule analysis unit is configured to analyze each generated rule to identify the rules that can be applied to the corresponding piece information, and to apply the identified rule to the corresponding piece of information. The rule analysis unit is also configured to analyze unapplied rules to determine what additional information is required to apply each unapplied rule to at least one piece of information. Another embodiment includes an information analysis unit for analyzing information gathered from a network, the information analysis unit includes a memory and a processor that execute an application. The application gathers at least one piece of information from at least one of a plurality of devices connected to the network, analyzes the gathered information, generates at least one rule based on the analysis of each piece of information, analyzes each generated rule to identify each rule that can be applied to a corresponding piece of information, applies each identified rule to the corresponding piece of information, and analyzes each unapplied rule to determine what additional information is required to apply each unapplied rule to at least one piece of information. Other objects, features, and advantages of the disclosure will be apparent from the following description, taken in conjunction with the accompanying sheets of drawings, wherein like numerals refer to like parts, elements, components, steps, and processes.",
  "date_published": "20160915",
  "title": "BUILDING ANALYTIC DEVICE",
  "ipcr_labels": [
    "G06N502",
    "H04L2908",
    "G05B1101"
  ],
  "_processing_info": {
    "original_size": 49320,
    "optimized_size": 3551,
    "reduction_percent": 92.8
  }
}