{
  "date_produced": "20160824",
  "publication_number": "US20160260012A1-20160908",
  "main_ipcr_label": "G06N3063",
  "decision": "REJECTED",
  "application_number": "15157035",
  "inventor_list": [
    {
      "inventor_name_last": "HUNZINGER",
      "inventor_name_first": "Jason Frank",
      "inventor_city": "San Diego",
      "inventor_state": "CA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "CAREY",
      "inventor_name_first": "Ryan Michael",
      "inventor_city": "San Diego",
      "inventor_state": "CA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "CHAN",
      "inventor_name_first": "Victor Hokkiu",
      "inventor_city": "Del Mar",
      "inventor_state": "CA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "WIERZYNSKI",
      "inventor_name_first": "Casimir Matthew",
      "inventor_city": "La Jolla",
      "inventor_state": "CA",
      "inventor_country": "US"
    }
  ],
  "abstract": "A method for creating and maintaining short-term memory using short-term plasticity, includes changing a gain of a synapse based on pre synaptic spike activity without regard to postsynaptic spike activity. The method also includes calculating the gain based on a continuously updated synaptic state variable associated with the short-term plasticity.",
  "filing_date": "20160517",
  "patent_number": "None",
  "summary": "<SOH> SUMMARY <EOH>In one aspect of the present disclosure, a method for creating and maintaining short-term memory using short-term plasticity is presented. The method includes changing a gain of a synapse based on presynaptic spike activity without regard to postsynaptic spike activity. Another aspect of the present disclosure is directed to an apparatus including means for changing a gain of a synapse based on presynaptic spike activity without regard to postsynaptic spike activity. In another aspect of the present disclosure, a computer program product for creating and maintaining short-term memory using short-term plasticity is disclosed. The computer program product has a non-transitory computer-readable medium. The computer readable medium has non-transitory program code recorded thereon, which, when executed by the processor(s), causes the processor(s) to perform operations of changing a gain of a synapse based on presynaptic spike activity without regard to postsynaptic spike activity. Another aspect discloses a wireless communication device having a memory and at least one processor coupled to the memory. The processor(s) is configured to change a gain of a synapse based on presynaptic spike activity without regard to postsynaptic spike activity. In yet another aspect of the present disclosure, a method for creating and maintaining short-term memory using short-term plasticity is presented. The method includes storing state information in a synapse based on presynaptic activity. The method further includes retrieving the state information as postsynaptic activity. Another aspect of the present disclosure is directed to an apparatus including means for storing state information in a synapse based on presynaptic activity. The apparatus also includes means for retrieving the state information as postsynaptic activity. In another aspect of the present disclosure, a computer program product for creating and maintaining short-term memory using short-term plastic...",
  "date_published": "20160908",
  "title": "SHORT-TERM SYNAPTIC MEMORY BASED ON A PRESYNAPTIC SPIKE",
  "ipcr_labels": [
    "G06N3063",
    "G06N308"
  ],
  "_processing_info": {
    "original_size": 87852,
    "optimized_size": 3378,
    "reduction_percent": 96.15
  }
}