{
  "date_produced": "20161102",
  "publication_number": "US20160335543A1-20161117",
  "main_ipcr_label": "G06N502",
  "decision": "PENDING",
  "application_number": "15153404",
  "inventor_list": [
    {
      "inventor_name_last": "GOLDSTEIN",
      "inventor_name_first": "Boris",
      "inventor_city": "New York",
      "inventor_state": "NY",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "GOLDSTEIN",
      "inventor_name_first": "David",
      "inventor_city": "New York",
      "inventor_state": "NY",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "BAKHAREVA",
      "inventor_name_first": "Milla",
      "inventor_city": "New York",
      "inventor_state": "NY",
      "inventor_country": "US"
    }
  ],
  "abstract": "This invention provides a computer method and system for interactive administration of medical cannabinoid treatments. The invention also provides information on cannabinoid product availability and geographical information. Medical professionals, cannabis growers, cannabis manufacturers, and other stakeholders can use this computer method and system to study trends, efficacy, and other information pertinent to the medical cannabis market.",
  "filing_date": "20160512",
  "patent_number": "None",
  "summary": "<SOH> SUMMARY OF THE INVENTION <EOH>This invention generally relates to databases, computer methods, and systems to carry out the computer methods, wherein the databases store information relating to various medical marijuana and cannabinoid products, various medical conditions treatable by medical marijuana and cannabinoid. The systems provide interactive means for various users to receive treatment, locate and supply products relating medical marijuana and cannabinoid therapy. The systems also analyze information collected from user interface modules to supply pattern to medical professionals and other stakeholders in the medical marijuana market. According to embodiments, this invention relates to a method to provide medical cannabis diagnosis, treatment, information, and data analysis, including: displaying questions in natural language and receiving at least one answer from a user at a user interface; converting the at least one answer to computer readable data by a processor; processing the computer readable data by artificial intelligence reasoning using data from at least one knowledge source containing medical cannabis knowledge to produce at least one output; converting the at least one output into natural language; and displaying the at least one output in natural language at a user interface. In some embodiments, in this method, the at least one answer is in natural language and the processor is a natural language processor. The knowledge source includes data from the Metathesaurus, the Semantic Network, and the Medical Marijuana Ontology; and the Medical Marijuana Ontology database includes medical marijuana data provided in computer readable files. In some embodiments, the user interface in this method is a computing article, which may be a desktop computer, a laptop computer, a smart phone, a tablet, or a kiosk computer. The displayed questions in this method are adapted to the user type, which may be medical cannabis users, medical professionals, can...",
  "date_published": "20161117",
  "title": "METHOD AND SYSTEM FOR MEDICAL CANNABINOID TREATMENT AND PRODUCT SELECTION",
  "ipcr_labels": [
    "G06N502",
    "G06F1900",
    "G06F1728"
  ],
  "_processing_info": {
    "original_size": 57476,
    "optimized_size": 3326,
    "reduction_percent": 94.21
  }
}