{
  "decision": "PENDING",
  "application_number": "15156809",
  "date_published": "20171123",
  "date_produced": "20171108",
  "title": "Triangle Rendering Mechanism",
  "filing_date": "20160517",
  "inventor_list": [
    {
      "inventor_name_last": "Bar-On",
      "inventor_name_first": "Tomer",
      "inventor_city": "Petah Tikva",
      "inventor_state": "",
      "inventor_country": "IL"
    }
  ],
  "ipcr_labels": [
    "G06T1520",
    "G06T1530",
    "G06T1140",
    "G06T1720",
    "G06T120"
  ],
  "main_ipcr_label": "G06T1520",
  "summary": "<SOH> BRIEF DESCRIPTION OF THE DRAWINGS <EOH>Embodiments are illustrated by way of example, and not by way of limitation, in the figures of the accompanying drawings in which like reference numerals refer to similar elements. FIG. 1 is a block diagram of a processing system, according to an embodiment. FIG. 2 is a block diagram of an embodiment of a processor having one or more processor cores, an integrated memory controller, and an integrated graphics processor. FIG. 3 is a block diagram of a graphics processor, which may be a discrete graphics processing unit, or may be a graphics processor integrated with a plurality of processing cores. FIG. 4 is a block diagram of a graphics processing engine of a graphics processor in accordance with some embodiments. FIG. 5 is a block diagram of another embodiment of a graphics processor. FIG. 6 illustrates thread execution logic including an array of processing elements employed in some embodiments of a graphics processing engine. FIG. 7 is a block diagram illustrating a graphics processor instruction formats according to some embodiments. FIG. 8 is a block diagram of another embodiment of a graphics processor. FIG. 9A is a block diagram illustrating a graphics processor command format according to an embodiment and FIG. 9B is a block diagram illustrating a graphics processor command sequence according to an embodiment. FIG. 10 illustrates exemplary graphics software architecture for a data processing system according to some embodiments. FIG. 11 is a block diagram illustrating an IP core development system that may be used to manufacture an integrated circuit to perform operations according to an embodiment. FIG. 12 is a block diagram illustrating an exemplary system on a chip integrated circuit that may be fabricated using one or more IP cores, according to an embodiment. FIG. 13 is a block diagram illustrating an exemplary graphics processor of a system on a chip integrated circuit that may be fabricated using one or mor...",
  "patent_number": "None",
  "abstract": "A mechanism for efficient triangle rendering is described. A method of embodiments, as described herein, includes detecting a plurality of triangles during rendering of a digital image, computing an error bound as a function of depth value gradients and determining whether one or more of the plurality of triangles relative to a projection screen based on the error bound computation.",
  "publication_number": "US20170337728A1-20171123",
  "_processing_info": {
    "original_size": 115869,
    "optimized_size": 2950,
    "reduction_percent": 97.45
  }
}