{
  "date_produced": "20171108",
  "publication_number": "US20170337476A1-20171123",
  "main_ipcr_label": "G06N502",
  "decision": "PENDING",
  "application_number": "15158409",
  "inventor_list": [
    {
      "inventor_name_last": "Gordon",
      "inventor_name_first": "John C.",
      "inventor_city": "Newcastle",
      "inventor_state": "WA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Keskin",
      "inventor_name_first": "Cem",
      "inventor_city": "Seattle",
      "inventor_state": "WA",
      "inventor_country": "US"
    }
  ],
  "abstract": "Emotional/cognitive state presentation is described. When two or more users, each using a device configured to present emotional/cognitive state data, are in proximity to one another, each device communicates an emotional/cognitive state of the user of the device to another device. Upon receiving data indicating an emotional/cognitive state of another user, an indication of the emotional/cognitive state of the user is presented.",
  "filing_date": "20160518",
  "patent_number": "None",
  "summary": "<SOH> SUMMARY <EOH>This disclosure describes techniques for emotional/cognitive state-triggered recording. In an example, one or more sensors gather sensor data while a camera captures video content to a buffer. Based on the sensor data, an emotional or cognitive state of a user is determined. Upon detecting a change in the emotional/cognitive state of the user, a video segment is created based on the video content currently in the buffer. Additional video content may be captured and added to the video segment, for example, until another change in the emotional or cognitive state of the user is detected. In this way, video segments are created, which correspond to periods of time during which a user experienced a change in an emotional or cognitive state. For example, while watching a child's sporting event, if the child scores a point, causing the user (the parent) to get excited, happy, or proud, a video segment will be created and stored that includes a few minutes prior to and after the child scored the point. This disclosure also describes an emotional/cognitive state presentation system, which enables users to dynamically and automatically share their emotional or cognitive state with another user using an electronic device. For example, two users with a trusted relationship, may each be using a device configured to enable emotional/cognitive state presentation. Sensor data may be gathered in association with each user, which is used to determine a current emotional or cognitive state of the respective user. The data is then shared and presented, enabling each user to be aware of the other user's current emotional or cognitive state. This Summary is provided to introduce a selection of concepts in a simplified form that are further described below in the Detailed Description. This Summary is not intended to identify key or essential features of the claimed subject matter, nor is it intended to be used as an aid in determining the scope of the claimed subject m...",
  "date_published": "20171123",
  "title": "EMOTIONAL/COGNITIVE STATE PRESENTATION",
  "ipcr_labels": [
    "G06N502",
    "G06T1900"
  ],
  "_processing_info": {
    "original_size": 141454,
    "optimized_size": 3114,
    "reduction_percent": 97.8
  }
}