{
  "decision": "ACCEPTED",
  "application_number": "15157824",
  "date_published": "20170202",
  "date_produced": "20170119",
  "title": "COMPUTER-IMPLEMENTED METHOD AND SYSTEM FOR EXECUTING ANDROID APPS NATIVELY ON ANY ENVIRONMENT",
  "filing_date": "20160518",
  "inventor_list": [
    {
      "inventor_name_last": "KOSMISKAS",
      "inventor_name_first": "Mario",
      "inventor_city": "San Mateo",
      "inventor_state": "CA",
      "inventor_country": "US"
    }
  ],
  "ipcr_labels": [
    "G06F944",
    "G06F945"
  ],
  "main_ipcr_label": "G06F944",
  "summary": "<SOH> SUMMARY <EOH>The above-mentioned needs are met by a computer-implemented method, computer program product and system for executing Android apps natively on any environment. An example of a computer-implemented method for executing Android apps natively on any environment includes converting one or more Android applications to a binary format of other applications in the Host Operating System, wherein the Android applications are in one of a source format and a binary format. Further, the computer-implemented method includes replacing all equivalent components from a standard Android environment with ones provided by the Host OS thereby using the Host Operating System's capabilities. Furthermore, the computer-implemented method includes executing Android applications natively by a Host Operating System. Moreover, the computer-implemented method includes mixing Android generated with content created by the Host Operating System to generate a final screen, wherein the user views and interacts with the final screen. An example of a computer-program product for executing Android apps natively on any environment includes converting one or more Android applications to a binary format of other applications in the Host Operating System, wherein the Android applications are in one of a source format and a binary format. Further, the computer-program product includes replacing all equivalent components from a standard Android environment with ones provided by the Host OS thereby using the Host Operating System's capabilities. Furthermore, the computer-program product includes executing Android applications natively by a Host Operating System. Moreover, the computer-implemented method includes mixing Android generated with content created by the Host Operating System to generate a final screen, wherein the user views and interacts with the final screen. An example of a system for executing Android apps natively on any environment includes a computing device operated by a ...",
  "patent_number": "9875099",
  "abstract": "A computer-implemented method and system for executing Android apps natively on any environment. The computer-implemented method includes converting one or more Android applications to a binary format of other applications in the Host Operating System, wherein the Android applications are in one of a source format and a binary format. Further, the computer-implemented method includes replacing all equivalent components from a standard Android environment with ones provided by the Host OS thereby using the Host Operating System's capabilities. Furthermore, the computer-implemented method includes executing Android applications natively by a Host Operating System. Moreover, the computer-implemented method includes mixing Android generated with content created by the Host Operating System to generate a final screen, wherein the user views and interacts with the final screen.",
  "publication_number": "US20170031680A1-20170202",
  "_processing_info": {
    "original_size": 56871,
    "optimized_size": 3483,
    "reduction_percent": 93.88
  }
}