{
  "decision": "PENDING",
  "application_number": "15155233",
  "date_published": "20160908",
  "date_produced": "20160824",
  "title": "METHOD OF AGGREGATING BUSINESS AND SOCIAL NETWORKS",
  "filing_date": "20160516",
  "inventor_list": [
    {
      "inventor_name_last": "Mathew",
      "inventor_name_first": "Ashvin J.",
      "inventor_city": "Kirkland",
      "inventor_state": "WA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Hargarten",
      "inventor_name_first": "Christopher S.",
      "inventor_city": "Seattle",
      "inventor_state": "WA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Azimi-Garakani",
      "inventor_name_first": "Navid",
      "inventor_city": "Redmond",
      "inventor_state": "WA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Carvallo",
      "inventor_name_first": "Carlos",
      "inventor_city": "Sammamish",
      "inventor_state": "WA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Tierney",
      "inventor_name_first": "Gerry M.",
      "inventor_city": "Redmond",
      "inventor_state": "WA",
      "inventor_country": "US"
    }
  ],
  "ipcr_labels": [
    "H04L1258",
    "G06F30484"
  ],
  "main_ipcr_label": "H04L1258",
  "summary": "<SOH> SUMMARY <EOH>A meta-network is provided that stores information describing users, the networks to which such users belong, and relationships established in such networks between users. The meta-network facilitates establishing relationships across multiple networks. That is, when a relationship is established in one network, it can be used to propagate relationships in other networks between the same or different users. In some embodiments, the meta-network enables users to search for other users according to one or more specified attributes. Users matching the specified attributes may be identified, and a similarity measure may be determined for each of the identified users. In some embodiments, a mapping interface based on the determined similarity measures is displayed to enable the user to visually compare the identified users having a similarity measure within the specified attribute range. This Summary is provided to introduce a selection of concepts in a simplified form that are further described in the Detailed Description. This Summary is not intended to identify key features or essential features of the claimed subject matter, nor is it intended to be used as an aid in determining the scope of the claimed subject matter.",
  "patent_number": "None",
  "abstract": "A method and system for facilitating relationships across multiple networks is described. The meta-network includes relationship information describing users, the networks to which such users belong, and the relationships that they have established within such networks. When a relationship is established in a network, it can be used to propagate relationships across any number of networks with the same or different users. The meta-network enhances the users' ability to search for information and manage their relationships across multiple networks. A user can search for other users according to one or more user-specified attributes. One or more users satisfying the user-specified attributes are identified, and a similarity measure may be determined for each of the identified users. A mapping interface is displayed to the user to enable the user to visually compare the identified users having a similarity measure within the displayed range. The mapping interface allows the user to invite...",
  "publication_number": "US20160261548A1-20160908",
  "_processing_info": {
    "original_size": 39796,
    "optimized_size": 3417,
    "reduction_percent": 91.41
  }
}