{
  "decision": "ACCEPTED",
  "application_number": "15157520",
  "date_published": "20171123",
  "date_produced": "20171108",
  "title": "SYSTEM AND METHOD OF KNOB OPERATION FOR TOUCHSCREEN DEVICES",
  "filing_date": "20160518",
  "inventor_list": [
    {
      "inventor_name_last": "Mathew",
      "inventor_name_first": "Sabu",
      "inventor_city": "Bangalore",
      "inventor_state": "",
      "inventor_country": "IN"
    },
    {
      "inventor_name_last": "Sulania",
      "inventor_name_first": "Sunil",
      "inventor_city": "Bangalore",
      "inventor_state": "",
      "inventor_country": "IN"
    },
    {
      "inventor_name_last": "Ambika",
      "inventor_name_first": "Nithin",
      "inventor_city": "Bangalore",
      "inventor_state": "",
      "inventor_country": "IN"
    },
    {
      "inventor_name_last": "Kshitij",
      "inventor_name_first": "Ashwini",
      "inventor_city": "Bangalore",
      "inventor_state": "",
      "inventor_country": "IN"
    }
  ],
  "ipcr_labels": [
    "G06F3041",
    "B64D4300",
    "G06F30488",
    "G08G500"
  ],
  "main_ipcr_label": "G06F3041",
  "summary": "<SOH> BRIEF SUMMARY <EOH>Touchscreen displays are disclosed in this application that are configured to improve flight screen display ergonomics and to improve the incidence of mishandling. In one exemplary embodiment, a touchscreen display including a first planar surface that comprises a first value-indicating virtual button showing a first value displayed in a first area of the first planar surface, a touch sensor operably coupled with the first planar surface, wherein the touch sensor is configured to detect a touch within the first area of the first planar surface, a second planar surface that is non-coplanar with respect to the first planar surface, the first and second planar surfaces forming a first common edge, and a first swipe sensor operably coupled with the second planar surface, wherein the first swipe sensor is configured to detect a swiping motion in a first direction or in a second direction along the second planar surface, the second direction being opposite the first direction. The touch sensor and the first swipe sensor are electronically and communicatively coupled with one another such that the first swipe sensor is configured to detect the swiping motion in the first or second direction while the touch sensor concurrently detects a touch, and to not detect the swiping motion in the first or second direction while the touch sensor concurrently does not detect a touch. Further, the first swipe sensor and the first planar surface are electronically and communicatively coupled with one another such that, while the touch sensor concurrently detects a touch in the first area, a detected swiping motion in the first direction causes the first value of the first value-indicating virtual button to increase and a detected swiping motion in the second direction causes the first value of the first value-indicating virtual button to decrease. In another exemplary embodiment, a vehicle includes a value-determined vehicle system that operates on the basis of a...",
  "patent_number": "9916032",
  "abstract": "A touchscreen display includes a first planar surface that comprises a first value-indicating virtual button showing a first value displayed in a first area of the first planar surface, a touch sensor operably coupled with the first planar surface, wherein the touch sensor is configured to detect a touch within the first area of the first planar surface, a second planar surface that is non-coplanar with respect to the first planar surface, the first and second planar surfaces forming a first common edge, a first swipe sensor operably coupled with the second planar surface, wherein the first swipe sensor is configured to detect a swiping motion in a first direction or in a second direction along the second planar surface, the second direction being opposite the first direction. The touchscreen display can be implemented in a vehicle, such as an aircraft.",
  "publication_number": "US20170336901A1-20171123",
  "_processing_info": {
    "original_size": 60852,
    "optimized_size": 3888,
    "reduction_percent": 93.61
  }
}