{
  "decision": "PENDING",
  "application_number": "15154249",
  "date_published": "20170720",
  "date_produced": "20170705",
  "title": "SYSTEM, METHOD AND COMPUTER PROGRAM PRODUCT FOR ORDER FULFILLMENT IN RETAIL SUPPLY NETWORKS",
  "filing_date": "20160513",
  "inventor_list": [
    {
      "inventor_name_last": "DESHPANDE",
      "inventor_name_first": "Ajay A.",
      "inventor_city": "White Plains",
      "inventor_state": "NY",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "GUPTA",
      "inventor_name_first": "Saurabh",
      "inventor_city": "Irving",
      "inventor_state": "TX",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "HAMPAPUR",
      "inventor_name_first": "Arun",
      "inventor_city": "Norwalk",
      "inventor_state": "CT",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "KING",
      "inventor_name_first": "Alan J.",
      "inventor_city": "South Salem",
      "inventor_state": "NY",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "KOC",
      "inventor_name_first": "Ali",
      "inventor_city": "White Plains",
      "inventor_state": "NY",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "LI",
      "inventor_name_first": "Yingjie",
      "inventor_city": "Chappaqua",
      "inventor_state": "NY",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "LIU",
      "inventor_name_first": "Xuan",
      "inventor_city": "Yorktown Heights",
      "inventor_state": "NY",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "MILITE",
      "inventor_name_first": "Christopher S.",
      "inventor_city": "Oxford",
      "inventor_state": "CT",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "QUANZ",
      "inventor_name_first": "Brian L.",
      "inventor_city": "Yorktown Heights",
      "inventor_state": "NY",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "TAN",
      "inventor_name_first": "Chek Keong",
      "inventor_city": "Danbury",
      "inventor_state": "CT",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "XING",
      "inventor_name_first": "Dahai",
      "inventor_city": "White Plains",
      "inventor_state": "NY",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "ZHENG",
      "inventor_name_first": "Xiaobo",
      "inventor_city": "Shanghai",
      "inventor_state": "",
      "inventor_country": "CN"
    }
  ],
  "ipcr_labels": [
    "G06Q3002",
    "G06Q1008"
  ],
  "main_ipcr_label": "G06Q3002",
  "summary": "<SOH> SUMMARY <EOH>Product fulfillment decisions may incorporate data determined from the modeling of markdown-avoidance savings (in order to optimize profitability). In one embodiment, a computer-implemented method for selecting, for order fulfillment of a product, at least one eligible node from among a plurality of potential nodes, is provided, the method comprising: obtaining by a computer, for the product, inventory data indicative of a supply of the product for a projected period of time at each of the potential nodes; obtaining by the computer, for the product, markdown implementation data indicative of a planned time when the product price will be marked down at each of the potential nodes; obtaining by the computer, for the product, existing price data indicative of an existing price of the product at each of the potential nodes; obtaining by the computer, for the product, markdown rate data indicative of a markdown rate to be applied to the product at each of the potential nodes; obtaining, by the computer, time data indicative of a current time; executing by the computer, for the product, a calculating process to calculate a markdown-avoidance savings at each of the potential nodes, the markdown-avoidance savings being calculated based upon at least the inventory data, the markdown implementation data, the existing price data, and the time data; and executing by the computer a selecting process to select, from among the plurality of potential nodes, the at least one eligible node for order fulfillment, the at least one eligible node for order fulfillment being selected based at least in part upon the calculated markdown-avoidance savings. In another embodiment, a computer readable storage medium, tangibly embodying a program of instructions executable by a computer for selecting, for order fulfillment of a product, at least one eligible node from among a plurality of potential nodes, is provided, the program of instructions, when executing, performing the...",
  "patent_number": "None",
  "abstract": "The present disclosure relates generally to the field of retail supply networks. In one specific example, mechanisms are provided to model markdown-avoidance savings for omni-channel fulfillment in retail supply networks. In various embodiments, systems, methods and computer program products are provided.",
  "publication_number": "US20170206541A1-20170720",
  "_processing_info": {
    "original_size": 69459,
    "optimized_size": 4524,
    "reduction_percent": 93.49
  }
}