{
  "decision": "ACCEPTED",
  "application_number": "15150898",
  "date_published": "20171116",
  "date_produced": "20171103",
  "title": "SYSTEMS AND ASSOCIATED METHODS FOR MEASURING THE LENGTH OF A FISH",
  "filing_date": "20160510",
  "inventor_list": [
    {
      "inventor_name_last": "Butterworth",
      "inventor_name_first": "Paul",
      "inventor_city": "Auckland",
      "inventor_state": "",
      "inventor_country": "NZ"
    }
  ],
  "ipcr_labels": [
    "G06T760",
    "A01K9900",
    "A01K9700",
    "H04N5232",
    "G01B1102"
  ],
  "main_ipcr_label": "G06T760",
  "summary": "<SOH> BRIEF SUMMARY OF THE INVENTION <EOH>Ensuring an accurate measurement of the length of a caught fish can be difficult. To prove a length of the fish, often times, a fisherman may take a picture of the fish along with a special ruler or other measurement device. However, a number of factors make such a measurement system difficult. First, the measurement device must be close enough to the physical fish to ensure the ability to measure the fish. Second, the measurement device and fish must still be readable within the picture. This can prove difficult depending on a number of different factors, such as the size of the fish, the angle of the picture, the weather conditions, the type of measurement device, the condition of the fish, among other things. Further, it is still possible to alter the measurement, such as by making a fraudulent measurement device (e.g., a portion of the measurement device may be covered up by the fish and could be shortened). Embodiments of the present invention seek to provide an easy to use and reliable way to measure the length of a fish. Using computer vision and augmented reality techniques, some embodiments of the present invention propose utilizing known parameters of a camera and a known length of a marker within a camera view or picture to determine the length of the fish also shown in the same camera view or picture. Such a determination of the length of the fish could be performed in real-time or later remotely. Additionally, the measurement of the length of the fish is reliable because it is not dependent on a zoom value or angle of the camera and there is no required measurement device. Further, the technique is easy to use and can be performed with a camera phone or tablet. An example embodiment of the present invention includes an apparatus comprising a processor, a memory including computer program code, and a camera. The memory and the computer program code are configured to, with the processor, cause the apparatus to rec...",
  "patent_number": "9928611",
  "abstract": "Embodiments of the present invention seek to provide an accurate way to measure the length of a fish. Some embodiments of the present invention propose utilizing a known length of a marker within a camera view or picture to determine the length of the fish also shown in the same camera view or picture. This determination could be performed in real-time or later remotely. Further, the measurement of the length of the fish is reliable because it is not dependent on a zoom value or angle of the camera and there is no required measurement device. Further, the technique is easy to use and can be performed with a camera phone or tablet.",
  "publication_number": "US20170330341A1-20171116",
  "_processing_info": {
    "original_size": 62195,
    "optimized_size": 3244,
    "reduction_percent": 94.78
  }
}