{
  "decision": "ACCEPTED",
  "application_number": "15152372",
  "date_published": "20161110",
  "date_produced": "20161026",
  "title": "METHODS, COMPUTER-ACCESSIBLE MEDIUM AND SYSTEMS FOR FACILITATING DARK FLASH PHOTOGRAPHY",
  "filing_date": "20160511",
  "inventor_list": [
    {
      "inventor_name_last": "Fergus",
      "inventor_name_first": "Robert",
      "inventor_city": "New York",
      "inventor_state": "NY",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Krishnan",
      "inventor_name_first": "Dilip",
      "inventor_city": "Jersey City",
      "inventor_state": "NJ",
      "inventor_country": "US"
    }
  ],
  "ipcr_labels": [
    "H04N5235",
    "G06T700",
    "G06T500",
    "G03B1503",
    "H04N533"
  ],
  "main_ipcr_label": "H04N5235",
  "summary": "<SOH> SUMMARY OF EXEMPLARY EMBODIMENTS <EOH>At least one of the objects of various exemplary embodiments of the present disclosure is to overcome the deficiencies commonly associated with the prior art as discussed above, and provide exemplary embodiments of computer-accessible medium, methods and systems for dark flash photography. For example, described herein is an exemplary embodiment of an apparatus for providing illumination and obtaining an image, which can include, e.g., a first arrangement that can be configured to emit a flash of light including ultra-violet light and/or infra-red light to illuminate a scene and/or one or more subjects, and a second arrangement that can be configured to obtain an image of the illuminated scene and/or one or more subject. A duration of time and/or an intensity level of the flash can be selected so that wavelengths of the flash can be substantially invisible to a human eye, for example. According to certain exemplary embodiments of the present disclosure, at least, e.g., approximately 90% of the light can include ultra-violet light and/or infra-red light; while, in accordance with some exemplary embodiments, at least, e.g., approximately 95% of the light can include ultra-violet light and/or infra-red light. It is possible that the visibility of the wavelengths of the flash perceived by the human eye can be between, e.g., approximately 200 times less than the visibility of wavelengths of a standard flash of light having substantially the same amount of energy as the flash. A standard flash can include, e.g., light having a substantially even distribution of wavelengths of between approximately 400 nanometers (nm) and approximately 700 nm, where a majority of the light of the standard flash has a wavelength of between approximately 400 nm and approximately 700 nm, for example. Also described herein, for example, is an exemplary embodiment of an apparatus for providing illumination that includes an arrangement configured to em...",
  "patent_number": "9602734",
  "abstract": "Exemplary embodiments of the present disclosure relate generally to methods, computer-accessible medium and systems for dark flash photography. For example, described herein is an exemplary embodiment of an apparatus for providing illumination and obtaining an image, which can include, e.g., a first arrangement configured to emit a flash of light including ultra-violet light and/or infra-red light to illuminate a scene and/or one or more subjects, and a second arrangement configured to obtain an image of the illuminated scene and/or one or more subject. A duration of time and/or an intensity level of the flash can be selected, e.g., so that wavelengths of the flash can be substantially invisible to a human eye. For example, the visibility of the flash perceived by the human eye can be, e.g., approximately 200 times less than the visibility of a standard flash of light having substantially the same amount of energy as the flash.",
  "publication_number": "US20160330358A1-20161110",
  "_processing_info": {
    "original_size": 172089,
    "optimized_size": 3717,
    "reduction_percent": 97.84
  }
}