{
  "decision": "PENDING",
  "application_number": "15154863",
  "date_published": "20170112",
  "date_produced": "20161228",
  "title": "USER INTERFACES FOR DESIGNING OBJECTS",
  "filing_date": "20160513",
  "inventor_list": [
    {
      "inventor_name_last": "Mahdavi",
      "inventor_name_first": "Siavash Haroun",
      "inventor_city": "London",
      "inventor_state": "",
      "inventor_country": "GB"
    },
    {
      "inventor_name_last": "Ashuach",
      "inventor_name_first": "Assa",
      "inventor_city": "London",
      "inventor_state": "",
      "inventor_country": "GB"
    },
    {
      "inventor_name_last": "De Cordes",
      "inventor_name_first": "Nicolas",
      "inventor_city": "Brussels",
      "inventor_state": "",
      "inventor_country": "BE"
    }
  ],
  "ipcr_labels": [
    "G06F1750",
    "G06F30481",
    "G06F30484"
  ],
  "main_ipcr_label": "G06F1750",
  "summary": "<SOH> SUMMARY OF THE INVENTION <EOH>It is desired to overcome at least some of the limitations described above in relation to the existing known methods for generating and manipulating an industrial design representation. According to one aspect of the present invention, there is provided a method and system for enabling the designer of a representation of an industrial design to apply constraints to that design which limit a further co-designer from complete freedom in altering the design. In other words, the present invention encompasses a method for two or more people to modify a design representation of an object where one person has more control than the other. In this way, there can be two types of users, namely professional ‘original designers’ and amateur ‘co-designers’. The original designer is also the creator of the original model and can set limits within which the ‘co-designers’ can design. Parts of the design can thus be ‘opened up’ by the original designer for the co-designer to manipulate. Other ‘unopened’ parts of the design are ‘locked’ and cannot be changed by the co-designer. The co-designer is free to manipulate and/or modify those portions of the original design which have been designated as ‘open’ within the limits set by the original designer. More specifically, according to one aspect of the present invention there is provided a collaborative method of generating a design representation of an object between a first user and a second user, the method comprising: designating, at a first user terminal, a set of design object variables relating to different aspects of the design representation; specifying, at the first user terminal, constraints for the set of design object variables, the constraints comprising a range of first user designated values for each of the designated object variables of the set; receiving at a second user terminal, the set of design object variables, the constraints for the set and the design representation via a commu...",
  "patent_number": "None",
  "abstract": "A collaborative method of generating a design representation of an object between a first user and a second user is described. The method comprises: designating, at a first user terminal, a set of design object variables relating to different aspects of the design representation; specifying, at the first user terminal, constraints for the set of design object variables, the constraints comprising a range of first user designated values for each of the designated object variables of the set; receiving at a second user terminal, the set of design object variables, the constraints for the set and the design representation via a communication network; enabling, at the second user terminal, manipulation of the design object representation, the enabling step comprising enabling selection of a particular value of at least one of the designated object variables only within the constrained value range specified by the first user; and presenting on the second user terminal a graphical representa...",
  "publication_number": "US20170011137A1-20170112",
  "_processing_info": {
    "original_size": 121021,
    "optimized_size": 3920,
    "reduction_percent": 96.76
  }
}