{
  "date_produced": "20170329",
  "publication_number": "US20170103334A1-20170413",
  "main_ipcr_label": "G06N700",
  "decision": "PENDING",
  "application_number": "15156439",
  "inventor_list": [
    {
      "inventor_name_last": "GUSEV",
      "inventor_name_first": "Gleb Gennadievich",
      "inventor_city": "Moscow",
      "inventor_state": "",
      "inventor_country": "RU"
    },
    {
      "inventor_name_last": "DRUTSA",
      "inventor_name_first": "Aleksey Valyerevich",
      "inventor_city": "Moscow",
      "inventor_state": "",
      "inventor_country": "RU"
    },
    {
      "inventor_name_last": "SERDYUKOV",
      "inventor_name_first": "Pavel Viktorovich",
      "inventor_city": "Moscow",
      "inventor_state": "",
      "inventor_country": "RU"
    }
  ],
  "abstract": "The methods and systems described herein relate to conducting a controlled experiment using prediction of future user behavior. The method, executable on at least one server, comprises: collecting behavior data on two sets of users over a first period, wherein: the first set of users is exposed to a control; the second set of users is exposed to a treatment variant; and the behavior data relates to a performance parameter of the controlled experiment; based on a prediction model applied to the behavior data, calculating predicted values of the performance parameter for each user of the first set and the second set of users over a second period of time; and determining if a difference exists between the predicted values of the performance parameter for each user of the first set of users and the predicted values of the performance parameter for each user of the second set of users.",
  "filing_date": "20160517",
  "patent_number": "None",
  "summary": "<SOH> SUMMARY <EOH>It is an object of the present technology to ameliorate at least some of the inconveniences present in the prior art. According to a first broad aspect of the present technology, there is provided a method of conducting a controlled experiment using prediction of future user behavior. The method comprises: collecting behavior data on a first set of users and a second set of users over a first period of time, wherein: the first set of users is exposed to a control variant of a service; the second set of users is exposed to a treatment variant of the service; and the behavior data relates to a performance parameter of the controlled experiment; based on at least one prediction model applied to the behavior data, calculating predicted values of the performance parameter for each user of the first set of users and each user of the second set of users over a second period of time; and determining if a statistically significant difference exists between the predicted values of the performance parameter for each user of the first set of users and the predicted values of the performance parameter for each user of the second set of users In some implementations of the method, the method further comprises: calculating an average value of the predicted values of the performance parameter for each user of the first set of users; calculating an average value of the predicted values of the performance parameter for each user of the second set of users; and determining if a statistically significant difference exists between the average value of the predicted values of the performance parameter for each user of the first set of users and the average value of the predicted values of the performance parameter for each user of the second set of users. In some implementations of the method, the method further comprises: obtaining actual values of the performance parameter for each user of the first set of users and each user of the second set of users based on the b...",
  "date_published": "20170413",
  "title": "METHOD OF AND SYSTEM FOR CONDUCTING A CONTROLLED EXPERIMENT USING PREDICTION OF FUTURE USER BEHAVIOR",
  "ipcr_labels": [
    "G06N700",
    "G06F1730",
    "G06N9900"
  ],
  "_processing_info": {
    "original_size": 104929,
    "optimized_size": 3822,
    "reduction_percent": 96.36
  }
}