{
  "date_produced": "20171103",
  "publication_number": "US20170330096A1-20171116",
  "main_ipcr_label": "G06N504",
  "decision": "PENDING",
  "application_number": "15152379",
  "inventor_list": [
    {
      "inventor_name_last": "Das Gupta",
      "inventor_name_first": "Aparupa",
      "inventor_city": "San Jose",
      "inventor_state": "CA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Ramakrishna",
      "inventor_name_first": "Rahul",
      "inventor_city": "San Jose",
      "inventor_state": "CA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Udupi",
      "inventor_name_first": "Yathiraj B.",
      "inventor_city": "San Jose",
      "inventor_state": "CA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Dutta",
      "inventor_name_first": "Debojyoti",
      "inventor_city": "Santa Clara",
      "inventor_state": "CA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Sharma",
      "inventor_name_first": "Manoj",
      "inventor_city": "Sunnyvale",
      "inventor_state": "CA",
      "inventor_country": "US"
    }
  ],
  "abstract": "A method for ranking detected anomalies is disclosed. The method includes generating a graph based on a plurality of rules, wherein the graph comprises nodes representing metrics identified in the rules, edges connecting nodes where metrics associated with connected nodes are identified in a given rule, and edge weights of the edges each representing a severity level assigned to the given rule. The method further includes ranking nodes of the graph based on the edge weights. The method further includes ranking detected anomalies based on the ranking of the nodes corresponding to the metrics associated with the detected anomalies.",
  "filing_date": "20160511",
  "patent_number": "None",
  "summary": "<SOH> BRIEF DESCRIPTION OF THE DRAWINGS <EOH>To provide a more complete understanding of the present disclosure and features and advantages thereof, reference is made to the following description, taken in conjunction with the accompanying figures, wherein like reference numerals represent like parts, in which: FIG. 1 shows an exemplary system for alerting, and identifying and/or ranking anomalies, according to some embodiments of the disclosure; FIG. 2 shows an exemplary set of rules for generating alerts; FIG. 3 shows an exemplary graph generated based on the set of rules shown in FIG. 2 , according to some embodiments of the disclosure; FIG. 4 is a flow diagram illustrating a method for ranking anomalies, according to some embodiments of the disclosure; FIG. 5 is a flow diagram illustrating a method for smart thresholding, according to some embodiments of the disclosure; and FIG. 6 is a flow diagram illustrating a method for combining rules and anomaly detection when triggering an alert, according to some embodiments of the disclosure. detailed-description description=\"Detailed Description\" end=\"lead\"?",
  "date_published": "20171116",
  "title": "INTELLIGENT ANOMALY IDENTIFICATION AND ALERTING SYSTEM BASED ON SMART RANKING OF ANOMALIES",
  "ipcr_labels": [
    "G06N504",
    "G06F1730",
    "G06F1730"
  ],
  "_processing_info": {
    "original_size": 61342,
    "optimized_size": 2963,
    "reduction_percent": 95.17
  }
}