{
  "date_produced": "20161122",
  "publication_number": "US20160358070A1-20161208",
  "main_ipcr_label": "G06N308",
  "decision": "PENDING",
  "application_number": "15154650",
  "inventor_list": [
    {
      "inventor_name_last": "Brothers",
      "inventor_name_first": "John W.",
      "inventor_city": "Calistoga",
      "inventor_state": "CA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Lee",
      "inventor_name_first": "Joohoon",
      "inventor_city": "East Palo Alto",
      "inventor_state": "CA",
      "inventor_country": "US"
    }
  ],
  "abstract": "Tuning a neural network may include selecting a portion of a first neural network for modification to increase computational efficiency and generating, using a processor, a second neural network based upon the first neural network by modifying the selected portion of the first neural network while offline.",
  "filing_date": "20160513",
  "patent_number": "None",
  "summary": "<SOH> SUMMARY <EOH>One embodiment includes a method of tuning a neural network. The method includes selecting a portion of a first neural network for modification to increase computational efficiency and generating, using a processor, a second neural network based upon the first neural network by modifying the selected portion of the first neural network while offline. Another embodiment includes an apparatus for tuning a neural network. The apparatus includes a memory storing program code and a processor coupled to the memory. The processor is configured to initiate operations responsive to executing the program code. The operations include selecting a portion of a first neural network for modification to increase computational efficiency and generating a second neural network based upon the first neural network by modifying the selected portion of the first neural network while offline. A computer program product includes a computer readable storage medium having program code stored thereon for tuning a neural network. The program code is executable by a processor to perform operations. The operations include selecting a portion of a first neural network for modification to increase computational efficiency and generating a second neural network based upon the first neural network by modifying the selected portion of the first neural network while offline. This Summary section is provided merely to introduce certain concepts and not to identify any key or essential features of the claimed subject matter. Many other features and embodiments of the invention will be apparent from the accompanying drawings and from the following detailed description.",
  "date_published": "20161208",
  "title": "AUTOMATIC TUNING OF ARTIFICIAL NEURAL NETWORKS",
  "ipcr_labels": [
    "G06N308",
    "G06N304"
  ],
  "_processing_info": {
    "original_size": 99987,
    "optimized_size": 2680,
    "reduction_percent": 97.32
  }
}