{
  "date_produced": "20160817",
  "publication_number": "US20160253592A1-20160901",
  "main_ipcr_label": "G06N504",
  "decision": "PENDING",
  "application_number": "15150954",
  "inventor_list": [
    {
      "inventor_name_last": "Sinha",
      "inventor_name_first": "Ayon",
      "inventor_city": "Sunnyvale",
      "inventor_state": "CA",
      "inventor_country": "US"
    }
  ],
  "abstract": "Methods and systems for trend aware self-correcting entity relationship extraction are disclosed. For example, a method can include receiving a selected entity, determining a plurality of entities related to the selected entity, determining a plurality of most probable entities, calculating relevance scores, and displaying a subset of the plurality of most probable entities. The selected entity can be received on a network-based transaction system. The plurality of entities related to the selected entity can be determined based on a relationship score. The relationship score can represent navigation transitions, aggregated over time, between the selected entity and each of the plurality of entities. The plurality of most probable entities can be determined based on probabilities. Relevance scores can be calculated for each of the plurality of most probable entities. Finally, the subset of the plurality of most probable entities to be displayed can be determined according to the relevan...",
  "filing_date": "20160510",
  "patent_number": "None",
  "summary": "<SOH> BRIEF DESCRIPTION OF THE DRAWINGS <EOH>Some embodiments are illustrated by way of example and not limitation in the figures of the accompanying drawings in which: FIG. 1 is a block diagram illustrating various example entity browsing patters within a networked publication system. FIG. 2A is a block diagram illustrating an example entity relationship graph. FIG. 2B is a block diagram illustrating an example entity relationship graph. FIG. 3 is a diagram illustrating probability curves for three related entities, according to an example embodiment. FIG. 4 is a block diagram illustrating an example online system capable of implementing trend aware self-correcting entity relationship extraction for presenting recommendations. FIG. 5 is a block diagram illustrating an example recommendation sub-system capable of implementing trend aware self-correcting entity relationship extraction. FIG. 6 is a flowchart illustrating an example method for trend aware self-correcting entity relationship extraction. FIG. 7 is a flowchart illustrating an example method for using trend aware self-correcting entity relationships to make recommendations. FIG. 8 is a table illustrating an example of entity relationship data exhibiting high edge strength relationships, according to an example embodiment. FIG. 9 is a table illustrating an example of entity relationship data exhibiting low edge strength relationships, according to an example embodiment. FIG. 10A is a user-interface screen illustrating example recommendations within a marketplace application without trend aware self-correcting entity relationship extraction. FIG. 10B is a user-interface screen illustrating example recommendations within a marketplace application with trend aware self-correcting entity relationship extraction, according to an example embodiment. FIGS. 11A-11E are user-interface screens illustrating example displays of related entities, according example embodiments. FIG. 12 is a diagrammatic representation of...",
  "date_published": "20160901",
  "title": "SYSTEMS AND METHODS FOR TREND AWARE SELF-CORRECTING ENTITY RELATIONSHIP EXTRACTION",
  "ipcr_labels": [
    "G06N504",
    "G06N9900",
    "G06N700"
  ],
  "_processing_info": {
    "original_size": 57280,
    "optimized_size": 3594,
    "reduction_percent": 93.73
  }
}