{
  "date_produced": "20160824",
  "publication_number": "US20160260016A1-20160908",
  "main_ipcr_label": "G06N502",
  "decision": "ACCEPTED",
  "application_number": "15156934",
  "inventor_list": [
    {
      "inventor_name_last": "Barrett",
      "inventor_name_first": "Christopher L.",
      "inventor_city": "Blacksburg",
      "inventor_state": "VA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Marathe",
      "inventor_name_first": "Madhav V.",
      "inventor_city": "Blacksburg",
      "inventor_state": "VA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Bisset",
      "inventor_name_first": "Keith R.",
      "inventor_city": "Eggleston",
      "inventor_state": "VA",
      "inventor_country": "US"
    }
  ],
  "abstract": "Systems, methods, and computer-readable media for generating a data set are provided. One method includes generating a data set based on input data using a plurality of brokers. The method further includes receiving a request from a user and determining whether the request can be fulfilled using data currently in the data set. When the request can be fulfilled using data currently in the data set, the data is accessed using broker(s) configured to provide access to data within the data set. When the request cannot be fulfilled using data currently in the data set, at least one new broker is spawned using existing broker(s) and additional data needed to fulfill the request is added to the data set using the new broker. The method further includes generating a response to the request using one or more of the plurality of brokers.",
  "filing_date": "20160517",
  "patent_number": "9870531",
  "summary": "<SOH> SUMMARY <EOH>One embodiment of the disclosure relates to a method. The method includes generating, using a computerized analysis system comprising one or more computing devices, a data set (e.g., a synthetic data set) based on input data using a plurality of brokers (e.g., software modules or agents). The data set includes a plurality of entities (e.g., synthetic entities) and is generated using input data from at least two distinct information sources accessible by one or more of the plurality of brokers. Each entity is assigned one or more attributes based on information included in the input data. The method further includes receiving, at the computerized analysis system, a request from a user and determining, at the computerized analysis system, whether the request can be fulfilled using data currently in the data set. The method further includes, when the request can be fulfilled using data currently in the data set, accessing, at the computerized analysis system, the data using one or more of the plurality of brokers configured to provide access to data within the data set. The method further includes, when the request cannot be fulfilled using data currently in the data set, spawning, at the computerized analysis system, at least one new broker using one or more existing brokers and adding additional data needed to fulfill the request to the data set using the at least one new broker. The method further includes generating a response to the request using one or more of the plurality of brokers. Another embodiment relates to a system including at least one computing device operably coupled to at least one memory and configured to generate a data set (e.g., a synthetic data set) based on input data using a plurality of brokers (e.g., software modules or agents). The data set includes a plurality of entities (e.g., synthetic entities) and is generated using input data from at least two distinct information sources accessible by one or more of the plurality...",
  "date_published": "20160908",
  "title": "COMPLEX SITUATION ANALYSIS SYSTEM USING A PLURALITY OF BROKERS THAT CONTROL ACCESS TO INFORMATION SOURCES",
  "ipcr_labels": [
    "G06N502"
  ],
  "_processing_info": {
    "original_size": 112277,
    "optimized_size": 3748,
    "reduction_percent": 96.66
  }
}