{
  "date_produced": "20161122",
  "publication_number": "US20160358074A1-20161208",
  "main_ipcr_label": "G06N308",
  "decision": "PENDING",
  "application_number": "15163833",
  "inventor_list": [
    {
      "inventor_name_last": "Latapie",
      "inventor_name_first": "Hugo M.",
      "inventor_city": "Long Beach",
      "inventor_state": "CA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Fenoglio",
      "inventor_name_first": "Enzo",
      "inventor_city": "Issy-les-Moulineaux",
      "inventor_state": "",
      "inventor_country": "FR"
    },
    {
      "inventor_name_last": "Pandey",
      "inventor_name_first": "Santosh G.",
      "inventor_city": "Newark",
      "inventor_state": "CA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Surcouf",
      "inventor_name_first": "Andre",
      "inventor_city": "Saint Leu La Foret",
      "inventor_state": "",
      "inventor_country": "FR"
    }
  ],
  "abstract": "Various systems and methods for counting people. For example, one method involves receiving input data at an analytics system that includes a neural network. The input data includes a representation of an environment, including representations of several people. The method also includes identifying the representations of the people in the representation of the environment. The method also includes updating an output value that indicates the number of people identified as being present in the environment.",
  "filing_date": "20160525",
  "patent_number": "None",
  "summary": "<SOH> BRIEF DESCRIPTION OF THE DRAWINGS <EOH>The present disclosure may be better understood, and its numerous objects, features, and advantages made apparent to those skilled in the art by referencing the accompanying drawings. FIG. 1 is a block diagram illustrating an example system, according to one embodiment. FIGS. 2A-2F are block diagrams illustrating example modules, according to embodiments. FIG. 3 is a block diagram illustrating an example environment, according to one embodiment. FIGS. 4-14 are flow charts illustrating example processes, according to embodiments. FIG. 15 is a block diagram depicting a network device suitable for implementing embodiments of the systems described herein. detailed-description description=\"Detailed Description\" end=\"lead\"?",
  "date_published": "20161208",
  "title": "Methods and Systems for Counting People",
  "ipcr_labels": [
    "G06N308",
    "G06N700"
  ],
  "_processing_info": {
    "original_size": 62489,
    "optimized_size": 2281,
    "reduction_percent": 96.35
  }
}