{
  "decision": "PENDING",
  "application_number": "15168408",
  "date_published": "20170427",
  "date_produced": "20170412",
  "title": "THEMATIC INTERACTIVE ATTRACTION",
  "filing_date": "20160531",
  "inventor_list": [
    {
      "inventor_name_last": "Hettema",
      "inventor_name_first": "Philip",
      "inventor_city": "Los Angeles",
      "inventor_state": "CA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Hungerford",
      "inventor_name_first": "Eric",
      "inventor_city": "Pasadena",
      "inventor_state": "CA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Barton",
      "inventor_name_first": "Jake",
      "inventor_city": "New York",
      "inventor_state": "NY",
      "inventor_country": "US"
    }
  ],
  "ipcr_labels": [
    "G06F314",
    "G06F301",
    "G06F30482"
  ],
  "main_ipcr_label": "G06F314",
  "summary": "<SOH> SUMMARY OF THE INVENTION <EOH>The invention is generally directed to an attraction for use within a larger a environment wherein a physically meaningful structure is formed to support a plurality of displays arranged in a geometrical fashion which allows for presentation of discrete images in each of the displays, grouped displays which display a single image or all of the displays displaying a single image to provide a narrative related to the attraction's environs. The invention is also generally directed for use within a larger attraction environment wherein a large physical structure supports an array of LCD displays arranged in a geometrical fashion which allows for presentation of discrete images in each of the displays, several grouped displays that show contiguous images, or all of the displays displaying a single discrete image to provide a narrative related to the attraction's context, Another object of the invention is to provide an improved narrative interactive display, which provides images and sound associated with the environs of an attraction through audience interaction with an interactive concierge controlling the displays through a gesture language. Still another object of the invention is to provide a multi-picture display environment controlled interactively by a human concierge utilizing a gesture language to responsively create a bespoke show for an audience. Yet another object of the invention is to provide a means for conveying information related to a wide variety of relevant topics surrounding an attraction location to educate and entertain an audience with an interactive partially scripted and partially adlibbed presentation backed by creative use of stored images related to the a specific content module. Yet still another object of the invention is to provide in improved display attraction which visually collects an audience which sees the attraction and the surrounding environment to provide a partially scripted and partially adl...",
  "patent_number": "None",
  "abstract": "The invention is generally directed to an attraction which draws a visitor's attention from other visual attractions in a fashion which provides a stunning visual perspective including a collection of curated images organized and facilitated by a human ambassador providing narrative and visual content and varying the visual presentation in an interactive fashion with an audience utilizing a gesture-based language to manufacture a bespoke experience.",
  "publication_number": "US20170115945A1-20170427",
  "_processing_info": {
    "original_size": 33801,
    "optimized_size": 3292,
    "reduction_percent": 90.26
  }
}