{
  "decision": "PENDING",
  "application_number": "15163706",
  "date_published": "20160915",
  "date_produced": "20160831",
  "title": "PAYMENT PROCESSING BASED ON VEHICLE REMOTE IDENTIFICATION",
  "filing_date": "20160525",
  "inventor_list": [
    {
      "inventor_name_last": "Eid",
      "inventor_name_first": "Gilbert",
      "inventor_city": "Kahhaleh",
      "inventor_state": "",
      "inventor_country": "LB"
    }
  ],
  "ipcr_labels": [
    "G06Q2010",
    "G06Q2040",
    "H04L2906",
    "G06K19077",
    "G06K1907"
  ],
  "main_ipcr_label": "G06Q2010",
  "summary": "<SOH> SUMMARY <EOH>This summary is provided to introduce a selection of concepts in a simplified form that are further described below in the Detailed Description. This summary is not intended to identify key features or essential features of the claimed subject matter, nor is it intended to be used as an aid in determining the scope of the claimed subject matter. Various embodiments of the present disclosure provide methods and systems for effective vehicle identification, which can be utilized in making payments for the goods or services, and also in finding stolen, wanted, or suspicious motor vehicles. Specifically, the present technology involves installation of wireless passive or active identification tags, such as, but not limited to, radio-frequency identification (RFID) tags, Wi-Fi tags, Bluetooth tags, and so forth, on all or certain motor vehicles within a dedicated area such as a country, state, district, or private land or parcel. The identification tag can be configured to emit identification signals, which include a vehicle identifier and, optionally, other information related to the vehicle and/or its owner. The identification signal can be propagated across a relatively short distance, for example, less than 300 feet or even less than 100 feet when the vehicle is in an unassisted view of a human eye. The present technology may also employ the use of electronic devices, such as a portable computer, tablet computer, wireless telephone, or smart phone, which includes a reader or antenna for wirelessly communicating with the identification tags installed on vehicles. For these ends, the electronic device may run a dedicated software application (e.g., a mobile application) to implement the methods described herein and other processes including communication with the identification tags and remote databases to identify a status of a particular motor vehicle, make reports, issue tickets for traffic or parking violations, process payments, and so forth. Up...",
  "patent_number": "None",
  "abstract": "Methods and systems for processing payments based on remote vehicle identification are provided. This technology requires installation of identification tags, such as RFID tags, on vehicles, which actively or passively emit identification signals conveying vehicle identifiers. When a vehicle arrives on premises of a merchant, a vehicle identifier can be acquired by an electronic device from the vehicle. This allows for verifying the vehicle and obtaining relevant vehicle information. Once the vehicle is identified, the electronic device can cause performing a monetary or non-monetary transaction for goods or services provided by the merchant to the driver or owner of the vehicle. The transaction is performed by a payment processing service deployed on a server in accordance with one or more predetermined rules and against a vehicle owner's account maintained by a database of registered vehicles.",
  "publication_number": "US20160267451A1-20160915",
  "_processing_info": {
    "original_size": 98973,
    "optimized_size": 3500,
    "reduction_percent": 96.46
  }
}