{
  "date_produced": "20170603",
  "publication_number": "US20170169328A1-20170615",
  "main_ipcr_label": "G06N3063",
  "decision": "ACCEPTED",
  "application_number": "15169507",
  "inventor_list": [
    {
      "inventor_name_last": "Modha",
      "inventor_name_first": "Dharmendra S.",
      "inventor_city": "San Jose",
      "inventor_state": "CA",
      "inventor_country": "US"
    }
  ],
  "abstract": "Embodiments of the invention relate to a multi-scale spatio-temporal neural network system. One embodiment comprises a neural network including multiple heterogeneous neuron populations that operate at different time scales. Each neuron population comprises at least one digital neuron. Each neuron population further comprises a time scale generation circuit that controls timing for operation of said neuron population, wherein each neuron of said neuron population integrates neuronal firing events at a time scale corresponding to said neuron population. The neural network further comprises a plurality of synapses interconnecting the neurons, wherein each synapse interconnects a neuron with another neuron. At least one neuron receives neuronal firing events from an interconnected neuron that operates at a different time scale.",
  "filing_date": "20160531",
  "patent_number": "9715654",
  "summary": "<SOH> BRIEF SUMMARY <EOH>Embodiments of the invention relate to a multi-scale spatio-temporal neural network system. One embodiment comprises a neural network including multiple heterogeneous neuron populations that operate at different time scales. Each neuron population comprises at least one digital neuron. Each neuron population further comprises a time scale generation circuit that controls timing for operation of said neuron population, wherein each neuron of said neuron population integrates neuronal firing events at a time scale corresponding to said neuron population. The neural network further comprises a plurality of synapses interconnecting the neurons, wherein each synapse interconnects a neuron with another neuron. At least one neuron receives neuronal firing events from an interconnected neuron that operates at a different time scale. Another embodiment comprises communicating neuronal firing events between multiple heterogeneous neuron populations, wherein the neuron populations operate at different time scales. Each neuron population comprises at least one digital neuron. Each neuron of each neuron population integrates neuronal firing events targeting said neuron at a time scale corresponding to said neuron population. At least one neuron receives neuronal firing events from a neuron that operates at a different time scale. These and other features, aspects and advantages of the present invention will become understood with reference to the following description, appended claims and accompanying figures.",
  "date_published": "20170615",
  "title": "MULTI-SCALE SPATIO-TEMPORAL NEURAL NETWORK SYSTEM",
  "ipcr_labels": [
    "G06N3063",
    "G06N304"
  ],
  "_processing_info": {
    "original_size": 43789,
    "optimized_size": 2940,
    "reduction_percent": 93.29
  }
}