{
  "date_produced": "20170412",
  "publication_number": "US20170116539A1-20170427",
  "main_ipcr_label": "G06N700",
  "decision": "REJECTED",
  "application_number": "15169795",
  "inventor_list": [
    {
      "inventor_name_last": "Allen",
      "inventor_name_first": "Gregory",
      "inventor_city": "Greenwich",
      "inventor_state": "CT",
      "inventor_country": "US"
    }
  ],
  "abstract": "A method of predictive analysis, including the steps of (a) selecting a sequence of discrete information signals for a time interval; (b) identifying one or more creators of the a group the discrete information signals, the one or more creators comprising a first group of social media participants; (c) selecting a group of observers of the sequence of discrete information signals, the observers comprising a second group of social media participants; (d) selecting a sub-group of observers from the group of the observers, the sub-group comprising one or more individuals of the group of observers who have taken external actions subsequent to the time interval; and (e) determining the existence or absence of one or more dependencies between the among the first group and the second group of media participants.",
  "filing_date": "20160601",
  "patent_number": "None",
  "summary": "<SOH> SUMMARY OF THE INVENTION <EOH>As will be described more fully in the description of preferred embodiments, the present invention may include a method of predictive analysis, including the steps of (a) selecting a sequence of discrete information signals for a time interval; (b) identifying one or more creators of the a group the discrete information signals, the one or more creators including a first group of social media participants; (c) selecting a group of observers of the sequence of discrete information signals, the observers including a second group of social media participants; (d) selecting a sub-group of observers from the group of the observers, the sub-group including one or more individuals of the group of observers who have taken external actions subsequent to the time interval; and (e) determining the existence or absence of one or more dependencies between the among the first group and the second group of media participants. In some embodiments, step (e) above may comprise the step of determining the existence or absence of one or more dependencies between the discrete information signals created by the first group of social media participants and the external actions of the second group of media participants. Likewise, step (d) may comprise the step of identifying from the first and second groups of social media participants social media participants social media participants of interest. In other embodiments of the present invention, the participants of interest may comprise participants having a statistically significant effect on the external actions. Also, aforementioned step (a) may include the step of identifying a subject of interest and the discrete information signals concern the subject of interest. Yet other embodiments of the present invention may include the additional steps to determine probability distributions of external actions based on a relationship between (1) reactive data and (2) social activity and observing participant...",
  "date_published": "20170427",
  "title": "SYSTEM AND METHOD OF PREDICTIVE ANALYSIS",
  "ipcr_labels": [
    "G06N700",
    "H04L2908",
    "H04L1224"
  ],
  "_processing_info": {
    "original_size": 43962,
    "optimized_size": 3370,
    "reduction_percent": 92.33
  }
}