{
  "date_produced": "20171115",
  "publication_number": "US20170344900A1-20171130",
  "main_ipcr_label": "G06N9900",
  "decision": "PENDING",
  "application_number": "15163414",
  "inventor_list": [
    {
      "inventor_name_last": "ALZAHRANI",
      "inventor_name_first": "Sultan Saad",
      "inventor_city": "Tempe",
      "inventor_state": "AZ",
      "inventor_country": "US"
    }
  ],
  "abstract": "A method and apparatus are provided for organizing media files using parameters obtained from the visual content and metadata of the media files. Using machine learning, an algorithm is trained to apply user preferences to organize the media files. The user indicates their preferences by viewing the media files and selecting relevancy measures and organizational actions for a subset of the media files (i.e., training data). Using the media-file parameters, the algorithm calculates relevancy values for respective media files. The algorithm is trained to minimize the error between the calculated relevancy value and the user determined relevancy measures of the training data. The media-file parameters can include, e.g., the blurriness of and facial and pattern recognition of the visual content; the source, location, time, edit history, and the frequency and recency of access to the media files as recoded in the metadata.",
  "filing_date": "20160524",
  "patent_number": "None",
  "summary": "<SOH> SUMMARY <EOH>A method and apparatus is provided for organizing media files using parameters obtained from the visual content and metadata of the media files. Using machine learning, an algorithm is trained to apply user preferences to organize the media files. The user indicates their preferences by viewing the media files and selecting relevancy measures and organizational actions for a subset of the media files (i.e., training data). Using the media-file parameters, the algorithm calculates relevancy values for respective media files. The algorithm is trained to minimize the error between the calculated relevancy value and the user determined relevancy measures of the training data. The media-file parameters can include, e.g., the blurriness of and facial and pattern recognition of the visual content; the source, location, time, edit history, and the frequency and recency of access to the media files as recoded in the metadata. It is to be understood that both the foregoing general description of the invention and the following detailed description are exemplary, but are not restrictive of the invention.",
  "date_published": "20171130",
  "title": "METHOD AND APPARATUS FOR AUTOMATED ORGANIZATION OF VISUAL-CONTENT MEDIA FILES ACCORDING TO PREFERENCES OF A USER",
  "ipcr_labels": [
    "G06N9900",
    "G06F1730"
  ],
  "_processing_info": {
    "original_size": 93396,
    "optimized_size": 2676,
    "reduction_percent": 97.13
  }
}