{
  "decision": "PENDING",
  "application_number": "15161015",
  "date_published": "20160915",
  "date_produced": "20160831",
  "title": "Method for Providing Power to an Electronic Device",
  "filing_date": "20160520",
  "inventor_list": [
    {
      "inventor_name_last": "Helfrich",
      "inventor_name_first": "Kenneth J.",
      "inventor_city": "Duluth",
      "inventor_state": "GA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Kim",
      "inventor_name_first": "Sang H.",
      "inventor_city": "Grayslake",
      "inventor_state": "IL",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Fraternali",
      "inventor_name_first": "Fabrizio",
      "inventor_city": "Seveso",
      "inventor_state": "",
      "inventor_country": "IT"
    }
  ],
  "ipcr_labels": [
    "G06F126",
    "H02M704"
  ],
  "main_ipcr_label": "G06F126",
  "summary": "<SOH> SUMMARY <EOH>In an embodiment, set forth by way of example and not limitation, a method for providing power through a USB port of an electronic device includes connecting a power supply to a USB port of an electronic device, emulating a personal computer (PC) host system such that the electronic device believes that the power supply is a PC host system, retrieving at least one descriptor from the electronic device, identifying the electronic device from the at least one descriptor, and setting a charging voltage based upon the identity of the electronic device. In another embodiment, set forth by way of example and not limitation, a method for providing power through a USB port of an electronic device includes connecting a power supply including digital logic to a USB port of an electronic device, emulating a personal computer (PC) host system using the digital logic such that the electronic device believes that the power supply is a PC host system, retrieving at least one descriptor via the USB port from the electronic device via at least one data line, identifying a maximum voltage level to be provided to the electronic device from the at least one descriptor, and setting a charging voltage of the power supply to the maximum voltage level. In yet another embodiment, set forth by way of example and not limitation, a method for providing power through a USB port of an electronic device includes connecting a power supply including digital logic to a USB port of an electronic device, wherein the USB port includes a VBUS power line, a D− data line and a D+ data line, emulating a personal computer (PC) host system using the digital logic such that the electronic device believes that the power supply is a PC host system, retrieving at least one descriptor via the USB port from the electronic device, wherein the descriptor includes one or more of a Vendor Identification Number (VID), a Product Identification Number (PID), and a code in a text descriptor field, ident...",
  "patent_number": "None",
  "abstract": "A method for providing power through a USB port of an electronic device includes connecting a power supply to a USB port of an electronic device, emulating a personal computer (PC) host system such that the electronic device believes that the power supply is a PC host system, retrieving at least one descriptor from the electronic device, identifying the electronic device from the at least one descriptor, and setting a charging voltage based upon the identity of the electronic device.",
  "publication_number": "US20160266625A1-20160915",
  "_processing_info": {
    "original_size": 32833,
    "optimized_size": 3339,
    "reduction_percent": 89.83
  }
}