{
  "decision": "PENDING",
  "application_number": "15162947",
  "date_published": "20170921",
  "date_produced": "20170906",
  "title": "GENERATING RECOMMENDATIONS FOR MEDIA ASSETS TO BE DISPLAYED WITH RELATED TEXT CONTENT",
  "filing_date": "20160524",
  "inventor_list": [
    {
      "inventor_name_last": "Jhamtani",
      "inventor_name_first": "Harsh",
      "inventor_city": "Kanpur",
      "inventor_state": "",
      "inventor_country": "IN"
    },
    {
      "inventor_name_last": "Dutta",
      "inventor_name_first": "Siddhartha Kumar",
      "inventor_city": "Thane",
      "inventor_state": "",
      "inventor_country": "IN"
    },
    {
      "inventor_name_last": "Gundapuneni",
      "inventor_name_first": "Midhun",
      "inventor_city": "Hyderabad",
      "inventor_state": "",
      "inventor_country": "IN"
    },
    {
      "inventor_name_last": "Varma",
      "inventor_name_first": "Shubham",
      "inventor_city": "Ahmedabad",
      "inventor_state": "",
      "inventor_country": "IN"
    },
    {
      "inventor_name_last": "Huesler",
      "inventor_name_first": "Cedric",
      "inventor_city": "San Jose",
      "inventor_state": "CA",
      "inventor_country": "US"
    }
  ],
  "ipcr_labels": [
    "G06F1730",
    "G06F1727"
  ],
  "main_ipcr_label": "G06F1730",
  "summary": "<SOH> SUMMARY <EOH>According to certain embodiments, systems and methods are disclosed for creating multimedia content that includes both text and media assets that illustrate or otherwise correspond to the text. For example, multiple sentences are ranked on various features. A ranking for a sentence is determined based on, for example, the presence of important phrases in the sentence, the degree to which informational content of the sentence can be represented through a media asset, the presence of one or more sentiments associated with the sentence, and the readability of the sentence. In some examples, the ranked sentences are analyzed to determine similar information content, and the sentences are re-ranked based on this analysis (e.g., to avoid assigning pictures to multiple sentences with similar content). A subset of the ranked sentences with higher ranks are analyzed, for example, to determine similarities between content in the sentence and text descriptions of media assets (e.g., “tags” or captions for an image). Such analysis is then used to select appropriate images or other media assets. Multimedia content is then generated in which the selected images or other media assets are positioned near the set of sentences. These illustrative embodiments are mentioned not to limit or define the disclosure, but to provide examples to aid understanding thereof. Additional embodiments are discussed in the Detailed Description, and further description is provided there.",
  "patent_number": "None",
  "abstract": "Certain embodiments involve creating multimedia content with text and media assets that illustrate the text. Multiple sentences are ranked on various features. A sentence ranking is determined based on, for example, the presence of important phrases in the sentence, the degree to which informational content of the sentence can be represented through a media asset, the presence of one or more sentiments associated with the sentence, and the readability of the sentence. In some examples, the ranked sentences are analyzed to determine similar information content, and the sentences are re-ranked based on this analysis. A subset of the ranked sentences with higher ranks are analyzed to determine similarities between content in the sentence and text descriptions of media assets. This analysis can be used to select appropriate images or other media assets. Multimedia content is generated in which the selected media assets are positioned near the set of sentences.",
  "publication_number": "US20170270123A1-20170921",
  "_processing_info": {
    "original_size": 94974,
    "optimized_size": 3648,
    "reduction_percent": 96.16
  }
}