{
  "decision": "PENDING",
  "application_number": "15166046",
  "date_published": "20160922",
  "date_produced": "20160908",
  "title": "DEVICE HAVING CAMERA FUNCTION AND METHOD OF IMAGE CAPTURE",
  "filing_date": "20160526",
  "inventor_list": [
    {
      "inventor_name_last": "TSUNODA",
      "inventor_name_first": "Hiroshi",
      "inventor_city": "Osaka",
      "inventor_state": "",
      "inventor_country": "JP"
    }
  ],
  "ipcr_labels": [
    "H04N5235",
    "G06T700",
    "H04N5232",
    "H04N5225",
    "G06T500"
  ],
  "main_ipcr_label": "H04N5235",
  "summary": "<SOH> SUMMARY <EOH>A first aspect of the present disclosure relates to a device having a camera function. The device having a camera function according to the first aspect includes an image capturing unit configured to capture an image, a light emitter configured to emit light in a photographing direction, and at least one processor configured to control the image capturing unit and the light emitter. The at least one processor is configured to perform a first image capturing operation and a second image capturing operation based on a shutter operation, in the first image capturing operation the image capturing unit capturing a first image without light emission from the light emitter, in the second image capturing operation the image capturing unit capturing a second image with light emission from the light emitter, and divide an area of the first image into an area of a subject and an area of a background based on a difference in state between corresponding portions of the first image and the second image. A second aspect of the present disclosure relates to a method of image capture. The method of image capture according to the second aspect includes performing a first image capturing operation and a second image capturing operation based on a shutter operation, in the first image capturing operation a first image being captured without light emission in a direction that the first image is captured, in the second image capturing operation a second image being captured with light emission in the direction that the second image is captured, and dividing an area of the first image into an area of a subject and an area of a background based on a difference in state between corresponding portions of the first image and the second image. A “subject” may refer to all capturing targets including a background and a main capturing target located in front of the background, or may refer to a capturing target located in front of the background. The “subject” in an embodiment...",
  "patent_number": "None",
  "abstract": "A controller is configured to perform a first image capturing operation and a second image capturing operation based on a shutter operation, in the first image capturing operation a first image capturing unit capturing an image without light emission from a light emitter, in the second image capturing operation the first image capturing unit capturing an image with light emission from the light emitter, and divide an area of a first image captured by the first image capturing operation into an area of a subject and an area of a background based on a difference in state between corresponding portions of the first image and a second image captured by the second image capturing operation.",
  "publication_number": "US20160277656A1-20160922",
  "_processing_info": {
    "original_size": 68938,
    "optimized_size": 3304,
    "reduction_percent": 95.21
  }
}