{
  "date_produced": "20160921",
  "publication_number": "US20160292593A1-20161006",
  "main_ipcr_label": "G06N9900",
  "decision": "PENDING",
  "application_number": "15160243",
  "inventor_list": [
    {
      "inventor_name_last": "Agarwalla",
      "inventor_name_first": "Lalit",
      "inventor_city": "Bangalore",
      "inventor_state": "",
      "inventor_country": "IN"
    },
    {
      "inventor_name_last": "Mungi",
      "inventor_name_first": "Ashish",
      "inventor_city": "Bangalore",
      "inventor_state": "",
      "inventor_country": "IN"
    },
    {
      "inventor_name_last": "Mustafi",
      "inventor_name_first": "Joy",
      "inventor_city": "Kolkata",
      "inventor_state": "",
      "inventor_country": "IN"
    },
    {
      "inventor_name_last": "Parikh",
      "inventor_name_first": "Ankur",
      "inventor_city": "Bangalore",
      "inventor_state": "",
      "inventor_country": "IN"
    }
  ],
  "abstract": "Generating distractors for text-based MCT items. An MCT item stem is received. The stem is transmitted to a QA system and a plurality of candidate answers related to the stem is received from the QA system. Incorrect answers in the plurality of candidate answers are identified. Textual features are extracted from the stem. A set of semantic criteria associated with the extracted textual features is generated. Based on the generated semantic criteria, a subset of the incorrect candidate answers is selected.",
  "filing_date": "20160520",
  "patent_number": "None",
  "summary": "<SOH> SUMMARY <EOH>Embodiments of the present invention disclose a method, computer program product, and system for generating distractors for text-based multiple choice test (MCT) items. An MCT item stem is received. The stem is transmitted to a question answering (QA) system and a plurality of candidate answers related to the stem is received from the QA system. Incorrect answers in the plurality of candidate answers are identified. Textual features are extracted from the stem. A set of semantic criteria associated with the extracted textual features is generated. Based on the semantic criteria, a subset of the incorrect candidate answers is selected.",
  "date_published": "20161006",
  "title": "QUESTION ANSWERING SYSTEM-BASED GENERATION OF DISTRACTORS USING MACHINE LEARNING",
  "ipcr_labels": [
    "G06N9900",
    "G06N502",
    "G09B706"
  ],
  "_processing_info": {
    "original_size": 53698,
    "optimized_size": 2191,
    "reduction_percent": 95.92
  }
}