{
  "decision": "PENDING",
  "application_number": "15161804",
  "date_published": "20161124",
  "date_produced": "20161109",
  "title": "METHOD AND SYSTEM FOR BUSINESS CUSTOMER ON-BOARDING",
  "filing_date": "20160523",
  "inventor_list": [
    {
      "inventor_name_last": "Mohnot",
      "inventor_name_first": "Manish",
      "inventor_city": "Wilmington",
      "inventor_state": "DE",
      "inventor_country": "US"
    }
  ],
  "ipcr_labels": [
    "G06Q4002",
    "G06Q1006"
  ],
  "main_ipcr_label": "G06Q4002",
  "summary": "<SOH> SUMMARY OF THE INVENTION <EOH>A method for performing business customer onboarding, comprising: identifying a need of a business customer; matching a business expert with said customer; assessing said need of said customer; displaying a series of windows to request information related to said customer, wherein said information is used to create at least one application to fulfill said need; and verifying said at least one application. Said information is also used to create a second application to fulfill a second need. The method further comprises offering non-bank related transactions.",
  "patent_number": "None",
  "abstract": "The business customer onboarding process enables banks or financial services providers to meet business customer's needs. A user interface is employed to guide a customer or financial advisor through a step-by-step process in collecting relevant information, whereby only relevant information pertaining to the customer's need is collected. The user interface provides multi-lingual supports which is customizable by the customer. Windows of the user interface for information collection are determined based on the customer's need and information gathered in immediately preceding windows. This collected data is then utilized complete the application for one or more bank services. The onboarding process enables an omni-channel lead capture for sales to the customer.",
  "publication_number": "US20160343072A1-20161124",
  "_processing_info": {
    "original_size": 45172,
    "optimized_size": 1922,
    "reduction_percent": 95.75
  }
}