{
  "date_produced": "20171115",
  "publication_number": "US20170344895A1-20171130",
  "main_ipcr_label": "G06N700",
  "decision": "PENDING",
  "application_number": "15166680",
  "inventor_list": [
    {
      "inventor_name_last": "Roy",
      "inventor_name_first": "Kabir",
      "inventor_city": "Mumbai",
      "inventor_state": "",
      "inventor_country": "IN"
    }
  ],
  "abstract": "The present invention discloses an intelligent workspace. In example embodiments the invention discloses method and systems with intelligent workspace for operating on an application of a computing device. The workspace of the invention includes various tools utilizing user behavioral analytics and user role information for dynamically operating on applications like procurement application. The system and method of the invention reduces operational time of the user and enhances user experience.",
  "filing_date": "20160527",
  "patent_number": "None",
  "summary": "<SOH> SUMMARY <EOH>An embodiment of the present invention discloses a system with intelligent workspace for operating on an application of a computing device. The system includes: 1) a network interface configured to communicate with at least one server; and 2) an electronic user interface configured to display the intelligent workspace on the computing device and receive inputs from a user. The electronic user interface is a self-evolving user interface configured to receive inputs from a user through voice commands, gesture controls, mouse, touch pads or keyboards. The system further includes at least one user activity database coupled to the at least one server for storing a real time user activity data obtained by identifying and tracking activity of the user in the workspace, and at least one user profile database coupled to the at least one server for storing a user profile data containing information about access, terms of usage and role of the user when operating on the application. The system also provides an artificial intelligence (AI) engine for predicting a set of actions the user may want to perform based on the user activity data and the user profile data wherein the AI engine reconfigures the workspace dynamically to provide a plurality of optimization and navigation options to the user based on the predicted actions, and a self-learning data processor configured to run the application based on the reconfigured workspace wherein the data processor is coupled to the artificial intelligence engine for processing the predicted actions and a plurality of selected optimization and navigation options to reduce operational time of the user and provide enhanced user experience. In an example embodiment, the invention provides a method for operating with an intelligent workspace on an application of a computing device. The method includes the steps of displaying the intelligent workspace on a display of the computing device, receiving inputs from a user throu...",
  "date_published": "20171130",
  "title": "Intelligent Workspace",
  "ipcr_labels": [
    "G06N700",
    "G06N9900",
    "G06F30484"
  ],
  "_processing_info": {
    "original_size": 79855,
    "optimized_size": 3025,
    "reduction_percent": 96.21
  }
}