{
  "decision": "PENDING",
  "application_number": "15162681",
  "date_published": "20171130",
  "date_produced": "20171115",
  "title": "PROVIDING TRAVEL OR PROMOTION BASED RECOMMENDATION ASSOCIATED WITH SOCIAL GRAPH",
  "filing_date": "20160524",
  "inventor_list": [
    {
      "inventor_name_last": "Ramesan",
      "inventor_name_first": "Roshin Lal",
      "inventor_city": "Redmond",
      "inventor_state": "WA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Quintero",
      "inventor_name_first": "Megan",
      "inventor_city": "Seattle",
      "inventor_state": "WA",
      "inventor_country": "US"
    }
  ],
  "ipcr_labels": [
    "G06F1730",
    "G06Q3002",
    "G06Q5014",
    "G06Q5000"
  ],
  "main_ipcr_label": "G06F1730",
  "summary": "<SOH> SUMMARY <EOH>This summary is provided to introduce a selection of concepts in a simplified form that are further described below in the Detailed Description. This summary is not intended to exclusively identify key features or essential features of the claimed subject matter, nor is it intended as an aid in determining the scope of the claimed subject matter, Embodiments are directed to providing a travel or a promotion based recommendation associated with a social graph. A communication service, according to embodiments, may initiate operations to provide a travel based recommendation by processing a content of a communication to identify a travel plan associated with a recipient. The travel plan may include a component associated with a previous purchase of a relation of the recipient from, a social graph, of the recipient. Another travel plan associated with an acquaintance of the recipient may also be identified. The acquaintance may be detected from the social graph of the recipient. Next, a shared attribute may be detected between the travel plan and the other travel plan. The shared attribute may be assigned a relevancy score. Furthermore, the shared attribute may be provided to the recipient based on the relevancy score. The communication service may initiate operations to provide a promotion based recommendation by processing a content of a communication to identify a promotion directed to a recipient. Next, a social networking source may be queried to identify the promotion as presented to an acquaintance of the recipient. The acquaintance may be detected from a social graph of the recipient. The promotion may be ranked based on a number of interactions between the acquaintance and the promotion. A relevancy of the promotion for the recipient may be determined based on a rank of the promotion. Furthermore, a notification associated with the promotion may be provided to the recipient, These and other and advantages will be apparent from a reading of t...",
  "patent_number": "None",
  "abstract": "A travel or a promotion based recommendation is provided in association with a social graph of a recipient of a communication. A communication service initiates operations to provide the travel or promotion based recommendation by processing a content of a communication to identify a travel, plan of a recipient or a promotion directed to a recipient. A detected shared attribute between the travel plan of the recipient and the travel plan of the acquaintance is assigned a relevancy score. The promotion is processed to determine a trend of the promotion with an acquaintance at a social networking site and an accuracy of the promotion. The shared attribute or the promotion is provided to the recipient.",
  "publication_number": "US20170344643A1-20171130",
  "_processing_info": {
    "original_size": 69487,
    "optimized_size": 3463,
    "reduction_percent": 95.02
  }
}