{
  "decision": "ACCEPTED",
  "application_number": "15165056",
  "date_published": "20171130",
  "date_produced": "20171115",
  "title": "SYSTEMS AND METHODS FOR HIGHER ORDER DIMENSIONAL SPACE VIDEO SEGMENTATION",
  "filing_date": "20160526",
  "inventor_list": [
    {
      "inventor_name_last": "Hornung",
      "inventor_name_first": "Alexander Sorkine",
      "inventor_city": "Zurich",
      "inventor_state": "",
      "inventor_country": "CH"
    },
    {
      "inventor_name_last": "Perazzi",
      "inventor_name_first": "Federico",
      "inventor_city": "Zurich",
      "inventor_state": "",
      "inventor_country": "CH"
    },
    {
      "inventor_name_last": "Wang",
      "inventor_name_first": "Oliver",
      "inventor_city": "Zurich",
      "inventor_state": "",
      "inventor_country": "CH"
    },
    {
      "inventor_name_last": "Märki",
      "inventor_name_first": "Nicolas",
      "inventor_city": "Zurich",
      "inventor_state": "",
      "inventor_country": "CH"
    }
  ],
  "ipcr_labels": [
    "G06T710",
    "G11B2734",
    "G11B2730"
  ],
  "main_ipcr_label": "G06T710",
  "summary": "<SOH> SUMMARY <EOH>This disclosure relates to segmenting a video in a higher order dimensional space. A video may be segmented by obtaining visual information defining an image of the video. The visual information may include pixels of the image and may be represented in a display space. The display space may have a first dimensionality such that the visual information represented in the display space facilitates visual reproduction of the image on a display device. A designation of a subset of the visual information represented in the display space as a part of an object portrayed in the image may be obtained. The visual information and the designation may be represented in the higher order dimensional space. The higher order dimensional space may have a second dimensionality greater than the first dimensionality. An association of the visual information represented in the higher order dimensional space with the object may be obtained based on the higher order dimensional space representation of the visual information and the designation. The association may be correlated with the visual information represented in the display space. The correlation may define a location of the object in the image. A system for segmenting a video in a higher order dimensional space may include one or more processors, and/or other components. The one or more processors may be configured to execute one or more computer program components. The computer program components may include one or more of an obtain component, a designation component, a representation component, an association component, a correlation component, and/or other components. The obtain component may be configured to obtain visual information defining an image of the video. The visual information may include pixels of the image. The visual information may be represented in a display space having a first dimensionality such that the visual information represented in the display space facilitates visual reproduction of...",
  "patent_number": "9911194",
  "abstract": "This disclosure relates to system and methods for segmenting a video in a higher order dimensional space. A video may be segmented by obtaining visual information defining an image of the video. The visual information may include pixels of the image and may be represented in a display space having a first dimensionality. A designation of a subset of the visual information represented in the display space as a part of an object portrayed in the image may be obtained. The visual information and the designation may be represented in the higher order dimensional space having a second dimensionality greater than the first dimensionality. An association of the visual information represented in the higher order dimensional space with the object may be obtained. The association may be correlated with the visual information represented in the display space. The correlation may define a location of the object in the image.",
  "publication_number": "US20170345151A1-20171130",
  "_processing_info": {
    "original_size": 49161,
    "optimized_size": 3955,
    "reduction_percent": 91.96
  }
}