{
  "date_produced": "20171108",
  "publication_number": "US20170337480A1-20171123",
  "main_ipcr_label": "G06N504",
  "decision": "PENDING",
  "application_number": "15160954",
  "inventor_list": [
    {
      "inventor_name_last": "Yin",
      "inventor_name_first": "Christopher",
      "inventor_city": "Redwood City",
      "inventor_state": "CA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Hellman",
      "inventor_name_first": "Jeffrey",
      "inventor_city": "Albuquerque",
      "inventor_state": "NM",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Harris",
      "inventor_name_first": "Scott",
      "inventor_city": "San Mateo",
      "inventor_state": "CA",
      "inventor_country": "US"
    }
  ],
  "abstract": "Techniques and a system are provided for generating correlations based on inferred behavior by an inferred event detection system executing on a mobile computing device. Inferred events are events that are detected without an explicit input to the mobile computing device. The inferred events are further classified by the inferred event detection system. In one embodiment, a method comprises, using an application on a mobile computing device, wherein the mobile computing device includes at least one geolocation antenna capable of providing geolocation information that is accessible by the application and that specifies a geolocation of the mobile computing device at a particular time, monitoring the geolocation information; without receiving an explicit request to the application executing on the mobile computing device, determining by the mobile computing device at a first time, a first timestamp and a first geolocation information for the mobile computing device at the first time; wit...",
  "filing_date": "20160520",
  "patent_number": "None",
  "summary": "<SOH> SUMMARY <EOH>The appended claims may serve to summarize the present disclosure.",
  "date_published": "20171123",
  "title": "INFERRING EVENTS BASED ON IDENTIFIED BEHAVIOR",
  "ipcr_labels": [
    "G06N504",
    "H04L2908",
    "G06F1730"
  ],
  "_processing_info": {
    "original_size": 87059,
    "optimized_size": 1945,
    "reduction_percent": 97.77
  }
}