{
  "decision": "PENDING",
  "application_number": "15160741",
  "date_published": "20171123",
  "date_produced": "20171108",
  "title": "Remote Life Science Laboratories and Storage Facilities",
  "filing_date": "20160520",
  "inventor_list": [
    {
      "inventor_name_last": "Heckerman",
      "inventor_name_first": "David E.",
      "inventor_city": "Santa Monica",
      "inventor_state": "CA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Shute",
      "inventor_name_first": "David H.",
      "inventor_city": "Redmond",
      "inventor_state": "WA",
      "inventor_country": "US"
    }
  ],
  "ipcr_labels": [
    "G06F1900"
  ],
  "main_ipcr_label": "G06F1900",
  "summary": "<SOH> SUMMARY <EOH>This Summary is provided to introduce a selection of concepts in a simplified form that are further described below in the Detailed Description. This Summary is not intended to identify key features or essential features of the claimed subject matter nor is it intended to be used to limit the scope of the claimed subject matter. An automated life science laboratory may be situated at the same location as a data center. The automated life science laboratory can receive instructions electronically, such as over the Internet, and implement those instructions using automated machines and robotics to perform biotechnology protocols like DNA sequencing. A storage facility for biological specimens may also be situated at the same location as a data center. In an implementation, both the automated life science laboratory and the storage facility are located together with the data center. The storage facility may include various refrigerators, freezers, and other storage areas for storing a number of biological specimens. Many of the factors that are considered when selecting a site for a data center are also appropriate for determining where to locate an automated life science laboratory or a storage facility. Lower costs for land and low-cost electricity are advantageous for automated life science laboratories and storage facilities as well as for data centers. Physical security put in place for the data center may also be used to protect biological specimens and equipment. Electrical and cooling systems implemented for the data center may be shared with the automated life science laboratory or storage facility. Physical proximity between the automated life science laboratory and the data center also allows for a direct high-speed data connection. Large volumes of data created by the life science laboratory, such as data from DNA sequencers, may be moved to the data center quickly and securely. The data center may also be used to perform analytics on dat...",
  "patent_number": "None",
  "abstract": "An automated life science laboratory or a storage facility for biological specimens may be located together with or in close proximity to a data center. The location of the data center, the automated life science laboratory, and the storage facility may be a location in which land and/or electricity are less expensive than locations where the biological specimens are collected. The automated life science laboratory may have a high-capacity data connection to the data center. The life science laboratory, storage facility, and the data center may share a connection to the electrical grid, an HVAC system, and/or a security perimeter. A biological specimen may be removed from storage at the storage facility, process by one or more biotechnology protocols at the automated life science laboratory, and data from the processing may be stored in the data center.",
  "publication_number": "US20170337337A1-20171123",
  "_processing_info": {
    "original_size": 67422,
    "optimized_size": 3565,
    "reduction_percent": 94.71
  }
}