{
  "date_produced": "20171108",
  "publication_number": "US20170337482A1-20171123",
  "main_ipcr_label": "G06N700",
  "decision": "PENDING",
  "application_number": "15160429",
  "inventor_list": [
    {
      "inventor_name_last": "SINDIA",
      "inventor_name_first": "SURAJ",
      "inventor_city": "HILLSBORO",
      "inventor_state": "OR",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "AGARWAL",
      "inventor_name_first": "SHRUTI",
      "inventor_city": "HILLSBORO",
      "inventor_state": "OR",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "YELTEN",
      "inventor_name_first": "MUSTAFA BERKE",
      "inventor_city": "ISTANBUL",
      "inventor_state": "",
      "inventor_country": "TR"
    },
    {
      "inventor_name_last": "TICE",
      "inventor_name_first": "CHRISTOPHER L.",
      "inventor_city": "WORCESTER",
      "inventor_state": "MA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "JANCZAK",
      "inventor_name_first": "TERESA KRYSTYNA",
      "inventor_city": "HILLSBORO",
      "inventor_state": "OR",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "JOHNSON",
      "inventor_name_first": "SCOTT C.",
      "inventor_city": "PORTLAND",
      "inventor_state": "OR",
      "inventor_country": "US"
    }
  ],
  "abstract": "Systems, apparatuses, and methods for enabling sensor discovery in autonomous devices herein. An example device to perform system-level verification predictions includes a neural network circuit including a neural network. During a first phase, the neural network circuit to train the neural network using respective assembly-level test data and the system-level verification test data associated with each of a first plurality of semiconductor dice. The first plurality of semiconductor dice is produced from a plurality of training wafers. During a second phase, the neural network circuit to determine, using the neural network, a system-level pass/fail decision for each of second plurality of semiconductor dice based on respective assembly-level test data associated with each of the second plurality of semiconductor dice. The second plurality of semiconductor dice is produced from a plurality of production wafers.",
  "filing_date": "20160520",
  "patent_number": "None",
  "summary": "<SOH> BRIEF DESCRIPTION OF THE DRAWINGS <EOH>In the drawings, which are not necessarily drawn to scale, like numerals may describe similar components in different views. Like numerals having different letter suffixes may represent different instances of similar components. The drawings illustrate generally, by way of example, but not by way of limitation, various embodiments discussed in the present document. FIG. 1 illustrates components of an industrial Internet-of-Things predictive system in accordance with some embodiments. FIG. 2 illustrates components of an industrial Internet-of-Things (IoT) predictive system in accordance with some embodiments. FIG. 3 illustrates an industrial Internet-of-Things (IoT) predictive semiconductor die fabrication system (system) 300 according to an embodiment of the disclosure. FIG. 4 illustrates a method to venerate system-level verification predictions in accordance with some embodiments. FIG. 5 illustrates a method to generate system-level verification predictions in accordance with some embodiments. FIG. 6 is a block diagram illustrating an example machine upon which any one or more of the techniques (e.g., methodologies) discussed herein may perform, according to an example embodiment. detailed-description description=\"Detailed Description\" end=\"lead\"?",
  "date_published": "20171123",
  "title": "PREDICTIVE SYSTEM FOR INDUSTRIAL INTERNET OF THINGS",
  "ipcr_labels": [
    "G06N700",
    "G06N308"
  ],
  "_processing_info": {
    "original_size": 87920,
    "optimized_size": 3546,
    "reduction_percent": 95.97
  }
}