{
  "date_produced": "20170524",
  "publication_number": "US20170161637A1-20170608",
  "main_ipcr_label": "G06N9900",
  "decision": "PENDING",
  "application_number": "15161867",
  "inventor_list": [
    {
      "inventor_name_last": "MISRA",
      "inventor_name_first": "Janardan",
      "inventor_city": "Bangalore",
      "inventor_state": "",
      "inventor_country": "IN"
    },
    {
      "inventor_name_last": "Sengupta",
      "inventor_name_first": "Shubhashis",
      "inventor_city": "Bangalore",
      "inventor_state": "",
      "inventor_country": "IN"
    },
    {
      "inventor_name_last": "Podder",
      "inventor_name_first": "Sanjay",
      "inventor_city": "Thane",
      "inventor_state": "",
      "inventor_country": "IN"
    },
    {
      "inventor_name_last": "Acharyulu",
      "inventor_name_first": "Karthik",
      "inventor_city": "Madanapalle",
      "inventor_state": "",
      "inventor_country": "IN"
    }
  ],
  "abstract": "A device may receive a first command, included in a set of commands, to set a configuration parameter associated with performing feature extraction. The device may receive a second command, included in the set of commands, to set a corresponding value for the configuration parameter. The configuration parameter and the corresponding value may correspond to a particular feature metric that is to be extracted. The device may configure, based on the configuration parameter and the corresponding value, feature extraction for a corpus of documents. The device may perform, based on configuring feature extraction for the corpus, feature extraction on the corpus to determine the particular feature metric. The device may generate a feature vector based on performing the feature extraction. The feature vector may include the particular feature metric. The feature vector may include a feature identifier identifying the particular feature metric. The device may provide the feature vector.",
  "filing_date": "20160523",
  "patent_number": "None",
  "summary": "<SOH> SUMMARY <EOH>According to some possible implementations, a device may include one or more processors. The one or more processors may receive a first command, included in a set of commands, to set a configuration parameter associated with performing feature extraction. The one or more processors may receive a second command, included in the set of commands, to set a corresponding value for the configuration parameter. The configuration parameter and the corresponding value may correspond to a particular feature metric that is to be extracted. The one or more processors may configure, based on the configuration parameter and the corresponding value, feature extraction for a corpus of documents. The one or more processors may perform, based on configuring feature extraction for the corpus, feature extraction on the corpus to determine the particular feature metric. The one or more processors may generate a feature vector based on performing the feature extraction. The feature vector may include the particular feature metric. The feature vector may include a feature identifier identifying the particular feature metric. The one or more processors may provide the feature vector. According to some possible implementations, a non-transitory computer-readable medium may store one or more instructions that, when executed by one or more processors, may cause the one or more processors to provide a user interface. The one or more instructions, when executed by the one or more processors, may cause the one or more processors to include one or more user interface elements identifying a set of commands of a feature extraction language. The one or more instructions, when executed by one or more processors, may cause the one or more processors to receive, via the user interface, a selection of one or more commands of the feature extraction language. The one or more commands may identify a set of feature metrics. The one or more instructions, when executed by one or more proces...",
  "date_published": "20170608",
  "title": "FEATURE EXTRACTION FOR MACHINE LEARNING",
  "ipcr_labels": [
    "G06N9900",
    "G06F1730"
  ],
  "_processing_info": {
    "original_size": 65304,
    "optimized_size": 3975,
    "reduction_percent": 93.91
  }
}