{
  "decision": "PENDING",
  "application_number": "15167250",
  "date_published": "20161201",
  "date_produced": "20161116",
  "title": "SYSTEM AND METHOD OF E-COMMERCE",
  "filing_date": "20160527",
  "inventor_list": [
    {
      "inventor_name_last": "Zebic",
      "inventor_name_first": "Gregor",
      "inventor_city": "Wallisellen",
      "inventor_state": "",
      "inventor_country": "CH"
    }
  ],
  "ipcr_labels": [
    "G06Q3006"
  ],
  "main_ipcr_label": "G06Q3006",
  "summary": "<SOH> SUMMARY OF THE INVENTION <EOH>In one aspect of the present invention, a method of providing an e-commerce platform comprises: providing a web server comprising a microprocessor and a memory, wherein the microprocessor publishes a web page accessible over an internet, wherein the web page comprises at least a product page and a shopping cart page, wherein the product page comprises a grid comprising a plurality of unselected tiles, wherein each of the unselected tiles comprises a product information of different products and a selection button, the product page further comprising an add all selected tiles to a shopping cart button; transforms at least one of the unselected tiles to a selected tile when a user activates the selection button using a computer having access to the internet; transfers the at least one selected tile to the shopping cart page when the user activates the add all selected tiles to the shopping cart button; and prompts the user to purchase the at least one selected tile within the shopping cart page. These and other features, aspects and advantages of the present invention will become better understood with reference to the following drawings, description and claims.",
  "patent_number": "None",
  "abstract": "A system and method of e-commerce is provided. The system and method of e-commerce may include a web server accessed by users over the internet. The web server produces a unique product page having an index. The index includes a plurality of tiles, where each tile displays a different product to view or purchase. Users may select a tile to view or purchase the product. The action of selecting the tile includes flipping the tile 180 degrees and producing a visual of the tile flipping and displaying the back side of the tile. Selected tiles may then be added to the shopping cart page and purchased.",
  "publication_number": "US20160350841A1-20161201",
  "_processing_info": {
    "original_size": 21774,
    "optimized_size": 2335,
    "reduction_percent": 89.28
  }
}