{
  "date_produced": "20171115",
  "publication_number": "US20170344892A1-20171130",
  "main_ipcr_label": "G06N700",
  "decision": "PENDING",
  "application_number": "15162852",
  "inventor_list": [
    {
      "inventor_name_last": "Byron",
      "inventor_name_first": "Donna K.",
      "inventor_city": "Petersham",
      "inventor_state": "MA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "DiMascio",
      "inventor_name_first": "Carmine M.",
      "inventor_city": "West Roxbury",
      "inventor_state": "MA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Pinel",
      "inventor_name_first": "Florian",
      "inventor_city": "New York",
      "inventor_state": "NY",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Winkler",
      "inventor_name_first": "Timothy P.",
      "inventor_city": "Clinton",
      "inventor_state": "MA",
      "inventor_country": "US"
    }
  ],
  "abstract": "A mechanism is provided for modifying an existing recipe to meet a set of desired colors for a final food dish. Responsive to receiving a request to modify the existing recipe to meet the set of desired colors, at least one of the set of existing colors to be changed to meet the desired set of colors is identified. An ingredient-action-sequence triplet associated with each at least one existing color to be changed in the existing recipe is identified and, from a corpus of ingredient-action-sequence triplets associated with other existing recipes, one or more candidates that can he added to produce the at least one target color are identified. The one or more candidates that can he added are ranked based on how each candidate pairs best with other ingredients in the existing recipe. Based on a selection of a candidate, the existing recipe is modified with the selected candidate.",
  "filing_date": "20160524",
  "patent_number": "None",
  "summary": "<SOH> SUMMARY <EOH>This Summary is provided to introduce a selection of concepts in a simplified form that are further described herein in the Detailed Description. This Summary is not intended to identify key factors or essential features of the claimed subject matter, nor is it intended to be used to limit the scope of the claimed subject matter. In one illustrative embodiment, a method, in a data processing system, is provided for modifying an existing recipe to meet a set of desired colors for a final food dish. Responsive to receiving a request to modify the existing recipe to meet the set of desired colors, the set of desired colors has at least one target color that is different from a set of existing colors of the final food dish, the illustrative embodiment identifies at least one of the set of existing colors to be changed to meet the desired set of colors. The illustrative embodiment identifies an ingredient-action-sequence triplet associated with each at least one existing color to be changed in the existing recipe. From a corpus of ingredient-action-sequence triplets associated with other existing recipes, the illustrative embodiment identifies one or more candidates that can be added to the existing recipe to produce the at least one target color. The illustrative embodiment ranks the one or more candidates that can be added to the existing recipe to produce the at least one target color based on how each candidate pairs best with other ingredients in the existing recipe. Based on a selection of a candidate from the one or more candidates that can be added to the existing recipe to produce the at least one target color, the illustrative embodiment modifies the existing recipe with the selected candidate. In other illustrative embodiments, a computer program product comprising a computer useable or readable medium having a computer readable program is provided. The computer readable program, when executed on a computing device, causes the computing devi...",
  "date_published": "20171130",
  "title": "Predicting a Chromatic Identity of an Existing Recipe and Modifying the Existing Recipe to Meet a Desired Set of Colors by Adding New Elements to the Recipe",
  "ipcr_labels": [
    "G06N700",
    "G06N9900",
    "G06F1730"
  ],
  "_processing_info": {
    "original_size": 114960,
    "optimized_size": 4012,
    "reduction_percent": 96.51
  }
}