{
  "date_produced": "20160928",
  "publication_number": "US20160300158A1-20161013",
  "main_ipcr_label": "G06N9900",
  "decision": "PENDING",
  "application_number": "15162631",
  "inventor_list": [
    {
      "inventor_name_last": "Masato",
      "inventor_name_first": "Yoshida",
      "inventor_city": "Sapporo",
      "inventor_state": "",
      "inventor_country": "JP"
    }
  ],
  "abstract": "The system and method which provides for a virtual creature using an artificial intelligence engine and an augmented reality engine. The user provides input data in form of queries to the client device which is processed by the artificial intelligence engine and results are generated and commands are provide to the augmented reality engine which in turn generates a virtual creature of user's to which the user is able to interact and get assistance. The creature is continuously evolved by the artificial intelligence engine to help the user in a better and efficient manner.",
  "filing_date": "20160524",
  "patent_number": "None",
  "summary": "<SOH> BRIEF SUMMARY OF THE INVENTION <EOH>The system consists of a client device which is responsible for taking inputs from the user. The Inputs may be received in varied manner ranging from voice input to gesture or manual input through a suitable device. The client device further sends the input to be processed by the system for further use. A program is provided in this system which either stored on a local storage device or is present online. This program sends the input data to artificial intelligence engine to process the request as per the user request/command. The artificial intelligence engine generates an augmented reality image to the user environment on the basis of the processed data. The user can also request the system to generate an augmented reality based virtual creature to which the user may communicate and give commands. The artificial intelligence engine produces this augmented reality image interface. The user is also given the option to choose the kind of augmented reality based virtual creature, which may range from a pet, humanoid, machine, character etc. It is the object of the invention to provide for a system which uses the artificial intelligence mechanism in the best way to produce a augmented reality based creature in order to help the user communicate in the most effective manner. These and other features, objects and advantages of the present invention will be readily apparent to persons of ordinary skill in the art upon reading the entirety of this disclosure, which includes the accompanying drawings and claims.",
  "date_published": "20161013",
  "title": "Nurturing Virtual Creatures with Augmented reality and artificial intelligence",
  "ipcr_labels": [
    "G06N9900",
    "G06T1900"
  ],
  "_processing_info": {
    "original_size": 16353,
    "optimized_size": 2725,
    "reduction_percent": 83.34
  }
}