{
  "date_produced": "20161116",
  "publication_number": "US20160350661A1-20161201",
  "main_ipcr_label": "G06N504",
  "decision": "PENDING",
  "application_number": "15164745",
  "inventor_list": [
    {
      "inventor_name_last": "Sato",
      "inventor_name_first": "Yasuhide",
      "inventor_city": "Osaka",
      "inventor_state": "",
      "inventor_country": "JP"
    },
    {
      "inventor_name_last": "Arai",
      "inventor_name_first": "Yoshihiko",
      "inventor_city": "Osaka",
      "inventor_state": "",
      "inventor_country": "JP"
    },
    {
      "inventor_name_last": "Moritani",
      "inventor_name_first": "Yuri",
      "inventor_city": "Osaka",
      "inventor_state": "",
      "inventor_country": "JP"
    }
  ],
  "abstract": "An image forming apparatus includes a replacement time predicting circuit, a variation determining circuit, and a replacement time adjusting circuit. The replacement time predicting circuit periodically predicts, based on a consumption trend, a replacement time of a consumption article starting from a time when a replacement article is ordered, the replacement time being a time when a non-consumption amount of the consumption article is equal to or less than a specific replacement threshold. The variation determining circuit determines a variation of each later-predicted replacement time from a replacement time that is predicted when the replacement article is ordered, each later-predicted replacement time being predicted after the replacement article is ordered. The replacement time adjusting circuit, in response to the variation determined by the variation determining circuit, changes the consumption trend of the consumption article so as to reduce or eliminate the variation.",
  "filing_date": "20160525",
  "patent_number": "None",
  "summary": "<SOH> SUMMARY <EOH>An image forming apparatus according to an aspect of the present disclosure includes a replacement time predicting circuit, a variation determining circuit, and a replacement time adjusting circuit. The replacement time predicting circuit is that periodically predicts, based on a consumption trend, a replacement time of a consumption article starting from a time when a replacement article is ordered, the replacement time being a time when a non-consumption amount of the consumption article is equal to or less than a specific replacement threshold. The variation determining circuit that determines a variation of each later-predicted replacement time from a replacement time that is predicted when the replacement article is ordered, each later-predicted replacement time being predicted after the replacement article is ordered. The replacement time adjusting circuit that changes, in response to the variation determined by the variation determining circuit, the consumption trend of the consumption article so as to reduce or eliminate the variation. A recording medium according to another aspect of the present disclosure is a non-transitory computer-readable recording medium storing a replacement time management program which causes a computer to execute: periodically predicting, based on a consumption trend, a replacement time of a consumption article starting from a time when a replacement article is ordered, the replacement time being a time when a non-consumption amount of the consumption article is equal to or less than a specific replacement threshold; determining a variation of each later-predicted replacement time from a replacement time that is predicted when the replacement article is ordered, each later-predicted replacement time being predicted after the replacement article is ordered; and changing, in response to the determined variation, the consumption trend of the consumption article so as to reduce or eliminate the variation. This Summa...",
  "date_published": "20161201",
  "title": "IMAGE FORMING APPARATUS AND NON-TRANSITORY RECORDING MEDIUM STORING REPLACEMENT TIME MANAGEMENT PROGRAM",
  "ipcr_labels": [
    "G06N504",
    "G06Q3006"
  ],
  "_processing_info": {
    "original_size": 41242,
    "optimized_size": 3873,
    "reduction_percent": 90.61
  }
}