{
  "date_produced": "20160908",
  "publication_number": "US20160275408A1-20160922",
  "main_ipcr_label": "G06N700",
  "decision": "REJECTED",
  "application_number": "15166594",
  "inventor_list": [
    {
      "inventor_name_last": "Davidoff",
      "inventor_name_first": "Andrew J.",
      "inventor_city": "Bogor",
      "inventor_state": "",
      "inventor_country": "ID"
    }
  ],
  "abstract": "A processor-based system for generating a probability map may include at least one processor. The at least one processor may be configured to receive data associated with a quantity to be mapped and apply a processor-based mapping algorithm to generate a first map of values for the quantity within an area of interest. The processor may also be configured to modify at least one or more of data provided as input to the mapping algorithm or one or more input parameters associated with the mapping algorithm and generate at least a second map of values for the quantity within the area of interest; and generate a probability map associated with the quantity based on the first and second maps.",
  "filing_date": "20160527",
  "patent_number": "None",
  "summary": "<SOH> SUMMARY <EOH>A processor-based system for generating a probability map may include at least one processor. The at least one processor may be configured to receive data associated with a quantity to be mapped and apply a processor-based mapping algorithm to generate a first map of values for the quantity within an area of interest. The processor may also be configured to modify at least one or more of data provided as input to the mapping algorithm or one or more input parameters associated with the mapping algorithm and generate at least a second map of values for the quantity within the area of interest; and generate a probability map associated with the quantity based on the first and second maps. A computer readable storage medium having computer readable program code embodied in the medium for use by a processor-based system in generating a probability map may include program code configured to receive data associated with a quantity to be mapped. The program code may also be configured to apply a processor-based mapping algorithm to generate a first map of values for the quantity within an area of interest; modify at least one or more of data provided as input to the mapping algorithm or one or more input parameters associated with the mapping algorithm and generate at least a second map of values for the quantity within the area of interest; and generate a probability map associated with the quantity based on the first and second maps. A method of generating a probability map may include receiving data associated with a quantity to be mapped and applying a processor-based mapping algorithm to generate a first map of values for the quantity within an area of interest. The method may also include modifying at least one or more of data provided as input to the mapping algorithm or one or more input parameter associated with the mapping algorithm and generating at least a second map of values for the quantity within the area of interest; and generating a pro...",
  "date_published": "20160922",
  "title": "PROBABILITY MAPPING SYSTEM",
  "ipcr_labels": [
    "G06N700",
    "G06N502"
  ],
  "_processing_info": {
    "original_size": 66869,
    "optimized_size": 3221,
    "reduction_percent": 95.18
  }
}