{
  "date_produced": "20170713",
  "publication_number": "US20170213133A1-20170727",
  "main_ipcr_label": "G06N308",
  "decision": "PENDING",
  "application_number": "15162361",
  "inventor_list": [
    {
      "inventor_name_last": "Modha",
      "inventor_name_first": "Dharmendra S.",
      "inventor_city": "San Jose",
      "inventor_state": "CA",
      "inventor_country": "US"
    }
  ],
  "abstract": "The present invention relates to unsupervised, supervised and reinforced learning via spiking computation. The neural network comprises a plurality of neural modules. Each neural module comprises multiple digital neurons such that each neuron in a neural module has a corresponding neuron in another neural module. An interconnection network comprising a plurality of edges interconnects the plurality of neural modules. Each edge interconnects a first neural module to a second neural module, and each edge comprises a weighted synaptic connection between every neuron in the first neural module and a corresponding neuron in the second neural module.",
  "filing_date": "20160523",
  "patent_number": "None",
  "summary": "<SOH> BRIEF SUMMARY <EOH>The present invention relates to unsupervised, supervised and reinforced learning via spiking computation. In one embodiment, the present invention provides a neural network comprising a plurality of neural modules, wherein each neural module comprises multiple digital neurons such that each neuron in a neural module has a corresponding neuron in another neural module. An interconnection network comprising a plurality of edges interconnects the plurality of neural modules, wherein each edge interconnects a first neural module to a second neural module, and each edge comprises a weighted synaptic connection between every neuron in the first neural module and a corresponding neuron in the second neural module. In another embodiment, the present invention provides a method comprising producing spiking computation in a neural network comprising a plurality of neural modules interconnected via weighted synaptic connections in an interconnection network, wherein each neural module comprises multiple digital neurons such that every neuron in a first neural module is connected to a corresponding neuron in a second neural module via a weighted synaptic connection. The spiking computation comprises generating signals which define a set of time steps for operation of the neuron. At each time step, each neuron based on its operational state determines whether to generate a firing event in response to firing events received as input signals from neurons in other neural modules. Each said input signal is weighted by the weighted synaptic connection communicating said input signal to said neuron. These and other features, aspects and advantages of the present invention will become understood with reference to the following description, appended claims and accompanying figures.",
  "date_published": "20170727",
  "title": "UNSUPERVISED, SUPERVISED AND REINFORCED LEARNING VIA SPIKING COMPUTATION",
  "ipcr_labels": [
    "G06N308"
  ],
  "_processing_info": {
    "original_size": 79729,
    "optimized_size": 3032,
    "reduction_percent": 96.2
  }
}