{
  "decision": "ACCEPTED",
  "application_number": "15163244",
  "date_published": "20160915",
  "date_produced": "20160831",
  "title": "MEDIA CONTENT MANAGEMENT",
  "filing_date": "20160524",
  "inventor_list": [
    {
      "inventor_name_last": "WELTS",
      "inventor_name_first": "FRANK ANDREW",
      "inventor_city": "SAN LUIS OBISPO",
      "inventor_state": "CA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "MORRELLI",
      "inventor_name_first": "BEN",
      "inventor_city": "SAN LUIS OBISPO",
      "inventor_state": "CA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "MONTALVO",
      "inventor_name_first": "GREGORY",
      "inventor_city": "DURHAM",
      "inventor_state": "NC",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "REYNOLDS",
      "inventor_name_first": "DANIEL THOMAS TAPUITEA",
      "inventor_city": "BIRMINGHAM",
      "inventor_state": "MI",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "BENAMOU",
      "inventor_name_first": "ANDREAS MARC",
      "inventor_city": "SPICEWOOD",
      "inventor_state": "TX",
      "inventor_country": "US"
    }
  ],
  "ipcr_labels": [
    "H04L2908",
    "H04N1940",
    "H04N1970",
    "G06F1730"
  ],
  "main_ipcr_label": "H04L2908",
  "summary": "<SOH> BRIEF DESCRIPTION OF THE DRAWINGS <EOH>The features and advantages of the various exemplary embodiments will become apparent from the following detailed description when considered in conjunction with the accompanying drawings. Where possible, the same reference numerals and characters are used to denote like features, elements, components or portions of the inventive embodiments. It is intended that changes and modifications can be made to the described exemplary embodiments without departing from the true scope and spirit of the inventive embodiments as is defined by the claims. In the drawings: FIG. 1A illustrates an ad hoc networking arrangement in accordance with an embodiment; FIG. 1B illustrates a combination ad hoc and a conventional networking arrangement in accordance with an embodiment; FIG. 1C illustrates an conventional networking arrangement in accordance with an embodiment; FIG. 2A illustrates an architectural arrangement for media content management in accordance with an embodiment; FIG. 2B illustrates an architectural arrangement for media content management in accordance with an embodiment; FIG. 2C illustrates a device data storage configuration is depicted in accordance with an embodiment; FIG. 3 illustrates a process for media content management in accordance with an embodiment; FIG. 4 illustrates an exemplary computer device upon in which the various embodiments may be implemented. detailed-description description=\"Detailed Description\" end=\"lead\"?",
  "patent_number": "9832263",
  "abstract": "System, computer implemented process and computer program product for managing media content among a plurality of devices which includes the exchange of device status data among two or more devices. The exchanged device status data includes individual device capabilities and indicia of available media content stored within each of the devices. Each device determines from the exchanged device status data whether any differences exist in available media content stored among the plurality of devices and also whether any of the determined differences in media content will require transcoding to compatible data formats. Once the determinations have been completed, synchronizing and optionally transcoding of the available media content is performed based on the determinations made from the exchanged device status data. Any required transcoding may be performed either before or after media content synchronizing.",
  "publication_number": "US20160269484A1-20160915",
  "_processing_info": {
    "original_size": 54485,
    "optimized_size": 3603,
    "reduction_percent": 93.39
  }
}