{
  "date_produced": "20170412",
  "publication_number": "US20170116532A1-20170427",
  "main_ipcr_label": "G06N504",
  "decision": "PENDING",
  "application_number": "15167102",
  "inventor_list": [
    {
      "inventor_name_last": "Vance",
      "inventor_name_first": "Michael Steffen",
      "inventor_city": "Kenmore",
      "inventor_state": "WA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Benson",
      "inventor_name_first": "Jared T.",
      "inventor_city": "Pleasant Hill",
      "inventor_state": "CA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Robertson",
      "inventor_name_first": "Christian",
      "inventor_city": "Concord",
      "inventor_state": "CA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Shah",
      "inventor_name_first": "Shilpa R.",
      "inventor_city": "Oakland",
      "inventor_state": "CA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "White",
      "inventor_name_first": "Gabriel J.",
      "inventor_city": "San Francisco",
      "inventor_state": "CA",
      "inventor_country": "US"
    }
  ],
  "abstract": "Group-based information displays correspond to the collection of display objects representative of either contacts associated with a user or applications or executable components executable, or otherwise accessible, via the mobile communication device. The group-based information displays can be logically organized according to subject matter organizational criteria. The subject matter organizational criteria can include, for example, organization or other affiliates criteria, event-based, or activity based criteria, topic-based criteria and the like. Through the group-based information displays, mobile communication device users can initiate one or more actions corresponding to the selection of display objects corresponding to applications or executable components. Additionally, as applicable, the user can limit, or otherwise apply, the initiated actions to contacts identified, or otherwise associated, with the specific group-based information display.",
  "filing_date": "20160527",
  "patent_number": "None",
  "summary": "<SOH> BRIEF DESCRIPTION OF THE DRAWINGS <EOH>The foregoing aspects and many of the attendant advantages of the present disclosure will become more readily appreciated as the same become better understood by reference to the following detailed description, when taken in conjunction with the accompanying drawings, wherein: FIG. 1 is a block diagram illustrative of a mobile communication environment including a number of mobile communication devices and a group processing service; FIG. 2 is a block diagram illustrative of components of a mobile communication device for use the generation, management and display of group-based information; FIGS. 3A-3C are illustrative user interfaces generated on a mobile communication device for displaying group-based information displays; FIG. 4 is a flow diagram of an illustrative of a group-based information processing routine implemented by a group information processing service to generate group-based information; and FIGS. 5A-5C are illustrative user interfaces generated on a mobile communication device for generating group-based information based on user inputs. detailed-description description=\"Detailed Description\" end=\"lead\"?",
  "date_published": "20170427",
  "title": "GROUP BASED INFORMATION DISPLAYS",
  "ipcr_labels": [
    "G06N504",
    "G06Q5000"
  ],
  "_processing_info": {
    "original_size": 61953,
    "optimized_size": 3295,
    "reduction_percent": 94.68
  }
}