{
  "decision": "ACCEPTED",
  "application_number": "15163497",
  "date_published": "20170202",
  "date_produced": "20170119",
  "title": "METHOD FOR DESIGNING MULTIPLE TUNED FILTER IN HIGH VOLTAGE DIRECT CURRENT SYSTEM",
  "filing_date": "20160524",
  "inventor_list": [
    {
      "inventor_name_last": "CHYUN",
      "inventor_name_first": "Yi Kyung",
      "inventor_city": "Ansan-si",
      "inventor_state": "",
      "inventor_country": "KR"
    }
  ],
  "ipcr_labels": [
    "G06F1750",
    "H03H701"
  ],
  "main_ipcr_label": "G06F1750",
  "summary": "<SOH> SUMMARY <EOH>Embodiments provide an MTF according to characteristics of an HVDC system, a method for designing a damped type MTF, and a designing device. In one embodiment, a method for designing an MTF in an HVDC system includes: setting an input parameter constituting the MTF; setting a resonance frequency of the MTF; extracting at least one LC combination case constituting the MTF on the basis of the input parameter and the resonance frequency; performing optimization for harmonic reduction on the LC combination case; and extracting an LC combination case determined based on a result obtained by performing the optimization. According to the present disclosure, it is possible to implement an MTF in an HVDC system, which has an optimal combination of R, L, and C, which satisfies a harmonic voltage regulation value and a harmonic current allowable level by considering efficiency and harmonic reduction through the above-described method. The details of one or more embodiments are set forth in the accompanying drawings and the description below. Other features will be apparent from the description and drawings, and from the claims.",
  "patent_number": "9953119",
  "abstract": "A method for designing a multiple tuned filter (MTF) in a high voltage direct current (HVDC) system includes setting an input parameter constituting the MTF; setting a resonance frequency of the MTF; extracting at least one LC combination case constituting the MTF on the basis of the input parameter and the resonance frequency; performing optimization for harmonic reduction on the LC combination case; and extracting an LC combination case determined based on a result obtained by performing the optimization.",
  "publication_number": "US20170032070A1-20170202",
  "_processing_info": {
    "original_size": 32840,
    "optimized_size": 2246,
    "reduction_percent": 93.16
  }
}