{
  "date_produced": "20170621",
  "publication_number": "US20170193396A1-20170706",
  "main_ipcr_label": "G06N9900",
  "decision": "PENDING",
  "application_number": "15168309",
  "inventor_list": [
    {
      "inventor_name_last": "KANANI",
      "inventor_name_first": "Pallika Haridas",
      "inventor_city": "Westford",
      "inventor_state": "MA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "WICK",
      "inventor_name_first": "Michael Louis",
      "inventor_city": "Medford",
      "inventor_state": "MA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "SILVERSTEIN",
      "inventor_name_first": "Katherine",
      "inventor_city": "Amherst",
      "inventor_state": "MA",
      "inventor_country": "US"
    }
  ],
  "abstract": "A system that performs natural language processing receives a text corpus that includes a plurality of documents and receives a knowledge base. The system generates a set of document n-grams from the text corpus and considers all n-grams as candidate mentions. The system, for each candidate mention, queries the knowledge base and in response retrieves results. From the results retrieved by the queries, the system generates a search space and generates a joint model from the search space.",
  "filing_date": "20160531",
  "patent_number": "None",
  "summary": "<SOH> SUMMARY <EOH>One embodiment is a system that performs natural language processing. The system receives a text corpus that includes a plurality of documents and receives a knowledge base. The system generates a set of document n-grams from the text corpus and considers all n-grams as candidate mentions. The system, for each candidate mention, queries the knowledge base and in response retrieves results. From the results retrieved by the queries, the system generates a search space and generates a joint model from the search space.",
  "date_published": "20170706",
  "title": "NAMED ENTITY RECOGNITION AND ENTITY LINKING JOINT TRAINING",
  "ipcr_labels": [
    "G06N9900",
    "G06N700",
    "G06F1730"
  ],
  "_processing_info": {
    "original_size": 31514,
    "optimized_size": 1913,
    "reduction_percent": 93.93
  }
}