{
  "decision": "ACCEPTED",
  "application_number": "15163585",
  "date_published": "20170126",
  "date_produced": "20170110",
  "title": "FINGERPRINTING OF DATA",
  "filing_date": "20160524",
  "inventor_list": [
    {
      "inventor_name_last": "Malik",
      "inventor_name_first": "Sumit",
      "inventor_city": "Bangalore",
      "inventor_state": "",
      "inventor_country": "IN"
    },
    {
      "inventor_name_last": "Sahi",
      "inventor_name_first": "Raja",
      "inventor_city": "Los Angeles",
      "inventor_state": "CA",
      "inventor_country": "US"
    }
  ],
  "ipcr_labels": [
    "G06T100",
    "G11B2000",
    "G06F2110"
  ],
  "main_ipcr_label": "G06T100",
  "summary": "<SOH> SUMMARY <EOH>The present invention provides methods and apparatus for implementing fingerprinting data. In one implementation, a method of fingerprinting includes: receiving a plurality of input datasets, each of said plurality of input datasets divided into a plurality of input segments, at least one of said plurality of input datasets uniquely marked; selecting at least one input segment from one of at least two different input datasets of said plurality of input datasets; and arranging said selected at least one input segment to produce an output dataset having a plurality of output segments, such that the number of output segments is equal to the number of input segments in each input dataset.",
  "patent_number": "9911171",
  "abstract": "A method of identifying a source of media, including: performing the following actions using at least one computer: identifying a plurality of segments arranged to form said media; generating a representative master key (RMK) of said media from the arrangement of the plurality of segments, wherein the RMK comprises a first listing of master identifiers corresponding to the plurality of segments, each master identifier of the first listing of master identifiers identifying a source master of each segment of the plurality of segments; receiving a listing of fingerprints, each fingerprint of the listing of fingerprints having a corresponding identifier that identifies the source of said media, said each fingerprint also including a second listing of master identifiers; and comparing the first listing of master identifiers in the RMK to the second listing of master identifiers in said each fingerprint in the listing of fingerprints to identify the source.",
  "publication_number": "US20170024842A1-20170126",
  "_processing_info": {
    "original_size": 43330,
    "optimized_size": 2354,
    "reduction_percent": 94.57
  }
}