{
  "date_produced": "20160831",
  "publication_number": "US20160267376A1-20160915",
  "main_ipcr_label": "G06N304",
  "decision": "PENDING",
  "application_number": "15163563",
  "inventor_list": [
    {
      "inventor_name_last": "Jackson",
      "inventor_name_first": "Bryan L.",
      "inventor_city": "Fremont",
      "inventor_state": "CA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Modha",
      "inventor_name_first": "Dharmendra S.",
      "inventor_city": "San Jose",
      "inventor_state": "CA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Pass",
      "inventor_name_first": "Norman J.",
      "inventor_city": "Sunnyvale",
      "inventor_state": "CA",
      "inventor_country": "US"
    }
  ],
  "abstract": "The present invention provides a system comprising a neurosynaptic processing device including multiple neurosynaptic core circuits for parallel processing, and a serial processing device including at least one processor core for serial processing. Each neurosynaptic core circuit comprises multiple electronic neurons interconnected with multiple electronic axons via a plurality of synapse devices. The system further comprises an interconnect circuit for coupling the neurosynaptic processing device with the serial processing device. The interconnect circuit enables the exchange of data packets between the neurosynaptic processing device and the serial processing device.",
  "filing_date": "20160524",
  "patent_number": "None",
  "summary": "<SOH> BRIEF SUMMARY <EOH>One embodiment provides a system comprising a neurosynaptic processing device including multiple neurosynaptic core circuits for parallel processing, and a serial processing device including at least one processor core for serial processing. Each neurosynaptic core circuit comprises multiple electronic neurons interconnected with multiple electronic axons via a plurality of synapse devices. The system further comprises an interconnect circuit for coupling the neurosynaptic processing device with the serial processing device. The interconnect circuit enables the exchange of data packets between the neurosynaptic processing device and the serial processing device. Another embodiment provides a method comprising routing one or more serialized data packets to at least one serial processing device for serial processing, and routing one or more de-serialized data packets to at least one neurosynaptic processing device for parallel processing. Each serial processing device comprises at least one processor core for serial processing. Each neurosynaptic processing device comprises multiple neurosynaptic core circuits for parallel processing. Each neurosynaptic core circuit includes multiple electronic neurons interconnected with multiple electronic axons via a plurality of synapse devices. The neurosynaptic processing devices are coupled with the serial processing devices via an interconnect circuit for data exchange therebetween. These and other features, aspects and advantages of the present invention will become understood with reference to the following description, appended claims and accompanying figures.",
  "date_published": "20160915",
  "title": "COUPLING PARALLEL EVENT-DRIVEN COMPUTATION WITH SERIAL COMPUTATION",
  "ipcr_labels": [
    "G06N304",
    "G06N3063"
  ],
  "_processing_info": {
    "original_size": 46258,
    "optimized_size": 3196,
    "reduction_percent": 93.09
  }
}