{
  "decision": "ACCEPTED",
  "application_number": "15169022",
  "date_published": "20160922",
  "date_produced": "20160908",
  "title": "ONE GESTURE, ONE BLINK, AND ONE-TOUCH PAYMENT AND BUYING USING HAPTIC CONTROL VIA MESSAGING AND CALLING MULTIMEDIA SYSTEM ON MOBILE AND WEARABLE DEVICE, CURRENCY TOKEN INTERFACE, POINT OF SALE DEVICE, AND ELECTRONIC PAYMENT CARD",
  "filing_date": "20160531",
  "inventor_list": [
    {
      "inventor_name_last": "Zhou",
      "inventor_name_first": "Dylan T. X.",
      "inventor_city": "Tiburon",
      "inventor_state": "CA",
      "inventor_country": "US"
    }
  ],
  "ipcr_labels": [
    "G06Q2032",
    "H04B13827",
    "H04L932",
    "H04W1206",
    "H04W7602",
    "G06Q2010",
    "G06Q2006",
    "G06Q3006",
    "G06Q2040",
    "H04L2908",
    "H04W400",
    "H04M1725"
  ],
  "main_ipcr_label": "G06Q2032",
  "summary": "<SOH> SUMMARY OF INVENTION <EOH>(1) Field of the Invention This application relates generally to data processing, and more specifically to methods and systems for one-touch and one gesture buying and paying performed via a mobile and wearable device. (2) Background Mobile payments generally refer to payment operations performed via a mobile or wearable device. The operations performed via mobile and wearable devices may include electronic commerce transactions, retail purchasing, micropayments, and other daily payments. Mobile payments may utilize credit cards, debit cards, gift cards, and virtual currencies. While mobile payments facilitate and stimulate the trade, the procedure of providing financial details and authenticating of identity may be tedious and time-consuming. Therefore, the convenience of mobile payments for daily micropayments is hindered.",
  "patent_number": "9576285",
  "abstract": "Methods and systems for messaging, calling, and one blink, one-touch, and one gesture payments and buying via mobile and wearable devices are disclosed. An exemplary system comprises a database in communication with a processor, the processor configured to provide a haptic control associated with the system. The haptic control is shown on a display of a mobile and wearable device overlapping other visual elements. The haptic control provides mode selection elements associated with a payment, messaging, and calling modes. The processor receives a selection of the payment mode via the mode selection elements from a user. Upon the selection, context is extracted from the display. Based on the context, a payment transaction type which the user intends to perform is determined. The payment transaction type includes a payment receiving transaction and a payment sending transaction. Based on the determining, a transaction request is sent to a financial institution using the extraction",
  "publication_number": "US20160275483A1-20160922",
  "_processing_info": {
    "original_size": 57886,
    "optimized_size": 2712,
    "reduction_percent": 95.31
  }
}