{
  "date_produced": "20161109",
  "publication_number": "US20160342905A1-20161124",
  "main_ipcr_label": "G06N9900",
  "decision": "PENDING",
  "application_number": "15160440",
  "inventor_list": [
    {
      "inventor_name_last": "GHOSE",
      "inventor_name_first": "AVIK",
      "inventor_city": "KOLKATA",
      "inventor_state": "",
      "inventor_country": "IN"
    },
    {
      "inventor_name_last": "PAL",
      "inventor_name_first": "ARPAN",
      "inventor_city": "KOLKATA",
      "inventor_state": "",
      "inventor_country": "IN"
    },
    {
      "inventor_name_last": "PAL",
      "inventor_name_first": "ARINDAM",
      "inventor_city": "KOLKATA",
      "inventor_state": "",
      "inventor_country": "IN"
    },
    {
      "inventor_name_last": "CHATTOPADHYAY",
      "inventor_name_first": "TANUSHYAM",
      "inventor_city": "KOLKATA",
      "inventor_state": "",
      "inventor_country": "IN"
    },
    {
      "inventor_name_last": "MAITI",
      "inventor_name_first": "SANTA",
      "inventor_city": "KOLKATA",
      "inventor_state": "",
      "inventor_country": "IN"
    }
  ],
  "abstract": "A multi-dimensional sensor data analysis system and method is provided. The multi-dimensional sensor data analysis system receives indoor and outdoor location, online and physical activity, online and physical proximity and additional a plurality of inputs (specific to a user), for example, surrounding of the subject, physiological parameters of the subject and recent social status of the subject, both online and offline. The multi-dimensional sensor data analysis system processes these inputs along with the knowledge of past behavior and traditional parameters of location, proximity and activity by performing a multi-dimensional sensor data analysis fusion technique, producing one or more outputs, for example, predicting or determining a human behaviour to a given stimuli.",
  "filing_date": "20160520",
  "patent_number": "None",
  "summary": "<SOH> SUMMARY <EOH>Embodiments of the present disclosure present technological improvements as solutions to one or more of the above-mentioned technical problems recognized by the inventors in conventional systems. For example, in one aspect, a processor implemented method is provided. A processor implemented method, comprising: obtaining, using one or more hardware processors, one or more inputs from one or more sources, wherein the one or more inputs are specific to a user, wherein the one or more inputs correspond to at least one of one or more contexts associated with the user and one or more environmental conditions; analyzing, using the one or more hardware processors, the one or more inputs corresponding to at least one of the one or more contexts associated with the user and the one or more environmental conditions; assigning, using the one or more hardware processors, one or more weights to the one or more analyzed inputs based on the one or more sources to obtain one or more weighted analyzed inputs. In an embodiment, the one or more weights are assigned to the one or more analyzed inputs based on at least one of a current location of the user, and an event associated with the user. The method further comprises fusing, using the one or more hardware processors, the one or more weighted analyzed inputs to derive one or more vital signs of the user. In an embodiment, the one or more weighted analyzed inputs are prioritized for fusing to derive the one or more vital signs of the user based on at least one of a current location of the user, and an event associated with the user. In an embodiment, the one or more weights are assigned to the one or more analyzed inputs using one or more machine learning techniques. The method further comprises determining, using the one or more hardware processors, a behavior of the user based on the one or more vital signs of the user. In an embodiment, the one or more sources comprises at least one of one or more location sens...",
  "date_published": "20161124",
  "title": "MULTI-DIMENSIONAL SENSOR DATA BASED HUMAN BEHAVIOUR DETERMINATION SYSTEM AND METHOD",
  "ipcr_labels": [
    "G06N9900",
    "G06N502"
  ],
  "_processing_info": {
    "original_size": 56826,
    "optimized_size": 3936,
    "reduction_percent": 93.07
  }
}