{
  "decision": "PENDING",
  "application_number": "15166292",
  "date_published": "20161201",
  "date_produced": "20161116",
  "title": "ONLINE MARKETPLACE OF PLUGINS FOR ENHANCING DIALOG SYSTEMS",
  "filing_date": "20160527",
  "inventor_list": [
    {
      "inventor_name_last": "Gelfenbeyn",
      "inventor_name_first": "Ilya Gennadyevich",
      "inventor_city": "Sunnyvale",
      "inventor_state": "CA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Goncharuk",
      "inventor_name_first": "Artem",
      "inventor_city": "Mountain View",
      "inventor_state": "CA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Sirotin",
      "inventor_name_first": "Pavel Aleksandrovich",
      "inventor_city": "Sunnyvale",
      "inventor_state": "CA",
      "inventor_country": "US"
    }
  ],
  "ipcr_labels": [
    "G06F9445",
    "G06Q2012",
    "H04L2906"
  ],
  "main_ipcr_label": "G06F9445",
  "summary": "<SOH> SUMMARY <EOH>This summary is provided to introduce a selection of concepts in a simplified form that are further described below in the Detailed Description. This summary is not intended to identify key features or essential features of the claimed subject matter, nor is it intended to be used as an aid in determining the scope of the claimed subject matter. Provided is a system for enhancing dialog systems. The system may include at least one processor and a memory. The memory may be operable to maintain an online marketplace that may comprise a plurality of dialog system extension elements. Each of the plurality of dialog system extension elements may include at least one of a dialog system plugin, a dialog system add-on, a dialog system update, and a dialog system upgrade. The processor may be operable to receive a selection of one of the plurality of dialog system extension elements from a software developer. The software developer may have a dialog system associated with the software developer. The processor may be further operable to associate the one of the plurality of dialog system extension elements selected by the software developer with a dialog system of the software developer. Provided is a method for enhancing dialog systems. The method may include maintaining an online marketplace that may comprise a plurality of dialog system extension elements. Each of the plurality of dialog system extension elements may include at least one of a dialog system plugin, a dialog system add-on, a dialog system update, and a dialog system upgrade. The method may further include receiving a selection of one of the plurality of dialog system extension elements from a software developer. The software developer may be associated with a dialog system. The method may continue with associating the one of the plurality of dialog system extension elements selected by the software developer with the dialog system of the software developer. Additional objects, advantages, ...",
  "patent_number": "None",
  "abstract": "A method for enhancing dialog systems is disclosed herein. The method comprises maintaining an online marketplace that may include a plurality of dialog system extension elements. Each of the plurality of dialog system extension elements may include at least one of a dialog system plugin, a dialog system add-on, a dialog system update, and a dialog system upgrade. The method may further include receiving a selection of one of the plurality of dialog system extension elements from a software developer. The software developer may be associated with a dialog system. The method may continue with associating the one of the plurality of dialog system extension elements with the dialog system of the software developer.",
  "publication_number": "US20160350101A1-20161201",
  "_processing_info": {
    "original_size": 88103,
    "optimized_size": 3624,
    "reduction_percent": 95.89
  }
}