{
  "decision": "PENDING",
  "application_number": "15168234",
  "date_published": "20170216",
  "date_produced": "20170201",
  "title": "STORAGE DEVICE OPERATING TO PREVENT DATA LOSS WHEN COMMUNICATING IS INTERRUPTED",
  "filing_date": "20160530",
  "inventor_list": [
    {
      "inventor_name_last": "PARK",
      "inventor_name_first": "Jeong-Woo",
      "inventor_city": "Yongin-si",
      "inventor_state": "",
      "inventor_country": "KR"
    },
    {
      "inventor_name_last": "PARK",
      "inventor_name_first": "Younwon",
      "inventor_city": "Suwon-si",
      "inventor_state": "",
      "inventor_country": "KR"
    }
  ],
  "ipcr_labels": [
    "G06F306"
  ],
  "main_ipcr_label": "G06F306",
  "summary": "<SOH> SUMMARY <EOH>Some embodiments include a storage device comprising: at least one nonvolatile memory; a buffer; and a memory controller configured to: receive data from a host; store the data in the buffer; and flush the data in the buffer to the at least one nonvolatile memory in response to an absence of communication with the host for a reference time duration. Some embodiments include a storage device comprising: at least one nonvolatile memory; a buffer; and a memory controller configured to: receive data from a host; store the data in the buffer; and flush the data in the buffer to the at least one nonvolatile memory without a command provided from the host. Some embodiments include a storage device comprising: at least one nonvolatile memory; a buffer; and a memory controller configured to: receive data from a host; store the data in the buffer; and flush the data in the buffer to the at least one nonvolatile memory before receiving a reset command from the host and before receiving a flush command from the host.",
  "patent_number": "None",
  "abstract": "A storage device comprising: at least one nonvolatile memory; a buffer; and a memory controller configured to: receive data from a host; store the data in the buffer; and flush the data in the buffer to the at least one nonvolatile memory in response to an absence of communication with the host for a reference time duration.",
  "publication_number": "US20170046083A1-20170216",
  "_processing_info": {
    "original_size": 74731,
    "optimized_size": 2072,
    "reduction_percent": 97.23
  }
}