{
  "decision": "PENDING",
  "application_number": "15163655",
  "date_published": "20160915",
  "date_produced": "20160831",
  "title": "CONSTRUCTION PAYMENT MANAGEMENT SYSTEM AND METHOD WITH DRAW NOTIFICATION FEATURES",
  "filing_date": "20160524",
  "inventor_list": [
    {
      "inventor_name_last": "Allin",
      "inventor_name_first": "Patrick J.",
      "inventor_city": "Lake Bluff",
      "inventor_state": "IL",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Cherry",
      "inventor_name_first": "Charles C.",
      "inventor_city": "Glenview",
      "inventor_state": "IL",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Eichhorn",
      "inventor_name_first": "William H.",
      "inventor_city": "Hinsdale",
      "inventor_state": "IL",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Niden",
      "inventor_name_first": "Howard L.",
      "inventor_city": "Chicago",
      "inventor_state": "IL",
      "inventor_country": "US"
    }
  ],
  "ipcr_labels": [
    "G06Q2010",
    "G06Q5008",
    "G06Q1006",
    "G06Q3004",
    "G06Q2040"
  ],
  "main_ipcr_label": "G06Q2010",
  "summary": "<SOH> SUMMARY OF THE INVENTION <EOH>In one embodiment, the invention provides a construction payment management system including an application server. The application server has a processor and a computer-readable memory storing instructions. When the instructions are executed by the processor, the application server determines a date on which a draw is to occur for a construction project and generates a notification. The notification includes an indication of the date on which the draw will occur and an invitation to initiate a request for payment to be included in the draw. The application server then determines a plurality of participants associated with the construction project to be included in the draw and transmits the notification to the determined plurality of participants. The application server initiates the draw on the determined date and at least one participant of the determined plurality of participants receives a payment in the draw. In some embodiments, the application server determines the date of the draw based on an input received from one of the participants associated with the construction project. In other embodiments, the applications server automatically schedules periodic draws during the course of the construction project. In another embodiment, the invention provides a method of managing a payment process for a construction project. A date on which a draw is to occur is determined and a notification of the draw is electronically generated. The notification includes an indication of the date on which the draw will occur and an invitation to initiate a request for payment to be included in the draw. A plurality of participant associated with the construction project is identified to receive the notification. The notification is transmitted and the draw is electronically initiated. At least one of the plurality of notified participants receives a payment in the draw. In another embodiment, the invention provides a computer-implemented metho...",
  "patent_number": "None",
  "abstract": "Systems and method for managing a construction payment process. When instructions are executed by a processor, an application server determines a date on which a draw is to occur for a construction project and generates a notification. The notification includes an indication of the date on which the draw will occur and an invitation to initiate a request for payment to be included in the draw. The application server then determines a plurality of participants associated with the construction project to be included in the draw and transmits the notification to the determined plurality of participants. The application server initiates the draw on the determined date and at least one participant of the determined plurality of participants receives a payment in the draw.",
  "publication_number": "US20160267450A1-20160915",
  "_processing_info": {
    "original_size": 144868,
    "optimized_size": 3850,
    "reduction_percent": 97.34
  }
}