{
  "decision": "PENDING",
  "application_number": "15163478",
  "date_published": "20170525",
  "date_produced": "20170510",
  "title": "METHODS AND DEVICES FOR DETECTING INTENDED TOUCH ACTION",
  "filing_date": "20160524",
  "inventor_list": [
    {
      "inventor_name_last": "Yang",
      "inventor_name_first": "Kun",
      "inventor_city": "Beijing",
      "inventor_state": "",
      "inventor_country": "CN"
    },
    {
      "inventor_name_last": "Tao",
      "inventor_name_first": "Jun",
      "inventor_city": "Beijing",
      "inventor_state": "",
      "inventor_country": "CN"
    },
    {
      "inventor_name_last": "Jiang",
      "inventor_name_first": "Zhongsheng",
      "inventor_city": "Beijing",
      "inventor_state": "",
      "inventor_country": "CN"
    }
  ],
  "ipcr_labels": [
    "G06F3041",
    "G06F30346",
    "G06F30488"
  ],
  "main_ipcr_label": "G06F3041",
  "summary": "<SOH> SUMMARY <EOH>This Summary is provided to introduce a selection of concepts in a simplified form that are further described below in the Detailed Description. This Summary is not intended to identify key features or essential features of the claimed subject matter, nor is it intended to be used to limit the scope of the claimed subject matter. In one embodiment, a method for detecting a touch gesture on a device having a touch input interface is provided. The method comprises: generating by a first sensing unit a first sensing parameter upon a touch action on the touch input interface; determining by the first sensing unit a first touch gesture corresponding to the first sensing parameter; acquiring by the first sensing unit a second touch gesture corresponding to a second sensing parameter generated by a second sensing unit; and determining that the touch gesture has been detected and is valid by confirming that the first touch gesture and the second touch gesture are the same, wherein the first and second sensing units are interconnected and are respectively one and the other of a touch control processor for the touch input interface and a motion sensor for the device. In another embodiment, a device for detecting a touch gesture is disclosed. The device comprises: a touch input interface; a first sensing unit comprising one of a touch processor connected to the touch input interface and a motion sensor for the device; and a second sensing unit connected to the first sensing unit and comprising the other of the touch processor and the motion sensor, wherein the first sensing unit is configured to: generate a first sensing parameter upon detecting a touch action on the touch input interface; determine a first touch gesture corresponding to the first sensing parameter; acquire a second touch gesture corresponding to a second sensing parameter generated by a second sensing unit; and determine that the touch gesture has been detected and is valid by confirming th...",
  "patent_number": "None",
  "abstract": "Methods and devices are disclosed for determining that a touch gesture is validly detected. In one embodiment, a method for detecting the touch gesture comprises: generating by a first sensing unit a first sensing parameter upon a touch action on the touch input interface; determining by the first sensing unit a first touch gesture corresponding to the first sensing parameter; acquiring by the first sensing unit a second touch gesture corresponding to a second sensing parameter generated by a second sensing unit; and determining that the touch gesture has been detected and is valid by confirming that the first touch gesture and the second touch gesture are the same; wherein the first and second sensing units are interconnected and are respectively one and the other of a touch control processor for the touch input interface and a motion sensor. With the combination of two sensors and checking the correspondence between touch gestures detected by the two sensors, the accuracy of detectin...",
  "publication_number": "US20170147125A1-20170525",
  "_processing_info": {
    "original_size": 78983,
    "optimized_size": 3849,
    "reduction_percent": 95.13
  }
}