{
  "date_produced": "20171115",
  "publication_number": "US20170344887A1-20171130",
  "main_ipcr_label": "G06N502",
  "decision": "PENDING",
  "application_number": "15166602",
  "inventor_list": [
    {
      "inventor_name_last": "Ahmed",
      "inventor_name_first": "Ahmed Faraj",
      "inventor_city": "Milpitas",
      "inventor_state": "CA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "D'Angelo",
      "inventor_name_first": "Dario",
      "inventor_city": "Los Gatos",
      "inventor_state": "CA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Li",
      "inventor_name_first": "Haojun",
      "inventor_city": "Berkeley",
      "inventor_state": "CA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Washington, Jr.",
      "inventor_name_first": "Kevin A.",
      "inventor_city": "Pflugerville",
      "inventor_state": "TX",
      "inventor_country": "US"
    }
  ],
  "abstract": "Disclosed herein is a heuristically programmable system comprising a web-socket; a backend component that is in operative communication with the web-socket to act as a heuristically programmed algorithm framework that is operative to interact with a user in natural language and in a human-like manner; a main frame computer; a web server that is in operative communication with an internet; where the main frame computer and the web server are in operative communication with the web socket; and a cognitive computing system; where the web socket comprises a computer system configured to provide a voice, motion and/or a graphical interface to a user; and where the web socket is operative to communicate with the cognitive computing system; where the cognitive computing system is operative to convert speech to text and to send this text to the web socket.",
  "filing_date": "20160527",
  "patent_number": "None",
  "summary": "<SOH> SUMMARY <EOH>Disclosed herein is a heuristically programmable system comprising: a web-socket: a backend component that is in operative communication with the web-socket to act as a heuristically programmed algorithm framework that is operative to interact with a user in a human-like manner; a main frame computer; a web server that is in operative communication with an internet; where the main frame computer and the web server are in operative communication with the web socket; and a cognitive computing system; where the web socket comprises a computer system configured to provide a voice, motion and/or a graphical interface to a user; and where the web socket is operative to communicate with the cognitive computing system; where the cognitive computing system is operative to convert speech to text and to send this text to the web socket. Disclosed herein too is a method comprising querying a heuristically programmable system that comprises a web-socket; a backend component that is in operative communication with the web-socket to act as a heuristically programmed algorithm framework that is operative to interact with a user in a human-like manner; a main frame computer; a web server that is in operative communication with an internet; where the main frame computer and the web server are in operative communication with the web socket; and a cognitive computing system; where the web socket comprises a computer system configured to provide a voice, motion and/or a graphical interface to a user; and where the web socket is operative to communicate with the cognitive computing system; where the cognitive computing system is operative to convert speech to text and to send this text to the web socket; and receiving an answer or receiving a query from the system, where the query is designed to elicit further information from a user that enables the system to provide an answer to the query. Disclosed herein too is a method comprising a non-transitory storage medium re...",
  "date_published": "20171130",
  "title": "HEURISTICALLY PROGRAMMED ARTIFICIAL INTELLIGENCE FOR MAINFRAME OPERATING SYSTEMS",
  "ipcr_labels": [
    "G06N502",
    "H04L2908"
  ],
  "_processing_info": {
    "original_size": 83467,
    "optimized_size": 3895,
    "reduction_percent": 95.33
  }
}