{
  "decision": "PENDING",
  "application_number": "15165113",
  "date_published": "20171130",
  "date_produced": "20171115",
  "title": "INITIALIZING A PSEUDO-DYNAMIC DATA COMPRESSION SYSTEM WITH PREDETERMINED HISTORY DATA TYPICAL OF ACTUAL DATA",
  "filing_date": "20160526",
  "inventor_list": [
    {
      "inventor_name_last": "BLAETTLER",
      "inventor_name_first": "TOBIAS",
      "inventor_city": "MAUR",
      "inventor_state": "",
      "inventor_country": "CH"
    },
    {
      "inventor_name_last": "MITTELHOLZER",
      "inventor_name_first": "THOMAS",
      "inventor_city": "ZURICH",
      "inventor_state": "",
      "inventor_country": "CH"
    },
    {
      "inventor_name_last": "PAPANDREOU",
      "inventor_name_first": "NIKOLAOS",
      "inventor_city": "THALWIL",
      "inventor_state": "",
      "inventor_country": "CH"
    },
    {
      "inventor_name_last": "PARNELL",
      "inventor_name_first": "THOMAS",
      "inventor_city": "ZURICH",
      "inventor_state": "",
      "inventor_country": "CH"
    },
    {
      "inventor_name_last": "POZIDIS",
      "inventor_name_first": "CHARALAMPOS",
      "inventor_city": "THALWIL",
      "inventor_state": "",
      "inventor_country": "CH"
    }
  ],
  "ipcr_labels": [
    "G06F306"
  ],
  "main_ipcr_label": "G06F306",
  "summary": "<SOH> BRIEF SUMMARY <EOH>In at least one embodiment, the compression ratio achieved by a Lempel-Ziv encoder is improved by initializing history data structure(s) of the Lempel-Ziv encoder with fixed predetermined history data typical of actual data of a workload to be encoded. The Lempel-Ziv compressor then compresses each of multiple data pages in a sequence of data pages by reference to the fixed predetermined history data. Because the history data structure is preloaded with the predetermined history data, the transient phase performance as measured by compression ratio is enhanced as compared to conventional Lempel-Ziv encoders. Further, because the fixed predetermined history data is also known a priori by a corresponding Lempel-Ziv decoder, proper operation of the Lempel-Ziv decoder is ensured.",
  "patent_number": "None",
  "abstract": "In at least one embodiment, a history data structure of a Lempel-Ziv compressor is preloaded with fixed predetermined history data typical of actual data of a workload of the Lempel-Ziv compressor. The Lempel-Ziv compressor then compresses each of multiple data pages in a sequence of data pages by reference to the fixed predetermined history data.",
  "publication_number": "US20170344264A1-20171130",
  "_processing_info": {
    "original_size": 66679,
    "optimized_size": 2339,
    "reduction_percent": 96.49
  }
}