{
  "decision": "PENDING",
  "application_number": "15161279",
  "date_published": "20171123",
  "date_produced": "20171108",
  "title": "TOUCH-SENSING DEVICES USING MINIMUM DEPTH-VALUE SURFACE CHARACTERIZATIONS AND ASSOCIATED METHODS",
  "filing_date": "20160522",
  "inventor_list": [
    {
      "inventor_name_last": "Holman",
      "inventor_name_first": "David R.",
      "inventor_city": "Brampton",
      "inventor_state": "",
      "inventor_country": "CA"
    },
    {
      "inventor_name_last": "Killpack",
      "inventor_name_first": "Kip C.",
      "inventor_city": "Beaverton",
      "inventor_state": "OR",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Gavino",
      "inventor_name_first": "Brandon",
      "inventor_city": "Beaverton",
      "inventor_state": "OR",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Nooji",
      "inventor_name_first": "Vinay K.",
      "inventor_city": "Hillsboro",
      "inventor_state": "OR",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Dharmadhikari",
      "inventor_name_first": "Abhay A.",
      "inventor_city": "Portland",
      "inventor_state": "OR",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Rao",
      "inventor_name_first": "Vijay M.",
      "inventor_city": "Hillsboro",
      "inventor_state": "OR",
      "inventor_country": "US"
    }
  ],
  "ipcr_labels": [
    "G06F3042",
    "G06F3041"
  ],
  "main_ipcr_label": "G06F3042",
  "summary": "<SOH> BRIEF DESCRIPTION OF THE DRAWINGS <EOH>Features and advantages of technology embodiments will be apparent from the detailed description which follows, taken in conjunction with the accompanying drawings, which together illustrate, by way of example, embodiment features; and, wherein: FIG. 1 is a graphical representation of data in accordance with an embodiment of the present disclosure; FIG. 2 is a side view of a user's finger in a touch window in accordance with an embodiment of the present disclosure; FIG. 3 is a block diagram of an electronic device in accordance with an embodiment of the present disclosure; FIG. 4 is diagram of steps of a method in accordance with an embodiment of the present disclosure; FIG. 5 is a block diagram of an electronic device in accordance with an embodiment of the present disclosure; and FIG. 6 is diagram of steps of a method in accordance with an embodiment of the present disclosure. detailed-description description=\"Detailed Description\" end=\"lead\"? Reference will now be made to the exemplary embodiments illustrated, and specific language will be used herein to describe the same. It will nevertheless be understood that no limitation on disclosure scope is thereby intended.",
  "patent_number": "None",
  "abstract": "Devices for sensing touch on a surface using a minimum depth-value surface characterization, including associated methods, are disclosed and described.",
  "publication_number": "US20170336918A1-20171123",
  "_processing_info": {
    "original_size": 55339,
    "optimized_size": 2728,
    "reduction_percent": 95.07
  }
}