{
  "date_produced": "20171115",
  "publication_number": "US20170344899A1-20171130",
  "main_ipcr_label": "G06N9900",
  "decision": "PENDING",
  "application_number": "15163286",
  "inventor_list": [
    {
      "inventor_name_last": "Zimmerman",
      "inventor_name_first": "Thomas G",
      "inventor_city": "Cupertino",
      "inventor_state": "CA",
      "inventor_country": "US"
    }
  ],
  "abstract": "A method, apparatus and computer program product for automatically generating training sets for machine learning. A set of topics to train a machine learning system is provided. A set of subject matter expert follower sites is identified. Each of the subject matter expert follower sites is about a respective topic of the set of topics and allows followers to post content. The content posted by followers of a respective subject matter expert follower site on the internet is retrieved. The retrieved follower posted content is used to train the machine learning to recognize common features of the retrieved follower posted content of followers having an interest in a respective topic of the set of topics.",
  "filing_date": "20160524",
  "patent_number": "None",
  "summary": "<SOH> BRIEF SUMMARY <EOH>According to this disclosure, a method, apparatus and computer program product for automatically generating training sets for machine learning. A set of topics to train a machine learning system is provided. A set of subject matter expert sites is identified. Each of the subject matter expert sites allows followers to read content posted on the internet by the subject matter expert about a respective topic of the set of topics. The site also allows followers of a respective subject matter expert to upload follower posted content that can be retrieved by observers. The retrieved follower posted content is used to train the machine learning to recognize common features of the retrieved follower posted content of followers having an interest in a respective topic of the set of topics. The foregoing has outlined some of the more pertinent features of the disclosed subject matter. These features should be construed to be merely illustrative. Many other beneficial results can be attained by applying the disclosed subject matter in a different manner or by modifying the invention as will be described.",
  "date_published": "20171130",
  "title": "AUTOMATIC GENERATION OF TRAINING SETS USING SUBJECT MATTER EXPERTS ON SOCIAL MEDIA",
  "ipcr_labels": [
    "G06N9900",
    "G06F1730"
  ],
  "_processing_info": {
    "original_size": 65643,
    "optimized_size": 2433,
    "reduction_percent": 96.29
  }
}