{
  "decision": "PENDING",
  "application_number": "15162510",
  "date_published": "20160915",
  "date_produced": "20160831",
  "title": "TECHNIQUES FOR IMPORTATION OF INFORMATION TO A STORAGE SYSTEM",
  "filing_date": "20160523",
  "inventor_list": [
    {
      "inventor_name_last": "Kalman",
      "inventor_name_first": "Dean",
      "inventor_city": "Cary",
      "inventor_state": "NC",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Pai",
      "inventor_name_first": "Vishwas Venkatesh",
      "inventor_city": "Bangalore",
      "inventor_state": "",
      "inventor_country": "IN"
    },
    {
      "inventor_name_last": "Krishnamurthi",
      "inventor_name_first": "Baskaran",
      "inventor_city": "Bangalore",
      "inventor_state": "",
      "inventor_country": "IN"
    },
    {
      "inventor_name_last": "Rao",
      "inventor_name_first": "Santosh",
      "inventor_city": "Sunnyvale",
      "inventor_state": "CA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Subramanian",
      "inventor_name_first": "Chandramouli",
      "inventor_city": "Bangalore",
      "inventor_state": "",
      "inventor_country": "IN"
    }
  ],
  "ipcr_labels": [
    "G06F306"
  ],
  "main_ipcr_label": "G06F306",
  "summary": "<SOH> BRIEF DESCRIPTION OF THE DRAWINGS <EOH>FIG. 1A illustrates an exemplary embodiment of a system overview of a storage computing system. FIG. 1B illustrates a second exemplary embodiment of a system overview of a storage computing system. FIG. 2 illustrates a third embodiment of a storage computing system having cluster nodes. FIG. 3 illustrates an exemplary embodiment of hardware architecture of a cluster node. FIG. 4 illustrates an exemplary embodiment of a storage operating system architecture. FIGS. 5A / 5 B illustrate exemplary embodiments of storage computing system bound to a source logical unit and a target logical unit. FIGS. 6A-C illustrate exemplary embodiments of a bounded storage computing system during takeover and giveback events. FIG. 7 illustrates an exemplary embodiment of a logic flow. FIG. 8 illustrates a second exemplary embodiment of a logic flow. FIG. 9 illustrates an embodiment of a first computing architecture. detailed-description description=\"Detailed Description\" end=\"lead\"?",
  "patent_number": "None",
  "abstract": "Various embodiments are generally directed an apparatus and method for receiving an event notification for a pair of cluster nodes having a first cluster node and a second cluster node, the event notification indicating an occurrence of a takeover event or a giveback event. Further, various embodiments may include suspending copying of information from a source logical unit to a target logical unit, transferring one or more processes from the first cluster node to the second cluster node and resuming importation of information from the source logical unit to the target logical unit.",
  "publication_number": "US20160266830A1-20160915",
  "_processing_info": {
    "original_size": 92901,
    "optimized_size": 2762,
    "reduction_percent": 97.03
  }
}