{
  "decision": "PENDING",
  "application_number": "15168721",
  "date_published": "20160922",
  "date_produced": "20160908",
  "title": "METHOD AND SYSTEM FOR AN ELECTRONIC AUCTION AND SWEEPSTAKES",
  "filing_date": "20160531",
  "inventor_list": [
    {
      "inventor_name_last": "Mosley",
      "inventor_name_first": "Bobby",
      "inventor_city": "Piedmont",
      "inventor_state": "SC",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Bonnette",
      "inventor_name_first": "Brian",
      "inventor_city": "Anderson",
      "inventor_state": "SC",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Jungmann",
      "inventor_name_first": "Troy",
      "inventor_city": "Austin",
      "inventor_state": "TX",
      "inventor_country": "US"
    }
  ],
  "ipcr_labels": [
    "G06Q3002",
    "G06Q3008"
  ],
  "main_ipcr_label": "G06Q3002",
  "summary": "<SOH> SUMMARY OF THE INVENTION <EOH>In an embodiment, the invention is directed to a computer-implemented method of providing an electronic auction and an electronic sweepstakes system that receives a request to purchase a first quantity of electronic bids for use in at least one electronic auction. The bids may be purchased in any quantity and some embodiments the bids may be purchased in packages. In various embodiments, the system allocates the first quantity of electronic bids to an account associated with the purchaser. The account may be a preexisting account or a newly created account on the system. In various embodiments, the system also allocates a first quantity of electronic sweepstakes entries to the purchaser's account. The bids may be allocated to the purchaser's account once the purchaser submits payment for the bids, at which time the purchased bids are transferred to the account. The number of allocated sweepstakes entries may vary depending on the number of bids purchased, the value of the bids purchased, the length of time the purchaser has had an account on the system, or any other variables that the system may use in determining the number of sweepstakes entries to allocate to the purchaser's account. For example, in some embodiments, the purchaser may receive two sweepstakes entries for each bid purchased, and in other embodiments, the purchaser may receive one sweepstakes entry for every two bids purchased. The system may also be configured to receive a request from the purchaser to place a bid on a first item available in the at least one electronic auction. At least partially in response to receiving the request to place a bid, the system enables the purchaser to place the bid on the first item. The system may also require the user to reveal a sweepstakes entry before enabling the purchaser to place the first bid. In other embodiments, the system may be configured to receive a request from the purchaser to reveal a result of at least one of ...",
  "patent_number": "None",
  "abstract": "A system for allowing a user to participate in an electronic auction and an electronic sweepstakes game includes a processor configured to (1) receive a request to purchase a first quantity of bids, (2) enable purchase the first quantity of bids, (3) allocate the first quantity of purchased bids and a first quantity of electronic sweepstakes entries to an account of the purchase, (4) enable the purchaser to use one of the first quantity of bids to bid on a first item, (5) receive a request to reveal one of the first quantity of sweepstakes entries, (6) enable the user to reveal the one sweepstakes entry, and (7) enable the display of a result selected from a group consisting of the auction of the item and the reveal of the at least one sweepstakes entry.",
  "publication_number": "US20160275538A1-20160922",
  "_processing_info": {
    "original_size": 75049,
    "optimized_size": 3615,
    "reduction_percent": 95.18
  }
}