{
  "date_produced": "20160914",
  "publication_number": "US20160283865A1-20160929",
  "main_ipcr_label": "G06N9900",
  "decision": "REJECTED",
  "application_number": "15178676",
  "inventor_list": [
    {
      "inventor_name_last": "Costigan",
      "inventor_name_first": "Neil",
      "inventor_city": "Lulea",
      "inventor_state": "",
      "inventor_country": "SE"
    },
    {
      "inventor_name_last": "Deutschmann",
      "inventor_name_first": "Ingo",
      "inventor_city": "Merseburg",
      "inventor_state": "",
      "inventor_country": "DE"
    },
    {
      "inventor_name_last": "Libell",
      "inventor_name_first": "Tony",
      "inventor_city": "Lulea",
      "inventor_state": "",
      "inventor_country": "SE"
    },
    {
      "inventor_name_last": "Lindholm",
      "inventor_name_first": "Johan",
      "inventor_city": "Boden",
      "inventor_state": "",
      "inventor_country": "SE"
    },
    {
      "inventor_name_last": "Nordstrom",
      "inventor_name_first": "Peder",
      "inventor_city": "Lulea",
      "inventor_state": "",
      "inventor_country": "SE"
    },
    {
      "inventor_name_last": "Parnes",
      "inventor_name_first": "Peter",
      "inventor_city": "Lulea",
      "inventor_state": "",
      "inventor_country": "SE"
    }
  ],
  "abstract": "Recording, analyzing and categorizing of user interface input via touchpad, touch screens or any device that can synthesize gestures from touch and pressure into input events. Such as, but not limited to, smart phones, touch pads and tablets. Humans may generate the input. The analysis of data may include statistical profiling of individual users as well as groups of users, the profiles can be stored in, but not limited to data containers such as files, secure storage, smart cards, databases, off device, in the cloud etc. A profile may be built from user/users behavior categorized into quantified types of behavior and/or gestures. The profile might be stored anonymized. The analysis may take place in real time or as post processing. Profiles can be compared against each other by all the types of quantified behaviors or by a select few.",
  "filing_date": "20160610",
  "patent_number": "None",
  "summary": "<SOH> SUMMARY OF THE DISCLOSED TECHNOLOGY <EOH>The principles of the present invention provide for recording, analyzing, and categorizing user interface input via touchpad, touch screens or any electronic device that can receive and sense or synthesize gestures from human touch and pressure into input events. Such electronic devices may include, but are not limited to, smart phones, touch pads and tablets. Humans may generate the input sequence behavior that is converted by the electronic devices into sequence behavior input data. The analysis of the sequence behavior input data may include statistical profiling of individual users as well as groups of users. The statistical profiles can be stored in, but are not limited to, data containers, such as files, secure storage, smart cards, databases, off device (e.g., memory devices), “cloud” storage devices, etc. A statistical profile may be built from user/users behavior categorized into quantified types of behavior and/or gestures. The analysis may take place in real time or non-real time, such as post-processing. Statistical profiles can be compared against each other by one or more types of quantified behaviors. Quantified types of behavior may be, but not limited to, angle, acceleration, sequence, flight, pressure, quotient, and velocity.",
  "date_published": "20160929",
  "title": "SYSTEM AND METHOD FOR DISTINGUISHING HUMAN SWIPE INPUT SEQUENCE BEHAVIOR",
  "ipcr_labels": [
    "G06N9900",
    "G06F30484",
    "G06F2132",
    "G06F30488"
  ],
  "_processing_info": {
    "original_size": 25146,
    "optimized_size": 3472,
    "reduction_percent": 86.19
  }
}