{
  "date_produced": "20161122",
  "publication_number": "US20160358105A1-20161208",
  "main_ipcr_label": "G06N9900",
  "decision": "PENDING",
  "application_number": "15170016",
  "inventor_list": [
    {
      "inventor_name_last": "TANAKA",
      "inventor_name_first": "Toyoki",
      "inventor_city": "Okaya",
      "inventor_state": "",
      "inventor_country": "JP"
    },
    {
      "inventor_name_last": "ISHIKAWA",
      "inventor_name_first": "Takeshi",
      "inventor_city": "Azumino",
      "inventor_state": "",
      "inventor_country": "JP"
    }
  ],
  "abstract": "A teaching device that teaches a robot, includes a display section. When the teaching device is placed on a placing surface, the display section tilts at an angle of 15 degrees or more with respect to the placing surface.",
  "filing_date": "20160601",
  "patent_number": "None",
  "summary": "<SOH> SUMMARY <EOH>An aspect of the invention is directed to a teaching device that teaches a robot, the device including a display section. When the teaching device is placed on a placing surface, the display section tilts at an angle of 15 degrees or more with respect to the placing surface. With this configuration, when the teaching device is placed on the placing surface, the display section tilts at the angle of 15 degrees or more with respect to the placing surface. Consequently, in the teaching device, it is possible to improve visibility and operability and improve convenience of use. The aspect of the invention may be configured such that, in the teaching device, when the teaching device is placed on the placing surface, the display section tilts at an angle of 15 degrees or more and 35 degrees or less with respect to the placing surface. With this configuration, when the teaching device is placed on the placing surface, the display section tilts at the angle of 15 degrees or more and 35 degrees or less with respect to the placing surface. Consequently, in the teaching device, it is possible to guarantee high visibility and high operability. The aspect of the invention may be configured such that, in the teaching device, the teaching device is capable of changing a tilt with respect to the placing surface when the teaching device is placed on the placing surface. With this configuration, in the teaching device, the display section is capable of changing the tilt with respect to the placing surface when the teaching device is placed on the placing surface. Consequently, in the teaching device, it is possible to enable adjustment of the tilt of the display section with respect to the placing surface. The aspect of the invention may be configured such that, in the teaching device, the teaching device further includes a first enable switch extending in a first direction, and the first direction tilts with respect to the display section. With this configuration,...",
  "date_published": "20161208",
  "title": "TEACHING DEVICE AND ROBOT SYSTEM",
  "ipcr_labels": [
    "G06N9900"
  ],
  "_processing_info": {
    "original_size": 80618,
    "optimized_size": 2884,
    "reduction_percent": 96.42
  }
}