{
  "date_produced": "20171121",
  "publication_number": "US20170351965A1-20171207",
  "main_ipcr_label": "G06N700",
  "decision": "PENDING",
  "application_number": "15174883",
  "inventor_list": [
    {
      "inventor_name_last": "Kurniadi",
      "inventor_name_first": "Fransisco",
      "inventor_city": "Dublin",
      "inventor_state": "CA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Pedemane",
      "inventor_name_first": "Navya",
      "inventor_city": "San Jose",
      "inventor_state": "CA",
      "inventor_country": "US"
    }
  ],
  "abstract": "Various systems, mediums, and methods for providing services may involve data engines configured to generate scores associated with one or more entities and then to classify the entities based on the scores. The data engine may collect data and based on the collected data may generate a first behavior model in a first time span, and a second and third behavior models in a second time span. The data engine may generate a first score based on the first behavior model, a second score based on the second behavior model, and a third score based on the third behavior model. The data engine may generate a final score based on the first, second, and third scores. The data engine can classify the entity based on the final score. The data engine can then automatically adjust one of the services provided to the entity based on the final score.",
  "filing_date": "20160606",
  "patent_number": "None",
  "summary": "<SOH> BRIEF DESCRIPTION OF THE FIGURES <EOH>FIG. 1 is a block diagram of an exemplary system, according to some embodiments. FIG. 2A is a block diagram of an exemplary data engine, according to some embodiments. FIG. 2B is a block diagram of an exemplary data engine, according to some embodiments. FIG. 3A is a block diagram of an exemplary system, according to some embodiments. FIG. 3B illustrates an exemplary data engine, according to some embodiments. FIG. 4A illustrates an exemplary timeline with events on the timeline according to some embodiments. FIG. 4B illustrates an exemplary timeline with events on the timeline according to some embodiments. FIG. 5 is a block diagram of an exemplary system, according to some embodiments. FIG. 6 illustrates an exemplary method, according to some embodiments. detailed-description description=\"Detailed Description\" end=\"lead\"? Embodiments of the present disclosure and their advantages may be understood by referring to the detailed description provided herein. It should be appreciated that reference numerals may be used to illustrate various elements and/or features provided in the figures. Further, the figures may illustrate various examples for purposes of illustration and explanation related to the embodiments of the present disclosure and not for purposes of any limitation.",
  "date_published": "20171207",
  "title": "EVENT BASED BEHAVIOR PREDICTION, CLASSIFICATION, AND SERVICE ADJUSTMENT",
  "ipcr_labels": [
    "G06N700",
    "G06N502"
  ],
  "_processing_info": {
    "original_size": 95344,
    "optimized_size": 2903,
    "reduction_percent": 96.96
  }
}