{
  "decision": "PENDING",
  "application_number": "15177246",
  "date_published": "20161208",
  "date_produced": "20161122",
  "title": "Method To Generate A Consumer Interest Spatial Map, Based On Data Collected From The Movements Of Multiple Devices In A Defined Location",
  "filing_date": "20160608",
  "inventor_list": [
    {
      "inventor_name_last": "Klaczkow",
      "inventor_name_first": "Tomasz",
      "inventor_city": "Warszawa",
      "inventor_state": "",
      "inventor_country": "PL"
    }
  ],
  "ipcr_labels": [
    "G06Q3002"
  ],
  "main_ipcr_label": "G06Q3002",
  "summary": "<SOH> BRIEF SUMMARY OF THE INVENTION <EOH>The invention describes the method to collect and process data that results in a spatial map of the location showing the variable reactions, including purchasing decision, and general behavior of the consumers, and resulting in the estimation of the merchandising value of the space and other data for further analysis and optimisation of product location in a facility. The spatial map can be generated out of a single shopper's experience (single use—detailed observation) or as an average of multiple shoppers in a particular timeframe, including live updated data showing current measurements. The data can also be used for other purposes, such as real time promotions, shelve arrangement, price updates, etc. The invention consist of two major aspects: 1. Use of the equipment for data collection, transmission and aggregation. 2. The method to process data in order to create a spatial map, to extract the data and present it in an attractive form, easy to extend and analyze.",
  "patent_number": "None",
  "abstract": "A method and system to build a spatial map for a defined location based on the data collected from moving devices to define, measure and categorize the space in any consumer based environment and optimize the location of goods in the defined area. A method and system to collect, store, compare and display the real time positioning data and comparison of emotional and rational decisions, timeframes, biometric data crossed with a store cashier system to verify a purchase decision allowing for the categorization of “heat points” on the spatial map. Also provided is a method that operates in wireless environments.",
  "publication_number": "US20160358195A1-20161208",
  "_processing_info": {
    "original_size": 33923,
    "optimized_size": 2279,
    "reduction_percent": 93.28
  }
}