{
  "decision": "ACCEPTED",
  "application_number": "15174493",
  "date_published": "20160929",
  "date_produced": "20160914",
  "title": "NANOWIRE OR 2D MATERIAL STRIPS INTERCONNECTS IN AN INTEGRATED CIRCUIT CELL",
  "filing_date": "20160606",
  "inventor_list": [
    {
      "inventor_name_last": "Moroz",
      "inventor_name_first": "Victor",
      "inventor_city": "Saratoga",
      "inventor_state": "CA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Kawa",
      "inventor_name_first": "Jamil",
      "inventor_city": "Campbell",
      "inventor_state": "CA",
      "inventor_country": "US"
    }
  ],
  "ipcr_labels": [
    "H01L27092",
    "H01L23532",
    "H01L2906",
    "H01L2702",
    "G06F1750",
    "H01L2712",
    "H01L23522",
    "H01L23528",
    "H01L2910"
  ],
  "main_ipcr_label": "H01L27092",
  "summary": "<SOH> SUMMARY <EOH>A method for designing a circuit based on nanowires or on 2D material strips, a resulting cell architecture and an integrated circuit design tool utilizing the cell architecture, are described. Specifications of a particular cell in a computer readable description language can include transistors and interconnects implemented utilizing nanowires or 2D material strips. Thus, a computer implemented cell can comprise a specification of a circuit including a first transistor and a second transistor. The first transistor can include a first set of nanowires or 2D material strips arranged in parallel to form a channel structure, and a gate conductor disposed across the first set of nanowires or 2D material strips. The second transistor can include a second set of nanowires or 2D material strips arranged in parallel to form a channel structure, and a gate conductor disposed across the first set of nanowires or 2D material strips. The number of nanowires or of 2D material strips in the first set can be different from the number of nanowires or of 2D material strips in the second set, so that the drive power of the individual transistors, and other circuit performance characteristics, can be set with finer granularity. Also, the configuration of the nanowires or of the 2D material strips can be arranged in stacks and layers. The number of stacks and the number of layers used for implementation of the parallel nanowires or of parallel 2D material strips of a given transistor can be adjusted as suits a particular need. A cell library is described taking advantage of this granularity, which can include a set of cells that implements a common circuit, such as an inverter, a NAND gate or other common logic cell. The cells implementing the common circuit can differ in the number of parallel nanowires used in the implementation of a particular transistor in the common circuit. Also, the cells in the set of cells can differ in the number of parallel nanowires used...",
  "patent_number": "9691768",
  "abstract": "An integrated circuit design tool includes a cell library. The cell library includes entries for a plurality of cells, entries in the cell library including specifications of particular cells in a computer executable language. At least one entry in the cell library can comprise a specification of physical structures and timing parameters of a circuit including a first transistor, a second transistor, and an interconnect connecting a terminal of the first transistor to a terminal of the second transistor, the interconnect comprising one or more nanowires or 2D material strips arranged in parallel. An integrated circuit including the circuit is described.",
  "publication_number": "US20160284704A1-20160929",
  "_processing_info": {
    "original_size": 152317,
    "optimized_size": 3472,
    "reduction_percent": 97.72
  }
}