{
  "date_produced": "20161122",
  "publication_number": "US20160358085A1-20161208",
  "main_ipcr_label": "G06N504",
  "decision": "REJECTED",
  "application_number": "15173443",
  "inventor_list": [
    {
      "inventor_name_last": "ABADI",
      "inventor_name_first": "Mojtaba KHOMAMI",
      "inventor_city": "Montreal",
      "inventor_state": "",
      "inventor_country": "CA"
    },
    {
      "inventor_name_last": "POULIN",
      "inventor_name_first": "Jean-Philip RANCOURT",
      "inventor_city": "Saint-Nicolas",
      "inventor_state": "",
      "inventor_country": "CA"
    }
  ],
  "abstract": "An adaptive system and method are provided for modelling the behavioral and non-behavioral state of individual human subjects according to a set of past observations through sensed signals via a multi-modal pattern recognition algorithm. The system may take into consideration both subjective parameters that are learnt from the user over time, and contextual factors that are provided to the system, to achieve the model development.",
  "filing_date": "20160603",
  "patent_number": "None",
  "summary": "<SOH> SUMMARY <EOH>A unified multimodal human state inference system that fuses the information content of input modalities and adapts the inference models to input parameters via user and/or context modeling and domain transfer learning is lacking. Moreover, such a system that enhances the quality of an input modality employing the other input contents has not been proposed. The following provides a multimodal human state recognition system capable of: (i) fusing information content of multiple different modalities for better recognition quality, (ii) using different modalities to increase signal-to-noise ratio of other modalities, (iii) inferring contextual information and (iv) inferring subjective parameters. The system may use the contextual information together with subjective parameters to transfer the domain of input observations and adapt the trained systems for better recognition quality. The system may also learn its user over time to create user profiles that may be used to assist the inference of invariant and variant subjective parameters and contextual information. The following therefore provides an adaptive system and method that models the behavioral/non-behavioral state of individual humans according to a set of past observations through sensed signals via a uni-modal or multi-modal pattern recognition technique. The system main take into consideration both subjective parameters that are learned from the user over time, and contextual factors that are provided to the system, to achieve the model development. An embodiment of the invention as disclosed herein may include a system for determining a human state of a subject. The system may comprise a first modality data detection system configured to recognize first personal data of the subject indicative of the human state of the subject and a second modality data detection system configured to recognize second personal data of the subject indicative of the human state of the subject. The system may ...",
  "date_published": "20161208",
  "title": "SYSTEM AND METHOD FOR MULTIMODAL HUMAN STATE RECOGNITION",
  "ipcr_labels": [
    "G06N504",
    "G06N9900"
  ],
  "_processing_info": {
    "original_size": 86516,
    "optimized_size": 3160,
    "reduction_percent": 96.35
  }
}