{
  "decision": "PENDING",
  "application_number": "15177968",
  "date_published": "20161215",
  "date_produced": "20161130",
  "title": "LOCK SCREEN OUTPUT CONTROLLING METHOD AND ELECTRONIC DEVICE FOR SUPPORTING THE SAME",
  "filing_date": "20160609",
  "inventor_list": [
    {
      "inventor_name_last": "LEE",
      "inventor_name_first": "Chul Hwan",
      "inventor_city": "Seoul",
      "inventor_state": "",
      "inventor_country": "KR"
    },
    {
      "inventor_name_last": "JEON",
      "inventor_name_first": "Yong Joon",
      "inventor_city": "Hwaseong-si",
      "inventor_state": "",
      "inventor_country": "KR"
    },
    {
      "inventor_name_last": "KIM",
      "inventor_name_first": "Geon Soo",
      "inventor_city": "Suwon-si",
      "inventor_state": "",
      "inventor_country": "KR"
    },
    {
      "inventor_name_last": "KANG",
      "inventor_name_first": "Doo Suk",
      "inventor_city": "Suwon-si",
      "inventor_state": "",
      "inventor_country": "KR"
    },
    {
      "inventor_name_last": "SHIN",
      "inventor_name_first": "Sung Hyuk",
      "inventor_city": "Seongnam-si",
      "inventor_state": "",
      "inventor_country": "KR"
    }
  ],
  "ipcr_labels": [
    "G06F2136",
    "G06F30482",
    "G06F30484",
    "G06F30488"
  ],
  "main_ipcr_label": "G06F2136",
  "summary": "<SOH> SUMMARY <EOH>Aspects of the present disclosure are to address at least the above-mentioned problems and/or disadvantages and to provide at least the advantages described below. Accordingly, an aspect of the present disclosure is to provide a method of outputting a first screen including a designated image or a designated image and a designated display object as a lock screen and an electronic device for supporting the same. In accordance with an aspect of the present disclosure, a method of outputting a second screen is provided. The method includes a lock object in correspondence to an input for selecting a designated point or object of the first screen or a biometric information input and an electronic device for supporting the same. Accordingly, another aspect of the present disclosure is to provide a method of outputting a lock screen by differently configuring a lock object according to the type of an electronic device or the size of a display included in an electronic device and an electronic device for supporting the same. In accordance with another aspect of the present disclosure, an electronic device is provided. The electronic device includes a touch screen display, a processor electrically connected to the display, and a memory electrically connected to the processor, wherein the memory stores instructions that when executed, cause the processor to display a first screen comprising sets of objects to the display, configure, in response to a first touch input for selecting an object displayed on the first screen, at least one object included in a set of objects related to the selected object as at least one lock object for releasing a lock screen, and display a second screen configured with the at least one lock object. Other aspects, advantages, and salient features of the disclosure will become apparent to those skilled in the art from the following detailed description, which, taken in conjunction with the annexed drawings, discloses various embo...",
  "patent_number": "None",
  "abstract": "An apparatus and method for controlling lock-screen output are provided. The electronic device includes a touch screen display, a processor electrically connected to the display, and a memory electrically connected to the processor. The memory stores instructions that, when executed, cause the processor to display a first screen comprising sets of objects to the display, configure, in response to a first touch input for selecting an object displayed on the first screen, at least one object included in a set of objects related to the selected object as at least one lock object for releasing a lock screen, and display a second screen configured with the at least one lock object. In addition, various embodiments identified in the specification are enabled.",
  "publication_number": "US20160364564A1-20161215",
  "_processing_info": {
    "original_size": 143150,
    "optimized_size": 3952,
    "reduction_percent": 97.24
  }
}