{
  "date_produced": "20161116",
  "publication_number": "US20160350664A1-20161201",
  "main_ipcr_label": "G06N504",
  "decision": "REJECTED",
  "application_number": "15177237",
  "inventor_list": [
    {
      "inventor_name_last": "Devarajan",
      "inventor_name_first": "Ravinder",
      "inventor_city": "Cary",
      "inventor_state": "NC",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Benson",
      "inventor_name_first": "Jordan Riley",
      "inventor_city": "Ellerbe",
      "inventor_state": "NC",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Caira",
      "inventor_name_first": "David James",
      "inventor_city": "Chapel Hill",
      "inventor_state": "NC",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Sethi",
      "inventor_name_first": "Saratendu",
      "inventor_city": "Raleigh",
      "inventor_state": "NC",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Cox",
      "inventor_name_first": "James Allen",
      "inventor_city": "Cary",
      "inventor_state": "NC",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Healey",
      "inventor_name_first": "Christopher G.",
      "inventor_city": "Cary",
      "inventor_state": "NC",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Dinakaran",
      "inventor_name_first": "Gowtham",
      "inventor_city": "Raleigh",
      "inventor_state": "NC",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Padia",
      "inventor_name_first": "Kalpesh",
      "inventor_city": "Raleigh",
      "inventor_state": "NC",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Nie",
      "inventor_name_first": "Shaoliang",
      "inventor_city": "Raleigh",
      "inventor_state": "NC",
      "inventor_country": "US"
    }
  ],
  "abstract": "The results of electronic narrative analytics can be visualized. For example, an electronic communication that includes multiple narratives can be received. Each narrative can be segmented into respective blocks of characters. Multiple sentiments associated with the respective blocks of characters can be determined. Multiple sentiment patterns can be determined based on the multiple sentiments. The multiple sentiment patterns can be categorized into multiple sentiment pattern groups. Also, multiple semantic tags associated with the multiple sentiment patterns can be determined. Further, the multiple narratives can be categorized into multiple topic sets. A graphical user interface can be displayed visually indicating at least a portion of: the multiple sentiments, the multiple sentiment pattern groups, the multiple semantic tags, or the multiple topic sets.",
  "filing_date": "20160608",
  "patent_number": "None",
  "summary": "<SOH> SUMMARY <EOH>In one example, a computer readable medium comprising program code executable by a processor is provided. The program code can cause the processor to receive an electronic communication comprising a plurality of narratives. The program code can cause the processor to segment each narrative of the plurality of narratives into respective blocks of characters. The program code can cause the processor to determine a plurality of sentiments associated with the respective blocks of characters using a sentiment dictionary. Each sentiment of the plurality of sentiments can correspond to a particular block of characters. The program code can cause the processor to determine a plurality of sentiment patterns based on the plurality of sentiments. Each sentiment pattern of the plurality of sentiment patterns can correspond to a respective narrative of the plurality of narratives. Each sentiment pattern of the plurality of sentiment patterns can comprise a plurality of sentiment blocks ordered in an arrangement corresponding to the respective blocks of characters associated with the respective narrative. Each sentiment block of the plurality of sentiment blocks can indicate one or more sentiments of the plurality of sentiments. The program code can cause the processor to determine a plurality of semantic tags associated with the plurality of sentiment patterns. Each semantic tag of the plurality of semantic tags can correspond to a respective sentiment block of the plurality of sentiment blocks and represent of content associated with the respective sentiment block. The program code can cause the processor to categorize the plurality of narratives into a plurality of topic sets. Each topic set of the plurality of topic sets can comprise one or more narratives having a common topic. The program code can cause the processor to determine a plurality of overall sentiments based on the plurality of topic sets. Each overall sentiment of the plurality of overall sent...",
  "date_published": "20161201",
  "title": "VISUALIZATIONS FOR ELECTRONIC NARRATIVE ANALYTICS",
  "ipcr_labels": [
    "G06N504",
    "G06F1727",
    "G06F1730",
    "G06N9900"
  ],
  "_processing_info": {
    "original_size": 193187,
    "optimized_size": 4628,
    "reduction_percent": 97.6
  }
}