{
  "decision": "ACCEPTED",
  "application_number": "15175543",
  "date_published": "20170803",
  "date_produced": "20170719",
  "title": "OLED PANEL AND TOUCH DETECTION METHOD",
  "filing_date": "20160607",
  "inventor_list": [
    {
      "inventor_name_last": "Wu",
      "inventor_name_first": "Tianyi",
      "inventor_city": "Shanghai",
      "inventor_state": "",
      "inventor_country": "CN"
    }
  ],
  "ipcr_labels": [
    "G06F3044",
    "H01L5152",
    "H01L2732"
  ],
  "main_ipcr_label": "G06F3044",
  "summary": "<SOH> SUMMARY <EOH>According to an aspect of the present invention, there is provided an OLED panel, including: multiple matrix-arranged TFTs; an anode layer having multiple anodes, formed on one side of the TFTs; an organic light emitting layer, formed on one side of the anode layer away from the TFTs; a cathode layer having multiple cathodes, formed on one side of the organic light emitting layer away from the anode layer. The cathodes pass through the organic light emitting layer and are electrically connected to the corresponding TFTs to form pixel electrodes; and a time-division drive module electrically connected to the anodes configured to multiplex time-divisionally to alternately form common electrodes or touch electrodes. According to another aspect of the present invention, there is further provided a touch detection method of an OLED panel, where the foregoing OLED panel is used, including: forming the cathodes into pixel electrodes of the OLED panel, performing multiplex time-division on the anodes to alternately form into one type of common electrodes and touch electrodes of the OLED panel. When the anodes are the touch electrode, the time-division drive module captures a self-capacitance change of each of the touch electrodes or captures a mutual-capacitance change between the touch electrodes to position a touch location.",
  "patent_number": "10031629",
  "abstract": "An OLED panel is provided. The OLED panel may include multiple matrix-arranged TFTs, an anode layer, an organic light emitting layer, a cathode layer, and/or any other components. The anode layer can have multiple anodes, formed on one side of the TFTs. The organic light emitting layer can be formed on one side of the anode layer away from the TFTs. The cathode layer can have multiple cathodes and be formed on one side of the organic light emitting layer away from the anode layer. The cathodes can pass through the organic light emitting layer and be electrically connected to the corresponding TFTs to form pixel electrodes. A time-division drive module can be electrically connected to the anodes, which can be configured to multiplex time-divisionally to alternately form common electrodes or touch electrodes.",
  "publication_number": "US20170220150A1-20170803",
  "_processing_info": {
    "original_size": 38988,
    "optimized_size": 2724,
    "reduction_percent": 93.01
  }
}