{
  "date_produced": "20171121",
  "publication_number": "US20170351954A1-20171207",
  "main_ipcr_label": "G06N502",
  "decision": "PENDING",
  "application_number": "15172893",
  "inventor_list": [
    {
      "inventor_name_last": "Kosarek",
      "inventor_name_first": "Travis",
      "inventor_city": "Boston",
      "inventor_state": "MA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Boushka",
      "inventor_name_first": "Morgan",
      "inventor_city": "Boston",
      "inventor_state": "MA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Manis Sorensen",
      "inventor_name_first": "Carolyn",
      "inventor_city": "Boston",
      "inventor_state": "MA",
      "inventor_country": "US"
    }
  ],
  "abstract": "A method of processing data by one or more data processing systems for classification of the processed data into one or more predefined classifications, the method comprising: receiving by one or more data processing systems social profile data; binding by the one or more data processing systems based on the input social profile data, values of one or more attributes included in the social profile data to one or more parameters of a classifier executing on the one or more data processing systems; classifying data representing the user into one or more predefined classifications; for one of the predefined classifications into which the data representing the user is classified, identifying by the one or more data processing systems a candidate action included in the predefined classification and unassociated with the user; and transmitting an alert to notify the user of the candidate action.",
  "filing_date": "20160603",
  "patent_number": "None",
  "summary": "<SOH> SUMMARY <EOH>In some examples, a method of processing data by one or more data processing systems for classification of the processed data into one or more predefined classifications includes receiving by one or more data processing systems social profile data; binding by the one or more data processing systems based on the input social profile data, values of one or more attributes included in the social profile data to one or more parameters of a classifier executing on the one or more data processing systems; classifying by the one or more data processing systems data representing the user into one or more predefined classifications; for one of the predefined classifications into which the data representing the user is classified, identifying by the one or more data processing systems a candidate action included in the predefined classification and unassociated with the user; and transmitting, by the one or more data processing systems to the client device over one or more computerized networks, an alert to notify the user of the candidate action. A system of one or more computers can be configured to perform particular operations or actions by virtue of having software, firmware, hardware, or a combination of them installed on the system that in operation causes or cause the system to perform the actions. One or more computer programs can be configured to perform particular operations or actions by virtue of including instructions that, when executed by data processing apparatus, cause the apparatus to perform the actions. One or more aspects of this implementation include one or more of the following actions and/or features. classification by removing those one or more candidate actions corresponding to one or more actions associated with a user profile of the user; from among the filtered data representing the candidate actions, selecting an item of data representing one of the remaining candidate actions; generating the alert from the filtered, selected...",
  "date_published": "20171207",
  "title": "Data Classification with Social Profile Data",
  "ipcr_labels": [
    "G06N502",
    "G06Q5000"
  ],
  "_processing_info": {
    "original_size": 67381,
    "optimized_size": 3743,
    "reduction_percent": 94.45
  }
}