{
  "date_produced": "20161122",
  "publication_number": "US20160358090A1-20161208",
  "main_ipcr_label": "G06N700",
  "decision": "PENDING",
  "application_number": "15171158",
  "inventor_list": [
    {
      "inventor_name_last": "Irvine",
      "inventor_name_first": "John",
      "inventor_city": "Somerville",
      "inventor_state": "MA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Abramson",
      "inventor_name_first": "Mark",
      "inventor_city": "Lexington",
      "inventor_state": "MA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Tuohy",
      "inventor_name_first": "Seamus",
      "inventor_city": "Newton",
      "inventor_state": "MA",
      "inventor_country": "US"
    }
  ],
  "abstract": "Methods and systems are disclosed for obtaining and analyzing information to determine an estimated state of a real world. First information is obtained from a first source of a plurality of sources (e.g., data stores, real-time data streams, or information services), where the first information is potentially indicative of first and second states of the real world. If the first information exceeds a first decision threshold, then the estimated state is the first state, and if the first information exceeds a second decision threshold, then the estimated state is the second state. If the first information does not exceed either of the first and second decision thresholds, then second information is obtained from a second source. Obtaining the second information is based on whether the second source includes information that is relevant to the estimated state and whether the second source includes information that is redundant with the first information.",
  "filing_date": "20160602",
  "patent_number": "None",
  "summary": "<SOH> SUMMARY OF THE INVENTION <EOH>The methods and systems disclosed herein address both of these challenges within a unified mathematical-based methodology. One example embodiment of the present invention is a method of obtaining and analyzing information to determine an estimated state of a real world (e.g., a real-world physical environment). According to the method, a processor obtains first information from a first source of a plurality of sources, where the first information is potentially indicative of a first state and a second state of the real world. If the first information exceeds a first decision threshold, then the processor determines that the estimated state is the first state, and if the first information exceeds a second decision threshold, then the processor determines that the estimated state is the second state. If the first information does not exceed either of the first and second decision thresholds, then the processor obtains second information from a second source and determines whether the estimated state is the first state or the second state based on whether the first information and the second information together exceeds the first decision threshold or the second decision threshold. In obtaining the second information, the processor determines whether the second source includes information that is relevant to the estimated state and whether the second source includes information that is redundant with the first information. The plurality of sources may include, for example, a data store, a real-time data stream, or a service from which information can be requested. After the processor determines whether the estimated state is the first state or the second state, the processor can output the determination in a variety of ways, including, for example, raising an alert, notification, other visual display (e.g., highlighting certain text on a display), or audio output on a user's computer that indicates the determined state, sounding an a...",
  "date_published": "20161208",
  "title": "METHOD AND SYSTEM FOR OBTAINING AND ANALYZING INFORMATION FROM A PLURALITY OF SOURCES",
  "ipcr_labels": [
    "G06N700",
    "G06N504",
    "G06N9900",
    "G06Q5026"
  ],
  "_processing_info": {
    "original_size": 88583,
    "optimized_size": 3864,
    "reduction_percent": 95.64
  }
}