{
  "decision": "PENDING",
  "application_number": "15179649",
  "date_published": "20160929",
  "date_produced": "20160914",
  "title": "SYSTEM FOR MANAGING INFORMATION RELATED TO RECORDINGS FROM VIDEO/AUDIO RECORDING DEVICES",
  "filing_date": "20160610",
  "inventor_list": [
    {
      "inventor_name_last": "Kovac",
      "inventor_name_first": "Kresimir",
      "inventor_city": "Fountain Valley",
      "inventor_state": "CA",
      "inventor_country": "US"
    }
  ],
  "ipcr_labels": [
    "H04N577",
    "G08B600",
    "G06K900",
    "H04N5232",
    "H04N5907",
    "G06Q5026",
    "G11B2736",
    "F41C3302",
    "G06F1730",
    "H04W402",
    "H04L2908",
    "H04N528",
    "G11B2710"
  ],
  "main_ipcr_label": "H04N577",
  "summary": "<SOH> SUMMARY <EOH>According to the present design, there is provided a system for effectively utilizing law enforcement resources. The system includes a recording device configured to continuously record audio and/or video, thereby providing an audio and/or video recording, a computing device associated with the recording device, the computing device configured to receive a trigger indication and upon receiving the trigger indication establish a prior point in time of the audio and/or video recording as a beginning of a critical event and preserve recorded audio and/or video from the beginning of the critical event to an end recording point, and a remote device configured to analyze audio and/or video recordings including the preserved audio and/or video and provide information based on audio and/or video recording analysis. At least one of the computing device and the remote device is configured to apply information to the recorded audio and/or video based on events occurring between the beginning of the critical event and the end recording point for analysis by the remote device. According to an alternate version of the present design, there is provided a system for deploying law enforcement resources, comprising a recording device configured to continuously record audio and/or video, thereby providing an audio and/or video recording, a computing device associated with the recording device, the computing device configured to establish a prior point in time of the audio and/or video recording as a beginning of a critical event and preserve recorded audio and/or video from the beginning of the critical event to an end recording point, and a remote device configured to analyze audio and/or video recordings including the preserved audio and/or video and provide information based on audio and/or video recording analysis. The computing device is configured to sense a trigger indication using multiple sensing means and issue a command to the recording device upon sensin...",
  "patent_number": "None",
  "abstract": "A system and related software for effectively utilizing law enforcement resources is provided. The system includes a recording device configured to continuously record audio and/or video, thereby providing an audio and/or video recording, a computing device associated with the recording device, the computing device configured to receive a trigger indication and upon receiving the trigger indication establish a prior point in time of the audio and/or video recording as a beginning of a critical event and preserve recorded audio and/or video from the beginning of the critical event to an end recording point, and a remote device configured to analyze audio and/or video recordings including the preserved audio and/or video and provide information based on audio and/or video recording analysis. At least one of the computing device and the remote device is configured to apply information to the recorded audio and/or video based on events occurring between the beginning of the critical event ...",
  "publication_number": "US20160286156A1-20160929",
  "_processing_info": {
    "original_size": 195763,
    "optimized_size": 3727,
    "reduction_percent": 98.1
  }
}