{
  "date_produced": "20171121",
  "publication_number": "US20170351963A1-20171207",
  "main_ipcr_label": "G06N700",
  "decision": "PENDING",
  "application_number": "15171471",
  "inventor_list": [
    {
      "inventor_name_last": "LEEDS",
      "inventor_name_first": "BILL",
      "inventor_city": "San Francisco",
      "inventor_state": "CA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "LAKSHMANAN",
      "inventor_name_first": "VALLIAPPA",
      "inventor_city": "Bellevue",
      "inventor_state": "WA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "ALVAREZ",
      "inventor_name_first": "FRANCISCO",
      "inventor_city": "Seattle",
      "inventor_state": "WA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "HRYNIW",
      "inventor_name_first": "NATALIA",
      "inventor_city": "Seattle",
      "inventor_state": "WA",
      "inventor_country": "US"
    }
  ],
  "abstract": "A method for estimating confidence bounds for adjusted rainfall values for a set of geo-locations using agricultural data comprises using a server computer system that receives, via a network, agricultural data records that are used to estimate rainfall values for the set of geo-locations. Within the server computer system, rainfall calculation instructions receive digital data including observed radar and rain-gauge agricultural data records. The computer system then aggregates the agricultural data records and creates and stores the agricultural data sets. The agricultural data records are then used to estimate adjusted rainfall values for a set of geo-locations. Rainfall confidence bounds instructions estimate a set of confidence bounds for each of the adjusted rainfall values for the set of geo-locations. The set of confidence bounds provide a range for each of the adjusted rainfall values that represents a particular level of confidence associated with each of the adjusted rainfal...",
  "filing_date": "20160602",
  "patent_number": "None",
  "summary": "<SOH> SUMMARY <EOH>The appended claims may serve as a summary of the disclosure.",
  "date_published": "20171207",
  "title": "ESTIMATING CONFIDENCE BOUNDS FOR RAINFALL ADJUSTMENT VALUES",
  "ipcr_labels": [
    "G06N700",
    "G01W114",
    "G01W110"
  ],
  "_processing_info": {
    "original_size": 158874,
    "optimized_size": 2099,
    "reduction_percent": 98.68
  }
}