{
  "date_produced": "20171121",
  "publication_number": "US20170351971A1-20171207",
  "main_ipcr_label": "G06N9900",
  "decision": "PENDING",
  "application_number": "15175808",
  "inventor_list": [
    {
      "inventor_name_last": "Cai",
      "inventor_name_first": "Keke",
      "inventor_city": "Beijing",
      "inventor_state": "",
      "inventor_country": "CN"
    },
    {
      "inventor_name_last": "Guo",
      "inventor_name_first": "HongLei",
      "inventor_city": "Beijing",
      "inventor_state": "",
      "inventor_country": "CN"
    },
    {
      "inventor_name_last": "Jiang",
      "inventor_name_first": "Jian Min",
      "inventor_city": "Beijing",
      "inventor_state": "",
      "inventor_country": "CN"
    },
    {
      "inventor_name_last": "Su",
      "inventor_name_first": "Zhong",
      "inventor_city": "Beijing",
      "inventor_state": "",
      "inventor_country": "CN"
    },
    {
      "inventor_name_last": "Sun",
      "inventor_name_first": "Changhua",
      "inventor_city": "Beijing",
      "inventor_state": "",
      "inventor_country": "CN"
    },
    {
      "inventor_name_last": "Tang",
      "inventor_name_first": "Guoyu",
      "inventor_city": "Beijing",
      "inventor_state": "",
      "inventor_country": "CN"
    }
  ],
  "abstract": "The methods, systems, and computer program products described herein provide ways to generate an informative training corpus of samples for use in machine training a high-quality sentiment analysis computer model. In some aspects, a method is disclosed including receiving a plurality of training samples, extracting semantic and sentiment elements of one or more of the training samples, generalizing the semantic and sentiment elements of the one or more of the training samples, generating an informative ranking score for one or more of the training samples based on the generalized semantic and sentiment elements, selecting informative training samples from the plurality of training samples based at least in part on the generated informative ranking scores, and adding the selected informative training samples to an informative training corpus.",
  "filing_date": "20160607",
  "patent_number": "None",
  "summary": "<SOH> BRIEF SUMMARY <EOH>The methods, systems, and computer program products described herein provide ways to autonomously generate an informative training corpus of samples for use in machine training a high-quality sentiment analysis computer model. In an aspect of the present disclosure, a method is disclosed including receiving a plurality of training samples, extracting semantic and sentiment elements of one or more of the training samples, generalizing the extracted semantic and sentiment elements of the one or more of the training samples, generating an informative ranking score for one or more of the training samples based on the generalized semantic and sentiment elements, selecting informative training samples from the plurality of training samples based at least in part on the generated informative ranking scores, adding the selected informative training samples to an informative training corpus, and storing the informative training corpus in a database repository on a storage device. In aspects of the present disclosure apparatus, systems, and computer program products in accordance with the above aspect may also be provided. Further features as well as the structure and operation of various embodiments are described in detail below with reference to the accompanying drawings. In the drawings, like reference numbers indicate identical or functionally similar elements.",
  "date_published": "20171207",
  "title": "METHOD AND APPARATUS FOR INFORMATIVE TRAINING REPOSITORY BUILDING IN SENTIMENT ANALYSIS MODEL LEARNING AND CUSTOMAIZATION",
  "ipcr_labels": [
    "G06N9900",
    "G06N700",
    "G06N504"
  ],
  "_processing_info": {
    "original_size": 57169,
    "optimized_size": 3582,
    "reduction_percent": 93.73
  }
}