{
  "decision": "PENDING",
  "application_number": "15176912",
  "date_published": "20161208",
  "date_produced": "20161122",
  "title": "THING DISCOVERY AND CONFIGURATION FOR AN INTERNET OF THINGS INTEGRATED DEVELOPER ENVIRONMENT",
  "filing_date": "20160608",
  "inventor_list": [
    {
      "inventor_name_last": "Maluf",
      "inventor_name_first": "David A.",
      "inventor_city": "Mountain View",
      "inventor_state": "CA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Baker",
      "inventor_name_first": "Todd M.",
      "inventor_city": "Los Altos",
      "inventor_state": "CA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Xiao",
      "inventor_name_first": "Haihua",
      "inventor_city": "Shanghai",
      "inventor_state": "",
      "inventor_country": "CN"
    },
    {
      "inventor_name_last": "Wang",
      "inventor_name_first": "Yi",
      "inventor_city": "Shanghai",
      "inventor_state": "",
      "inventor_country": "CN"
    },
    {
      "inventor_name_last": "Malegaonkar",
      "inventor_name_first": "Ashutosh A.",
      "inventor_city": "Milpitas",
      "inventor_state": "CA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Zhang",
      "inventor_name_first": "Yajun",
      "inventor_city": "Santa Clara",
      "inventor_state": "CA",
      "inventor_country": "US"
    }
  ],
  "ipcr_labels": [
    "G06F944",
    "H04L1224"
  ],
  "main_ipcr_label": "G06F944",
  "summary": "<SOH> BRIEF DESCRIPTION OF THE DRAWINGS <EOH>The embodiments herein may be better understood by referring to the following description in conjunction with the accompanying drawings in which like reference numerals indicate identically or functionally similar elements, of which: FIG. 1 illustrates an example computing model for IoT; FIG. 2 illustrates an example layered application architecture in one typical IoT application; FIG. 3 illustrates an example architecture hierarchy of an IoT IDE; FIG. 4 illustrates an example showcase graph comprising nodes across layers and ports connecting nodes; FIG. 5 illustrates an example showcase subgraph in a Fog computing node; FIG. 6 illustrates an example functional diagram of an IoT IDE; FIG. 7 illustrates an example graphical user interface (GUI) of an IoT IDE; FIG. 8 illustrates an example workflow for an IoT IDE; FIG. 9 illustrates an example block diagram with a single instance of a system; FIG. 10 illustrates an example auto-discovery of real things for an IoT IDE; FIG. 11 illustrates an example canvas layout for an IoT IDE; FIG. 12 illustrates an example policy editor for an IoT IDE; FIG. 13 illustrates an example live management of a system using an IoT IDE; FIG. 14 illustrates an example simplified procedure for executing an IoT IDE in accordance with one or more embodiments described herein; FIG. 15 illustrates an example real-world physical environment for an IoT IDE; FIG. 16 illustrates an example of discovery beacons in a real-world physical environment for an IoT IDE; FIG. 17 illustrates an example of gateway-based discovery in a real-world physical environment for an IoT IDE; FIG. 18 illustrates an example configuration file access in a real-world physical environment for an IoT IDE; FIG. 19 illustrates another example configuration file access in a real-world physical environment for an IoT IDE; FIG. 20 illustrates an example simplified procedure for thing discovery and configuration for an IoT IDE; and FIG. 21...",
  "patent_number": "None",
  "abstract": "According to one or more embodiments of the disclosure, thing discovery and configuration for an Internet of Things (IoT) integrated developer environment (IDE) is shown and described. In particular, in one embodiment, a computer operates an IoT IDE that discovers real-world physical devices within a computer network that are available to participate with the IoT IDE. The IoT IDE may then determine a respective functionality of each of the real-world physical devices, and virtually represents the real-world physical devices as selectable options within the IoT IDE for an IoT application, where a respective virtual representation of each of the real-world physical devices is configured within the IoT IDE with the corresponding respective functionality of that real-world physical device. Simulating the IoT application within the IoT IDE then relays input and/or output (I/O) between the IoT IDE and a selected set of real-world physical devices according to their corresponding respective f...",
  "publication_number": "US20160357524A1-20161208",
  "_processing_info": {
    "original_size": 61785,
    "optimized_size": 4331,
    "reduction_percent": 92.99
  }
}