{
  "date_produced": "20161122",
  "publication_number": "US20160358073A1-20161208",
  "main_ipcr_label": "G06N308",
  "decision": "PENDING",
  "application_number": "15174020",
  "inventor_list": [
    {
      "inventor_name_last": "Desjardins",
      "inventor_name_first": "Guillaume",
      "inventor_city": "London",
      "inventor_state": "",
      "inventor_country": "GB"
    },
    {
      "inventor_name_last": "Simonyan",
      "inventor_name_first": "Karen",
      "inventor_city": "London",
      "inventor_state": "",
      "inventor_country": "GB"
    },
    {
      "inventor_name_last": "Kavukcuoglu",
      "inventor_name_first": "Koray",
      "inventor_city": "London",
      "inventor_state": "",
      "inventor_country": "GB"
    },
    {
      "inventor_name_last": "Pascanu",
      "inventor_name_first": "Razvan",
      "inventor_city": "Letchworth Garden City",
      "inventor_state": "",
      "inventor_country": "GB"
    }
  ],
  "abstract": "Methods, systems, and apparatus, including computer programs encoded on computer storage media, for processing inputs using a neural network system that includes a whitened neural network layer. One of the methods includes receiving an input activation generated by a layer before the whitened neural network layer in the sequence; processing the received activation in accordance with a set of whitening parameters to generate a whitened activation; processing the whitened activation in accordance with a set of layer parameters to generate an output activation; and providing the output activation as input to a neural network layer after the whitened neural network layer in the sequence.",
  "filing_date": "20160606",
  "patent_number": "None",
  "summary": "<SOH> SUMMARY <EOH>In general, one innovative aspect of the subject matter described in this specification can be embodied in a neural network system implemented by one or more computers that includes a whitened neural network layer is configured to: receive an input activation generated by a layer before the whitened neural network layer, process the received activation in accordance with a set of whitening parameters to generate a whitened activation, process the whitened activation in accordance with a set of layer parameters to generate an output activation, and provide the output activation as input to a neural network layer after the whitened neural network layer. For a system of one or more computers to be configured to perform particular operations or actions means that the system has installed on it software, firmware, hardware, or a combination of them that in operation cause the system to perform the operations or actions. For one or more computer programs to be configured to perform particular operations or actions means that the one or more programs include instructions that, when executed by data processing apparatus, cause the apparatus to perform the operations or actions. Particular embodiments of the subject matter described in this specification can be implemented so as to realize one or more of the following advantages. A whitened neural network layer as described in this specification can have a Fisher matrix that is constrained to be approximately the identity, allowing for stochastic gradient descent with respect to the layer parameters of the layer to be equivalent to natural gradient descent. In particular, the Fisher that is constrained is the Fisher of the objective function with respect to the parameters of the whitened neural layer. Thus, a neural network system that trains a neural network that includes one or more whitened neural network layers can leverage these properties of the Fisher to make constant progress over the course of the...",
  "date_published": "20161208",
  "title": "WHITENED NEURAL NETWORK LAYERS",
  "ipcr_labels": [
    "G06N308",
    "G06N9900",
    "G06N304"
  ],
  "_processing_info": {
    "original_size": 43267,
    "optimized_size": 3684,
    "reduction_percent": 91.49
  }
}