{
  "decision": "PENDING",
  "application_number": "15173993",
  "date_published": "20170105",
  "date_produced": "20161220",
  "title": "METHOD AND KIT FOR DYNAMIC GENE EXPRESSION MONITORING",
  "filing_date": "20160606",
  "inventor_list": [
    {
      "inventor_name_last": "Yount",
      "inventor_name_first": "Garret L.",
      "inventor_city": "San Francisco",
      "inventor_state": "CA",
      "inventor_country": "US"
    }
  ],
  "ipcr_labels": [
    "C12Q168",
    "G06F1920"
  ],
  "main_ipcr_label": "C12Q168",
  "summary": "<SOH> SUMMARY <EOH>The disclosure provides a method of monitoring a subject's mental, emotional or physical state. The method includes obtaining a first biological sample from the subject at a first time point; quantifying the amounts of a set of biological factors in the first biological sample; obtaining a second biological sample from the subject at a second time point; quantifying the amounts of a set of biological factors in the second biological sample; and determining a change in the quantified biological factors between the first sample and the second sample, wherein the change in the biological factors between the first sample and the second sample is indicative of the subject's mental, emotional or physical state. The disclosure also provides a method of monitoring a subject's mental, emotional or physical state. The method includes obtaining a first salivary sample from the subject at a first time point; fixing a set of biological factors in the first salivary sample; obtaining a second salivary sample from the subject at a second time point; fixing a set of biological factors in the second salivary sample; quantifying biological factors in the first and the second salivary samples; and determining a change in the quantified biological factors between the first sample and the second sample, wherein the change in the biological factors between the first sample and the second sample is indicative of the subject's mental, emotional or physical state. The disclosure also provides a system for monitoring a subject's mental, emotional or physical state. The method includes obtaining a first biological sample from the subject at a first time point; quantifying the amounts of a set of polynucleotides or polypeptides in the first biological sample; obtaining a second biological sample from the subject at a second time point; quantifying the amounts of a set of polynucleotides or polypeptides in the second biological sample; and determining a change in the quantifi...",
  "patent_number": "None",
  "abstract": "This disclosure relates to methods and kits, systems for screening, diagnosing and prognosing a disease, disorder, or physiological state based upon temporal measurements and analysis of gene expression in a subject.",
  "publication_number": "US20170002415A1-20170105",
  "_processing_info": {
    "original_size": 121194,
    "optimized_size": 2776,
    "reduction_percent": 97.71
  }
}