{
  "date_produced": "20171121",
  "publication_number": "US20170351968A1-20171207",
  "main_ipcr_label": "G06N9900",
  "decision": "PENDING",
  "application_number": "15173562",
  "inventor_list": [
    {
      "inventor_name_last": "Bowers",
      "inventor_name_first": "John A.",
      "inventor_city": "Austin",
      "inventor_state": "TX",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Laforteza",
      "inventor_name_first": "Andrew J.",
      "inventor_city": "Austin",
      "inventor_state": "TX",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Mcnair",
      "inventor_name_first": "Ryan D.",
      "inventor_city": "Austin",
      "inventor_state": "TX",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Randall",
      "inventor_name_first": "Benjamin J.",
      "inventor_city": "Fort Collins",
      "inventor_state": "CO",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Swingler",
      "inventor_name_first": "Teresa S.",
      "inventor_city": "Tucson",
      "inventor_state": "AZ",
      "inventor_country": "US"
    }
  ],
  "abstract": "A method, system and computer product for performing storage maintenance is described. A training set for storage volume reclamation is received. The training set includes a set of storage parameters, each set of storage parameters corresponds to a respective candidate storage volume of a set of candidate storage volumes. The training set also includes a set of user decisions made whether a respective candidate storage volume is reclaimable. The training set is used to train a machine learning system to recognize common features of reclaimable candidate storage volumes. A set of candidate storage volumes is provided for potential reclamation, each with a set of storage parameters. A graphical user interface presents respective members of the set of candidate storage volumes for reclamation if a confidence level is calculated that the respective candidate storage volume is reclaimable exceeds a threshold.",
  "filing_date": "20160603",
  "patent_number": "None",
  "summary": "<SOH> BRIEF SUMMARY <EOH>According to this disclosure, a method, apparatus and computer program product for performing storage maintenance. A training set for storage volume reclamation is received. The training set includes a set of storage parameters, each set of storage parameters corresponds to a respective candidate storage volume of a set of candidate storage volumes. The training set also includes a set of user decisions made whether a respective candidate storage volume is reclaimable. The training set is used to train a machine learning system to recognize common features of reclaimable candidate storage volumes. A set of candidate storage volumes is provided for potential reclamation, each with a set of storage parameters. A graphical user interface presents respective members of the set of candidate storage volumes for reclamation if a confidence level is calculated that the respective candidate storage volume is reclaimable exceeds a threshold. The foregoing has outlined some of the more pertinent features of the disclosed subject matter. These features should be construed to be merely illustrative. Many other beneficial results can be attained by applying the disclosed subject matter in a different manner or by modifying the invention as will be described.",
  "date_published": "20171207",
  "title": "MACHINE LEARNING FOR DETERMINING CONFIDENCE FOR RECLAMATION OF STORAGE VOLUMES",
  "ipcr_labels": [
    "G06N9900",
    "G06F30481",
    "G06F306"
  ],
  "_processing_info": {
    "original_size": 76195,
    "optimized_size": 3394,
    "reduction_percent": 95.55
  }
}