{
  "date_produced": "20171121",
  "publication_number": "US20170351951A1-20171207",
  "main_ipcr_label": "G06N308",
  "decision": "PENDING",
  "application_number": "15174188",
  "inventor_list": [
    {
      "inventor_name_last": "Santos",
      "inventor_name_first": "Jose Carlos Almeida",
      "inventor_city": "London",
      "inventor_state": "",
      "inventor_country": "GB"
    },
    {
      "inventor_name_last": "Arnold",
      "inventor_name_first": "Paul David",
      "inventor_city": "Bracknell",
      "inventor_state": "",
      "inventor_country": "GB"
    },
    {
      "inventor_name_last": "Roper",
      "inventor_name_first": "Ward Farquhar",
      "inventor_city": "Surbiton",
      "inventor_state": "",
      "inventor_country": "GB"
    },
    {
      "inventor_name_last": "Gupta",
      "inventor_name_first": "Parth",
      "inventor_city": "Gandhinagar",
      "inventor_state": "",
      "inventor_country": "IN"
    }
  ],
  "abstract": "Non-limiting examples of the present disclosure describe query classification to identify appropriateness of a query. A query may be received by at least one processing device. A deep neural network (DNN) model may be applied to evaluate the query. A vector representation may be generated for query based on application of the DNN model, where the DNN model is trained to classify queries according to a plurality of categories of appropriateness. The DNN model may be utilized to classify the query in a category of appropriateness based on analysis of the vector representation. In one example, auto-complete suggestions for the query may be filtered based on the classification of the category of appropriateness. In another example, classification of the query may be provided to an entry point. In yet another example, a response to the query is managed based on the classification of the query. Other examples are also described.",
  "filing_date": "20160606",
  "patent_number": "None",
  "summary": "<SOH> SUMMARY <EOH>Non-limiting examples of the present disclosure describe query classification to identify appropriateness of a query. A query may be received by at least one processing device. A deep neural network (DNN) model may be applied to evaluate the query. In one example, the DNN model is a deep structured semantic model (DSSM). A DNN or DSSM model may be trained to classify queries according to a plurality of categories of appropriateness. A vector representation may be generated for query based on application of the DNN model. The DNN model may be utilized to classify the query in a category of appropriateness based on analysis of the vector representation. In at least one example, auto-complete suggestions for the query may be filtered based on the classification of the category of appropriateness. In other examples, responses to the query may be managed based on classification of the category of appropriateness of the query. This Summary is provided to introduce a selection of concepts in a simplified form that are further described below in the Detailed Description. This Summary is not intended to identify key features or essential features of the claimed subject matter, nor is it intended to be used to limit the scope of the claimed subject matter. Additional aspects, features, and/or advantages of examples will be set forth in part in the description which follows and, in part, will be apparent from the description, or may be learned by practice of the disclosure.",
  "date_published": "20171207",
  "title": "QUERY CLASSIFICATION FOR APPROPRIATENESS",
  "ipcr_labels": [
    "G06N308",
    "G06F1730"
  ],
  "_processing_info": {
    "original_size": 77015,
    "optimized_size": 3432,
    "reduction_percent": 95.54
  }
}