{
  "date_produced": "20161122",
  "publication_number": "US20160358075A1-20161208",
  "main_ipcr_label": "G06N308",
  "decision": "PENDING",
  "application_number": "15176910",
  "inventor_list": [
    {
      "inventor_name_last": "Zhang",
      "inventor_name_first": "Zhengya",
      "inventor_city": "Ann Arbor",
      "inventor_state": "MI",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Chen",
      "inventor_name_first": "Thomas",
      "inventor_city": "Ann Arbor",
      "inventor_state": "MI",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Kim",
      "inventor_name_first": "Jung Kuk",
      "inventor_city": "Santa Clara",
      "inventor_state": "CA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Knag",
      "inventor_name_first": "Phil",
      "inventor_city": "Portland",
      "inventor_state": "OR",
      "inventor_country": "US"
    }
  ],
  "abstract": "A sparse coding system. The sparse coding system comprises a neural network including a plurality of neurons each having a respective feature associated therewith and each being configured to be electrically connected to every other neuron in the network and to a portion of an input dataset. The plurality of neurons are arranged in a plurality of neuron clusters each comprising a respective subset of the plurality of neurons, and the neurons in each cluster are electrically connected to one another in a bus structure, and the plurality of clusters are electrically connected together in a ring structure. Also provided is a sparse coding system that comprises an inference module configured to extract features from an input image containing an object, wherein the inference module comprises an implementation of a sparse coding algorithm, and a classifier configured to classify the object in the input image based on the extracted features.",
  "filing_date": "20160608",
  "patent_number": "None",
  "summary": "<SOH> SUMMARY <EOH>According to one embodiment, there is provided a sparse coding system. The system comprises a neural network including a plurality of neurons each having a respective feature associated therewith and each being configured to be electrically connected to every other neuron in the network and to a portion of an input dataset. The plurality of neurons are arranged in a plurality of neuron clusters each comprising a respective subset of the plurality of neurons, and the neurons in each cluster are electrically connected to one another in a bus structure, and the plurality of clusters are electrically connected together in a ring structure. According to another embodiment, there is provided a sparse coding system. The system comprises an inference module configured to extract features from an input image containing an object, wherein the inference module comprises an implementation of a sparse coding algorithm. The system further comprises a classifier configured to classify the object in the input image based on the extracted features. In an embodiment, the inference module and classifier are integrated on a single chip.",
  "date_published": "20161208",
  "title": "SYSTEM FOR IMPLEMENTING A SPARSE CODING ALGORITHM",
  "ipcr_labels": [
    "G06N308",
    "G06N3063"
  ],
  "_processing_info": {
    "original_size": 63784,
    "optimized_size": 3083,
    "reduction_percent": 95.17
  }
}