{
  "decision": "REJECTED",
  "application_number": "15171107",
  "date_published": "20170601",
  "date_produced": "20170517",
  "title": "CAPACITIVE STYLUS AND OPERATION SYSTEM FOR THE SAME",
  "filing_date": "20160602",
  "inventor_list": [
    {
      "inventor_name_last": "HUANG",
      "inventor_name_first": "CHIA-TE",
      "inventor_city": "New Taipei City",
      "inventor_state": "",
      "inventor_country": "TW"
    },
    {
      "inventor_name_last": "Hsu",
      "inventor_name_first": "Yan-Chin",
      "inventor_city": "Hsinchu County",
      "inventor_state": "",
      "inventor_country": "TW"
    }
  ],
  "ipcr_labels": [
    "G06F30354",
    "G06F3038",
    "G06F132",
    "G06F3044",
    "G06F3041"
  ],
  "main_ipcr_label": "G06F30354",
  "summary": "<SOH> SUMMARY OF THE INVENTION <EOH>Accordingly, it is the primary object of the present invention to provide a capacitive stylus. When the capacitive stylus is depressed, a calculation unit would base on a corresponding inductance-varying value to modulate and generate an oscillation frequency to an output unit. The output unit then bases on the oscillation frequency to output a frequency signal to a capacitive touch panel, so that the capacitive touch panel can calculate a pen-tip voltage of the capacitive stylus. In the present invention, an operation system for a capacitive stylus is provided. When the capacitive stylus is depressed, the capacitive stylus modulates and generates a signal, and a capacitive touch panel receives the signal generated by the capacitive stylus and calculates a pen-tip voltage of the capacitive stylus. In the present invention, a capacitive stylus applied to a capacitive touch panel as an input means includes a detection unit, a calculation unit and an output unit. The detection unit is to contact the capacitive touch panel. The calculation unit is electrically coupled with the detection unit. The output unit is electrically coupled with the calculation unit. When the detection unit contacts the capacitive touch panel, the detection unit generates a corresponding inductance-varying value, the calculation unit bases on the inductance-varying value to modulate and generate an oscillation frequency to the output unit, and the output unit bases on the oscillation frequency to output a frequency signal to the capacitive touch panel. In the present invention, a capacitive stylus applied to a capacitive touch panel as an input means includes a detection unit and a calculation unit. The detection unit is to contact the capacitive touch panel. The calculation unit is electrically coupled with the detection unit. When the detection unit contacts the capacitive touch panel, the detection unit generates a corresponding inductance-varying value, an...",
  "patent_number": "None",
  "abstract": "A capacitive stylus applied to a capacitive touch panel as an input means includes a detection unit, a calculation unit and an output unit. The detection unit is to contact the capacitive touch panel. The calculation unit is electrically coupled with the detection unit. The output unit is electrically coupled with the calculation unit. When the detection unit contacts the capacitive touch panel, the detection unit generates a corresponding inductance-varying value, the calculation unit bases on the inductance-varying value to modulate and generate an oscillation frequency to the output unit, and the output unit bases on the oscillation frequency to output a frequency signal to the capacitive touch panel. Further, an operation system is provided to integrate the capacitive stylus and the capacitive touch panel.",
  "publication_number": "US20170153722A1-20170601",
  "_processing_info": {
    "original_size": 52765,
    "optimized_size": 3566,
    "reduction_percent": 93.24
  }
}