{
  "decision": "PENDING",
  "application_number": "15174190",
  "date_published": "20170202",
  "date_produced": "20170119",
  "title": "UPDATING DATABASE DRIVERS FOR CLIENT APPLICATIONS THROUGH A DATABASE SERVER PUSH",
  "filing_date": "20160606",
  "inventor_list": [
    {
      "inventor_name_last": "Priyadarshini",
      "inventor_name_first": "Pallavi",
      "inventor_city": "Bangalore",
      "inventor_state": "",
      "inventor_country": "IN"
    },
    {
      "inventor_name_last": "Tatini",
      "inventor_name_first": "Parameswara R.",
      "inventor_city": "Bangalore",
      "inventor_state": "",
      "inventor_country": "IN"
    }
  ],
  "ipcr_labels": [
    "G06F9445",
    "H04L2908"
  ],
  "main_ipcr_label": "G06F9445",
  "summary": "<SOH> SUMMARY <EOH>According to one embodiment, a method for updating drivers is presented. The method may include transmitting a connection request from a first computer to a second computer. The method may also include creating a connection handshake in the first computer in response to the transmitted connection request, whereby the connection handshake includes a plurality of client credentials and a plurality of driver information. The method may further include transmitting the created connection handshake from the first computer to a second computer. The method may also include determining the first computer is authorized to connect to the second computer based on the plurality of client credentials. The method may further include determining a first version level of a first plurality of drivers associated with the first computer is a lower version level than a second version level of a second plurality of drivers associated with the second computer based on the plurality of driver information. The method may also include transmitting a driver update. The method may further include installing the driver update. According to another embodiment, a computer system for updating drivers is presented. The computer system may include one or more processors, one or more computer-readable memories, one or more computer-readable tangible storage devices, and program instructions stored on at least one of the one or more storage devices for execution by at least one of the one or more processors via at least one of the one or more memories, whereby the computer system is capable of performing a method. The computer system may include transmitting a connection request from a first computer to a second computer. The computer system may also include creating a connection handshake in the first computer in response to the transmitted connection request, whereby the connection handshake includes a plurality of client credentials and a plurality of driver information. The com...",
  "patent_number": "None",
  "abstract": "A method for updating drivers. The method may include transmitting a connection request from a first computer to a second computer. The method may include creating a connection handshake in the first computer in response to the transmitted connection request, whereby the connection handshake includes client credentials and driver information. The method may include transmitting the created connection handshake from the first computer to a second computer. The method may include determining the first computer is authorized to connect to the second computer based on the client credentials. The method may include determining a first version level of a first plurality of drivers associated with the first computer is a lower version level than a second version level of a second plurality of drivers associated with the second computer based on the driver information. The method may include transmitting a driver update. The method may include installing the driver update.",
  "publication_number": "US20170031673A1-20170202",
  "_processing_info": {
    "original_size": 58525,
    "optimized_size": 3721,
    "reduction_percent": 93.64
  }
}