{
  "date_produced": "20171121",
  "publication_number": "US20170351967A1-20171207",
  "main_ipcr_label": "G06N9900",
  "decision": "PENDING",
  "application_number": "15171778",
  "inventor_list": [
    {
      "inventor_name_last": "Babbush",
      "inventor_name_first": "Ryan",
      "inventor_city": "Venice",
      "inventor_state": "CA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Neven",
      "inventor_name_first": "Hartmut",
      "inventor_city": "Malibu",
      "inventor_state": "CA",
      "inventor_country": "US"
    }
  ],
  "abstract": "Methods, systems, and apparatus for training quantum evolutions using sub-logical controls. In one aspect, a method includes the actions of accessing quantum hardware, wherein the quantum hardware includes a quantum system comprising one or more multi-level quantum subsystems; one or more control devices that operate on the one or more multi-level quantum subsystems according to one or more respective control parameters that relate to a parameter of a physical environment in which the multi-level quantum subsystems are located; initializing the quantum system in an initial quantum state, wherein an initial set of control parameters form a parameterization that defines the initial quantum state; obtaining one or more quantum system observables and one or more target quantum states; and iteratively training until an occurrence of a completion event.",
  "filing_date": "20160602",
  "patent_number": "None",
  "summary": "<SOH> SUMMARY <EOH>This specification describes technologies for training quantum evolutions of an initial quantum state to realize a target quantum state with defined target characteristics. The quantum evolutions of the initial quantum state are trained using adjustable analogue evolutions defined through the tuning of fundamental hardware elements, such as control knobs that may typically be used to calibrate individual quantum gates. In general, one innovative aspect of the subject matter described in this specification can be implemented in a method that includes accessing quantum hardware, wherein the quantum hardware comprises a quantum system comprising one or more multi-level quantum subsystems; one or more control devices that operate on the one or more multi-level quantum subsystems according to one or more respective control parameters that relate to a parameter of a physical environment in which the multi-level quantum subsystems are located; initializing the quantum system in an initial quantum state, wherein an initial set of control parameters form a parameterization that defines the initial quantum state; obtaining one or more quantum system observables and one or more target quantum states; and iteratively training until an occurrence of a completion event. Other implementations of this aspect include corresponding computer systems, apparatus, and computer programs recorded on one or more computer storage devices, each configured to perform the actions of the methods. A system of one or more computers can be configured to perform particular operations or actions by virtue of having software, firmware, hardware, or a combination thereof installed on the system that in operation causes or cause the system to perform the actions. One or more computer programs can be configured to perform particular operations or actions by virtue of including instructions that, when executed by data processing apparatus, cause the apparatus to perform the actions. The...",
  "date_published": "20171207",
  "title": "TRAINING QUANTUM EVOLUTIONS USING SUBLOGICAL CONTROLS",
  "ipcr_labels": [
    "G06N9900"
  ],
  "_processing_info": {
    "original_size": 82122,
    "optimized_size": 3543,
    "reduction_percent": 95.69
  }
}