{
  "decision": "ACCEPTED",
  "application_number": "15176800",
  "date_published": "20160929",
  "date_produced": "20160914",
  "title": "SYSTEMS AND METHODS FOR HOST IMAGE TRANSFER",
  "filing_date": "20160608",
  "inventor_list": [
    {
      "inventor_name_last": "WEI",
      "inventor_name_first": "Po-Hsin",
      "inventor_city": "Taipei City",
      "inventor_state": "",
      "inventor_country": "TW"
    },
    {
      "inventor_name_last": "MALITZIS",
      "inventor_name_first": "Andrew Spyros",
      "inventor_city": "Old Bethpage",
      "inventor_state": "NY",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "MODANSKY",
      "inventor_name_first": "Andrew Lee",
      "inventor_city": "Rockville Centre",
      "inventor_state": "NY",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "CHANG",
      "inventor_name_first": "Sheng-Chang",
      "inventor_city": "Taipei City",
      "inventor_state": "",
      "inventor_country": "TW"
    }
  ],
  "ipcr_labels": [
    "G06F1114"
  ],
  "main_ipcr_label": "G06F1114",
  "summary": "<SOH> SUMMARY OF THE INVENTION <EOH>Methods and systems for transferring a host image of a first machine to a second machine, such as during disaster recovery or migration, are disclosed. In one example, a first profile of a first machine of a first type, such as a first client machine, is compared to a second profile of a second machine, such as a recovery machine or a second client machine of a second type different from the first type, to which the host image is to be transferred, by a first processing device. The first and second profiles each comprise at least one property of the first type of first machine and the second type of second machine, respectively. At least one property of a host image of the first machine is conformed to at least one corresponding property of the second machine. The conformed host image is provided to the second machine, via a network. The second machine is configured with at least one conformed property of the host image by a second processing device of the second machine. In accordance with an embodiment of the invention, a method of recovering a host image of a first machine to a second machine is disclosed comprising, comparing a first profile of a first machine of a first type to be transferred to a second profile of a second machine of a second type different from the first type, to which the host image is to be transferred, by a first processing device. The first and second profiles each comprise at least one property of the first type of first machine and the second type of second machine, respectively. At least one property of a host image of the first machine is conformed to at least one corresponding property of the second machine based, at least in part, on the comparison, by the first processing device. The host image includes an operating system. The conformed host image is provided to second machine, via a network, and the second machine is configured with at least one conformed property of the host image by a second ...",
  "patent_number": "9734019",
  "abstract": "Methods and systems for transferring a host image of a first machine to a second machine, such as during disaster recovery or migration, are disclosed. In one example, a first profile of a first machine of a first type, such as a first client machine, is compared to a second profile of a second machine, such as a recovery machine or a second client machine of a second type different from the first type, to which the host image is to be transferred, by a first processing device. The first and second profiles each comprise at least one property of the first type of first machine and the second type of second machine, respectively. At least one property of a host image of the first machine is conformed to at least one corresponding property of the second machine. The conformed host image is provided to the second machine, via a network. The second machine is configured with at least one conformed property of the host image by a second processing device of the second machine.",
  "publication_number": "US20160283330A1-20160929",
  "_processing_info": {
    "original_size": 104170,
    "optimized_size": 3992,
    "reduction_percent": 96.17
  }
}