{
  "date_produced": "20171121",
  "publication_number": "US20170351966A1-20171207",
  "main_ipcr_label": "G06N700",
  "decision": "PENDING",
  "application_number": "15175894",
  "inventor_list": [
    {
      "inventor_name_last": "Rastogi",
      "inventor_name_first": "Mudit",
      "inventor_city": "Brno",
      "inventor_state": "",
      "inventor_country": "CZ"
    }
  ],
  "abstract": "Methods and systems are provided for condition-based maintenance of a structural component exhibiting a physical defect. One exemplary system comprises a measurement system to obtain a current measurement of a defect in a structure, a monitoring system, and a maintenance system. The monitoring system determines a probabilistic representation of degradation development data for the defect using the current measurement, determines a reference remaining usage life metric for the structure based on the probabilistic representation and a target probability value, and determines one or more remaining usage life bounds based at least in part on the reference remaining usage life metric. The maintenance system determines maintenance schedule or other remedial action(s) for the structure in a manner that is influenced by the reference remaining usage life metric and the one or more remaining usage life bounds.",
  "filing_date": "20160607",
  "patent_number": "None",
  "summary": "<SOH> BRIEF SUMMARY <EOH>Methods and systems are provided for determining remaining usage life of a structural component exhibiting a defect. One exemplary system includes a measurement system to obtain a current measurement of a defect in a structure and a maintenance system coupled to determine an action for the structure in a manner that is influenced by a reference remaining usage life metric and one or more remaining usage life limits, such as, for example, a physical inspection or other non-destructive testing, component replacement, or other maintenance actions. The maintenance system is coupled to a monitoring system, which, in turn, is coupled to the measurement system to determine a probabilistic representation of degradation development data for the defect based at least in part on the current measurement, a threshold value, and one or more stress intensity factors, determine the reference remaining usage life metric for the structure based on the probabilistic representation and a target probability value, and determine the one or more remaining usage life limits based at least in part on the reference remaining usage life metric. In another exemplary embodiment, a method of monitoring a component having a physical defect is provided. The method involves determining degradation development data for the physical defect based at least in part on a current measurement of the physical defect, determining a probabilistic representation of the degradation development data based at least in part on a threshold value associated with the physical defect and uncertainty associated with the current measurement, determining a remaining usage life value for the component based on an input probability value and the probabilistic representation, determining one or more confidence limit values associated with the remaining usage life value, and providing the remaining usage life value and the one or more confidence limit values to a maintenance system. In yet another em...",
  "date_published": "20171207",
  "title": "PROBABILISTIC REMAINING USAGE LIFE OF AIRCRAFT STRUCTURES",
  "ipcr_labels": [
    "G06N700",
    "G01M9900",
    "G01L500"
  ],
  "_processing_info": {
    "original_size": 69538,
    "optimized_size": 3476,
    "reduction_percent": 95.0
  }
}