{
  "date_produced": "20171129",
  "publication_number": "US20170357906A1-20171214",
  "main_ipcr_label": "G06N700",
  "decision": "PENDING",
  "application_number": "15176213",
  "inventor_list": [
    {
      "inventor_name_last": "Bishop",
      "inventor_name_first": "Timothy A.",
      "inventor_city": "Minneapolis",
      "inventor_state": "MN",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Boxwell",
      "inventor_name_first": "Stephen A.",
      "inventor_city": "Columbus",
      "inventor_state": "OH",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Brumfield",
      "inventor_name_first": "Benjamin L.",
      "inventor_city": "Cedar Park",
      "inventor_state": "TX",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Vernier",
      "inventor_name_first": "Stanley J.",
      "inventor_city": "Grove City",
      "inventor_state": "OH",
      "inventor_country": "US"
    }
  ],
  "abstract": "A method, executed by a computer, includes determining within a collection of triples, triples that have a common first entity type and a common predicate to produce similar triples, determining similar triples that have a particular second entity type to produce matching triples, counting the similar triples and the matching triples to produce a similar triple count and a matching triple count, computing probability information based on the matching triple count and the similar triple count, and processing data based on the probability information. A computer system and computer program product corresponding to the method are also disclosed herein.",
  "filing_date": "20160608",
  "patent_number": "None",
  "summary": "<SOH> SUMMARY <EOH>A method, executed by a computer, includes determining within a collection of triples, triples that have a common first entity type and a common predicate to produce similar triples, determining similar triples that have a particular second entity type to produce matching triples, counting the similar triples and the matching triples to produce a similar triple count and a matching triple count, computing probability information based on the matching triple count and the similar triple count, and processing data based on the probability information. A computer system and computer program product corresponding to the method are also disclosed herein.",
  "date_published": "20171214",
  "title": "PROCESSING UN-TYPED TRIPLE STORE DATA",
  "ipcr_labels": [
    "G06N700",
    "G06F1730"
  ],
  "_processing_info": {
    "original_size": 46106,
    "optimized_size": 2334,
    "reduction_percent": 94.94
  }
}