{
  "decision": "ACCEPTED",
  "application_number": "15170716",
  "date_published": "20161215",
  "date_produced": "20161130",
  "title": "AUGMENTED REALITY METHOD AND SYSTEM FOR MEASURING AND/OR MANUFACTURING",
  "filing_date": "20160601",
  "inventor_list": [
    {
      "inventor_name_last": "MONTAIGNE",
      "inventor_name_first": "Manuel",
      "inventor_city": "La Salvetat-Saint-Gilles",
      "inventor_state": "",
      "inventor_country": "FR"
    },
    {
      "inventor_name_last": "ROSSI",
      "inventor_name_first": "Teemu",
      "inventor_city": "Dublin",
      "inventor_state": "",
      "inventor_country": "IE"
    }
  ],
  "ipcr_labels": [
    "G06T1900",
    "G06T700",
    "G01C308"
  ],
  "main_ipcr_label": "G06T1900",
  "summary": "<SOH> BRIEF DESCRIPTION OF THE FIGURES <EOH>FIG. 1 depicts components used in an assembling method. FIG. 2 shows receipt of input at an input device of an augmented reality system. FIG. 3 shows calibration of a measurement device via a calibrating object. FIG. 4 depicts the showing of an indication on the augmented reality system of where to place a targeting object. FIG. 5 depicts the showing of an indication on the augmented reality system of where to place the targeting object and the showing of an indication on the augmented reality system of a location at which a mark should be made. FIG. 6 depicts validation of a mark using the measurement device and the augmented reality system. FIG. 7 depicts a smart glove for use in conjunction with the augmented reality system. FIG. 8 depicts a model that can be viewed using the augmented reality system and manipulated using the smart glove. FIG. 9 depicts a general purpose computer system that can be used to implement aspects of the described subject matter. detailed-description description=\"Detailed Description\" end=\"lead\"?",
  "patent_number": "9870645",
  "abstract": "An assembling method, an augmented reality system and a computer program product for measuring and/or manufacturing are provided. A targeting object may be placed in a working space. A distance is measured from the measurement device to the targeting object. The distance measurement is transmitted to the augmented reality system, and the augmented reality system determines whether the distance measurement corresponds to a target distance.",
  "publication_number": "US20160364913A1-20161215",
  "_processing_info": {
    "original_size": 78868,
    "optimized_size": 2271,
    "reduction_percent": 97.12
  }
}