{
  "decision": "PENDING",
  "application_number": "15173643",
  "date_published": "20171228",
  "date_produced": "20171213",
  "title": "SECURE CIRCUIT FOR ENCRYPTION KEY GENERATION",
  "filing_date": "20160604",
  "inventor_list": [
    {
      "inventor_name_last": "Benson",
      "inventor_name_first": "Wade",
      "inventor_city": "San Jose",
      "inventor_state": "CA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Sykora",
      "inventor_name_first": "Libor",
      "inventor_city": "Prague",
      "inventor_state": "",
      "inventor_country": "CZ"
    },
    {
      "inventor_name_last": "Kuzela",
      "inventor_name_first": "Vratislav",
      "inventor_city": "Cakovicky",
      "inventor_state": "",
      "inventor_country": "CZ"
    },
    {
      "inventor_name_last": "Brouwer",
      "inventor_name_first": "Michael",
      "inventor_city": "Los Gatos",
      "inventor_state": "CA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Whalley",
      "inventor_name_first": "Andrew R.",
      "inventor_city": "San Francisco",
      "inventor_state": "CA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Hauck",
      "inventor_name_first": "Jerrold V.",
      "inventor_city": "Windermere",
      "inventor_state": "FL",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Finkelstein",
      "inventor_name_first": "David",
      "inventor_city": "Sunnyvale",
      "inventor_state": "CA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Mensch",
      "inventor_name_first": "Thomas",
      "inventor_city": "Sunnyvale",
      "inventor_state": "CA",
      "inventor_country": "US"
    }
  ],
  "ipcr_labels": [
    "H04L908",
    "H04L900",
    "H04L914",
    "H04L932",
    "G06F2132"
  ],
  "main_ipcr_label": "H04L908",
  "summary": "<SOH> SUMMARY <EOH>The present disclosure describes embodiments in which public key encryption may be used. In one embodiment, an integrated circuit may include a processor and a secure circuit (referred to below as a secure enclave processor (SEP)) isolated from access by the processor except through a mailbox mechanism. The secure circuit may be configured to generate and maintain key pairs having a public key and a private key. The secure circuit may also include circuitry for performing cryptographic operations (e.g., encryption, decryption, and signature generation) using the keys. In some embodiments, in order to attest to the validity of these keys, the secure circuit may issue certificate signing requests (CSR) to a certificate authority (CA) in order to receive corresponding certificates for these keys. In some embodiments, applications executing on the processor (e.g., third-party applications) may send requests to the secure circuit that ask it to perform cryptographic operations using the certified private keys. In some instances, using certified private keys maintained by the secure circuit is more secure than software-generated keys stored in system memory (e.g., uncertified keys generated by the applications themselves and potentially exposed to malicious software). In some embodiments, the secure circuit may be included in a first computing device and used to unlock functionality on a second computing device coupled to the first computing device. In such an embodiment, the second computing device may present an authentication challenge to the first computing device, the challenge specifying a set of data to be signed by the first computing device. In response to receiving the challenge, the first computing device may use the secure circuit to sign the data with a key maintained in the secure circuit. In one embodiment, this unlocked functionality may include permitting access to confidential data stored on the second device.",
  "patent_number": "None",
  "abstract": "Techniques are disclosed relating to relating to a public key infrastructure (PKI). In one embodiment, an integrated circuit is disclosed that includes at least one processor and a secure circuit isolated from access by the processor except through a mailbox mechanism. The secure circuit is configured to generate a key pair having a public key and a private key, and to issue, to a certificate authority (CA), a certificate signing request (CSR) for a certificate corresponding to the key pair. In some embodiments, the secure circuit may be configured to receive, via the mailbox mechanism, a first request from an application executing on the processor to issue a certificate to the application. The secure circuit may also be configured to perform, in response to a second request, a cryptographic operation using a public key circuit included in the secure circuit.",
  "publication_number": "US20170373843A1-20171228",
  "_processing_info": {
    "original_size": 75428,
    "optimized_size": 4459,
    "reduction_percent": 94.09
  }
}