{
  "decision": "PENDING",
  "application_number": "15172052",
  "date_published": "20161124",
  "date_produced": "20161109",
  "title": "Interactive Data Visualization User Interface with Gesture-based Data Field Selection",
  "filing_date": "20160602",
  "inventor_list": [
    {
      "inventor_name_last": "Stewart",
      "inventor_name_first": "Robin",
      "inventor_city": "Seattle",
      "inventor_state": "WA",
      "inventor_country": "US"
    }
  ],
  "ipcr_labels": [
    "G06F30482",
    "G06F1724",
    "G06F30484",
    "G06F1722",
    "G06F30488",
    "G06T1380"
  ],
  "main_ipcr_label": "G06F30482",
  "summary": "<SOH> SUMMARY <EOH>The above deficiencies and other problems associated with visualizing data are reduced or eliminated by the disclosed methods, devices, graphical user interfaces, and computer readable storage media. Various implementations of methods, devices, graphical user interfaces, and storage media within the scope of this disclosure and the appended claims each have several aspects, no single one of which is solely responsible for the attributes described herein. Thus methods, systems, and graphical user interfaces are provided that enable users to more easily and more efficiently analyze data sets.",
  "patent_number": "None",
  "abstract": "The various embodiments described herein include methods and devices for interactive data visualization. In one aspect, a method is performed at a device with a touch-sensitive surface and a display. The method includes displaying a first chart, the first chart concurrently displaying a first dimension and a first measure. The method further includes (i) detecting a touch input at a location that corresponds to a location on the first chart; (ii) determining whether the touch input is in a first region corresponding to the first dimension or in the second region corresponding to the first measure; and (iii) in response to detecting the touch input in the first region, adding another dimension through an animated transition to display a second chart, where at least one visual mark in the first chart is split into a plurality of visual marks in the second chart through the animated transition.",
  "publication_number": "US20160342292A1-20161124",
  "_processing_info": {
    "original_size": 60376,
    "optimized_size": 2155,
    "reduction_percent": 96.43
  }
}