{
  "decision": "PENDING",
  "application_number": "15177315",
  "date_published": "20160929",
  "date_produced": "20160914",
  "title": "SYSTEM AND METHOD FOR CATEGORICALLY SCORING ELECTRONIC DOCUMENTS",
  "filing_date": "20160608",
  "inventor_list": [
    {
      "inventor_name_last": "Uy",
      "inventor_name_first": "Victor Jr David",
      "inventor_city": "Burnaby",
      "inventor_state": "",
      "inventor_country": "CA"
    }
  ],
  "ipcr_labels": [
    "G06F1730"
  ],
  "main_ipcr_label": "G06F1730",
  "summary": "<SOH> SUMMARY OF THE INVENTION <EOH>It is an object of the present invention to provide a method and apparatus that overcomes problems in the prior art. In a first aspect, a method for displaying a score with a search result is provided. The method comprises: requesting a search from a search engine using a search query having at least one search term; receiving a set of search results from the search engine in response to the search query, each search result referencing an electronic document, the set of search results in an order based on a ranking of the search results by the search engine; displaying the set of ranked search results in the order; and displaying at least one score along with the set of search results, each score associated with an electronic document referenced by one of the search results and displayed with the one of the search results. Each score is determined independently from the ranking of the search results by the search engine. In a second aspect, a data processing system for displaying a score with a search result is provided. The data processing system comprises: at least one processor; a memory operatively coupled to the at least one processor; a display device operative to display data; and a program module stored in the memory and operative for providing instructions to the at least one processor, the at least one processor responsive to the instructions of the program module. The program module is operative for: requesting a search from a search engine using a search query having at least one search term; receiving a set of search results from the search engine in response to the search query, each search result referencing an electronic document, the set of search results in an order based on a ranking of the search results by the search engine; displaying the set of search results in the order on the display device; and displaying at least one score along with the set of search results on the display device, each score associated...",
  "patent_number": "None",
  "abstract": "Methods and apparatus are provided for associating scores with search results obtained from a search engine so that the scores can be displayed with the search results. A search of electronic documents, such as webpages, is requested and a set of search results obtained. Each search result in the set references an electronic document. Using the search results, a database containing scores determined for electronic documents is searched to determine whether scores have been determined for the electronic documents referenced by the search results. The scores stored in the database are based on people's ratings of the electronic document corresponding to the score. If a score has been determined for an electronic document referenced by one of the search results, that score is associated with the search result and the search results are then displayed with any scores associated with the search results.",
  "publication_number": "US20160283489A1-20160929",
  "_processing_info": {
    "original_size": 97806,
    "optimized_size": 3467,
    "reduction_percent": 96.46
  }
}