{
  "decision": "ACCEPTED",
  "application_number": "15176046",
  "date_published": "20161006",
  "date_produced": "20160921",
  "title": "SECURE TRANSACTION SYSTEM",
  "filing_date": "20160607",
  "inventor_list": [
    {
      "inventor_name_last": "SONG",
      "inventor_name_first": "Yuh-shen",
      "inventor_city": "Porter Ranch",
      "inventor_state": "CA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "LEW",
      "inventor_name_first": "Catherine",
      "inventor_city": "Porter Ranch",
      "inventor_state": "CA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "SONG",
      "inventor_name_first": "Alexander",
      "inventor_city": "Porter Ranch",
      "inventor_state": "CA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "SONG",
      "inventor_name_first": "Victoria",
      "inventor_city": "Porter Ranch",
      "inventor_state": "CA",
      "inventor_country": "US"
    }
  ],
  "ipcr_labels": [
    "G06Q2040",
    "G06Q2010",
    "H04L2906",
    "G06Q2038"
  ],
  "main_ipcr_label": "G06Q2040",
  "summary": "<SOH> SUMMARY <EOH>One aspect of the present disclosure enables consumers to conduct financial transactions in a secured manner without the need to use any traditional financial instrument which can be easily stolen or fabricated. As a result of one aspect of the present disclosure, there is no need for consumers to carry traditional financial instruments such as checks, credit cards, debit cards, stored-value cards, pre-paid cards, ATM cards, gift cards, etc. Traditionally, a client of a financial institution is identified by an account number. For example, a credit card has a credit card account number. A check has a checking account number. A stock trading account has a trading account number. An insurance policy holder has a policy number (or an account number). This is the traditional way for financial institutions to identify and manage billions of clients without any confusion. Because an account number is very long and a client may not be able to remember it, it is customary for a financial institution to issue a financial instrument that contains the account number. Therefore, financial transactions are conducted conventionally through cards. Nevertheless, if the financial instrument information of a consumer is stolen, a fraudster can use the stolen information to fabricate counterfeit financial instruments such as credit cards, debit cards, or checks, etc. or to give fraudulent instructions. Therefore, protecting the financial instruments is essential to preventing financial transactions fraud. Many methods have been disclosed throughout history to protect financial instruments. For example, some methods suggest that financial institutions provide consumers with temporary card numbers that automatically expire when certain criteria is met. Some methods suggest that cardholders deactivate their card numbers while they are not using the cards and activate their card numbers again before they use their cards. In general, these methods create huge overhead to...",
  "patent_number": "9858576",
  "abstract": "A computerized method enables a user to conduct a transaction in a private and secure manner via three computer systems and the user's partial identification information. The partial identification information is insufficient to disclose an identity of the user.",
  "publication_number": "US20160292683A1-20161006",
  "_processing_info": {
    "original_size": 111445,
    "optimized_size": 3272,
    "reduction_percent": 97.06
  }
}