{
  "decision": "PENDING",
  "application_number": "15175056",
  "date_published": "20161215",
  "date_produced": "20161130",
  "title": "TOUCH DEVICE",
  "filing_date": "20160607",
  "inventor_list": [
    {
      "inventor_name_last": "Chen",
      "inventor_name_first": "Wenlong",
      "inventor_city": "Xiamen",
      "inventor_state": "",
      "inventor_country": "CN"
    },
    {
      "inventor_name_last": "Chiang",
      "inventor_name_first": "Cheng-Chung",
      "inventor_city": "Kaohsiung",
      "inventor_state": "",
      "inventor_country": "TW"
    },
    {
      "inventor_name_last": "Jiang",
      "inventor_name_first": "Yau-Chen",
      "inventor_city": "Zhubei",
      "inventor_state": "",
      "inventor_country": "TW"
    },
    {
      "inventor_name_last": "Xie",
      "inventor_name_first": "Yanjun",
      "inventor_city": "Wuhan",
      "inventor_state": "",
      "inventor_country": "CN"
    },
    {
      "inventor_name_last": "Lai",
      "inventor_name_first": "Bin",
      "inventor_city": "Fuzhou",
      "inventor_state": "",
      "inventor_country": "CN"
    },
    {
      "inventor_name_last": "Lin",
      "inventor_name_first": "Ching-Shan",
      "inventor_city": "Tainan",
      "inventor_state": "",
      "inventor_country": "TW"
    }
  ],
  "ipcr_labels": [
    "G06F3041",
    "G02F11333",
    "G02F11362",
    "G02F11343",
    "G02F11368",
    "G06F3044",
    "G02F11335"
  ],
  "main_ipcr_label": "G06F3041",
  "summary": "<SOH> BRIEF SUMMARY OF DISCLOSURE <EOH>An object of the present disclosure is to provide a touch device having three-dimensional touch detection. In some embodiments of the disclosure, a touch device includes: a protection cover, used as an outer protection shield, and an upper surface of the protection cover is provided to users for a pressing action; a pressure-sensing layer, disposed under the protection cover, configured to detect touch strength; and a flat touch-sensing electrode layer, disposed between the pressure-sensing layer and the protection cover, configured to detect a position of the pressing action. And in some embodiments of the disclosure, a pressure-sensing layer includes at least one radial pressure-sensing electrode, the radial pressure-sensing electrode has a plurality of extension portions, and the extension portion is presented as a radial pattern outwards from the center of the radial pressure-sensing electrode for increasing a pressure-detection sensitivity.",
  "patent_number": "nan",
  "abstract": "The disclosure provides a touch device, including a protection cover, a pressure-sensing layer and a flat touch-sensing electrode layer. The protection cover is used as an outer protection shield, and an upper surface of the protection cover is provided to users for pressing action. The pressure-sensing layer is disposed under the protection cover to detect touch strength. The flat touch-sensing electrode layer is disposed between the pressure-sensing layer and the protection cover to detect the position of the user's touch.",
  "publication_number": "US20160364070A1-20161215",
  "_processing_info": {
    "original_size": 31637,
    "optimized_size": 2808,
    "reduction_percent": 91.12
  }
}