{
  "decision": "ACCEPTED",
  "application_number": "15176416",
  "date_published": "20160929",
  "date_produced": "20160914",
  "title": "LEVERAGING ENTERPRISE CONTENT",
  "filing_date": "20160608",
  "inventor_list": [
    {
      "inventor_name_last": "Radhakrishnan",
      "inventor_name_first": "Rajesh",
      "inventor_city": "Reston",
      "inventor_state": "VA",
      "inventor_country": "US"
    }
  ],
  "ipcr_labels": [
    "G06F1730"
  ],
  "main_ipcr_label": "G06F1730",
  "summary": "<SOH> SUMMARY <EOH>The present invention provides a method comprising: receiving, by an enterprise content management (ECM) computing system comprising a computer processor, data associated with a subscriber; registering, by the computer processor based on the data, the subscriber with the ECM computing system; connecting, by the computer processor, devices belonging to the subscriber to the ECM computing system via an Intranet; retrieving, by the computer processor from the devices, metadata associated with content retrieved by the subscriber via the devices; classifying, by the computer processor based on analysis of the metadata, the content into formal content and informal content, wherein the formal content comprises content that has been uploaded to a primary repository of the ECM computing system, and wherein the informal content comprises content that has not been uploaded to the primary repository of the ECM computing system; monitoring, by the computer processor, multiple searches for additional content initiated by the subscriber; generating, by the computer processor for the subscriber based on the monitoring and results of the classifying, multifaceted search results associated with the formal content and the informal content; and presenting, by the computer processor to the subscriber, the multifaceted search results. The present invention provides a computer program product, comprising a computer readable storage device storing a computer readable program code, the computer readable program code comprising an algorithm that when executed by a computer processor of an enterprise content management (ECM) computer system implements a method, the method comprising: receiving, by the computer processor, data associated with a subscriber; registering, by the computer processor based on the data, the subscriber with the ECM computing system; connecting, by the computer processor, devices belonging to the subscriber to the ECM computing system via an Intranet...",
  "patent_number": "9734236",
  "abstract": "A method and system for leveraging content is provided. The method includes receiving, data associated with a subscriber and registering the subscriber with an ECM computing system. Devices belonging to the subscriber are connected to the ECM computing system and metadata associated with content retrieved from the devices is generated. The content in the devices are classified into formal content and informal content. Multiple searches for additional content are monitored and multifaceted search results associated with the formal content and the informal content are generated and presented to the subscriber. The subscriber has an option to request informal content on additional end user devices from respective end users based on metadata presented by search results.",
  "publication_number": "US20160283576A1-20160929",
  "_processing_info": {
    "original_size": 37779,
    "optimized_size": 3304,
    "reduction_percent": 91.25
  }
}