{
  "date_produced": "20171121",
  "publication_number": "US20170351961A1-20171207",
  "main_ipcr_label": "G06N504",
  "decision": "PENDING",
  "application_number": "15170395",
  "inventor_list": [
    {
      "inventor_name_last": "Kochura",
      "inventor_name_first": "Nadiya",
      "inventor_city": "Bolton",
      "inventor_state": "MA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Wojtas",
      "inventor_name_first": "Alphonse Joseph",
      "inventor_city": "East Hampstead",
      "inventor_state": "NH",
      "inventor_country": "US"
    }
  ],
  "abstract": "An electronic appropriateness assessment tool (“tool”) can be configured to select information in response to an electronic request for the information. In one example, the request may be by a device associated with a user. In another example request may be by a social media platform. Before providing the information to the device, the tool can determine an appropriateness level of the information. In some instances, the tool can determine the appropriateness level based on social media data. The social media data may be expressions of sentiment about content made by social contacts of the user via the social media platform. The electronic appropriateness assessment tool can further determine a degree of the information to provide for presentation based on the appropriateness level.",
  "filing_date": "20160601",
  "patent_number": "None",
  "summary": "<SOH> SUMMARY <EOH>An electronic appropriateness assessment tool (“tool”) can be configured to select information in response to an electronic request for the information. In one example, the request may be by a device associated with a user. In another example, the request may be by a social media platform. Before providing the information to the device, the tool can determine an appropriateness level of the information. In some instances, the tool can determine the appropriateness level based on social media data. The social media data may be expressions of sentiment about content made by social contacts of the user via the social media platform. The electronic appropriateness assessment tool can further determine a degree of the information to provide for presentation based on the appropriateness level.",
  "date_published": "20171207",
  "title": "INFORMATION APPROPRIATENESS ASSESSMENT TOOL",
  "ipcr_labels": [
    "G06N504",
    "G06N9900"
  ],
  "_processing_info": {
    "original_size": 67866,
    "optimized_size": 2330,
    "reduction_percent": 96.57
  }
}