{
  "date_produced": "20160914",
  "publication_number": "US20160283843A1-20160929",
  "main_ipcr_label": "G06N502",
  "decision": "ACCEPTED",
  "application_number": "15172280",
  "inventor_list": [
    {
      "inventor_name_last": "LI",
      "inventor_name_first": "Bing",
      "inventor_city": "Shenzhen",
      "inventor_state": "",
      "inventor_country": "CN"
    }
  ],
  "abstract": "An application recommending method includes acquiring a first behavior eigenvalue according to behavior data of a first user. It is determined that at least one second user from a user relationship chain of the first user according to the first behavior eigenvalue. The second user is on the user relationship chain of the first user. A degree of similarity between a second behavior eigenvalue and the first behavior eigenvalue is greater than a preset threshold, and the second behavior eigenvalue is a behavior eigenvalue of the second user. A to-be-recommended application for the first user on the basis of behavior data of the at least one second user is determined.",
  "filing_date": "20160603",
  "patent_number": "9953262",
  "summary": "<SOH> SUMMARY <EOH>This section provides a general summary of the disclosure, and is not a comprehensive disclosure of its full scope or all of its features. In response to the challenges in the existing technology, various embodiments provide an application recommending method and apparatus. The technical methods are as follow. According to one aspect, an application recommending method is provided, the method includes: acquiring a first behavior eigenvalue according to behavior data of a first user; determining at least one second user from a user relationship chain of the first user according to the first behavior eigenvalue, the second user being on the user relationship chain of the first user, a degree of similarity between a second behavior eigenvalue and the first behavior eigenvalue being greater than a preset threshold, and the second behavior eigenvalue being a behavior eigenvalue of the second user; and determining a to-be-recommended application for the first user on the basis of behavior data of the at least one second user. According to another aspect, an application recommending apparatus is provided, the apparatus includes: a behavior eigenvalue acquiring module, configured to acquire a first behavior eigenvalue according to behavior data of a first user; a second user determining module, configured to determine at least one second user from a user relationship chain of the first user according to the first behavior eigenvalue, the second user being on the user relationship chain of the first user, a degree of similarity between a second behavior eigenvalue and the first behavior eigenvalue being greater than a preset threshold, and the second behavior eigenvalue being a behavior eigenvalue of the second user; and an application determining module, configured to determine a to-be-recommended application for the first user on the basis of behavior data of the at least one second user. Various embodiments produce the following beneficial effects. Afte...",
  "date_published": "20160929",
  "title": "Application Recommending Method And Apparatus",
  "ipcr_labels": [
    "G06N502",
    "H04L12911"
  ],
  "_processing_info": {
    "original_size": 70304,
    "optimized_size": 3214,
    "reduction_percent": 95.43
  }
}