{
  "decision": "ACCEPTED",
  "application_number": "15171412",
  "date_published": "20161208",
  "date_produced": "20161122",
  "title": "PRINTER, TERMINAL DEVICE, AND PRINTING SYSTEM",
  "filing_date": "20160602",
  "inventor_list": [
    {
      "inventor_name_last": "TSURUYAMA",
      "inventor_name_first": "Shinichi",
      "inventor_city": "Shiojiri-shi",
      "inventor_state": "",
      "inventor_country": "JP"
    }
  ],
  "ipcr_labels": [
    "G06K1500",
    "H04N132"
  ],
  "main_ipcr_label": "G06K1500",
  "summary": "<SOH> SUMMARY <EOH>An advantage of some aspects of the invention is that a technology is provided that enables a service person to, through the use of a terminal device, easily acquire operational information in relation to a printer. A printer according to a first aspect of the invention and constituting the foregoing technology includes a printing execution unit configured to execute printing; a code conversion unit configured to encode operational information in relation to the printing execution unit to generate an image pattern; and a display unit configured to display the image pattern, generated by the code conversion unit, on the display unit itself. In such a printer configured in this manner, the image pattern, resulting from the encoding of the operational information, is displayed on the display unit. This configuration, therefore, enables a service person to, through the use of a terminal device configured to read and decode the image pattern, easily acquire the operational information in relation to the printer. Further, the above printer may be configured such that the code conversion unit encodes the operational information into an image pattern representing a plurality of pieces of information by at least one color difference. Such an image pattern including the at least one color difference represents the operational information at a higher record density (this record density being equivalent to an information amount per unit area), as compared with an image pattern including no color difference (i.e., an image pattern colored in a single color). Further, the above printer may be configured such that the display unit displays a color patch for use in calibration of a terminal device configured to perform colorimetry on the image pattern. This configuration allows the device terminal to perform the colorimetry on the image pattern after having performed the calibration using the color patch, and thus improves the accuracy of reading of the image pat...",
  "patent_number": "9779339",
  "abstract": "A printer including a printing execution unit configured to execute printing; a code conversion unit configured to encode operational information in relation to the printing execution unit to generate an image pattern; and a display unit configured to display the image pattern, generated by the code conversion unit, on the display unit itself.",
  "publication_number": "US20160358053A1-20161208",
  "_processing_info": {
    "original_size": 50888,
    "optimized_size": 2902,
    "reduction_percent": 94.3
  }
}