{
  "decision": "PENDING",
  "application_number": "15174581",
  "date_published": "20170824",
  "date_produced": "20170809",
  "title": "METHODS AND APPARATUS FOR AN IMAGING SYSTEM",
  "filing_date": "20160606",
  "inventor_list": [
    {
      "inventor_name_last": "SHEN",
      "inventor_name_first": "Rui",
      "inventor_city": "San Jose",
      "inventor_state": "CA",
      "inventor_country": "US"
    }
  ],
  "ipcr_labels": [
    "G06K900",
    "G01B1100",
    "G06K952",
    "G06T700",
    "G06K962",
    "G06T760"
  ],
  "main_ipcr_label": "G06K900",
  "summary": "<SOH> BRIEF DESCRIPTION OF THE DRAWING FIGURES <EOH>A more complete understanding of the present technology may be derived by referring to the detailed description when considered in connection with the following illustrative figures. In the following figures, like reference numbers refer to similar elements and steps throughout the figures. FIG. 1 representatively illustrates a block diagram of a self-calibration system in accordance with an exemplary embodiment of the present technology; FIG. 2 representatively illustrates a block diagram of part of a self-calibration system in accordance with an exemplary embodiment of the present technology; FIG. 3 representatively illustrates a block diagram of part of a self-calibration system in accordance with an exemplary embodiment of the present technology; FIGS. 4A-J representatively illustrate camera frames used by the self-calibration system in accordance with an exemplary embodiment of the present technology; FIGS. 5A-C representatively illustrate a camera coordinate system in relation to a vehicle coordinate system in accordance with an exemplary embodiment of the present technology; FIG. 6 representatively illustrates a self-calibration camera system in accordance with an exemplary embodiment of the present technology; and FIG. 7 illustrates a process utilizing a self-calibration method in accordance with an exemplary embodiment of the present technology. detailed-description description=\"Detailed Description\" end=\"lead\"?",
  "patent_number": "None",
  "abstract": "Various embodiments of the present technology may comprise a method and apparatus for an on-vehicle camera system capable of calibrating the camera's orientation (i.e. pitch, yaw, roll angles) in relation to the vehicle's coordinate system utilizing normally-encountered imagery. The method and apparatus may comprise utilizing an image processor to detect features from pixel data of image frames, match features, provide an estimated orientation, and validate the orientation. A system utilizing the method and apparatus may transmit the camera's orientation with respect to the vehicle coordinate system to a peripheral system.",
  "publication_number": "US20170243069A1-20170824",
  "_processing_info": {
    "original_size": 58011,
    "optimized_size": 2709,
    "reduction_percent": 95.33
  }
}