{
  "date_produced": "20161122",
  "publication_number": "US20160358072A1-20161208",
  "main_ipcr_label": "G06N308",
  "decision": "PENDING",
  "application_number": "15172074",
  "inventor_list": [
    {
      "inventor_name_last": "Hermann",
      "inventor_name_first": "Karl Moritz",
      "inventor_city": "London",
      "inventor_state": "",
      "inventor_country": "GB"
    },
    {
      "inventor_name_last": "Kocisky",
      "inventor_name_first": "Tomas",
      "inventor_city": "London",
      "inventor_state": "",
      "inventor_country": "GB"
    },
    {
      "inventor_name_last": "Grefenstette",
      "inventor_name_first": "Edward Thomas",
      "inventor_city": "London",
      "inventor_state": "",
      "inventor_country": "GB"
    },
    {
      "inventor_name_last": "Espeholt",
      "inventor_name_first": "Lasse",
      "inventor_city": "London",
      "inventor_state": "",
      "inventor_country": "GB"
    },
    {
      "inventor_name_last": "Kay",
      "inventor_name_first": "William Thomas",
      "inventor_city": "London",
      "inventor_state": "",
      "inventor_country": "GB"
    },
    {
      "inventor_name_last": "Suleyman",
      "inventor_name_first": "Mustafa",
      "inventor_city": "London",
      "inventor_state": "",
      "inventor_country": "GB"
    },
    {
      "inventor_name_last": "Blunsom",
      "inventor_name_first": "Philip",
      "inventor_city": "Oxford",
      "inventor_state": "",
      "inventor_country": "GB"
    }
  ],
  "abstract": "Methods, systems, and apparatus, including computer programs encoded on computer storage media, for selecting answers to questions about documents. One of the methods includes receiving a document comprising a plurality of document tokens; receiving a question associated with the document, the question comprising a plurality of question tokens; processing the document tokens and the question tokens using a reader neural network to generate a joint numeric representation of the document and the question; and selecting, from the plurality of document tokens, an answer to the question using the joint numeric representation of the document and the question.",
  "filing_date": "20160602",
  "patent_number": "None",
  "summary": "<SOH> SUMMARY <EOH>This specification describes technologies that relate to processing electronic documents using neural networks. Generally, a reading comprehension neural network system receives document tokens from an electronic document and question tokens from a question about the electronic document. The reading comprehension neural network processes the document tokens and the question tokens to determine an answer to the question. The answer to the question is one or more tokens from the document that the reading comprehension neural network system has determined best answer the question. For a system of one or more computers to be configured to perform particular operations or actions means that the system has installed on it software, firmware, hardware, or a combination of them that in operation cause the system to perform the operations or actions. For one or more computer programs to be configured to perform particular operations or actions means that the one or more programs include instructions that, when executed by data processing apparatus, cause the apparatus to perform the operations or actions. The subject matter described in this specification can be implemented in particular embodiments so as to realize one or more of the following advantages. Reading comprehension neural networks can be trained to effectively read real documents and answer complex questions with minimal prior knowledge of language structure. A trained reading comprehension neural network can achieve a higher accuracy on question answering and semantic analysis tasks as compared to state-of-the-art natural language processing systems, and can do so without any specific encoding of the document or query structure. A large scale training data set can be generated for training the reading comprehension neural networks. The details of one or more embodiments of the subject matter of this specification are set forth in the accompanying drawings and the description below. Other feat...",
  "date_published": "20161208",
  "title": "READING COMPREHENSION NEURAL NETWORKS",
  "ipcr_labels": [
    "G06N308",
    "G06F30484"
  ],
  "_processing_info": {
    "original_size": 55425,
    "optimized_size": 4076,
    "reduction_percent": 92.65
  }
}