{
  "date_produced": "20160908",
  "publication_number": "US20160275409A1-20160922",
  "main_ipcr_label": "G06N700",
  "decision": "PENDING",
  "application_number": "15171057",
  "inventor_list": [
    {
      "inventor_name_last": "VEERASAMY",
      "inventor_name_first": "Vijayen S.",
      "inventor_city": "Ann Arbor",
      "inventor_state": "MI",
      "inventor_country": "US"
    }
  ],
  "abstract": "In certain example embodiments, moisture sensors, defoggers, etc., and/or related methods, are provided. More particularly, certain example embodiments relate to moisture sensors and/or defoggers that may be used in various applications such as, for example, refrigerator/freezer merchandisers, vehicle windows, building windows, etc. When condensation or moisture is detected, an appropriate action may be taken (e.g., actuating windshield wipers, turning on a defroster, triggering the heating of a merchandiser door or window, etc.). Bayesian approaches optionally may be implemented in certain example embodiments in an attempt to improve moisture detection accuracy. For instance, models of various types of disturbances may be developed and, based on live data and a priori information known about the model, a probability of the model being accurate is calculated. If a threshold value is met, the model may be considered a match and, optionally, a corresponding appropriate action may be take...",
  "filing_date": "20160602",
  "patent_number": "None",
  "summary": "<SOH> BACKGROUND AND SUMMARY OF EXAMPLE EMBODIMENTS OF THE INVENTION <EOH>The presence of moisture (e.g., rain or condensation) and/or other material or debris on vehicle windshields and/or backlites may create hazardous driving conditions for drivers, passengers, and pedestrians if not promptly removed. Wiper blades are a well-known, common way to remove such materials and reduce the hazards of driving during dangerous conditions. Rain sensors have been developed to detect the presence of moisture (e.g., rain or other condensation) on a vehicle windshield, and to turn on and off wipers, as necessary; when such moisture is detected. Automatically detecting rain, sleet, fog, and the like, and taking appropriate action—for example, turning on/off wiper blades at a proper speed—potentially reduces distractions to the driver, allowing the driver to better concentrate on the road ahead. However, inappropriately turning on/off wipers or failing to actuate wipers when moisture is present may also create hazardous conditions. Moreover, such systems are also susceptible to “dirt” distractions which may cause false reads/wipes when dirt is on the windshield. Certain conventional rain sensors are based on an electro-optical concept. According to certain such techniques, rain droplets are sensed solely by measuring the change in the total internal reflection of a light beam off the glass-air interface. Other electro-optical techniques have attempted to analyze the brightness of a section of a window “image” to detect rain droplets or fog on a window. However, these optical techniques have limited sensing areas, are fairly expensive, and may result in erroneous detection indications due to the use of optical imaging as the sole detection method. Thus, it will be appreciated that there exists a need in the art for a moisture (e.g., rain) sensor that is efficient in operation and/or detection. In certain example embodiments of this invention, a plurality of sensing capacitors are ...",
  "date_published": "20160922",
  "title": "MOISTURE SENSOR AND/OR DEFOGGER WITH BAYESIAN IMPROVEMENTS, AND RELATED METHODS",
  "ipcr_labels": [
    "G06N700",
    "G01J142",
    "G01N2722",
    "B60Q114",
    "B60S108"
  ],
  "_processing_info": {
    "original_size": 306265,
    "optimized_size": 3653,
    "reduction_percent": 98.81
  }
}