{
  "date_produced": "20160921",
  "publication_number": "US20160292565A1-20161006",
  "main_ipcr_label": "G06N304",
  "decision": "PENDING",
  "application_number": "15184917",
  "inventor_list": [
    {
      "inventor_name_last": "Appuswamy",
      "inventor_name_first": "Rathinakumar",
      "inventor_city": "San Jose",
      "inventor_state": "CA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Flickner",
      "inventor_name_first": "Myron D.",
      "inventor_city": "San Jose",
      "inventor_state": "CA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Modha",
      "inventor_name_first": "Dharmendra S.",
      "inventor_city": "San Jose",
      "inventor_state": "CA",
      "inventor_country": "US"
    }
  ],
  "abstract": "Embodiments of the present invention provide a method for feature extraction using multiple neurosynaptic core circuits including one or more input core circuits for receiving input and one or more output core circuits for generating output. The method comprises receiving a set of input data via the input core circuits, and extracting a first set of features from the input data using the input core circuits. Each feature of the first set of features is based on a subset of the input data. The method further comprises reordering the first set of features using the input core circuits, and generating a second set of features by combining the reordered first set of features using the output core circuits. The second set of features comprises a set of features with reduced correlation. Each feature of the second set of features is based on the entirety of said set of input data.",
  "filing_date": "20160616",
  "patent_number": "None",
  "summary": "<SOH> BRIEF SUMMARY <EOH>One embodiment provides a method for feature extraction using multiple neurosynaptic core circuits including one or more input core circuits for receiving input and one or more output core circuits for generating output. The method comprises receiving a set of input data via the input core circuits, and extracting a first set of features from the set of input data using the input core circuits. Each feature of the first set of features is based on a subset of the set of input data. The method further comprises reordering the first set of features using the input core circuits, and generating a second set of features by combining the reordered first set of features using the output core circuits. The second set of features comprises a set of features with reduced correlation. Each feature of the second set of features is based on the entirety of said set of input data. Another embodiment provides a neuromorphic system for feature extraction. The neuromorphic system comprises a first set of neurosynaptic core circuits for receiving a set of input data, extracting a first set of features from the set of input data, and reordering the first set of features. Each feature of the first set of features is based on a subset of the set of input data. The neuromorphic system further comprises a second set of neurosynaptic core circuits for generating a second set of features by combining the reordered first set of features. The second set of features comprises a set of features with reduced correlation. Each feature of the second set of features is based on the entirety of said set of input data. These and other features, aspects and advantages of the present invention will become understood with reference to the following description, appended claims and accompanying figures.",
  "date_published": "20161006",
  "title": "TRANSFORM ARCHITECTURE FOR MULTIPLE NEUROSYNAPTIC CORE CIRCUITS",
  "ipcr_labels": [
    "G06N304",
    "G06N308",
    "G06N3063"
  ],
  "_processing_info": {
    "original_size": 54535,
    "optimized_size": 3590,
    "reduction_percent": 93.42
  }
}