{
  "date_produced": "20160921",
  "publication_number": "US20160292564A1-20161006",
  "main_ipcr_label": "G06N300",
  "decision": "PENDING",
  "application_number": "15185222",
  "inventor_list": [
    {
      "inventor_name_last": "Falardeau",
      "inventor_name_first": "Simon",
      "inventor_city": "Laval",
      "inventor_state": "",
      "inventor_country": "CA"
    },
    {
      "inventor_name_last": "Nantel",
      "inventor_name_first": "Gérard",
      "inventor_city": "Deux-Montagnes",
      "inventor_state": "",
      "inventor_country": "CA"
    }
  ],
  "abstract": "An embodiment according to the present invention addresses reusability and alignment of content across channels in a multi-channel virtual assistant, by allowing users to define content on one channel and then have the content fully or partially translated for the other channels using a mix of pre-defined static rules, dynamic rules or machine learning. Content translation is provided based on communications channels, and content translation is performed from one to many formats, optionally in real time. Performing content translation using machine learning provides an advantage that as users work, content translation becomes more precise and covers more elements.",
  "filing_date": "20160617",
  "patent_number": "None",
  "summary": "<SOH> SUMMARY OF THE INVENTION <EOH>An embodiment according to the present invention addresses reusability and alignment of content across channels in a multi-channel virtual assistant by allowing users to define content on one channel and then have the content fully or partially translated for the other channels using a mix of pre-defined static rules, dynamic rules or machine learning. Content translation is provided based on communications channels and is performed from one to many formats, optionally in real time. Performing content translation using machine learning provides an advantage that as users work, content translation becomes more precise and covers more elements. In accordance with an embodiment of the invention, there is provided a system for content translation. The system comprises a translation module configured to receive, from a user interface, user entered content to provide a first end user experience suitable to be presented over a first type of communications channel; and a knowledge base comprising at least one translation configuration to translate the user entered content into analogous content to provide at least one other end user experience suitable to be presented over at least one respective different type of communications channel. The translation module is configured to consult the knowledge base to translate the user entered content into the analogous content, and to provide the analogous content to the user interface to be associated with the user entered content over the user interface. In further, related embodiments, each of the first type of communications channel and the at least one different type of communications channel may comprise at least one of: a web channel; a mobile channel; a text message channel; an e-mail channel; and an interactive voice response channel. The translation module may be still further configured to provide the analogous content, to the user interface to be associated with the user entered content...",
  "date_published": "20161006",
  "title": "Cross-Channel Content Translation Engine",
  "ipcr_labels": [
    "G06N300",
    "G06F30483",
    "G06N9900",
    "G06F30484",
    "G06N502",
    "G06F1728",
    "G06F316"
  ],
  "_processing_info": {
    "original_size": 40363,
    "optimized_size": 3424,
    "reduction_percent": 91.52
  }
}