{
  "decision": "PENDING",
  "application_number": "15186615",
  "date_published": "20170727",
  "date_produced": "20170713",
  "title": "MOBILE TERMINAL AND OPERATING METHOD THEREOF",
  "filing_date": "20160620",
  "inventor_list": [
    {
      "inventor_name_last": "HAN",
      "inventor_name_first": "Miran",
      "inventor_city": "Seoul",
      "inventor_state": "",
      "inventor_country": "KR"
    },
    {
      "inventor_name_last": "YANG",
      "inventor_name_first": "Seunghyun",
      "inventor_city": "Seoul",
      "inventor_state": "",
      "inventor_country": "KR"
    },
    {
      "inventor_name_last": "OH",
      "inventor_name_first": "Kyungin",
      "inventor_city": "Seoul",
      "inventor_state": "",
      "inventor_country": "KR"
    },
    {
      "inventor_name_last": "AHN",
      "inventor_name_first": "Jongyoon",
      "inventor_city": "Seoul",
      "inventor_state": "",
      "inventor_country": "KR"
    },
    {
      "inventor_name_last": "PARK",
      "inventor_name_first": "Shinjun",
      "inventor_city": "Seoul",
      "inventor_state": "",
      "inventor_country": "KR"
    }
  ],
  "ipcr_labels": [
    "G06T1900",
    "H04N5445"
  ],
  "main_ipcr_label": "G06T1900",
  "summary": "<SOH> SUMMARY <EOH>According to an innovative aspect of the subject matter described in this application, a mobile terminal includes a display unit that is configured to display a 360-degree image; a sensing unit that is configured to detect an input signal; and a control unit that is configured to control the display unit; control the sensing unit; display, on the display unit, a first image at a first viewing angle in response to the sensing unit detecting a first input signal for displaying the 360-degree image at the first viewing angle; and display, on the display unit, a second image at a second viewing angle in response to the sensing unit detecting a second input signal for displaying the 360-degree image at the second viewing angle that is different than the first viewing angle, where the second image includes a picture-in-picture (PIP) screen that displays predetermined content. The mobile terminal may include one or more of the following optional features. The predetermined content includes at least one of an advertisement or a payment window. The control unit is configured to display the second image and the PIP screen by fixing the 360-degree image at the second viewing angle based on the 360-degree image being displayed for a predetermined amount of time. The control unit is configured to increase a size of the PIP screen based on the sensor unit detecting a third input signal for changing the viewing angle of the 360-degree image to the second viewing angle and based on the viewing angle of the 360-degree image approaching the second viewing angle. The control unit is configured to cover a specific object in the second image with the PIP screen. The control unit is configured to overlap and display the PIP screen on the specific object based on the specific object being moved. The predetermined content includes a plurality of display areas for displaying the 360-degree image at different viewing angles. The control unit is configured to display a seco...",
  "patent_number": "None",
  "abstract": "A mobile terminal includes a display unit that is configured to display a 360-degree image. The mobile terminal further includes a sensing unit that is configured to detect an input signal. The mobile terminal further includes a control unit. The control unit is configured to control the display unit. The control unit is further configured to control the sensing unit. The control unit is further configured to display, on the display unit, a first image at a first viewing angle in response to the sensing unit detecting a first input signal for displaying the 360-degree image at the first viewing angle. The control unit is further configured to display, on the display unit, a second image at a second viewing angle in response to the sensing unit detecting a second input signal for displaying the 360-degree image at the second viewing angle that is different than the first viewing angle.",
  "publication_number": "US20170213389A1-20170727",
  "_processing_info": {
    "original_size": 142859,
    "optimized_size": 3994,
    "reduction_percent": 97.2
  }
}