{
  "date_produced": "20171207",
  "publication_number": "US20170364790A1-20171221",
  "main_ipcr_label": "G06N304",
  "decision": "PENDING",
  "application_number": "15187037",
  "inventor_list": [
    {
      "inventor_name_last": "Leobandung",
      "inventor_name_first": "Effendi",
      "inventor_city": "Stormville",
      "inventor_state": "NY",
      "inventor_country": "US"
    }
  ],
  "abstract": "A neural network device includes a crossbar grid including first metal lines running in a first direction and second metal lines running transversely to the first metal lines and being electrically isolated from the first metal lines. An array of cross-over elements is included. Each cross-over element is connected between a first metal line and a second metal line. The cross-over elements each include a floating gate transistor device having a floating node. The floating node is configured to store a programmable weight value.",
  "filing_date": "20160620",
  "patent_number": "None",
  "summary": "<SOH> SUMMARY <EOH>In accordance with an embodiment of the present principles, a neural network device includes a crossbar grid including first metal lines running in a first direction and second metal lines running transversely to the first metal lines and being electrically isolated from the first metal lines. An array of cross-over elements is included. Each cross-over element is connected between a first metal line and a second metal line. The cross-over elements each include a floating gate transistor device having a floating node. The floating node is configured to store a programmable weight value. Another neural network device includes a crossbar grid including first metal lines running in a first direction and second metal lines running transversely to the first metal lines and being electrically isolated from the first metal lines. An array of cross-over elements is included. Each cross-over element is connected between a first metal line and a second metal line. The cross-over elements include at least one floating gate transistor device having a floating node, the floating node being configured to store a programmable weight value. Control circuitry is selectively coupled to the crossbar grid to generate and send pulse sequences for setting, resetting or reading the weight value to/from the floating node. A method for programming a neural network device includes selectively generating pulses on a crossbar grid including first metal lines running in a first direction and second metal lines running transversely to the first metal lines and being electrically isolated from the first metal lines; programming weight values in cross-over elements electrically connected between the first metal lines and the second metal lines in the cross bar grid by storing charge in a floating node of a floating gate transistor device of the cross-over elements; and computing an output using an input modified by the weight values. These and other features and advantages will ...",
  "date_published": "20171221",
  "title": "NEURAL NETWORK USING FLOATING GATE TRANSISTOR",
  "ipcr_labels": [
    "G06N304",
    "H01L29788"
  ],
  "_processing_info": {
    "original_size": 38543,
    "optimized_size": 3086,
    "reduction_percent": 91.99
  }
}