{
  "decision": "ACCEPTED",
  "application_number": "15186838",
  "date_published": "20161013",
  "date_produced": "20160928",
  "title": "DIGITAL CONTENT DISTRIBUTION AND SUBSCRIPTION SYSEM",
  "filing_date": "20160620",
  "inventor_list": [
    {
      "inventor_name_last": "BI",
      "inventor_name_first": "Depeng",
      "inventor_city": "Buffalo Grove",
      "inventor_state": "IL",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "GLADWIN",
      "inventor_name_first": "Stephen Christopher",
      "inventor_city": "Chicago",
      "inventor_state": "IL",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "DENKINGER",
      "inventor_name_first": "Troy Steven",
      "inventor_city": "Brooklyn",
      "inventor_state": "NY",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "FRANKLIN",
      "inventor_name_first": "Timothy Scott",
      "inventor_city": "Lake Villa",
      "inventor_state": "IL",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "CILFONE",
      "inventor_name_first": "Bart Richard",
      "inventor_city": "Chicago",
      "inventor_state": "IL",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "PEWTERBAUGH",
      "inventor_name_first": "Anne Marie",
      "inventor_city": "Broomfield",
      "inventor_state": "CO",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "SPURGAT",
      "inventor_name_first": "Jeffrey Jonathan",
      "inventor_city": "Madison",
      "inventor_state": "WI",
      "inventor_country": "US"
    }
  ],
  "ipcr_labels": [
    "G06F2110",
    "H04L930",
    "H04L2906"
  ],
  "main_ipcr_label": "G06F2110",
  "summary": "<SOH> SUMMARY OF THE INVENTION <EOH>The present invention relates to a digital content distribution and subscription system for digital data files, such as digital audio and video data files, which provides subscribers, for example, with music or video from locally-stored digital files or on demand for a fee. The system may optionally provide streaming digital data as well as locally-stored digital files. After registration onto the system, a subscriber may select from a relatively wide variety of available digital content, for example, music content ripped from a high-quality digital source to provide relatively consistent digital quality to subscribers. In one exemplary implementation, subscribers may subscribe to a predetermined number of songs slots for a period of time, for example, about 200-400 song slots per month. The subscriber may then select songs from various playlists which causes encrypted digital audio files for the selected music to be downloaded to the subscribers's PC. A license key is downloaded to the subscribers' PC to “unlock” the selected songs to enable them to be decoded and played on the subscriber's personal computer or remote audio equipment for a predetermined time period. At the expiration of the predetermined time period, the license key expires, thereby preventing further playback of the encrypted audio data files. The selections of each subscriber are tabulated for the purpose of royalty tracking and payment of an appropriate license fee to the holders of copyright rights for the selections. The system may also be used to provide additional digital information, such as special events which may be live or pre-recorded. The digital content distribution and subscription system includes a digital content management system, a system for token-based authentication allowing secure data retrieval and a royalty administration system. The digital content management system manages the amount of digital content data delivered to a client over a...",
  "patent_number": "9886566",
  "abstract": "Digital content distribution systems and methods are provided for distributing for digital data files, such as digital audio and video data files. In accordance with one implementation, a token-based authentication system is provided that does not require knowledge of the individual user requesting the download of digital content data or real-time access to user account information. Instead, the token-based authentication system embeds the authentication information, or token, in the download request information itself. In this way, the download or content server authenticates the download request using the token contained in the download request information and therefore does not require any additional information to carry out this authentication, such as access to user account information.",
  "publication_number": "US20160300043A1-20161013",
  "_processing_info": {
    "original_size": 176647,
    "optimized_size": 4316,
    "reduction_percent": 97.56
  }
}