{
  "decision": "PENDING",
  "application_number": "15187907",
  "date_published": "20171221",
  "date_produced": "20171207",
  "title": "SENSOR MODULE REGISTRATION AND CONFIGURATION",
  "filing_date": "20160621",
  "inventor_list": [
    {
      "inventor_name_last": "Chou",
      "inventor_name_first": "Wei-Ting",
      "inventor_city": "Taipei",
      "inventor_state": "",
      "inventor_country": "TW"
    },
    {
      "inventor_name_last": "Liu",
      "inventor_name_first": "Chih-Hsiung",
      "inventor_city": "Taipei",
      "inventor_state": "",
      "inventor_country": "TW"
    },
    {
      "inventor_name_last": "Shih",
      "inventor_name_first": "Hao-Ting",
      "inventor_city": "Taipei",
      "inventor_state": "",
      "inventor_country": "TW"
    },
    {
      "inventor_name_last": "Su",
      "inventor_name_first": "Chih-Wen",
      "inventor_city": "Taipei",
      "inventor_state": "",
      "inventor_country": "TW"
    },
    {
      "inventor_name_last": "Tseng",
      "inventor_name_first": "Joey H. Y.",
      "inventor_city": "Taipei",
      "inventor_state": "",
      "inventor_country": "TW"
    },
    {
      "inventor_name_last": "Wang",
      "inventor_name_first": "Yi-Hong",
      "inventor_city": "Taipei",
      "inventor_state": "",
      "inventor_country": "TW"
    }
  ],
  "ipcr_labels": [
    "G06F1730",
    "G06F2162"
  ],
  "main_ipcr_label": "G06F1730",
  "summary": "<SOH> SUMMARY <EOH>Aspects of an embodiment of the present invention disclose a method, computer program product, and computing system for providing a framework to register a sensor module and manifest the capability the sensor module supports. A processor receives a first module registration request, wherein the first module registration request includes a sensor module and metadata. A processor determines that the first module registration request is compatible with a second module registration request by comparing data stored in a module database associated with the second module registration request to data within the first module registration request. A processor updates the module database with the metadata of the first module registration request. A processor generates a module delegate, wherein the module delegate provides data access and interaction interfaces based on the metadata. A processor generates a custom configuration component.",
  "patent_number": "None",
  "abstract": "In an approach for providing a framework to register a sensor module and manifest the capability the sensor module supports, a processor receives a first module registration request, wherein the first module registration request includes a sensor module and metadata. A processor determines that the first module registration request is compatible with a second module registration request by comparing data stored in a module database associated with the second module registration request to data within the first module registration request. A processor updates the module database with the metadata of the first module registration request. A processor generates a module delegate, wherein the module delegate provides data access and interaction interfaces based on the metadata. A processor generates a custom configuration component.",
  "publication_number": "US20170364542A1-20171221",
  "_processing_info": {
    "original_size": 43145,
    "optimized_size": 3051,
    "reduction_percent": 92.93
  }
}