{
  "date_produced": "20160928",
  "publication_number": "US20160300145A1-20161013",
  "main_ipcr_label": "G06N504",
  "decision": "PENDING",
  "application_number": "15189386",
  "inventor_list": [
    {
      "inventor_name_last": "Raichelgauz",
      "inventor_name_first": "Igal",
      "inventor_city": "New York",
      "inventor_state": "NY",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Odinaev",
      "inventor_name_first": "Karina",
      "inventor_city": "New York",
      "inventor_state": "NY",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Zeevi",
      "inventor_name_first": "Yehoshua Y.",
      "inventor_city": "Haifa",
      "inventor_state": "",
      "inventor_country": "IL"
    }
  ],
  "abstract": "A method and system for identification of a deviation from a periodic behavior pattern in a sequence of multimedia content segments are provided. The method includes generating at least one signature for each multimedia content segment of the sequence of multimedia content segments; comparing at least two of the generated signatures to detect a periodic behavior pattern, wherein the compared at least two signatures represent consecutive multimedia content segments; and comparing at least one signature of at least a subsequently received multimedia content segment to at least one signature representing the periodic behavior pattern to identify a deviation from the periodic behavior pattern.",
  "filing_date": "20160622",
  "patent_number": "None",
  "summary": "<SOH> SUMMARY <EOH>The various disclosed embodiments include a method for identification of a deviation from a periodic behavior pattern in a sequence of multimedia content segments. The method comprises generating at least one signature for each multimedia content segment of the sequence of multimedia content segments; comparing at least two of the generated signatures to detect a periodic behavior pattern, wherein the compared at least two signatures represent consecutive multimedia content segments; and comparing at least one signature of at least a subsequently received multimedia content segment to at least one signature representing the periodic behavior pattern to identify a deviation from the periodic behavior pattern. The various disclosed embodiments include a system for a system for identification of a deviation from a periodic behavior pattern in a sequence of multimedia content segments. The system comprises a processing system; and a memory connected to the processing system, the memory containing instructions that, when executed by the processing system, configure the system to: generate at least one signature for each multimedia content segment of the sequence of multimedia content segments; compare at least two of the generated signatures to detect a periodic behavior pattern, wherein the compared at least two signatures represent consecutive multimedia content segments; and compare at least one signature of at least a subsequently received multimedia content segment to at least one signature representing the periodic behavior pattern to identify a deviation from the periodic behavior pattern.",
  "date_published": "20161013",
  "title": "SYSTEM AND METHOD FOR IDENTIFICATION OF DEVIATIONS FROM PERIODIC BEHAVIOR PATTERNS IN MULTIMEDIA CONTENT",
  "ipcr_labels": [
    "G06N504",
    "H04N2125",
    "H04N21466",
    "H04N21258",
    "H04N2145"
  ],
  "_processing_info": {
    "original_size": 40391,
    "optimized_size": 3269,
    "reduction_percent": 91.91
  }
}