{
  "decision": "REJECTED",
  "application_number": "15186029",
  "date_published": "20161222",
  "date_produced": "20161208",
  "title": "OPTICAL DECODER FOR THERMAL BARCODES",
  "filing_date": "20160617",
  "inventor_list": [
    {
      "inventor_name_last": "SU",
      "inventor_name_first": "Ming",
      "inventor_city": "Newton",
      "inventor_state": "MA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "HOU",
      "inventor_name_first": "Sichao",
      "inventor_city": "Boston",
      "inventor_state": "MA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "WANG",
      "inventor_name_first": "Miao",
      "inventor_city": "Boston",
      "inventor_state": "MA",
      "inventor_country": "US"
    }
  ],
  "ipcr_labels": [
    "G06K714",
    "G06K1906",
    "G01N2135"
  ],
  "main_ipcr_label": "G06K714",
  "summary": "<SOH> SUMMARY OF THE INVENTION <EOH>The present invention provides a high capacity nanoparticle-based covert barcode system that relies on an entirely optical readout for its detection. The system includes a panel of phase change nanoparticles that have sharp and discrete melting peaks and that can be read by the detection of their solid-to-liquid or liquid-to-solid phase transitions. In order to achieve high coding capacity, pure substances and their eutectic mixtures can be used to make nanoparticles, where sharp melting peaks exist over a large temperature range. In this system, an infrared light is used to quickly heat up the taggant, and a thermal imager (such as infrared camera) is used to collect thermal images of the taggant continuously while the sample is being heated up, cooled down, or both. A readily detectable and sudden change in temperature occurs at the phase transition during the heating and/or cooling process, and can be used to indicate the identity of nanoparticles. One aspect of the invention is a taggant including a plurality of phase change nanoparticles disposed in a two-dimensional array. The plurality of phase change nanoparticles can include one or more types of phase change nanoparticles, each type having a uniquely identifiable phase change temperature. Another aspect of the invention is a tagged object including the above-described taggant. Yet another aspect of the invention is the identification of an object using a taggant. The method includes the steps of: (a) providing an object tagged with the taggant of claim 1 ; (b) irradiating the taggant with infrared radiation, whereby a temperature of the taggant increases over time; (c) scanning or acquiring an image of the taggant with an infrared imaging device over a period of time; (d) determining a phase change temperature and a position of the phase change nanoparticles; and (e) identifying the object by matching the phase change temperature and position of said phase change nanopart...",
  "patent_number": "None",
  "abstract": "A high capacity nanoparticle-based covert barcode system relies on an entirely optical readout for detection. The system includes a panel of phase change nanoparticles with sharp and discrete melting peaks; readout is based on heating with an infrared source and detection using an infrared imager, and detection of their phase transition temperatures and positions. A readily detectable and sudden change in temperature occurs at the phase transition during a heating or cooling process, and can be used to indicate the identity of nanoparticles.",
  "publication_number": "US20160371526A1-20161222",
  "_processing_info": {
    "original_size": 44458,
    "optimized_size": 3369,
    "reduction_percent": 92.42
  }
}