{
  "date_produced": "20171207",
  "publication_number": "US20170364817A1-20171221",
  "main_ipcr_label": "G06N700",
  "decision": "PENDING",
  "application_number": "15182901",
  "inventor_list": [
    {
      "inventor_name_last": "RAYKOV",
      "inventor_name_first": "Yordan Petrov",
      "inventor_city": "Birmingham",
      "inventor_state": "",
      "inventor_country": "GB"
    },
    {
      "inventor_name_last": "Özer",
      "inventor_name_first": "Emre",
      "inventor_city": "Buckden",
      "inventor_state": "",
      "inventor_country": "GB"
    },
    {
      "inventor_name_last": "DASIKA",
      "inventor_name_first": "Ganesh Suryanarayan",
      "inventor_city": "Austin",
      "inventor_state": "TX",
      "inventor_country": "US"
    }
  ],
  "abstract": "A method for estimating a number of occupants in a region comprises receiving a time series of sensor values detected over a period of time by a motion sensor sensing motion in the region. A spread parameter indicative of the spread of the sensor values is determined. The number of occupants in the region is estimated based on the spread parameter.",
  "filing_date": "20160615",
  "patent_number": "None",
  "summary": "<SOH> SUMMARY <EOH>At least some examples provide a method for estimating a number of occupants in a region, comprising: receiving a series of sensor values detected over a period of time by at least one motion sensor for sensing motion in said region; determining a spread parameter indicative of a spread of the sensor values detected over said period of time; and estimating the number of occupants in the region in dependence on said spread parameter. At least some examples provide a data processing apparatus comprising processing circuitry configured to perform the method discussed above. At least some examples provide a computer-readable storage medium storing a computer program to control a data processing apparatus to perform the method discussed above. The storage medium may be a non-transitory storage medium. At least some examples provide a system comprising: at least one motion sensor to sense motion in a region and to output a series of sensor values over a period of time; and processing circuitry to determine a spread parameter indicative of a spread of the sensor values detected over said period of time, and in dependence on said spread parameter, to estimate a number of occupants in the region. Further aspects, features and advantages of the present technique will be apparent from the following description of examples, which is to be read in conjunction with the accompanying drawings.",
  "date_published": "20171221",
  "title": "ESTIMATING A NUMBER OF OCCUPANTS IN A REGION",
  "ipcr_labels": [
    "G06N700",
    "G06N9900",
    "G01J500"
  ],
  "_processing_info": {
    "original_size": 99780,
    "optimized_size": 2629,
    "reduction_percent": 97.37
  }
}