{
  "date_produced": "20161208",
  "publication_number": "US20160371585A1-20161222",
  "main_ipcr_label": "G06N502",
  "decision": "PENDING",
  "application_number": "15185524",
  "inventor_list": [
    {
      "inventor_name_last": "McElhinney",
      "inventor_name_first": "Adam",
      "inventor_city": "Chicago",
      "inventor_state": "IL",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Roberts",
      "inventor_name_first": "Tyler",
      "inventor_city": "Chicago",
      "inventor_state": "IL",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Horrell",
      "inventor_name_first": "Michael",
      "inventor_city": "Chicago",
      "inventor_state": "IL",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Nicholas",
      "inventor_name_first": "Brad",
      "inventor_city": "Wheaton",
      "inventor_state": "IL",
      "inventor_country": "US"
    }
  ],
  "abstract": "Disclosed herein are systems, devices, and methods related to assets and predictive models and corresponding workflows that are related to the operation of assets. In particular, examples involve assets configured to receive and locally execute predictive models, locally individualize predictive models, and/or locally execute workflows or portions thereof.",
  "filing_date": "20160617",
  "patent_number": "None",
  "summary": "<SOH> BRIEF DESCRIPTION OF THE DRAWINGS <EOH>FIG. 1 depicts an example network configuration in which example embodiments may be implemented. FIG. 2 depicts a simplified block diagram of an example asset. FIG. 3 depicts a conceptual illustration of example abnormal-condition indicators and triggering criteria. FIG. 4 depicts a simplified block diagram of an example analytics system. FIG. 5 depicts an example flow diagram of a definition phase that may be used for defining model-workflow pairs. FIG. 6A depicts a conceptual illustration of an aggregate model-workflow pair. FIG. 6B depicts a conceptual illustration of an individualized model-workflow pair. FIG. 6C depicts a conceptual illustration of another individualized model-workflow pair. FIG. 6D depicts a conceptual illustration of a modified model-workflow pair. FIG. 7 depicts an example flow diagram of a modeling phase that may be used for defining a predictive model that outputs a health metric. FIG. 8 depicts a conceptual illustration of data utilized to define a model. FIG. 9 depicts an example flow diagram of an example definition phase that may be used for defining performance score functions. FIG. 10 depicts conceptual illustrations of aspects of example performance score functions. FIG. 11 depicts an example flow diagram of a local-execution phase that may be used for locally executing a predictive model. FIG. 12 depicts an example flow diagram of a modification phase that may be used for modifying model-workflow pairs. FIG. 13 depicts an example flow diagram of an adjustment phase that may be used for adjusting execution of model-workflow pairs. FIG. 14 depicts an example flow diagram of a determination phase that may be used for determining whether to locally execute a predictive model. FIG. 15 depicts a flow diagram of an example method for defining and deploying an aggregate, predictive model and corresponding workflow FIG. 16 depicts a flow diagram of an example method for defining and deploying an ...",
  "date_published": "20161222",
  "title": "Dynamic Execution of Predictive Models",
  "ipcr_labels": [
    "G06N502",
    "G06N700"
  ],
  "_processing_info": {
    "original_size": 237621,
    "optimized_size": 3333,
    "reduction_percent": 98.6
  }
}