{
  "date_produced": "20171207",
  "publication_number": "US20170364801A1-20171221",
  "main_ipcr_label": "G06N308",
  "decision": "PENDING",
  "application_number": "15186448",
  "inventor_list": [
    {
      "inventor_name_last": "Kim",
      "inventor_name_first": "SangBum",
      "inventor_city": "Yorktown Heights",
      "inventor_state": "NY",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Lam",
      "inventor_name_first": "Chung H.",
      "inventor_city": "Peekskill",
      "inventor_state": "NY",
      "inventor_country": "US"
    }
  ],
  "abstract": "A neuromorphic memory circuit including a programmable resistive memory element, an axon LIF pulse generator to generate an axon LIF pulse, a back propagation pulse generator to generate a back propagation pulse, a postsynaptic capacitor configured to build up a forward propagation LIF charge over time, and a presynaptic capacitor configured to build up a back propagation LIF charge over time. A first transistor activates a first discharge path from the postsynaptic capacitor through the programmable resistive memory element when the axon LIF pulse generator generates the axon LIF pulse. A second transistor activates a second discharge path from the presynaptic capacitor through the programmable resistive memory element when the back propagation pulse generator generates the back propagation pulse.",
  "filing_date": "20160618",
  "patent_number": "None",
  "summary": "<SOH> BRIEF SUMMARY <EOH>Accordingly, one example aspect of the present invention is a neuromorphic memory circuit comprising a programmable resistive memory element, an axon leaky integrate and fire (LIF) pulse generator to generate an axon LIF pulse, a back propagation pulse generator to generate a back propagation pulse, a postsynaptic capacitor configured to build up a forward propagation LIF charge over time, and a presynaptic capacitor configured to build up a back propagation LIF charge over time. A first transistor, electrically coupled to the postsynaptic capacitor and the programmable resistive memory element, activates a first discharge path from the postsynaptic capacitor through the programmable resistive memory element when the axon LIF pulse generator generates the axon LIF pulse. A second transistor, electrically coupled to the presynaptic capacitor and the programmable resistive memory element, activates a second discharge path from the presynaptic capacitor through the programmable resistive memory element when the back propagation pulse generator generates the back propagation pulse. Another example aspect of the present invention is a neuromorphic memory circuit comprising an axon leaky integrate and fire (LIF) pulse generator to generate an axon LIF pulse, a back propagation pulse generator to generate a back propagation pulse, a postsynaptic capacitor configured to build up a forward propagation LIF charge over time, and a presynaptic capacitor configured to build up a back propagation LIF charge over time. The neuromorphic memory circuit includes a memory cell array. Each memory cell in the memory cell array includes a programmable resistive memory element, a first transistor, and a second transistor. The first transistor is electrically coupled to the postsynaptic capacitor and the programmable resistive memory element, and activates a first discharge path from the postsynaptic capacitor through the programmable resistive memory element when ...",
  "date_published": "20171221",
  "title": "NEUROMORPHIC MEMORY CIRCUIT",
  "ipcr_labels": [
    "G06N308",
    "G06N304"
  ],
  "_processing_info": {
    "original_size": 60847,
    "optimized_size": 3487,
    "reduction_percent": 94.27
  }
}