{
  "decision": "PENDING",
  "application_number": "15187403",
  "date_published": "20170105",
  "date_produced": "20161220",
  "title": "INFORMATION REPRODUCTION/I/O METHOD USING DOT PATTERN, INFORMATION REPRODUCTION DEVICE, MOBILE INFORMATION I/O DEVICE, AND ELECTRONIC TOY USING DOT PATTERN",
  "filing_date": "20160620",
  "inventor_list": [
    {
      "inventor_name_last": "Yoshida",
      "inventor_name_first": "Kenji",
      "inventor_city": "Tokyo",
      "inventor_state": "",
      "inventor_country": "JP"
    }
  ],
  "ipcr_labels": [
    "G06K710",
    "G06F3039",
    "G06F303",
    "G06F1728",
    "A63H3322",
    "G06K714",
    "A63H3338",
    "A63H3326",
    "A63H300",
    "A63H328",
    "G06F30354",
    "G06K1906"
  ],
  "main_ipcr_label": "G06K710",
  "summary": "<SOH> SUMMARY OF THE INVENTION <EOH>The present invention proposes a dot pattern that allows to define code information or the x and y coordinates even if the dot pattern is an minimum area, and an information reproducing method and an information reproducing device based on the dot pattern A first aspect of the invention is configured to include the steps of: scanning as image data by scanning means ( 602 ) a medium such as a printed material ( 606 ) on which is formed a dot pattern portion ( 607 ), the dot pattern portion being formed by arranging in accordance with a given rule dots ( 605 ) generated by a dot code generating algorithm, in order to recognize various kinds of multimedia information; converting the image data of the dot pattern portion ( 607 ) into code data; and reading multimedia information corresponding to the code data out of storing means to reproduce the multimedia information. The multimedia information here may be any one of followings: voice information, image information, video information, and visible, audible and readable information such as a letter and a symbol. Further, the multimedia information may be digital data for another personal computer, a television system or a radio terminal to reproduce video/image information, text information and the like. Here, on the dot pattern portion ( 607 ), code information corresponding to voice data registered in the storing means may be defined or the x and y coordinates may be defined. Also, both of the code information and the x and y coordinates may be defined. In a header of the dot pattern portion ( 607 ), a flag may be registered to determine the dot pattern portion is code information or x and y coordinates. The medium may be a picture book or a photograph. The dot pattern portion ( 607 ) for recognizing voice information corresponding to image ( 606 b ) of the picture book or the like may be printed over the image ( 606 b ). The dot pattern portion ( 607 ) may be printed on a seal memb...",
  "patent_number": "None",
  "abstract": "The present invention proposes a dot pattern on which code information and x and y coordinate information can be defined even if the dot pattern is extremely small, and proposes an information reproducing method and an information reproducing device based on the dot pattern. More specifically, a medium such as a printed material on which is formed a dot pattern portion by arranging in accordance with a given rule dots generated by a dot code generating algorithm in order to recognize various kinds of multimedia information is scanned as image data by scanning means. Then, the image data is converted into code data. Multimedia information corresponding to the code data is read out of storing means to be reproduced.",
  "publication_number": "US20170004339A1-20170105",
  "_processing_info": {
    "original_size": 183420,
    "optimized_size": 3490,
    "reduction_percent": 98.1
  }
}