{
  "decision": "PENDING",
  "application_number": "15182986",
  "date_published": "20171221",
  "date_produced": "20171207",
  "title": "GUIDED VIRTUAL MACHINE MIGRATION",
  "filing_date": "20160615",
  "inventor_list": [
    {
      "inventor_name_last": "Ahmed",
      "inventor_name_first": "Syed R.",
      "inventor_city": "Bangalore",
      "inventor_state": "",
      "inventor_country": "IN"
    },
    {
      "inventor_name_last": "Nidugala",
      "inventor_name_first": "Muralikrishna",
      "inventor_city": "Bangalore",
      "inventor_state": "",
      "inventor_country": "IN"
    },
    {
      "inventor_name_last": "Pallamparti",
      "inventor_name_first": "Praveen K. R.",
      "inventor_city": "Hyderabad",
      "inventor_state": "",
      "inventor_country": "IN"
    },
    {
      "inventor_name_last": "Sainath",
      "inventor_name_first": "Venkatesh",
      "inventor_city": "Bangalore",
      "inventor_state": "",
      "inventor_country": "IN"
    },
    {
      "inventor_name_last": "Thakar",
      "inventor_name_first": "Dhavalkumar M.",
      "inventor_city": "Bangalore",
      "inventor_state": "",
      "inventor_country": "IN"
    }
  ],
  "ipcr_labels": [
    "G06F948",
    "G06F306",
    "H04L1224"
  ],
  "main_ipcr_label": "G06F948",
  "summary": "<SOH> SUMMARY <EOH>Embodiments of the present invention disclose a method, a computer program product, and a system for guided virtual machine migration. The method may include one or more computer processors determining a target host computer available for a migration of a virtual machine from a source host computer. The one or more computer processors identify one or more resources of the target host computer with one or more predictive errors. The one or more computer processors determine whether the virtual machine uses one or more of the identified one or more resources with one or more predictive errors. The one or more computer processors rank a migration path for the virtual machine from the source host computer to the target host computer with a designation. The one or more computer processors create a target host map, wherein the target host map indicates at least one migration path for the virtual machine from the source host computer to the target host computer.",
  "patent_number": "None",
  "abstract": "In an approach to guided virtual machine migration, one or more computer processors determine a target host computer available for a migration of a virtual machine from a source host computer. The one or more computer processors identify one or more resources of the target host computer with one or more predictive errors. The one or more computer processors determine whether the virtual machine uses one or more of the identified one or more resources with one or more predictive errors. The one or more computer processors rank a migration path for the virtual machine from the source host computer to the target host computer with a designation. The one or more computer processors create a target host map, wherein the target host map indicates at least one migration path for the virtual machine from the source host computer to the target host computer.",
  "publication_number": "US20170364387A1-20171221",
  "_processing_info": {
    "original_size": 77286,
    "optimized_size": 3001,
    "reduction_percent": 96.12
  }
}