{
  "decision": "ACCEPTED",
  "application_number": "15188488",
  "date_published": "20171221",
  "date_produced": "20171207",
  "title": "MESH NETWORK OF NEARBY MOBILE DEVICES AS A COMBINED SPEAKER SYSTEM FOR AUDIO",
  "filing_date": "20160621",
  "inventor_list": [
    {
      "inventor_name_last": "Toksoz",
      "inventor_name_first": "Tuna",
      "inventor_city": "Mountain View",
      "inventor_state": "CA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Price",
      "inventor_name_first": "Thomas",
      "inventor_city": "San Francisco",
      "inventor_state": "CA",
      "inventor_country": "US"
    }
  ],
  "ipcr_labels": [
    "G06F316",
    "H04W402",
    "H04W400",
    "H04W5600",
    "H04R312"
  ],
  "main_ipcr_label": "G06F316",
  "summary": "<SOH> SUMMARY <EOH>The following is a simplified summary of the disclosure in order to provide a basic understanding of some aspects of the disclosure. This summary is not an extensive overview of the disclosure. It is intended to neither identify key or critical elements of the disclosure, nor delineate any scope of the particular implementations of the disclosure or any scope of the claims. Its sole purpose is to present some concepts of the disclosure in a simplified form as a prelude to the more detailed description that is presented later. In an aspect of the disclosure, a method includes detecting one or more other computing devices within a geographic vicinity of a computing device, transmitting a confirmation to join a speaker mesh network with the detected one or more other computing devices, receiving a playback synchronization instruction for a media item, adjusting playback of the media item according to the playback synchronization instruction, wherein the one or more other computing devices in the speaker mesh network provide synchronized playback of the media item according to the playback synchronization instruction, receiving a stereo sound and audio equalization instruction, and applying, according to the stereo sound and audio equalization instruction, stereo sound and audio equalization settings to the playback of the media item at the computing device. In one implementation, the playback synchronization instruction includes identification of the media item, a timestamp in the media item, and a synchronized clock time. Furthermore, the stereo sound and audio equalization settings at the one or more other computing devices are different than the stereo sound and audio equalization settings at the computing device. In addition, the method may further include presenting a prompt in a user interface (UI) of the computing device, the prompt to query whether to join the speaker mesh network with the detected one or more other computing devices, and rec...",
  "patent_number": "9846564",
  "abstract": "Implementations disclose a mesh network of nearby mobile devices as a combined speaker system for audio. A method includes detecting one or more other computing devices within a geographic vicinity of a computing device, transmitting a confirmation to join a speaker mesh network with the detected one or more other computing devices, receiving a playback synchronization instruction for a media item, adjusting playback of the media item according to the playback synchronization instruction, wherein the one or more other computing devices in the speaker mesh network provide synchronized playback of the media item according to the playback synchronization instruction, receiving a stereo sound and audio equalization instruction, and applying, according to the stereo sound and audio equalization instruction, stereo sound and audio equalization settings to the playback of the media item at the computing device.",
  "publication_number": "US20170364322A1-20171221",
  "_processing_info": {
    "original_size": 73412,
    "optimized_size": 3683,
    "reduction_percent": 94.98
  }
}