{
  "date_produced": "20171207",
  "publication_number": "US20170364824A1-20171221",
  "main_ipcr_label": "G06N9900",
  "decision": "PENDING",
  "application_number": "15188572",
  "inventor_list": [
    {
      "inventor_name_last": "Boyer",
      "inventor_name_first": "Jerome",
      "inventor_city": "Santa Clara",
      "inventor_state": "CA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Grant",
      "inventor_name_first": "Robert H.",
      "inventor_city": "Austin",
      "inventor_state": "TX",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Zheltonogov",
      "inventor_name_first": "Vyacheslav A.",
      "inventor_city": "Allen",
      "inventor_state": "TX",
      "inventor_country": "US"
    }
  ],
  "abstract": "A computer-implemented method includes a processor extracting data and metadata from a process model, where the process is comprised of activities and the metadata is associated with each activity. The processor generates at least one user story for at least one activity, where the at least one user story includes an estimate attribute reflecting a predicted timeframe for completion of at least a portion of the at least one activity. The processor updates the model to reflect the at least one user story and displays the updated model as a project plan in a project management interface on a computing resource. The processor assigns a resource to the at least one user story and dynamically updates the estimate attribute of the at least one user story to reflect a new predicted timeframe, calculates impacts to the process and displays the impacts and the new predicted timeframe in the project management interface.",
  "filing_date": "20160621",
  "patent_number": "None",
  "summary": "<SOH> SUMMARY <EOH>According to embodiments, shortcomings of the prior art are overcome and additional advantages are provided through the provision of a method of semantic extraction from a process model to create and dynamically update a project plan for the process implementation. The method includes, for instance, in some embodiments: extracting, by one or more processor, with semantic extraction, data and metadata from a model representing a process, wherein the process is comprised of activities and the metadata is associated with each activity; based on the semantic extraction, generating, by the one or more processor, at least one user story for at least one activity, wherein the at least one user story comprises an estimate attribute reflecting a predicted timeframe for completion of at least a portion of the at least one activity; updating, by the one or more processor, the model to reflect the at least one user story, the updating comprising displaying the updated model as a project plan in a project management interface on a computing resource; assigning, by the one or more processor, a resource to the at least one user story; dynamically updating, by the one or more processor, the estimate attribute of the at least one user story to reflect a new predicted timeframe, wherein the dynamic updating is based on attributes of the resource; and updating, by the one or more processor, the at least one user story to reflect the new predicted timeframe, calculating impacts to the process, based on the new predicted timeframe, and displaying the impacts and the new predicted timeframe in the project management interface. According to embodiments, shortcomings of the prior art are overcome and additional advantages are provided through the provision of a computer program product to perform semantic extraction from a process model to create and dynamically update a project plan for the process. The computer program product includes, for instance, in some embodiment...",
  "date_published": "20171221",
  "title": "CONTEXTUAL EVALUATION OF PROCESS MODEL FOR GENERATION AND EXTRACTION OF PROJECT MANAGEMENT ARTIFACTS",
  "ipcr_labels": [
    "G06N9900",
    "G06N700",
    "G06N504"
  ],
  "_processing_info": {
    "original_size": 96316,
    "optimized_size": 3839,
    "reduction_percent": 96.01
  }
}