{
  "decision": "PENDING",
  "application_number": "15182314",
  "date_published": "20171214",
  "date_produced": "20171129",
  "title": "METHOD AND SYSTEM FOR VISUALIZING NETWORKS",
  "filing_date": "20160614",
  "inventor_list": [
    {
      "inventor_name_last": "Madsen",
      "inventor_name_first": "Ryan Sherali",
      "inventor_city": "San Francisco",
      "inventor_state": "CA",
      "inventor_country": "US"
    }
  ],
  "ipcr_labels": [
    "G06T1120",
    "H04L2908",
    "H04L1224"
  ],
  "main_ipcr_label": "G06T1120",
  "summary": "<SOH> SUMMARY <EOH>In general, in one aspect, the invention relates to a method for visualizing a network. The method includes identifying, for each of a set of network elements, a network element role and a network element connectivity, grouping the network elements based on the network element roles, displaying at least a subset of the grouped network elements and displaying connections between the displayed network elements, based on the network element connectivity. In general, in one aspect, the invention relates to a system for visualizing a network. The system includes a network topology database that includes network element entries for network elements. The system further includes a network visualization engine that identifies, for each of a set of network elements in the network topology database, a network element role and a network element connectivity, and groups the network elements based on the network element roles. The system also includes a network visualization interface that displays at least a subset of the grouped network elements, and displays connections between the displayed network elements, based on the network element connectivity. In general, in one aspect, the invention relates to a non-transitory computer readable medium including instructions that enable a system for visualizing a network to identify, for each of a set of network elements, a network element role and a network element connectivity, group the network elements based on the network element roles, display at least a subset of the grouped network elements and display connections between the displayed network elements, based on the network element connectivity.",
  "patent_number": "None",
  "abstract": "A method for visualizing a network. The method includes identifying, for each of a set of network elements, a network element role and a network element connectivity, grouping the network elements based on the network element roles, displaying at least a subset of the grouped network elements, and displaying connections between the displayed network elements, based on the network element connectivity.",
  "publication_number": "US20170358111A1-20171214",
  "_processing_info": {
    "original_size": 54572,
    "optimized_size": 2648,
    "reduction_percent": 95.15
  }
}