{
  "date_produced": "20161208",
  "publication_number": "US20160371591A1-20161222",
  "main_ipcr_label": "G06N504",
  "decision": "PENDING",
  "application_number": "15187650",
  "inventor_list": [
    {
      "inventor_name_last": "Reddy",
      "inventor_name_first": "Surendra",
      "inventor_city": "San Jose",
      "inventor_state": "CA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Koduru",
      "inventor_name_first": "Vamsi",
      "inventor_city": "San Jose",
      "inventor_state": "CA",
      "inventor_country": "US"
    }
  ],
  "abstract": "Briefly described, embodiments of the present invention pertains to a key performance indicator (KPI)-driven digital genome system or framework as well as various systems and methods of use and interaction therewith. Unlike conventional stand-alone KPI applications or pure-play centralized KPI solutions, embodiments of the present invention provide an automated way to codify the organizational objectives, goals, behavior, and motivations by continuously measuring, correlating, and discovering hidden relationships among various metrics, attributes, causal relationships, and networks display genomic findings via business applications without a priori knowledge of machine learning or statistical techniques.",
  "filing_date": "20160620",
  "patent_number": "None",
  "summary": "<SOH> SUMMARY OF THE INVENTION <EOH>An enterprise data genome and methods for making and using the same are disclosed. In one embodiment, a method for generating an enterprise data genome for an enterprise comprises: identifying key attributes, measures, and thresholds of enterprise entities that influence the financial, operational, and innovational outcomes of the enterprise using the statistical and artificial intelligence methods; extracting and contextualizing these attributes and measures from measured enterprise data; mapping the entities as nodes and relationships between entities as edges; creating contextual relevance scores to entities and relationships as labels; and connecting and automatically extracting and creating ontologies and semantic maps of enterprise entities.",
  "date_published": "20161222",
  "title": "SYSTEM AND METHOD FOR CREATING BIOLOGICALLY BASED ENTERPRISE DATA GENOME TO PREDICT AND RECOMMEND ENTERPRISE PERFORMANCE",
  "ipcr_labels": [
    "G06N504",
    "G06N700",
    "G06N9900",
    "G06F1730"
  ],
  "_processing_info": {
    "original_size": 64293,
    "optimized_size": 2292,
    "reduction_percent": 96.44
  }
}