{
  "decision": "ACCEPTED",
  "application_number": "15181304",
  "date_published": "20161215",
  "date_produced": "20161130",
  "title": "APPLICATION SECURITY POLICY ACTIONS BASED ON SECURITY PROFILE EXCHANGE",
  "filing_date": "20160613",
  "inventor_list": [
    {
      "inventor_name_last": "Kamble",
      "inventor_name_first": "Keshav Govind",
      "inventor_city": "San Jose",
      "inventor_state": "CA",
      "inventor_country": "US"
    }
  ],
  "ipcr_labels": [
    "G06F306",
    "G06F1208"
  ],
  "main_ipcr_label": "G06F306",
  "summary": "<SOH> SUMMARY <EOH>In one embodiment, a method includes receiving, at a first host, a security profile related to a first data socket descriptor indicating risk to data security of a second host. The method also includes, in response to the risk indicated by the security profile, performing by the first host, at least one action selected from a group of actions. The group of actions includes a cache flush on a cache of the first host according to a cache flush policy, cache locking on first data stored in the cache of the first host according to a cache locking policy, data redaction on second data of a first payload prior to being sent by the first host according to a redaction policy, memory locking of third data stored in an in-memory database of the first host according to a memory locking policy, and encryption of fourth data stored in the in-memory database of the first host or encryption of selected data fields of a second payload prior to being sent from the first host. According to another embodiment, a system includes a processing circuit and logic integrated with and/or executable by the processing circuit. The logic is configured to cause the processing circuit to receive, at a first host, a security profile related to a first data socket descriptor indicating risk to data security of a second host. The logic is also configured to cause the processing circuit to perform, by the first host, at least one action selected from a group of actions in response to the risk indicated by the security profile. The group of actions includes a cache flush on a cache of the first host according to a cache flush policy, cache locking on first data stored in the cache of the first host according to a cache locking policy, data redaction on second data of a first payload prior to being sent by the first host according to a redaction policy, memory locking of third data stored in an in-memory database of the first host according to a memory locking policy, and encryption ...",
  "patent_number": "9952790",
  "abstract": "In one embodiment, a method includes receiving, at a first host, a security profile related to a first data socket descriptor indicating risk to data security of a second host. The method also includes, in response to the risk indicated by the security profile, performing by the first host, at least one action selected from a group of actions. The group of actions includes a cache flush on a cache of the first host according to a cache flush policy, cache locking on data stored in the cache of the first host, data redaction on data of a payload prior to being sent by the first host, memory locking of data stored in an in-memory database of the first host, and encryption of data stored in the in-memory database of the first host or encryption of selected data fields of a payload prior to being sent from the first host.",
  "publication_number": "US20160364163A1-20161215",
  "_processing_info": {
    "original_size": 90224,
    "optimized_size": 3410,
    "reduction_percent": 96.22
  }
}