{
  "date_produced": "20160928",
  "publication_number": "US20160300136A1-20161013",
  "main_ipcr_label": "G06N502",
  "decision": "ACCEPTED",
  "application_number": "15189955",
  "inventor_list": [
    {
      "inventor_name_last": "Jung",
      "inventor_name_first": "Edward K.Y.",
      "inventor_city": "Bellevue",
      "inventor_state": "WA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Tegreene",
      "inventor_name_first": "Clarence T.",
      "inventor_city": "Bellevue",
      "inventor_state": "WA",
      "inventor_country": "US"
    }
  ],
  "abstract": "Computer-implemented systems utilizing sensor networks for sensing temperature and motion environmental parameters, and performing at least operations of electronically establishing, based on pattern recognition criteria, correspondence of a plurality of representative features a plurality of characteristics of an occurrence, where a first instance of the occurrence occurred within a first time period of a plurality of time periods; electronically discovering, based on the correspondence, a second instance of the occurrence in an environment during a second time period of the plurality of time periods; and electronically causing, based on the discovery of the second instance of the occurrence, a change in the environment via an electronically-controlled device.",
  "filing_date": "20160622",
  "patent_number": "9558447",
  "summary": "<SOH> SUMMARY <EOH>An embodiment provides an occurrence-data retrieval system. The system includes a data storage operable to store a plurality of instances of occurrence-data, each instance of the occurrence-data having a representative feature, a central computing device operable to communicate with the data storage, and instructions that cause a computing device to perform steps. The steps include receive from an input-selector an input selection corresponding to a target-occurrence having a representative feature, and select a pattern recognition criteria corresponding to the representative feature of the target-occurrence. The steps also include automatically search the plurality of instances of stored occurrence-data for data correlating to the target-occurrence using the selected pattern recognition criteria, and provide an output indicative of a result of the automatic search. The input-selector may include an individual user. The pattern recognition criteria may be automatically selected in response to input selection corresponding to the target-occurrence. The input selection may further include a representative feature of the target-occurrence. The representative feature may include a time period. The representative feature may include acoustic frequency components. The representative feature may include a frequency pattern. The frequency pattern may include at least one selected from a group consisting of a recognized word, a set of words, a breaking glass, a dog bark, a door opening, an alarm, a threshold acoustic level, and a voiceprint. The representative feature may include an electromagnetic pattern. The electromagnetic pattern may include at least one selected from a group consisting of a visible light, an infrared light, an ultraviolet light, and a radar. The recognition criteria may be automatically selected in response to the selected representative feature. The automatic search instruction may include using the pattern recognition criteria sele...",
  "date_published": "20161013",
  "title": "COMPUTER-IMPLEMENTED SYSTEMS UTILIZING SENSOR NETWORKS FOR SENSING TEMPERATURE AND MOTION ENVIRONMENTAL PARAMETERS; AND METHODS OF USE THEREOF",
  "ipcr_labels": [
    "G06N502",
    "G01D900",
    "G06N9900"
  ],
  "_processing_info": {
    "original_size": 144082,
    "optimized_size": 3584,
    "reduction_percent": 97.51
  }
}