{
  "date_produced": "20170329",
  "publication_number": "US20170103330A1-20170413",
  "main_ipcr_label": "G06N504",
  "decision": "PENDING",
  "application_number": "15181119",
  "inventor_list": [
    {
      "inventor_name_last": "Gagne",
      "inventor_name_first": "Christopher Stanleigh Ronan",
      "inventor_city": "San Francisco",
      "inventor_state": "CA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Hayes",
      "inventor_name_first": "David",
      "inventor_city": "San Francisco",
      "inventor_state": "CA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Shackelford",
      "inventor_name_first": "David Allen Lax",
      "inventor_city": "San Francisco",
      "inventor_state": "CA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Shekhar",
      "inventor_name_first": "Divakar Chandra",
      "inventor_city": "San Francisco",
      "inventor_state": "CA",
      "inventor_country": "US"
    }
  ],
  "abstract": "Embodiments are directed towards an operations maturity model. An operations management system may associate events with one or more organizations. Event metric information may be provided based on the events for one or more sub-scores. The sub-scores may be scaled to fit within a defined range. An operations maturity score may be provided for the organizations that may be based on the scaled sub-scores. One or more recommendations may be provided to increase the operations maturity score for the organizations based on operations maturity scores that correspond to the one or more organizations. Providing the recommendations, includes providing a correlation of operations practices and the sub-scores and providing configuration recommendations based on the operations practices that are correlated with above average sub-scores.",
  "filing_date": "20160613",
  "patent_number": "None",
  "summary": "<SOH> BRIEF DESCRIPTION OF THE DRAWINGS <EOH>Non-limiting and non-exhaustive embodiments of the present innovations are described with reference to the following drawings. In the drawings, like reference numerals refer to like parts throughout the various figures unless otherwise specified. For a better understanding of the described innovations, reference will be made to the following Description of Various Embodiments, which is to be read in association with the accompanying drawings, wherein: FIG. 1 shows components of one embodiment of an environment in which embodiments of the invention may be practiced; FIG. 2 shows one embodiment of a client computer that may be included in a system in accordance with at least one of the various embodiments; FIG. 3 shows one embodiment of a network computer, in accordance with at least one of the various embodiments; FIG. 4 illustrates a logical architecture of an operations management system that provides operations maturity modeling in accordance with at least one of the various embodiments; FIG. 5 illustrates a table that includes a portion of the sub-score that may be generated for providing operational maturity scores, in accordance with at least one of the various embodiments; FIG. 6 illustrates a graph that is an example of a plot of operations maturity score for a community of organizations in accordance with at least one of the various embodiments; FIG. 7 illustrates a graph that is an example of a plot of sub-score values for organizations in accordance with at least one of the various embodiments; FIG. 8 illustrates an overview flowchart for a process for operational maturity modeling in accordance with at least one the various embodiments; FIG. 9 illustrates a flowchart for a process for generating an operations maturity score for an organization in accordance with at least one of the various embodiments; FIG. 10 illustrates a flowchart for a process for generating report information based on operations maturity s...",
  "date_published": "20170413",
  "title": "OPERATIONS MATURITY MODEL",
  "ipcr_labels": [
    "G06N504",
    "G06F1750"
  ],
  "_processing_info": {
    "original_size": 113153,
    "optimized_size": 3862,
    "reduction_percent": 96.59
  }
}