{
  "date_produced": "20171207",
  "publication_number": "US20170364805A1-20171221",
  "main_ipcr_label": "G06N502",
  "decision": "PENDING",
  "application_number": "15188051",
  "inventor_list": [
    {
      "inventor_name_last": "Boyer",
      "inventor_name_first": "John M.",
      "inventor_city": "Victoria",
      "inventor_state": "",
      "inventor_country": "CA"
    }
  ],
  "abstract": "A first and second blending profile may be created for a set of question answering pipelines. A set of test answer data may be generated for a first answering pipeline. The test answer data may be generated based on a set of test question and using an answer key associated with the test questions. Based on the test answer data, a first blending profile can be created for the first answering pipeline. Using the set of test questions and a second answer key, another set of test answer data may be generated. This set may be generated for the second answering pipeline. Using this second answering pipeline test answer data, a second blending profile can be generated for the second answering pipeline. Each blending profile may have metadata about a confidence of each pipeline.",
  "filing_date": "20160621",
  "patent_number": "None",
  "summary": "<SOH> SUMMARY <EOH>Embodiments of the present disclosure may be directed toward a method that begins when a first set of test answer data for a first answering pipeline is generated based on a set of test questions and on a first answer key associated with the questions. Based on the first set of test answer data, a first blending profile may be generated. The first blending profile may contain metadata about a confidence of the first answering pipeline. Using the set of test questions and a second answer key associated with the questions, a second set of test answer data may be generated for the second answering pipeline. The second blending profile may be generated for the second answering pipeline and based on the second set of test answer data. The second blending profile may comprise metadata about a confidence of the second answering pipeline. Embodiments of the present disclosure may be directed toward a system comprising a computer readable storage medium with program instructions stored thereon, and one or more processors configured to execute the program instructions to perform a method. The method may begin when a first set of test answer data for a first answering pipeline is generated based on a set of test questions and on a first answer key associated with the questions. Based on the first set of test answer data, a first blending profile may be generated. The first blending profile may contain metadata about a confidence of the first answering pipeline. Using the set of test questions and a second answer key associated with the questions, a second set of test answer data may be generated for the second answering pipeline. The second blending profile may be generated for the second answering pipeline and based on the second set of test answer data. The second blending profile may comprise metadata about a confidence of the second answering pipeline. Embodiments of the present disclosure may be directed toward a computer program product comprising a co...",
  "date_published": "20171221",
  "title": "COGNITIVE QUESTION ANSWERING PIPELINE CALIBRATING",
  "ipcr_labels": [
    "G06N502",
    "G06N700"
  ],
  "_processing_info": {
    "original_size": 100942,
    "optimized_size": 3327,
    "reduction_percent": 96.7
  }
}