{
  "date_produced": "20160928",
  "publication_number": "US20160300139A1-20161013",
  "main_ipcr_label": "G06N502",
  "decision": "PENDING",
  "application_number": "15188068",
  "inventor_list": [
    {
      "inventor_name_last": "Bhat",
      "inventor_name_first": "Sandesh",
      "inventor_city": "Acton",
      "inventor_state": "MA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Mustafi",
      "inventor_name_first": "Joy",
      "inventor_city": "Kolkata",
      "inventor_state": "",
      "inventor_country": "IN"
    }
  ],
  "abstract": "A method providing an answer to at least one analytical question containing at least one table or at least one chart is provided. The method may include receiving an input question. The method may also include extracting a plurality of information from the input question based on a natural language analysis. The method may further include forming a well-defined sentence. The method may include extracting at least one table or at least one chart associated with the input question. The method may include forming at least one mathematical equation. The method may also include solving the at least one mathematical equation. The method may include determining the answer to the input question in natural language based on the solved at least one mathematical equation. The method may further include narrating the determined answer to the input question in natural language.",
  "filing_date": "20160621",
  "patent_number": "None",
  "summary": "<SOH> SUMMARY <EOH>According to one embodiment, a method providing an answer to at least one analytical question containing at least one table or at least one chart is provided. The method may include receiving an input question associated with the at least one analytical question. The method may also include extracting a plurality of information from the input question based on a natural language analysis of the input question. The method may further include forming a well-defined sentence based on the extracted plurality of information. The method may include extracting at least one table or at least one chart associated with the input question. The method may include forming at least one mathematical equation based on the well-defined sentence and the extracted at least one table or at least one chart. The method may also include solving the at least one mathematical equation. The method may include determining the answer to the input question in natural language based on the solved at least one mathematical equation. The method may further include narrating the determined answer to the input question in natural language. According to another embodiment, a computer system providing an answer to at least one analytical question containing at least one table or at least one chart is provided. The computer system may include one or more processors, one or more computer-readable memories, one or more computer-readable tangible storage devices, and program instructions stored on at least one of the one or more storage devices for execution by at least one of the one or more processors via at least one of the one or more memories, wherein the computer system is capable of performing a method. The method may include receiving an input question associated with the at least one analytical question. The method may also include extracting a plurality of information from the input question based on a natural language analysis of the input question. The method may further inc...",
  "date_published": "20161013",
  "title": "AUTOMATIC DATA INTERPRETATION AND ANSWERING ANALYTICAL QUESTIONS WITH TABLES AND CHARTS",
  "ipcr_labels": [
    "G06N502",
    "G06K962",
    "G06T1120",
    "G06F1711"
  ],
  "_processing_info": {
    "original_size": 56556,
    "optimized_size": 3624,
    "reduction_percent": 93.59
  }
}