{
  "date_produced": "20160928",
  "publication_number": "US20160300138A1-20161013",
  "main_ipcr_label": "G06N502",
  "decision": "PENDING",
  "application_number": "15180549",
  "inventor_list": [
    {
      "inventor_name_last": "VOLK",
      "inventor_name_first": "Dvir",
      "inventor_city": "Tel Aviv",
      "inventor_state": "",
      "inventor_country": "IL"
    }
  ],
  "abstract": "A server and method for contextual verification of a user intent. The method includes: determining, based on at least one variable related to a user device, a user intent; determining, based on the user intent, at least one contextual assumption; determining, based on the at least one contextual assumption, at least one expected variable; determining whether the at least one expected variable has been identified with respect to the user device; and determining the user intent as verified, when the at least one expected variable has been identified.",
  "filing_date": "20160613",
  "patent_number": "None",
  "summary": "<SOH> SUMMARY <EOH>A summary of several example embodiments of the disclosure follows. This summary is provided for the convenience of the reader to provide a basic understanding of such embodiments and does not wholly define the breadth of the disclosure. This summary is not an extensive overview of all contemplated embodiments, and is intended to neither identify key or critical elements of all embodiments nor to delineate the scope of any or all aspects. Its sole purpose is to present some concepts of one or more embodiments in a simplified form as a prelude to the more detailed description that is presented later. For convenience, the term “some embodiments” may be used herein to refer to a single embodiment or multiple embodiments of the disclosure. Some embodiments disclosed herein include a method for contextual verification of a user intent. The method includes: determining, based on at least one variable related to a user device, a user intent; determining, based on the user intent, at least one contextual assumption; determining, based on the at least one contextual assumption, at least one expected variable; determining whether the at least one expected variable has been identified with respect to the user device; and determining the user intent as verified, when the at least one expected variable has been identified. Some embodiments disclosed herein also include a server for contextual verification of a user intent. The server includes a processing system; and a memory, the memory containing instructions that, when executed by the processing system, configure the server to: determining, based on at least one variable related to a user device, a user intent; determining, based on the user intent, at least one contextual assumption; determining, based on the at least one contextual assumption, at least one expected variable; determining whether the at least one expected variable has been identified with respect to the user device; and determining the user...",
  "date_published": "20161013",
  "title": "METHOD AND SYSTEM FOR CONTEXT-BASED INTENT VERIFICATION",
  "ipcr_labels": [
    "G06N502",
    "G06Q3002",
    "H04L2908"
  ],
  "_processing_info": {
    "original_size": 51919,
    "optimized_size": 3125,
    "reduction_percent": 93.98
  }
}