{
  "decision": "PENDING",
  "application_number": "15183552",
  "date_published": "20161013",
  "date_produced": "20160928",
  "title": "INFORMATION PROCESSING APPARATUS, INFORMATION PROCESSING METHOD, AND COMPUTER PROGRAM",
  "filing_date": "20160615",
  "inventor_list": [
    {
      "inventor_name_last": "SAWADA",
      "inventor_name_first": "Tsutomu",
      "inventor_city": "Tokyo",
      "inventor_state": "",
      "inventor_country": "JP"
    }
  ],
  "ipcr_labels": [
    "G06F301",
    "G06F303",
    "G06F30485",
    "G06F30484",
    "G06F30482"
  ],
  "main_ipcr_label": "G06F301",
  "summary": "<SOH> SUMMARY <EOH>Thus, although technology exists for remote operation of a television, a personal computer and the like based on user gestures, when performing a remote operation by detecting only the orientation of a face or movement of facial parts, the large movements of the cursor displayed on a large screen of 50-inches or more, for example, make it different to precisely specify a position. Further, when performing a remote operation by detecting only the user's hand movements, although precise movements of the cursor displayed on the screen may be possible, large movements of the cursor displayed on the screen are difficult. Therefore, according to an embodiment of the present disclosure, provided are a new and improved information processing apparatus, information processing method, and computer program, which are capable of facilitating a remote operation performed based on detection of a specific gesture when a user performs a gesture-based remote operation. According to an embodiment of the present disclosure, there is provided an information processing apparatus including an operation detection unit configured to detect an orientation of a user's face and operations performed by the user, and an area selection unit configured to, when the operation detection unit detects that the user has performed a first operation, select an area on a screen based on the orientation of the user's face during the first operation. According to such a configuration, an operation detection unit detects the orientation of a user's face and operations performed by the user. When the operation detection unit detects that the user has performed a first operation, an area selection unit selects an area on the screen based on the orientation of the user's face during the first operation. Consequently, the information processing apparatus can facilitate a remote operation that is performed based on detection of a specific gesture when a user performs a gesture-based remote ope...",
  "patent_number": "None",
  "abstract": "There is provided an information processing apparatus including an operation detection unit configured to detect an orientation of a user's face and operations performed by the user, and an area selection unit configured to, when the operation detection unit detects that the user has performed a first operation, select an area on a screen based on the orientation of the user's face during the first operation.",
  "publication_number": "US20160299564A1-20161013",
  "_processing_info": {
    "original_size": 67282,
    "optimized_size": 3031,
    "reduction_percent": 95.5
  }
}