{
  "decision": "PENDING",
  "application_number": "15189558",
  "date_published": "20171228",
  "date_produced": "20171213",
  "title": "SEARCH SYSTEM EMPLOYING RESULT FEEDBACK",
  "filing_date": "20160622",
  "inventor_list": [
    {
      "inventor_name_last": "Kanjilal",
      "inventor_name_first": "Debasree",
      "inventor_city": "Bengaluru",
      "inventor_state": "",
      "inventor_country": "IN"
    },
    {
      "inventor_name_last": "Shah",
      "inventor_name_first": "Ruchirbhai Rajendra",
      "inventor_city": "Bengaluru",
      "inventor_state": "",
      "inventor_country": "IN"
    },
    {
      "inventor_name_last": "Vaseeharan Alexander",
      "inventor_name_first": "Vijay Samuel",
      "inventor_city": "San Jose",
      "inventor_state": "CA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Venkatraman",
      "inventor_name_first": "Sankaranarayanan",
      "inventor_city": "Bengaluru",
      "inventor_state": "",
      "inventor_country": "IN"
    },
    {
      "inventor_name_last": "Ramesh",
      "inventor_name_first": "Ramachandran",
      "inventor_city": "Bengaluru",
      "inventor_state": "",
      "inventor_country": "IN"
    }
  ],
  "ipcr_labels": [
    "G06F1730"
  ],
  "main_ipcr_label": "G06F1730",
  "summary": "<SOH> BRIEF DESCRIPTION OF THE DRAWINGS <EOH>Various ones of the appended drawings merely illustrate example embodiments of the present disclosure and cannot be considered as limiting its scope. FIG. 1 is a block diagram of an example communication system including an example search system employing search result feedback. FIG. 2 is a block diagram of an example networked system incorporating at least a portion of the example search system of FIG. 1 . FIG. 3 is a flow diagram of an example method of employing search result feedback to modify search results presented in response to search queries. FIG. 4 is a flow diagram of an example method of employing search result feedback to provide feedback to a listing entity. FIG. 5A depicts an example search device presenting search results in response to a search query. FIG. 5B depicts the example search device of FIG. 5A while search result feedback is being provided. FIG. 5C depicts the example search device of FIG. 5A presenting search results subsequent to the search result feedback of FIG. 5B . FIG. 6 is a block diagram illustrating an example of a software architecture that may be installed on a machine, according to some example embodiments. FIG. 7 illustrates a diagrammatic representation of a machine in the form of a computer system within which a set of instructions may be executed for causing the machine to perform any one or more of the methodologies discussed herein, according to an example embodiment. detailed-description description=\"Detailed Description\" end=\"lead\"? The headings provided herein are merely for convenience and do not necessarily affect the scope or meaning of the terms used.",
  "patent_number": "None",
  "abstract": "In various example embodiments, a search system and method employing search result feedback are presented. In an example, a search system may include a listing database including a plurality of listings, and a search engine may generate first search results in response to a first search query, the first search results including one or more of the plurality of listings. A search results modifier may receive a selection of a first listing of the first search results, with the selection of the first listing indicating a lack of interest in the first listing. The search engine may generate second search results in response to a second search query subsequent to the first search query, wherein the second search results include the first listing. The search results modifier may modify the second search results to less prominently display the first listing in the second search results.",
  "publication_number": "US20170371953A1-20171228",
  "_processing_info": {
    "original_size": 87395,
    "optimized_size": 3733,
    "reduction_percent": 95.73
  }
}