{
  "decision": "PENDING",
  "application_number": "15187004",
  "date_published": "20171221",
  "date_produced": "20171207",
  "title": "SYSTEM AND METHOD FOR IMPLEMENTING A GLOBAL PAYMENT ENGINE",
  "filing_date": "20160620",
  "inventor_list": [
    {
      "inventor_name_last": "STOREY",
      "inventor_name_first": "Ian",
      "inventor_city": "Southsea",
      "inventor_state": "",
      "inventor_country": "GB"
    },
    {
      "inventor_name_last": "SONAWALA",
      "inventor_name_first": "Ritesh R.",
      "inventor_city": "Bournemouth",
      "inventor_state": "",
      "inventor_country": "GB"
    },
    {
      "inventor_name_last": "BARBER",
      "inventor_name_first": "Michael John",
      "inventor_city": "Bournemouth",
      "inventor_state": "",
      "inventor_country": "GB"
    },
    {
      "inventor_name_last": "BARNES",
      "inventor_name_first": "Rob",
      "inventor_city": "Bournemouth",
      "inventor_state": "",
      "inventor_country": "GB"
    },
    {
      "inventor_name_last": "DIXON",
      "inventor_name_first": "Benedict William Hannibal",
      "inventor_city": "Ranmore Common",
      "inventor_state": "",
      "inventor_country": "GB"
    },
    {
      "inventor_name_last": "KHUSHALANI",
      "inventor_name_first": "Kirti",
      "inventor_city": "Las Palmas de Gran Canaria",
      "inventor_state": "",
      "inventor_country": "ES"
    },
    {
      "inventor_name_last": "KNEEBONE",
      "inventor_name_first": "Benjamin",
      "inventor_city": "Bournemouth",
      "inventor_state": "",
      "inventor_country": "GB"
    },
    {
      "inventor_name_last": "KUMAR",
      "inventor_name_first": "Satish",
      "inventor_city": "Bournemouth",
      "inventor_state": "",
      "inventor_country": "GB"
    },
    {
      "inventor_name_last": "PERKS",
      "inventor_name_first": "Stuart",
      "inventor_city": "Sutton Coldfield",
      "inventor_state": "",
      "inventor_country": "GB"
    },
    {
      "inventor_name_last": "JACKSON",
      "inventor_name_first": "Mark A.",
      "inventor_city": "Westerville",
      "inventor_state": "OH",
      "inventor_country": "US"
    }
  ],
  "ipcr_labels": [
    "G06Q2010",
    "G06Q2040",
    "G06Q2014"
  ],
  "main_ipcr_label": "G06Q2010",
  "summary": "<SOH> SUMMARY OF THE INVENTION <EOH>According to one embodiment, the invention relates to a global payment engine comprising: a payment initialization input that receives an electronic payment; the payment initialization input generates a payment context with an execution plan; a payments topology comprising a stage router, coupled to the payment initialization input and further in communication with a transform-to-external component and de-duplication component; and the stage router routes the payment context in accordance with the execution plan to a plurality of stages, the plurality of stages comprising a validation stage, an enrichment stage, a controls stage and a clearing stage where after each stage, the payment context is routed back to the stage router before being routed to a subsequent stage. The system may include a specially programmed computer system comprising one or more computer processors, mobile devices, electronic storage devices, and networks. The invention also relates to computer implemented method for implementing a global payment engine that comprises the steps of: receiving, via a payment initialization input, an electronic payment; the payment initialization input generates a payment context with an execution plan; implementing a payments topology comprising a stage router, coupled to the payment initialization input and further in communication with a transform-to-external component and de-duplication component; and routing, via the stage router, the payment context in accordance with the execution plan to a plurality of stages, the plurality of stages comprising a validation stage, an enrichment stage, a controls stage and a clearing stage where after each stage, the payment context is routed back to the stage router before being routed to a subsequent stage. The computer implemented system, method and medium described herein provide unique advantages to global payment entities, according to various embodiments of the invention. The inn...",
  "patent_number": "None",
  "abstract": "The invention relates to a method and system that implements a payment initialization input that receives an electronic payment; the payment initialization input generates a payment context with an execution plan; a payments topology comprising a stage router, coupled to the payment initialization input and further in communication with a transform-to-external component and de-duplication component; and the stage router routes the payment context in accordance with the execution plan to a plurality of stages, the plurality of stages comprising a validation stage, an enrichment stage, a controls stage and a clearing stage where after each stage, the payment context is routed back to the stage router before being routed to a subsequent stage.",
  "publication_number": "US20170364877A1-20171221",
  "_processing_info": {
    "original_size": 52086,
    "optimized_size": 4698,
    "reduction_percent": 90.98
  }
}