{
  "date_produced": "20171129",
  "publication_number": "US20170357909A1-20171214",
  "main_ipcr_label": "G06N9900",
  "decision": "PENDING",
  "application_number": "15181714",
  "inventor_list": [
    {
      "inventor_name_last": "Willamowski",
      "inventor_name_first": "Jutta Katharina",
      "inventor_city": "Grenoble",
      "inventor_state": "",
      "inventor_country": "FR"
    },
    {
      "inventor_name_last": "Hoppenot",
      "inventor_name_first": "Yves",
      "inventor_city": "Notre Dame de Message",
      "inventor_state": "",
      "inventor_country": "FR"
    },
    {
      "inventor_name_last": "Pouyadou",
      "inventor_name_first": "Jerome",
      "inventor_city": "Grenoble",
      "inventor_state": "",
      "inventor_country": "FR"
    },
    {
      "inventor_name_last": "Langlais",
      "inventor_name_first": "Michel",
      "inventor_city": "Pont de Claix",
      "inventor_state": "",
      "inventor_country": "FR"
    },
    {
      "inventor_name_last": "Suarez",
      "inventor_name_first": "Juan-Pablo",
      "inventor_city": "Grenoble",
      "inventor_state": "",
      "inventor_country": "FR"
    }
  ],
  "abstract": "A system and method that supports the efficient interactive identification of the most paper intensive document categories such that a maximum number of the documents belonging to those categories can be correctly categorized with a minimum effort and within a minimum amount of time is disclosed. Further, an iterative method combining automatic grouping mechanisms with human labelling. The system and method are configured to allow the automatic machine labelling to run iteratively to generate improved document clustering and categorization.",
  "filing_date": "20160614",
  "patent_number": "None",
  "summary": "<SOH> BRIEF DESCRIPTION <EOH>In one embodiment of this disclosure, described is a computer-implemented method for interactive labelling of documents associated with one or more printing systems used in an organization. The method comprises receiving a representative set of unlabelled printed documents from the one or more printing systems and processing at least one document from the representative set of unlabelled printed documents to generate a plurality of clusters of printed documents, where each cluster contains documents with a subset of similarities. The method further processes at least one document from the representative set of unlabelled printed documents to generate a plurality of categories of printed documents, where each category contains documents with a subset of similarities and then generates a list of clusters and categories for user review. The method receives document clustering information from a system for one or more documents based on the list of clusters and receives document category validation information from a user for one or more documents based on the list of categories. A trainer to classify all or part of a set of labelled documents from the machine learning and human labelling phases is updates and using the updated trainer, classifying one or more printed documents received in step a) which remain unlabelled and displaying to a user a list of categories and clusters generated by the machine learning and human labelling phases and a list of KPIs generated based upon the representative set of unlabelled documents and the labelled documents. In still another embodiment a system for interactive labelling of documents associated with one or more printing systems used in an organization is described. The system receives a representative set of unlabelled printed documents from the one or more printing systems. A clustering component of the system is configured to process at least one document from the representative set of unlabelled ...",
  "date_published": "20171214",
  "title": "SYSTEM AND METHOD TO EFFICIENTLY LABEL DOCUMENTS ALTERNATING MACHINE AND HUMAN LABELLING STEPS",
  "ipcr_labels": [
    "G06N9900",
    "G06F1730"
  ],
  "_processing_info": {
    "original_size": 68480,
    "optimized_size": 3756,
    "reduction_percent": 94.52
  }
}