{
  "date_produced": "20170621",
  "publication_number": "US20170193362A1-20170706",
  "main_ipcr_label": "G06N308",
  "decision": "PENDING",
  "application_number": "15185616",
  "inventor_list": [
    {
      "inventor_name_last": "Cremer",
      "inventor_name_first": "Markus K.",
      "inventor_city": "Orinda",
      "inventor_state": "CA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Cramer",
      "inventor_name_first": "Jason",
      "inventor_city": "Berkeley",
      "inventor_state": "CA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Popp",
      "inventor_name_first": "Phillip",
      "inventor_city": "Oakland",
      "inventor_state": "CA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Summers",
      "inventor_name_first": "Cameron Aubrey",
      "inventor_city": "Oakland",
      "inventor_state": "CA",
      "inventor_country": "US"
    }
  ],
  "abstract": "A neural network-based classifier system can receive a query including a media signal and, in response, provide an indication that a particular received query corresponds to a known media type or media class. The neural network-based classifier system can select and apply various models to facilitate media classification. In an example embodiment, classifying a media query includes accessing digital media data and a context parameter from a first device. A model for use with the network-based classifier system can be selected based on the context parameter. In an example embodiment, the network-based classifier system provides a media type probability index for the digital media data using the selected model and spectral features corresponding to the digital media data. In an example embodiment, the digital media data includes an audio or video signal sample.",
  "filing_date": "20160617",
  "patent_number": "None",
  "summary": "<SOH> BRIEF DESCRIPTION OF THE DRAWINGS <EOH>Some embodiments are illustrated by way of example and not limitation in the figures of the accompanying drawings. FIG. 1 illustrates generally an example embodiment of a system configured to receive and analyze media information. FIG. 2 illustrates generally a flow diagram of a method that can include providing a media classification. FIG. 3 illustrates generally a block diagram of some components of a mobile device. FIG. 4 illustrates generally an example embodiment that includes a query sound waveform and a context sensor signal. FIG. 5 illustrates generally a block diagram of a media processor circuit. FIG. 6 illustrates generally a block diagram of a database for storing classification models. FIG. 7 illustrates generally an example embodiment of using a classification network to identify media content. FIG. 8 illustrates generally an example embodiment that includes determining an audio type probability index. FIG. 9 illustrates generally an example embodiment that includes selecting a classification model based on context parameters. FIG. 10 illustrates generally an example embodiment that includes selecting an updated classification model. FIG. 11 illustrates generally an example embodiment that includes determining when to apply an updated classification model. FIG. 12 illustrates generally an example embodiment that includes training a media query identification system. FIG. 13 illustrates generally an example embodiment that includes determining whether to classify a media query. FIG. 14 is a block diagram illustrating components of a machine, according to some examples, that can read instructions from a machine-readable medium and perform any one or more of the methods discussed herein. detailed-description description=\"Detailed Description\" end=\"lead\"?",
  "date_published": "20170706",
  "title": "RESPONDING TO REMOTE MEDIA CLASSIFICATION QUERIES USING CLASSIFIER MODELS AND CONTEXT PARAMETERS",
  "ipcr_labels": [
    "G06N308",
    "G06F1730"
  ],
  "_processing_info": {
    "original_size": 135047,
    "optimized_size": 3752,
    "reduction_percent": 97.22
  }
}