{
  "date_produced": "20170621",
  "publication_number": "US20170193397A1-20170706",
  "main_ipcr_label": "G06N9900",
  "decision": "PENDING",
  "application_number": "15185869",
  "inventor_list": [
    {
      "inventor_name_last": "Kottha",
      "inventor_name_first": "Samatha",
      "inventor_city": "Bangalore",
      "inventor_state": "",
      "inventor_country": "IN"
    },
    {
      "inventor_name_last": "Rao",
      "inventor_name_first": "Bhavana",
      "inventor_city": "Bangalore",
      "inventor_state": "",
      "inventor_country": "IN"
    },
    {
      "inventor_name_last": "Gjadhav",
      "inventor_name_first": "Suraj",
      "inventor_city": "Mumbai",
      "inventor_state": "",
      "inventor_country": "IN"
    },
    {
      "inventor_name_last": "Deshmukh",
      "inventor_name_first": "Jayati",
      "inventor_city": "Bangalore",
      "inventor_state": "",
      "inventor_country": "IN"
    },
    {
      "inventor_name_last": "Mohamedrasheed",
      "inventor_name_first": "Annervaz Karukapadath",
      "inventor_city": "Trichur",
      "inventor_state": "",
      "inventor_country": "IN"
    },
    {
      "inventor_name_last": "Podder",
      "inventor_name_first": "Sanjay",
      "inventor_city": "Thane",
      "inventor_state": "",
      "inventor_country": "IN"
    },
    {
      "inventor_name_last": "Sengupta",
      "inventor_name_first": "Shubhashis",
      "inventor_city": "Bangalore",
      "inventor_state": "",
      "inventor_country": "IN"
    }
  ],
  "abstract": "Methods, systems, and apparatus, including computer programs encoded on a computer storage medium, for natural language processing of unstructured text are disclosed. In one aspect, a method includes the actions of receiving one or more unstructured data entries that each include one or more sentences, are each associated with an entity, and are each from a user. The actions further include parsing the one or more sentences. The actions further include determining one or more classifications of each unstructured data entry. The actions further include determining a sentiment. The actions further include accessing structured data. The actions further include defining one or more groups of users based on the structured data, wherein each of the one or more groups shares a common characteristic in the structured data. The actions further include determining sentiments to associate with the group.",
  "filing_date": "20160617",
  "patent_number": "None",
  "summary": "<SOH> SUMMARY <EOH>Entities may use natural language processing to identify topics or aspects or both of unstructured, natural language text. The natural language processing may involve identifying topics/aspects associated with the unstructured data and any sentiments expressed towards those topics/aspects as well as overall sentiment. The natural language processing may involve machine learning techniques. The natural language processor may receive data from a machine learning system that was trained using labeled training data that includes identified topics/aspects and corresponding sentiments. The training data may include various text snippets. Additionally, each entity may have complied structured data that may be used to group the sources of the labeled data. Based on the groups of the sources of the labeled data, the sentiments, and the topics/aspects, the system may identify sentiments and topics/aspects that may be common to particular groups. The system then generates a user interface to present the groups and their associated topics/aspects and sentiments. An innovative aspect of the subject matter described in this specification may be implemented in a method that includes the actions of receiving one or more unstructured data entries that each include one or more sentences, are each associated with an entity, and are each from a user; for each unstructured data entry, determining whether to translate the one or more sentences in the unstructured data entry to a common language; for each unstructured data entry, parsing the one or more sentences; based on the parsed one or more sentences, determining one or more classifications of each unstructured data entry; for each of the one or more classifications, determining a sentiment; accessing structured data that is associated with each entity; defining one or more groups of users based on the structured data, where each of the one or more groups shares a common characteristic in the structured data; for e...",
  "date_published": "20170706",
  "title": "REAL TIME ORGANIZATION PULSE GATHERING AND ANALYSIS USING MACHINE LEARNING AND ARTIFICIAL INTELLIGENCE",
  "ipcr_labels": [
    "G06N9900",
    "G06F1728",
    "G06F1727",
    "G06F1730"
  ],
  "_processing_info": {
    "original_size": 69701,
    "optimized_size": 4424,
    "reduction_percent": 93.65
  }
}