{
  "date_produced": "20171207",
  "publication_number": "US20170364814A1-20171221",
  "main_ipcr_label": "G06N504",
  "decision": "PENDING",
  "application_number": "15186023",
  "inventor_list": [
    {
      "inventor_name_last": "Rinehart",
      "inventor_name_first": "Michael D.",
      "inventor_city": "San Jose",
      "inventor_state": "CA",
      "inventor_country": "US"
    }
  ],
  "abstract": "According to one embodiment, a method for assessing whether a first site possesses a selected characteristic, the method comprising training, using a machine-learning process, a classifier to determine, based on web site data corresponding to one or more known web sites, whether the first web site possesses the selected characteristic, wherein the one or more known web pages comprise web pages known to possess the selected characteristic and web pages known not to possess the selected characteristic.",
  "filing_date": "20160617",
  "patent_number": "None",
  "summary": "<SOH> SUMMARY OF THE DISCLOSURE <EOH>According to one embodiment, a method for assessing whether a first site possesses a selected characteristic, the method comprising training, using a machine-learning process, a classifier to determine, based on web site data corresponding to one or more known web sites, whether the first web site possesses the selected characteristic, wherein the one or more known web pages comprise web pages known to possess the selected characteristic and web pages known not to possess the selected characteristic. Certain embodiments may provide one or more technical advantages. For example, an embodiment of the present disclosure may automatically assess the characteristics of unknown web sites thereby reducing the cost associated with the manual review and analysis web site characteristics. As another example, an embodiment of the present disclosure may result a more accurate assessment of the characteristics of a web site. Other technical advantages will be readily apparent to one skilled in the art from the following figures, descriptions, and claims. Moreover, while specific advantages have been enumerated above, various embodiments may include all, some, or none of the enumerated advantages.",
  "date_published": "20171221",
  "title": "SYSTEM AND METHOD FOR ASSESSING CHARACTERISTICS OF WEB SITES",
  "ipcr_labels": [
    "G06N504",
    "G06N9900"
  ],
  "_processing_info": {
    "original_size": 58541,
    "optimized_size": 2307,
    "reduction_percent": 96.06
  }
}