{
  "date_produced": "20161208",
  "publication_number": "US20160371590A1-20161222",
  "main_ipcr_label": "G06N504",
  "decision": "PENDING",
  "application_number": "15184490",
  "inventor_list": [
    {
      "inventor_name_last": "Blackley",
      "inventor_name_first": "Jonathan Seamus",
      "inventor_city": "South Pasadena",
      "inventor_state": "CA",
      "inventor_country": "US"
    }
  ],
  "abstract": "A method is disclosed comprising receiving first data from a vapor device regarding one or more constituents contained in a breath of a user, storing the first data with second data regarding one or more constituents contained in the breath of the user, performing a trend analysis on the first data and the second data to determine a trend of presence of the one or more constituents in the breath of the user over time, determining an impact of the trend on health of the user, determining a dosing regimen of one or more vaporizable materials for the user to inhale, and transmitting the dosing regimen to the vapor device.",
  "filing_date": "20160616",
  "patent_number": "None",
  "summary": "<SOH> SUMMARY <EOH>It is to be understood that both the following general description and the following detailed description are exemplary and explanatory only and are not restrictive. In an aspect, an apparatus is disclosed comprising an intake, configured to receive air exhaled by a user, a sensor, coupled to the intake, configured for detecting a one or more constituents in the received air, a processor, coupled to the sensor, configured for collecting data from the sensor regarding the one or more constituents, and a network access device, coupled to the processor, configured for transmitting the data to a central computing device. In an aspect, a method is disclosed comprising receiving first data from a vapor device regarding one or more constituents contained in a breath of a user, storing the first data with second data regarding one or more constituents contained in the breath of the user, performing a trend analysis on the first data and the second data to determine a trend of presence of the one or more constituents in the breath of the user over time, determining an impact of the trend on health of the user, determining a dosing regimen of one or more vaporizable materials for the user to inhale, and transmitting the dosing regimen to the vapor device. In an aspect, a method is disclosed comprising receiving air exhaled by a user into a breath analysis apparatus, exposing the received air to a sensor, collecting data from the sensor regarding one or more constituents in the received air, and transmitting the data to a central server. Additional advantages will be set forth in part in the description which follows or can be learned by practice. The advantages will be realized and attained by means of the elements and combinations particularly pointed out in the appended claims. It is to be understood that both the foregoing general description and the following detailed description are exemplary and explanatory only and are not restrictive.",
  "date_published": "20161222",
  "title": "Longitudinal Health And Predictive Modeling From Air Analyzer And Treatment System",
  "ipcr_labels": [
    "G06N504",
    "G01N33497"
  ],
  "_processing_info": {
    "original_size": 212300,
    "optimized_size": 3208,
    "reduction_percent": 98.49
  }
}