{
  "decision": "PENDING",
  "application_number": "15181095",
  "date_published": "20171214",
  "date_produced": "20171129",
  "title": "FORCE VECTOR CURSOR CONTROL",
  "filing_date": "20160613",
  "inventor_list": [
    {
      "inventor_name_last": "Geary",
      "inventor_name_first": "Matthew Joseph",
      "inventor_city": "Raleigh",
      "inventor_state": "NC",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Hancock",
      "inventor_name_first": "Lincoln Penn",
      "inventor_city": "Raleigh",
      "inventor_state": "NC",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Luttrell",
      "inventor_name_first": "Wesley Abram",
      "inventor_city": "Raleigh",
      "inventor_state": "NC",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Osborne",
      "inventor_name_first": "Christopher Miles",
      "inventor_city": "Cary",
      "inventor_state": "NC",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Skinner",
      "inventor_name_first": "Jeffrey E.",
      "inventor_city": "Raleigh",
      "inventor_state": "NC",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Sluchak",
      "inventor_name_first": "Thomas John",
      "inventor_city": "Apex",
      "inventor_state": "NC",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Stewart",
      "inventor_name_first": "Aaron Michael",
      "inventor_city": "Raleigh",
      "inventor_state": "NC",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Yu",
      "inventor_name_first": "Jonathan Jen-Wei",
      "inventor_city": "Raleigh",
      "inventor_state": "NC",
      "inventor_country": "US"
    }
  ],
  "ipcr_labels": [
    "G06F30481",
    "G06F30488",
    "G06F3041"
  ],
  "main_ipcr_label": "G06F30481",
  "summary": "<SOH> BRIEF SUMMARY <EOH>An apparatus for controlling a cursor using a force vector input by a user touch is disclosed. A method and computer program product also perform the functions of the apparatus. The apparatus for controlling a cursor using a force vector input by a user touch includes a force sensor operatively coupled to a surface, a processor, and a memory that stores code executable by the processor to: measure a force vector input by a user touch at the surface, the force vector including a magnitude and a direction, translate the magnitude into a cursor velocity, and control movements of a cursor based on the cursor velocity and the determined direction. In one embodiment, measuring the force vector includes the processor determining a finger tilt corresponding to the force vector input and computing a direction component based on the finger tilt. In another embodiment, measuring the force vector includes the processor determining a contact area corresponding to the force vector input, the contact area corresponding to an area of the surface being touched and computing a direction component based on a geometry of the contact area. In certain embodiments, measuring the force vector includes the processor detecting two or more simultaneously input force vectors, selecting a gesture command based on the simultaneously input force vectors, and controlling a user interface based on the selected gesture command. In some embodiments, the apparatus also includes a touch sensor operatively coupled to the surface, the touch sensor measuring a touch location of the user touch. In one such embodiment, the processor identifies a touch location corresponding to the user-input force vector, designates a button region on the surface based on the touch location, and controls a user interface based on one or more touches at the button region. In another such embodiment, the processor dynamically switches between position-based control of the cursor and pressure-based con...",
  "patent_number": "None",
  "abstract": "For controlling a cursor using a force vector input by a user touch, an apparatus is disclosed. A system, method, and program product also perform the functions of the apparatus. The apparatus for controlling a cursor using a force vector input by a user touch includes a force sensor operatively coupled to a surface, a processor, and a memory that stores code executable by the processor to: measure a force vector input by a user touch at the surface, the force vector including a magnitude and a direction, translate the magnitude into a cursor velocity, and control movements of a cursor based on the cursor velocity and the determined direction.",
  "publication_number": "US20170357403A1-20171214",
  "_processing_info": {
    "original_size": 92496,
    "optimized_size": 4262,
    "reduction_percent": 95.39
  }
}