{
  "date_produced": "20171207",
  "publication_number": "US20170364802A1-20171221",
  "main_ipcr_label": "G06N502",
  "decision": "PENDING",
  "application_number": "15186740",
  "inventor_list": [
    {
      "inventor_name_last": "Gordon",
      "inventor_name_first": "Michael S.",
      "inventor_city": "Yorktown Heights",
      "inventor_state": "NY",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Hobson",
      "inventor_name_first": "Stacy Fay",
      "inventor_city": "Poughkeepsie",
      "inventor_state": "NY",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Pickover",
      "inventor_name_first": "Clifford A.",
      "inventor_city": "Yorktown Heights",
      "inventor_state": "NY",
      "inventor_country": "US"
    }
  ],
  "abstract": "An expert recommendation method, system, and non-transitory computer readable medium, include a topic extraction circuit configured to extract a topic of a user input message in real-time, an expert recommending circuit configured to recommend a list including a plurality of experts based on the extracted topic, and an expert ranking circuit configured to order the experts on the list of experts based on an expert rank factor.",
  "filing_date": "20160620",
  "patent_number": "None",
  "summary": "<SOH> SUMMARY <EOH>In view of the technical problem, the inventors have considered a non-abstract improvement to a computer technology via a technical solution to the technical problem in which a system can recommend an expert in real-time while a user is composing a message based on an extracted topic of the message and dynamically updating a ranking of the experts provided. In an exemplary embodiment, the present invention can provide an expert recommendation system, including a topic extraction circuit configured to extract a topic of a user input message in real-time, an expert recommending circuit configured to recommend a list including a plurality of experts based on the extracted topic, and an expert ranking circuit configured to order the experts on the list of experts based on an expert rank factor. Further, in another exemplary embodiment, the present invention can provide an expert recommendation method, including extracting a topic of a user input message in real-time, recommending a list including a plurality of experts based on the extracted topic, and ordering the experts on the list of experts based on an expert rank factor. Even further, in another exemplary embodiment, the present invention can provide a non-transitory computer-readable recording medium recording a expert recommendation program, the program causing a computer to perform: extracting a topic of a user input message in real-time, recommending a list including a plurality of experts based on the extracted topic, and ordering the experts on the list of experts based on an expert rank factor. There has thus been outlined, rather broadly, an embodiment of the invention in order that the detailed description thereof herein may be better understood, and in order that the present contribution to the art may be better appreciated. There are, of course, additional exemplary embodiments of the invention that will be described below and which will form the subject matter of the claims appended ...",
  "date_published": "20171221",
  "title": "SYSTEM, METHOD, AND RECORDING MEDIUM FOR EXPERT RECOMMENDATION WHILE COMPOSING MESSAGES",
  "ipcr_labels": [
    "G06N502",
    "G06F1730",
    "G06Q5000",
    "H04L1258"
  ],
  "_processing_info": {
    "original_size": 48589,
    "optimized_size": 3367,
    "reduction_percent": 93.07
  }
}