{
  "decision": "PENDING",
  "application_number": "15180684",
  "date_published": "20161215",
  "date_produced": "20161130",
  "title": "User Interface For An Analysis And Vapor Dispensing Apparatus",
  "filing_date": "20160613",
  "inventor_list": [
    {
      "inventor_name_last": "Blackley",
      "inventor_name_first": "Jonathan Seamus",
      "inventor_city": "South Pasadena",
      "inventor_state": "CA",
      "inventor_country": "US"
    }
  ],
  "ipcr_labels": [
    "G05B19042",
    "G06F30484",
    "G06Q3006"
  ],
  "main_ipcr_label": "G05B19042",
  "summary": "<SOH> SUMMARY <EOH>It is to be understood that both the following general description and the following detailed description are exemplary and explanatory only and are not restrictive. In an aspect, an apparatus is disclosed comprising a vapor device communication device, configured for communicating with a vapor device, a processor, coupled to the vapor device communication component, configured for generating a user interface for controlling one or more functions of the vapor device via the vapor device communication device, a display device, configured for displaying the user interface, and an input device, configured for receiving an input based on the user interface. In an aspect, a method is disclosed comprising transmitting an authorization request to a computing device, receiving an authorization token from the computing device, transmitting the authorization token to a vapor device, establishing a communication session with the vapor device based on the authorization token, and generating a user interface for controlling one or more functions of the vapor device via the communication session. Additional advantages will be set forth in part in the description which follows or can be learned by practice. The advantages will be realized and attained by means of the elements and combinations particularly pointed out in the appended claims. It is to be understood that both the foregoing general description and the following detailed description are exemplary and explanatory only and are not restrictive.",
  "patent_number": "None",
  "abstract": "An apparatus is disclosed comprising a vapor device communication device, configured for communicating with a vapor device, a processor, coupled to the vapor device communication component, configured for generating a user interface for controlling one or more functions of the vapor device via the vapor device communication device, a display device, configured for displaying the user interface, and an input device, configured for receiving an input based on the user interface.",
  "publication_number": "US20160363917A1-20161215",
  "_processing_info": {
    "original_size": 213513,
    "optimized_size": 2605,
    "reduction_percent": 98.78
  }
}