{
  "date_produced": "20171207",
  "publication_number": "US20170364813A1-20171221",
  "main_ipcr_label": "G06N504",
  "decision": "PENDING",
  "application_number": "15184728",
  "inventor_list": [
    {
      "inventor_name_last": "Boyer",
      "inventor_name_first": "Carol Ann",
      "inventor_city": "Whittier",
      "inventor_state": "NC",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Dell",
      "inventor_name_first": "Jeffrey Pierre",
      "inventor_city": "Morgan Hill",
      "inventor_state": "CA",
      "inventor_country": "US"
    }
  ],
  "abstract": "Embodiments of the present invention provide a system for a managing entity to automatically provide alerts based on tail event analysis. The system may receive input data in real time from vendor data feeds, social media data feeds, and a tail event ledger. The system may then automatically populate surveys, transmit the surveys to responders, and receive survey results from the responders. The survey results may be transmitted to specialists that return a predicted tail event outcome. This predicted tail event outcome is then automatically transmitted to partners, or decision makers, that provide action steps for responding to the predicted tail event outcome. The system may then continuously monitor the input data, identify an indicator of an occurrence of the tail event, and then automatically transmit the action steps to appropriate parties.",
  "filing_date": "20160616",
  "patent_number": "None",
  "summary": "<SOH> BRIEF SUMMARY <EOH>The following presents a summary of certain embodiments of the invention. This summary is not intended to identify key or critical elements of all embodiments nor delineate the scope of any or all embodiments. Its sole purpose is to present certain concepts and elements of one or more embodiments in a summary form as a prelude to the more detailed description that follows. Embodiments of the present invention address the above needs and/or achieve other advantages by providing apparatuses (e.g., a system, computer program product and/or other devices) and methods for a monitoring entity to automatically provide alerts based on tail event analysis. The system embodiments may comprise one or more memory devices having computer readable program code stored thereon, a communication device, and one or more processing devices operatively coupled to the one or more memory devices, wherein the one or more processing devices are configured to execute the computer readable program code to carry out the invention. In computer program product embodiments of the invention, the computer program product comprises at least one non-transitory computer readable medium comprising computer readable instructions for carrying out the invention. Computer implemented method embodiments of the invention may comprise providing a computing system comprising a computer processing device and a non-transitory computer readable medium, where the computer readable medium comprises configured computer program instruction code, such that when said instruction code is operated by said computer processing device, said computer processing device performs certain operations to carry out the invention. For sample, illustrative purposes, system environments will be summarized. The system may involve receiving, in real time, input data comprising third party vendor data feeds, social media data, and tail event ledger data. The system may then identify, based on the received input d...",
  "date_published": "20171221",
  "title": "SYSTEM FOR AUTOMATIC RESPONSES TO PREDICTED TAIL EVENT OUTCOMES",
  "ipcr_labels": [
    "G06N504",
    "G06N700"
  ],
  "_processing_info": {
    "original_size": 107450,
    "optimized_size": 3577,
    "reduction_percent": 96.67
  }
}