{
  "date_produced": "20161116",
  "publication_number": "US20160350663A1-20161201",
  "main_ipcr_label": "G06N504",
  "decision": "REJECTED",
  "application_number": "15181384",
  "inventor_list": [
    {
      "inventor_name_last": "McCord",
      "inventor_name_first": "Alan",
      "inventor_city": "Frisco",
      "inventor_state": "TX",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Unitt",
      "inventor_name_first": "Ashley",
      "inventor_city": "Basingstoke",
      "inventor_state": "",
      "inventor_country": "GB"
    }
  ],
  "abstract": "A system and method for an optimized, self-learning and self-organizing contact center has been developed. This system and method uses principles and tools of information theory, including the latent Dirichlet allocation which reduces information to specific predetermined topics and a distribution of topic related words to infer its hidden, generative underpinnings so to self-organize a contact center, infer its desired electronic versus human make up, and optimally route all customer requests to an electronic resource or a specific human agent best suited to respond to the request for maximal business value per interaction. The system can also infer and respond to changes in customer call center usage.",
  "filing_date": "20160613",
  "patent_number": "None",
  "summary": "<SOH> SUMMARY OF THE INVENTION <EOH>The inventor has developed a system for an optimized, self-learning and self-organizing contact center which uses principles of information theory to infer hidden variables that has led a contact center customer to initiate communication using a specific topic and set of related identifiers to route each customer to the contact center resource best equipped to respond. The invention also uses principles of information theory to predict the knowledge and skill sets that will be needed within the call center structure and to insure that current resources, both electronic and human, are deployed so as to maximize the business efficiency and effectiveness of the call center. Last, the systems use of information theory and continuous monitoring of contact operations allows it to rapidly react to maintain contact center efficacy as an enterprise's product line matures and business practices change. According to a preferred embodiment of the invention, system for an optimized, self-learning and self-organizing contact center comprising: a topic based routing module stored in a memory of and operating on a processor of a computing device and an interaction information optimization module stored in a memory of and operating on a processor of a computing device. Wherein, the topic based routing module: receives requests from contact center customers, infers the topic distribution of the request based upon information theory based algorithms, routes the request to the contact center resource best suited to respond to the request. Wherein the interaction information optimization module: monitors all communication into and out of the contact center, analyzes communication streams for all topics and topic related identifiers, creates optimized relationships between identifiers present in analyzed communications and business value related topics attached to contact center resources using information theory algorithms and machine learning. Accord...",
  "date_published": "20161201",
  "title": "SYSTEM AND METHOD FOR AN OPTIMIZED, SELF-LEARNING AND SELF-ORGANIZING CONTACT CENTER",
  "ipcr_labels": [
    "G06N504",
    "H04M3523",
    "H04M351",
    "G06N9900",
    "G06N700"
  ],
  "_processing_info": {
    "original_size": 57894,
    "optimized_size": 3473,
    "reduction_percent": 94.0
  }
}