{
  "date_produced": "20161109",
  "publication_number": "US20160342906A1-20161124",
  "main_ipcr_label": "G06N9900",
  "decision": "PENDING",
  "application_number": "15181191",
  "inventor_list": [
    {
      "inventor_name_last": "Shaashua",
      "inventor_name_first": "Triinu Magi",
      "inventor_city": "Herzeliya",
      "inventor_state": "",
      "inventor_country": "IL"
    },
    {
      "inventor_name_last": "Shaashua",
      "inventor_name_first": "Ori",
      "inventor_city": "Herzeliya",
      "inventor_state": "",
      "inventor_country": "IL"
    },
    {
      "inventor_name_last": "Palachy",
      "inventor_name_first": "Shay Shimon",
      "inventor_city": "Ramat Gan",
      "inventor_state": "",
      "inventor_country": "IL"
    },
    {
      "inventor_name_last": "Ram",
      "inventor_name_first": "Yoav",
      "inventor_city": "Pardes Hanna- Karkur",
      "inventor_state": "",
      "inventor_country": "IL"
    }
  ],
  "abstract": "A method of consolidating Internet of Things (IoT) devices connected via an IoT network is disclosed. An IoT integration platform implemented by a computer system can collect data from one or more of IoT devices, IoT solution specific server systems, third-party server systems, general-purpose user computing devices, or any combination thereof. The IoT integration platform can label the data based on entity-specific context. The entity-specific context can correspond to a user account, a device, a location, or any combination thereof. The IoT integration platform can generate an entity-specific profile based on the labeled data. The IoT integration platform can generate, based on the entity-specific profile, a situation forecast associated with a target entity and with a timeframe yet to occur.",
  "filing_date": "20160613",
  "patent_number": "None",
  "summary": "<SOH> BRIEF DESCRIPTION OF THE DRAWINGS <EOH>FIG. 1A is a block diagram illustrating vertical solutions provided for connected devices. FIG. 1B is a block diagram illustrating an integration platform operating in conjunction with the vertical solutions. FIG. 2 is a block diagram illustrating an example system environment of an internet of things (IoT) integration platform system. FIG. 3 is a block diagram illustrating the IoT integration platform system. FIG. 4 is an example of an user interface illustrating an active lifeline diagram for a user account on an integration interface, consistent with various embodiments of the disclosed technology FIG. 5 is a diagrammatic representation of a machine in the example form of a computer system within which a set of instructions, for causing the machine to perform any one or more of the methodologies or modules discussed herein, may be executed. FIG. 6 is a diagrammatic representation of a wireless device. FIG. 7 is a flow diagram of a method of data consolidation, consistent with various embodiments of the disclosed technology. FIG. 8 is a flow diagram of a method of interoperable IoT rule management, consistent with various embodiments of the disclosed technology. FIG. 9A is an exemplary screen shot illustrating a rule management interface of an integration platform at a rule activation stage, consistent with various embodiments of the disclosed technology. FIG. 9B is an exemplary screen shot illustrating the rule management interface of the integration platform at a condition selection stage, consistent with various embodiments of the disclosed technology. FIG. 9C is an exemplary screen shot illustrating the rule management interface of the integration at an action selection stage, consistent with various embodiments of the disclosed technology. FIG. 10A is an exemplary screen shot illustrating the consolidation interface showing a correlative insight, consistent with various embodiments of the disclosed technology. FIG....",
  "date_published": "20161124",
  "title": "SITUATION FORECAST MECHANISMS FOR INTERNET OF THINGS INTEGRATION PLATFORM",
  "ipcr_labels": [
    "G06N9900",
    "G06F1730"
  ],
  "_processing_info": {
    "original_size": 142552,
    "optimized_size": 3832,
    "reduction_percent": 97.31
  }
}