{
  "date_produced": "20170125",
  "publication_number": "US20170039471A1-20170209",
  "main_ipcr_label": "G06N308",
  "decision": "PENDING",
  "application_number": "15180310",
  "inventor_list": [
    {
      "inventor_name_last": "OGAWA",
      "inventor_name_first": "Masahiro",
      "inventor_city": "Toyota-shi",
      "inventor_state": "",
      "inventor_country": "JP"
    }
  ],
  "abstract": "A neural network learning device includes a learning unit configured to perform a learning process that learns a neural network using a plurality of learning data sets. The learning process includes a data reading process, a synaptic weight correction process, a neuron generation process, and a neuron removal process. The neural network learning device includes an intermediate layer generation unit configured to perform an intermediate layer generation process. The intermediate layer generation process newly generates an additional intermediate layer including at least one neuron as an intermediate layer of the neural network when a loss function is greater than a predetermined second threshold value after the learning process is performed. When the additional intermediate layer is newly generated by the intermediate layer generation process, the learning unit performs the learning process again, using the neural network in which the additional intermediate layer has been generated.",
  "filing_date": "20160613",
  "patent_number": "None",
  "summary": "<SOH> SUMMARY <EOH>In the related art, the neural network is limited to a sandglass type and the number of neurons in each intermediate layer is fixed. The intermediate layer is extended and the neural network is learned. As a result, the number of intermediate layers is likely to be unnecessarily large. Therefore, in the related art, it is necessary to optimize the structure of a neural network. The invention is to provide a neural network learning device which can optimize the structure of a neural network. According to an aspect of the invention, there is provided a neural network learning device that learns a hierarchical neural network having an input initial structure or a predetermined initial structure. The neural network learning device includes a learning unit configured to perform a learning process that learns the neural network using a plurality of learning data sets. The learning process includes: a data reading process that reads the learning data from a database; a synaptic weight correction process that calculates a loss function of the neural network using the learning data and corrects a synaptic weight of the neural network according to the loss function, when the learning data is read by the data reading process; a neuron generation process that newly generates a neuron in an intermediate layer of the neural network when the loss function is greater than a predetermined first threshold value after the synaptic weight correction process is performed; and a neuron removal process that removes some of the neurons in the intermediate layer when the sum of the synaptic weights of a plurality of neurons in the intermediate layer of the neural network is less than a predetermined reference sum after the synaptic weight correction process is performed. When the neuron is newly generated by the neuron generation process or when some of the neurons are removed by the neuron removal process, the synaptic weight correction process calculates the loss functi...",
  "date_published": "20170209",
  "title": "NEURAL NETWORK LEARNING DEVICE",
  "ipcr_labels": [
    "G06N308",
    "G06N304"
  ],
  "_processing_info": {
    "original_size": 41880,
    "optimized_size": 3527,
    "reduction_percent": 91.58
  }
}