{
  "decision": "ACCEPTED",
  "application_number": "15186707",
  "date_published": "20171130",
  "date_produced": "20171115",
  "title": "HARD DISK MOUNTING DEVICE",
  "filing_date": "20160620",
  "inventor_list": [
    {
      "inventor_name_last": "LIEN",
      "inventor_name_first": "YEN-CHIH",
      "inventor_city": "New Taipei",
      "inventor_state": "",
      "inventor_country": "TW"
    },
    {
      "inventor_name_last": "LAI",
      "inventor_name_first": "TSANG-SEN",
      "inventor_city": "New Taipei",
      "inventor_state": "",
      "inventor_country": "TW"
    },
    {
      "inventor_name_last": "CHEN",
      "inventor_name_first": "CHENG-HUA",
      "inventor_city": "New Taipei",
      "inventor_state": "",
      "inventor_country": "TW"
    }
  ],
  "ipcr_labels": [
    "G06F118",
    "G11B3302"
  ],
  "main_ipcr_label": "G06F118",
  "summary": "<SOH> BRIEF DESCRIPTION OF THE DRAWINGS <EOH>Implementations of the present technology will now be described, by way of example only, with reference to the attached figures. FIG. 1 is an isometric view of a mounting device for a hard disk. FIG. 2 is similar to FIG. 1 , with a top wall omitted. FIG. 3 is an exploded view of the mounting device shown in FIG. 2 . FIG. 4 is a cross-sectional view taken along the line IV-IV of FIG. 2 . FIG. 5 is similar to FIG. 4 , but with a rotatable element pressing against a fastening element. detailed-description description=\"Detailed Description\" end=\"lead\"?",
  "patent_number": "9829939",
  "abstract": "A device for mounting a hard disk in a server or other housing includes a frame, a hard disk, and a rotatable element. The frame defines a receiving space thereon and includes an end wall. The hard disk is slidably received in the receiving space. The hard disk includes a fastening element facing to the end wall. The hard disk is slidably attached to the end wall and the fastening element is locked to the end wall. The rotatable element is attached to the end wall and can rotate from a first position to a second position to abut the fastening element. The rotatable element can be pressed against the fastening element to unlock and the hard disk can be slidably detached from the end wall.",
  "publication_number": "US20170344081A1-20171130",
  "_processing_info": {
    "original_size": 18748,
    "optimized_size": 2118,
    "reduction_percent": 88.7
  }
}