{
  "date_produced": "20170713",
  "publication_number": "US20170213125A1-20170727",
  "main_ipcr_label": "G06N304",
  "decision": "ACCEPTED",
  "application_number": "15184892",
  "inventor_list": [
    {
      "inventor_name_last": "Appuswamy",
      "inventor_name_first": "Rathinakumar",
      "inventor_city": "San Jose",
      "inventor_state": "CA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Flickner",
      "inventor_name_first": "Myron D.",
      "inventor_city": "San Jose",
      "inventor_state": "CA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Modha",
      "inventor_name_first": "Dharmendra S.",
      "inventor_city": "San Jose",
      "inventor_state": "CA",
      "inventor_country": "US"
    }
  ],
  "abstract": "Embodiments of the present invention provide a method for feature extraction comprising generating synaptic connectivity information for a neurosynaptic core circuit. The core circuit comprises one or more electronic neurons, one or more electronic axons, and an interconnect fabric including a plurality of synapse devices for interconnecting the neurons with the axons. The method further comprises initializing the interconnect fabric based on the synaptic connectivity information generated, and extracting a set of features from input received via the electronic axons. The set of features extracted comprises a set of features with reduced correlation.",
  "filing_date": "20160616",
  "patent_number": "10019667",
  "summary": "<SOH> BRIEF SUMMARY <EOH>One embodiment provides a method for feature extraction. The method comprises generating synaptic connectivity information for a neurosynaptic core circuit. The core circuit comprises one or more electronic neurons, one or more electronic axons, and an interconnect fabric including a plurality of synapse devices for interconnecting the neurons with the axons. The method further comprises initializing the interconnect fabric based on the synaptic connectivity information generated, and extracting a set of features from input received via the electronic axons. The set of features extracted comprises a set of features with reduced correlation. Another embodiment provides a method for reducing correlation between features. The method comprises generating synaptic connectivity information for a neurosynaptic core circuit. The core circuit comprises one or more electronic neurons, one or more electronic axons, and an interconnect fabric including a plurality of synapse devices for interconnecting the neurons with the axons. The method further comprises initializing the interconnect fabric based on the synaptic connectivity information generated, receiving multiple input features via the electronic axons, and generating a set of features with reduced correlation for the input features. The set of features is generated by combining the input features based on the synaptic connectivity information generated. Another embodiment provides a neurosynaptic core circuit for feature extraction. The core circuit comprises one or more electronic neurons, one or more electronic axons for receiving input, and an interconnect fabric including a plurality of synapse devices for interconnecting the electronic neurons with the electronic axons. The interconnect fabric is initialized with synaptic connectivity information. The neurons generate output comprising a set of features with reduced correlation extracted from the input received based on the synaptic connect...",
  "date_published": "20170727",
  "title": "TRANSFORM FOR A NEUROSYNAPTIC CORE CIRCUIT",
  "ipcr_labels": [
    "G06N304"
  ],
  "_processing_info": {
    "original_size": 41781,
    "optimized_size": 3504,
    "reduction_percent": 91.61
  }
}