{
  "date_produced": "20170607",
  "publication_number": "US20170177999A1-20170622",
  "main_ipcr_label": "G06N312",
  "decision": "PENDING",
  "application_number": "15192845",
  "inventor_list": [
    {
      "inventor_name_last": "NOVIK",
      "inventor_name_first": "Alesis",
      "inventor_city": "London",
      "inventor_state": "",
      "inventor_country": "GB"
    },
    {
      "inventor_name_last": "SUTAS",
      "inventor_name_first": "Andrius",
      "inventor_city": "London",
      "inventor_state": "",
      "inventor_country": "GB"
    }
  ],
  "abstract": "The present invention relates to an improved method of providing identification of a user or authentication of a user's identity. More particularly, the present invention relates to an improved method of providing identification of a user or authentication of a user's identity using conditional behavioural biometrics. The present invention seeks to provide an enhanced method of authenticating and/or identifying a user identity using conditional behavioural biometrics. According to a first aspect of the present invention, there is provided a method of generating a user profile for use in identifying and/or authenticating a user on a device, the device equipped with one or more sensors, the method comprising: generating a set of data points from sensory data collected by the one or more sensors; clustering the set of data points to produce a set of data clusters; developing a first classifier for the data clusters, the first classifier being operable to assign a further data point derive...",
  "filing_date": "20160624",
  "patent_number": "None",
  "summary": "<SOH> SUMMARY OF THE INVENTION <EOH>The present invention seeks to provide an enhanced method of authenticating and/or identifying a user identity using conditional behavioural biometrics. According to a first aspect of the present invention, there is provided a method of generating a user profile for use in identifying and/or authenticating a user on a device, the device equipped with one or more sensors, the method comprising: generating a set of data points from sensory data collected by the one or more sensors; clustering the set of data points to produce a set of data clusters; developing a first classifier for the data clusters, the first classifier being operable to assign a further data point derived from a further user interaction with the computing device to one of the data clusters; and developing one or more further classifiers for at least one of the data clusters, the further classifier operable to identify and/or authenticate a user identity based on the further data point. According to a second aspect of the invention, there is provided a method of identifying and/or authenticating a user on a device, the device equipped with one or more sensors, the method comprising: generating a data point from sensory data derived from a user interaction with the device; assigning the data point to a cluster of data points using a first classifier, the first classifier developed from a plurality of previous user interactions with the device; and applying a second classifier to the data point, the second classifier being chosen based on the assigned data cluster, and operable to identify and/or authenticate a user identity based on the further data point. By classifying sensory data based on previous user interactions with a computing device, an additional layer of security can be provided over solely using a password or PIN input for security as a device can identify and/or authenticate a user separately to the user providing credentials to identify or authentica...",
  "date_published": "20170622",
  "title": "CONDITIONAL BEHAVIOURAL BIOMETRICS",
  "ipcr_labels": [
    "G06N312",
    "G06F2132"
  ],
  "_processing_info": {
    "original_size": 38200,
    "optimized_size": 3674,
    "reduction_percent": 90.38
  }
}