{
  "decision": "PENDING",
  "application_number": "15195828",
  "date_published": "20171228",
  "date_produced": "20171213",
  "title": "METHODS AND SYSTEMS FOR DETECTING CRACKS IN ILLUMINATED ELECTRONIC DEVICE SCREENS",
  "filing_date": "20160628",
  "inventor_list": [
    {
      "inventor_name_last": "Forutanpour",
      "inventor_name_first": "Babak",
      "inventor_city": "San Diego",
      "inventor_state": "CA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Ploetner",
      "inventor_name_first": "Jeffrey",
      "inventor_city": "San Diego",
      "inventor_state": "CA",
      "inventor_country": "US"
    }
  ],
  "ipcr_labels": [
    "G06T700",
    "G06T740",
    "G06K952",
    "G06K962"
  ],
  "main_ipcr_label": "G06T700",
  "summary": "<SOH> BRIEF DESCRIPTION OF THE DRAWINGS <EOH>FIG. 1 is a schematic diagram illustrating components of a suitable computing environment for implementing various aspects of the present technology. FIG. 2 is a flow diagram of a routine for identifying cracks in an illuminated electronic device screen, in accordance with an embodiment of the relevant technology. FIG. 3A illustrates an image pyramid of an electronic device with multiple layers for use in the routine of FIG. 2 , and FIG. 3B illustrates a variety of kernels for use in the routine of FIG. 2 , in accordance with an embodiment of the relevant technology. FIG. 4 is an isometric view of a machine employing methods and systems in accordance embodiments of the present technology for recycling mobile phones and/or other electronic devices. FIGS. 5A-5D are a series of isometric views of the machine of FIG. 4 with a number of exterior panels removed to illustrate operation of the machine in accordance with an embodiment of the present technology. detailed-description description=\"Detailed Description\" end=\"lead\"?",
  "patent_number": "None",
  "abstract": "Systems and methods for detecting the cracks in illuminated electronic device screens are disclosed. In one embodiment, the method includes receiving an image of an electronic device screen and retrieving a plurality of kernels, each having values corresponding to a line region and a non-line region, with the orientation of the line region and the non-line region differing for each kernel. At least some of the kernels are applied to the image to obtain, at various locations of the image, values corresponding to the line regions and the non-line regions. Based on the values corresponding to the line regions and the non-line regions, cracks are automatically identified in the electronic device screen.",
  "publication_number": "US20170372465A1-20171228",
  "_processing_info": {
    "original_size": 89451,
    "optimized_size": 2545,
    "reduction_percent": 97.15
  }
}