{
  "date_produced": "20161012",
  "publication_number": "US20160314407A1-20161027",
  "main_ipcr_label": "G06N9900",
  "decision": "ACCEPTED",
  "application_number": "15199532",
  "inventor_list": [
    {
      "inventor_name_last": "Bunyk",
      "inventor_name_first": "Paul",
      "inventor_city": "New Westminister",
      "inventor_state": "",
      "inventor_country": "CA"
    },
    {
      "inventor_name_last": "Maibaum",
      "inventor_name_first": "Felix",
      "inventor_city": "Braunscheweig",
      "inventor_state": "",
      "inventor_country": "DE"
    }
  ],
  "abstract": "A system may include first and second qubits that cross one another and a first coupler having a perimeter that encompasses at least a part of the portions of the first and second qubits, the first coupler being operable to ferromagnetically or anti-ferromagnetically couple the first and the second qubits together. A multi-layered computer chip may include a first plurality N of qubits laid out in a first metal layer, a second plurality M of qubits laid out at least partially in a second metal layer that cross each of the qubits of the first plurality of qubits, and a first plurality N times M of coupling devices that at least partially encompasses an area where a respective pair of the qubits from the first and the second plurality of qubits cross each other.",
  "filing_date": "20160630",
  "patent_number": "9779360",
  "summary": "<SOH> BRIEF SUMMARY <EOH>A system may be summarized as including a first qubit, a second qubit, wherein a portion of the first qubit crosses the second qubit, and a coupler, having a perimeter, providing a coupling between the first qubit and the second qubit and proximate to the portion of the first qubit that crosses the second qubit. The first qubit may cross the second qubit substantially perpendicularly. The perimeter of the coupler may encompass at least a part of the portion of the first qubit that crosses the second qubit. The perimeter of the coupler may encompass a first portions of the first qubit that does not cross the second qubit and a second portion of the second qubit that does not cross the first qubit. The perimeter of the coupler may include a first arm extending substantially parallel to a length of the first qubit and a second arm extending substantially parallel to a length of the second qubit. The first qubit may include a first qubit loop of superconducting material that is superconductive at a first critical temperature and at least one Josephson junction, the second qubit includes a second qubit loop of superconducting material that is superconductive at a second critical temperature and at least one Josephson junction, and the coupler includes a coupling loop of superconducting material that is superconductive at a third critical temperature. The coupling loop may be interrupted by at least one Josephson junction. The coupler may be on a separate layer from the first and the second qubits. The coupler may be on a same layer as one of the first or the second qubits. The first coupler may be operable to at least one of ferromagnetically, anti-ferromagnetically and transversely couple the first qubit and the second qubit. A multi-layered computer chip may be summarized as a first plurality N of qubits laid out at least partially in a first metal layer, a second plurality M of qubits laid out at least partially in a second metal layer; each o...",
  "date_published": "20161027",
  "title": "SYSTEMS, DEVICES, AND METHODS FOR ANALOG PROCESSING",
  "ipcr_labels": [
    "G06N9900",
    "G06F1582"
  ],
  "_processing_info": {
    "original_size": 124074,
    "optimized_size": 3479,
    "reduction_percent": 97.2
  }
}