{
  "decision": "PENDING",
  "application_number": "15199276",
  "date_published": "20180104",
  "date_produced": "20171219",
  "title": "INPUT DEVICE RECEIVER WITH DELTA-SIGMA MODULATOR",
  "filing_date": "20160630",
  "inventor_list": [
    {
      "inventor_name_last": "BOHANNON",
      "inventor_name_first": "Eric Scott",
      "inventor_city": "Henrietta",
      "inventor_state": "NY",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "BELL, JR.",
      "inventor_name_first": "Marshall J.",
      "inventor_city": "Dripping Springs",
      "inventor_state": "TX",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "YANG",
      "inventor_name_first": "Yihong",
      "inventor_city": "Lubbock",
      "inventor_state": "TX",
      "inventor_country": "US"
    }
  ],
  "ipcr_labels": [
    "G06F3041"
  ],
  "main_ipcr_label": "G06F3041",
  "summary": "<SOH> SUMMARY <EOH>One embodiment described herein is a processing system for an input device comprising a plurality of sensor electrodes. The processing system comprises a delta-sigma modulator comprising one or more input nodes configured to receive a signal based on a sensor signal received from at least a first sensor electrode of the plurality of sensor electrodes, and an integrator coupled with the one or more input nodes and configured to produce an integration signal. The delta-sigma modulator further comprises a quantizer coupled with an output of the integrator and configured to quantize the integration signal and a feedback digital-to-analog converter (DAC) controlled based by the quantizer. The processing system further comprises a digital filter coupled with an output of the delta-sigma modulator and configured to mitigate a quantization noise of the quantizer. Another embodiment described herein is an input device, comprising a plurality of sensor electrodes, and a processing system coupled with the plurality of sensor electrodes. The processing system comprises a delta-sigma modulator comprising one or more input nodes configured to receive a signal based on a sensor signal received from at first sensor electrode of the plurality of sensor electrodes. The delta-sigma modulator further comprises an integrator coupled with the one or more input nodes and configured to produce an integration signal, a quantizer coupled with an output of the integrator and configured to quantize the integration signal, and a feedback digital-to-analog converter (DAC) controlled based by the quantizer. The processing system further comprises a digital filter coupled with an output of the delta-sigma modulator and configured to mitigate a quantization noise of the quantizer. Another embodiment described herein is a method comprising receiving, at one or more input nodes, a sensor signal from a first sensor electrode of a plurality of sensor electrodes. The method further co...",
  "patent_number": "None",
  "abstract": "A processing system, and associated input device and method are disclosed suitable for reducing a receiver size within the input device. The processing system comprises a delta-sigma modulator comprising one or more input nodes configured to receive a signal based on a sensor signal received from at least a first sensor electrode of the plurality of sensor electrodes. The delta-sigma modulator further comprises an integrator coupled with the one or more input nodes and configured to produce an integration signal, a quantizer coupled with an output of the integrator and configured to quantize the integration signal, and a feedback digital-to-analog converter (DAC) controlled based by the quantizer. The processing system further comprises a digital filter coupled with an output of the delta-sigma modulator and configured to mitigate a quantization noise of the quantizer.",
  "publication_number": "US20180004317A1-20180104",
  "_processing_info": {
    "original_size": 82610,
    "optimized_size": 3731,
    "reduction_percent": 95.48
  }
}