{
  "date_produced": "20170607",
  "publication_number": "US20170178027A1-20170622",
  "main_ipcr_label": "G06N9900",
  "decision": "PENDING",
  "application_number": "15198711",
  "inventor_list": [
    {
      "inventor_name_last": "Duggan",
      "inventor_name_first": "Desmond",
      "inventor_city": "San Francisco",
      "inventor_state": "CA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Zhu",
      "inventor_name_first": "Qian",
      "inventor_city": "Mountain View",
      "inventor_state": "CA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Tung",
      "inventor_name_first": "Teresa",
      "inventor_city": "San Jose",
      "inventor_state": "CA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Kang",
      "inventor_name_first": "Jaeyoung Christopher",
      "inventor_city": "Berkeley",
      "inventor_state": "CA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Sun",
      "inventor_name_first": "Wenjia",
      "inventor_city": "Hornsby",
      "inventor_state": "",
      "inventor_country": "AU"
    }
  ],
  "abstract": "A machine provides a system and interface to allow domain experts and other users to develop, deploy, and iterate on analytical models. The machine facilitates building, deploying, and/or training analytical models by, e.g., exposing analytical model configuration parameters to a user while abstracting model building and model deployment activities. The machine can also determine resource loads or execution times for various analytical models and can schedule model execution accordingly. The machine also provides a dynamically reconfigurable user interface for controlling the system.",
  "filing_date": "20160630",
  "patent_number": "None",
  "summary": "<SOH> BRIEF DESCRIPTION OF THE DRAWINGS <EOH>FIG. 1 shows an example machine for implementing machine learning. FIG. 2 shows an example specific system implementation for the machine. FIG. 3 shows further detail of the example specific system implementation shown in FIG. 2 . FIG. 4 shows a flow diagram of logic that the machine may implement. FIG. 5 shows another flow diagram of logic that the machine may implement. FIG. 6 shows another flow diagram of logic that the machine may implement. FIG. 7 shows an example graphical user interface. FIG. 8 shows a variation of the example graphical user interface of FIG. 7 . FIG. 9 shows another variation of the example graphical user interface of FIG. 7 . FIG. 10 shows another flow diagram of logic that the machine may implement. FIG. 11 shows another flow diagram of logic that the machine may implement. FIG. 12 shows another flow diagram of logic that the machine may implement. detailed-description description=\"Detailed Description\" end=\"lead\"?",
  "date_published": "20170622",
  "title": "MACHINE FOR DEVELOPMENT AND DEPLOYMENT OF ANALYTICAL MODELS",
  "ipcr_labels": [
    "G06N9900",
    "G06F1730"
  ],
  "_processing_info": {
    "original_size": 107380,
    "optimized_size": 2746,
    "reduction_percent": 97.44
  }
}