{
  "date_produced": "20171213",
  "publication_number": "US20170372212A1-20171228",
  "main_ipcr_label": "G06N700",
  "decision": "PENDING",
  "application_number": "15195916",
  "inventor_list": [
    {
      "inventor_name_last": "Zasadzinski",
      "inventor_name_first": "Michal",
      "inventor_city": "Olsztyn",
      "inventor_state": "",
      "inventor_country": "PL"
    },
    {
      "inventor_name_last": "Solé Simó",
      "inventor_name_first": "Marc",
      "inventor_city": "Barcelona",
      "inventor_state": "",
      "inventor_country": "ES"
    },
    {
      "inventor_name_last": "Muntés-Mulero",
      "inventor_name_first": "Victor",
      "inventor_city": "Barcelona",
      "inventor_state": "",
      "inventor_country": "ES"
    }
  ],
  "abstract": "A root cause analysis system utilizes ACs corresponding to component types in a network to construct a diagnosis model. The system generates the ACs based on component models for each component type in the network and may perform offline evaluation of the ACs using determined conditional probabilities and potential state values and cache the results. When an issue is identified at a component, the system uses a relational schema to determine a set of components on which the component depends and creates a diagnosis model for performing root cause analysis. The diagnosis model includes the component type ACs corresponding to each of the components identified in the relational schema. The system populates the diagnosis model with conditional probabilities and observed state values determined from event indications generated by the components. The system outputs a most probable explanation of the issue based on evaluation of the diagnosis model.",
  "filing_date": "20160628",
  "patent_number": "None",
  "summary": "<SOH> BRIEF DESCRIPTION OF THE DRAWINGS <EOH>Aspects of the disclosure may be better understood by referencing the accompanying drawings. FIG. 1 depicts an example system for performing root cause analysis using a diagnosis model. FIG. 2 depicts a flow chart with example operations for performing root cause analysis using a diagnosis model. FIG. 3 depicts a flow chart with example operations for generating a diagnosis model. FIG. 4 illustrates an example transformation from a whole network representation to component models. FIG. 5 illustrates an example transformation from a component model to a diagnosis model. FIG. 6 depicts graphs illustrating performance of the above-described root cause analysis techniques in comparison to conventional approaches of model-based root cause analysis. FIG. 7 depicts an example computer system with a root cause analyzer that includes a diagnosis model generator. detailed-description description=\"Detailed Description\" end=\"lead\"?",
  "date_published": "20171228",
  "title": "MODEL BASED ROOT CAUSE ANALYSIS",
  "ipcr_labels": [
    "G06N700",
    "G06N9900"
  ],
  "_processing_info": {
    "original_size": 78454,
    "optimized_size": 2781,
    "reduction_percent": 96.46
  }
}