{
  "date_produced": "20171213",
  "publication_number": "US20170372223A1-20171228",
  "main_ipcr_label": "G06N9900",
  "decision": "PENDING",
  "application_number": "15192509",
  "inventor_list": [
    {
      "inventor_name_last": "VAUGHN",
      "inventor_name_first": "ROBERT L.",
      "inventor_city": "PORTLAND",
      "inventor_state": "OR",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "JOHNSON",
      "inventor_name_first": "JENNIFER N.",
      "inventor_city": "WEST SACRAMENTO",
      "inventor_state": "CA",
      "inventor_country": "US"
    }
  ],
  "abstract": "A mechanism is described for facilitating smart crowd-sourced automatic indoor discovery and mapping according to one embodiment. A method of embodiments, as described herein, includes collecting data relating to a facility, where the data is based on one or more of movement data, contextual data, and observation data relating to at least one of an indoor space and one or more users of the indoor space. The method may further include generating one or more dynamic profiles of the indoor space and the occupants, and building a map of the indoor space based on the one or more dynamic profiles.",
  "filing_date": "20160624",
  "patent_number": "None",
  "summary": "<SOH> BRIEF DESCRIPTION OF THE DRAWINGS <EOH>Embodiments are illustrated by way of example, and not by way of limitation, in the figures of the accompanying drawings in which like reference numerals refer to similar elements. FIG. 1 illustrates a computing device employing a smart mapping mechanism according to one embodiment. FIG. 2 illustrates a smart mapping mechanism according to one embodiment. FIG. 3A illustrates a use-case scenario according to one embodiment. FIG. 3B illustrates a use-case scenario according to one embodiment. FIG. 3C illustrates a table according to one embodiment. FIG. 4A illustrates a method for facilitating smart crowd-sourced mapping according to one embodiment. FIG. 4B illustrates a method for facilitating smart crowd-sourced mapping according to one embodiment. FIG. 5 illustrates computer environment suitable for implementing embodiments of the present disclosure according to one embodiment. FIG. 6 illustrates a method for facilitating dynamic targeting of users and communicating of message according to one embodiment. detailed-description description=\"Detailed Description\" end=\"lead\"?",
  "date_published": "20171228",
  "title": "SMART CROWD-SOURCED AUTOMATIC INDOOR DISCOVERY AND MAPPING",
  "ipcr_labels": [
    "G06N9900",
    "G06F1730",
    "G06F1750"
  ],
  "_processing_info": {
    "original_size": 114290,
    "optimized_size": 2467,
    "reduction_percent": 97.84
  }
}