{
  "date_produced": "20170316",
  "publication_number": "US20170091649A1-20170330",
  "main_ipcr_label": "G06N9900",
  "decision": "PENDING",
  "application_number": "15199582",
  "inventor_list": [
    {
      "inventor_name_last": "Clarke",
      "inventor_name_first": "David",
      "inventor_city": "College Park",
      "inventor_state": "MD",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Sau",
      "inventor_name_first": "Jay Deep",
      "inventor_city": "Rockville",
      "inventor_state": "MD",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Das Sarma",
      "inventor_name_first": "Sankar",
      "inventor_city": "College Park",
      "inventor_state": "MD",
      "inventor_country": "US"
    }
  ],
  "abstract": "Example methods and mechanisms are described herein for implementing and adiabatically operating a topological quantum computing (TQC) phase gate that complements the existing Clifford operations, and thereby allows universal quantum computation with Majorana systems. Further embodiments include a testing system for the phase gate that is feasible with Majorana zero modes and demonstrates violations of the CHSH-Bell inequality. Further, the design used for the testing of the inequality leads directly to a practical platforms for performing universal TQC with Majorana wires in which explicit braiding need never occur. Thus, certain embodiments of the disclosed technology involve three synergistically connected aspects of anyonic TQC the context of the currently active area of using MZMs for topological quantum computation): a practical phase gate for universal topological quantum computation using MZMs, a precise protocol (using CHSH inequality) for testing that the desired gate operati...",
  "filing_date": "20160630",
  "patent_number": "None",
  "summary": "<SOH> SUMMARY <EOH>Disclosed herein are representative embodiments of methods, apparatus, and systems for quantum computing, and in particular for quantum computing using a universal topological quantum computer. The disclosed methods, apparatus, and systems should not be construed as limiting in any way. In this disclosure, a new type of phase gate is introduced for already existing semiconductor-based Majorana wire systems. Additionally, embodiments disclosed herein demonstrate how this phase gate may be benchmarked using CHSH measurements. In particular embodiments, systems and techniques are disclosed that use a “measurement-only” approach that bypasses the need for explicit Majorana braiding. This approach may be scaled beyond the two-qubit system used for CHSH violations, leading to a well defined platform for universal fault-tolerant quantum computation using Majorana zero modes. Certain example embodiments concern a method for operating an adjustable phase gate in a quantum circuit, the adjustable phase gate comprising a stationary pair of Ising anyons. Example implementations comprise the acts of causing a mobile Ising anyon to pass through the adjustable phase gate, thereby creating a targeted phase change in the stationary pair of Ising anyons; and controlling the mobile Ising anyon as the mobile Ising anyon passes through the adjustable phase gate so that the mobile Ising anyon has a complex amplitude during passage. Further, the controlling is performed such that the targeted phase change experienced by the stationary pair of Ising anyons is between 0 and π or 0 and −π. In particular implementations, the controlling comprises performing one or more of: (a) adjusting a gate voltage of one or more gates capacitively coupled to one or more superconducting islands that form the adjustable phase gate, (b) adjusting a capacitance of the one or more superconducting islands; or (c) adjusting a strength of at least one Josephson junction relative to at least one...",
  "date_published": "20170330",
  "title": "ADIABATIC PHASE GATES IN PARITY-BASED QUANTUM COMPUTERS",
  "ipcr_labels": [
    "G06N9900",
    "G06F1582"
  ],
  "_processing_info": {
    "original_size": 97259,
    "optimized_size": 3887,
    "reduction_percent": 96.0
  }
}