{
  "decision": "PENDING",
  "application_number": "15193401",
  "date_published": "20161020",
  "date_produced": "20161005",
  "title": "DISTRIBUTED SCRIPTING FOR PRESENTATIONS WITH TOUCH SCREEN DISPLAYS",
  "filing_date": "20160627",
  "inventor_list": [
    {
      "inventor_name_last": "Hariton",
      "inventor_name_first": "Nicholas T.",
      "inventor_city": "Los Angeles",
      "inventor_state": "CA",
      "inventor_country": "US"
    }
  ],
  "ipcr_labels": [
    "G06F30484",
    "G06F1730",
    "G06F30481",
    "H04L2906",
    "G06F30488",
    "G06F1724"
  ],
  "main_ipcr_label": "G06F30484",
  "summary": "<SOH> SUMMARY OF THE INVENTION <EOH>A live presentation may be prepared and displayed by providing a primary scripting room for preparing a presentation script and a control computer in the primary scripting computer for use by a control operator to view and/or edit possible contributions to the presentation script and for saving the presentation script being prepared. At least one remote scripting room may be connected to the primary scripting room by network to form a virtual scripting room therewith. A remote computer may be provided in the remote scripting room for operation by a contributor to provide possible contributions to the presentation script viewable by the remote operator. At least portions of the saved scripted presentation may be presented on a display computer as the live presentation.",
  "patent_number": "None",
  "abstract": "A live presentation may be prepared and displayed by providing a primary scripting room for preparing a presentation script and a control computer in the primary scripting computer for use by a control operator to view and/or edit possible contributions to the presentation script and for saving the presentation script being preparing. At least one remote scripting room may be connected to the primary scripting room by network to form a virtual scripting room therewith. A remote computer may be provided in the remote scripting room for operation by a contributor to provide possible contributions to the presentation script viewable by the remote operator. At least portions of the saved scripted presentation may be presented on a display computer as the live presentation.",
  "publication_number": "US20160306516A1-20161020",
  "_processing_info": {
    "original_size": 59602,
    "optimized_size": 2219,
    "reduction_percent": 96.28
  }
}