{
  "decision": "PENDING",
  "application_number": "15196183",
  "date_published": "20180104",
  "date_produced": "20171219",
  "title": "SCHEDULING REQUESTS IN AN EXECUTION ENVIRONMENT",
  "filing_date": "20160629",
  "inventor_list": [
    {
      "inventor_name_last": "Nasser",
      "inventor_name_first": "Samir A.",
      "inventor_city": "Durham",
      "inventor_state": "NC",
      "inventor_country": "US"
    }
  ],
  "ipcr_labels": [
    "G06F948"
  ],
  "main_ipcr_label": "G06F948",
  "summary": "<SOH> SUMMARY <EOH>According to an embodiment of this disclosure, a computer-implemented method includes receiving a plurality of requests. Resource utilization is determined for two or more resources in an execution environment. An at-risk resource is identified, from among the two or more resources, with highest utilization among the two or more resources. The method further includes determining, by a computer processor, a subset of requests to be approved that are estimated to have lowest impact on the at-risk resource, based at least in part on historical resource utilization applicable to one or more request types of the plurality of requests. The subset of requests is approved for processing by the execution environment, where the subset of requests excludes one or more unapproved requests. The one or more unapproved requests are held in a waiting queue in lieu of processing the one or more unapproved requests, responsive to the one or more unapproved requests not being approved. In another embodiment, a system includes a memory having computer readable instructions and one or more processors for executing the computer readable instructions. The computer readable instructions include receiving a plurality of requests. Resource utilization is determined for two or more resources in an execution environment. An at-risk resource is identified, from among the two or more resources, with highest utilization among the two or more resources. The computer readable instructions further include determining a subset of requests to be approved that are estimated to have lowest impact on the at-risk resource, based at least in part on historical resource utilization applicable to one or more request types of the plurality of requests. The subset of requests is approved for processing by the execution environment, where the subset of requests excludes one or more unapproved requests. The one or more unapproved requests are held in a waiting queue in lieu of processing the o...",
  "patent_number": "None",
  "abstract": "A computer-implemented method includes receiving a plurality of requests. Resource utilization is determined for two or more resources in an execution environment. An at-risk resource is identified, from among the two or more resources, with highest utilization among the two or more resources. The method further includes determining, by a computer processor, a subset of requests to be approved that are estimated to have lowest impact on the at-risk resource, based at least in part on historical resource utilization applicable to one or more request types of the plurality of requests. The subset of requests is approved for processing by the execution environment, where the subset of requests excludes one or more unapproved requests. The one or more unapproved requests are held in a waiting queue in lieu of processing the one or more unapproved requests, responsive to the one or more unapproved requests not being approved.",
  "publication_number": "US20180004569A1-20180104",
  "_processing_info": {
    "original_size": 51487,
    "optimized_size": 3469,
    "reduction_percent": 93.26
  }
}