{
  "date_produced": "20161005",
  "publication_number": "US20160307111A1-20161020",
  "main_ipcr_label": "G06N700",
  "decision": "PENDING",
  "application_number": "15194782",
  "inventor_list": [
    {
      "inventor_name_last": "Baughman",
      "inventor_name_first": "Aaron K.",
      "inventor_city": "Silver Spring",
      "inventor_state": "MD",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Boinodiris",
      "inventor_name_first": "Phaedra K.",
      "inventor_city": "Apex",
      "inventor_state": "NC",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Graham",
      "inventor_name_first": "Barry M.",
      "inventor_city": "Silver Spring",
      "inventor_state": "MD",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Vane",
      "inventor_name_first": "Russell R.",
      "inventor_city": "Herndon",
      "inventor_state": "VA",
      "inventor_country": "US"
    }
  ],
  "abstract": "A system, method and program product for optimizing a team to solve a problem. The system includes: a team building system for building a fundamental analytic team from a database of analysts to solve an inputted problem, wherein the fundamental analytic team includes at least one cluster of analysts characterized with specificity and at least one cluster of analysts characterized with sensitivity; and a problem analysis system that collects sensor data from the fundamental analytic team operating within an immersive environment, wherein the problem analysis system includes a system for evaluating the sensor data to identify a bias condition from the fundamental analytic team, and includes a system for altering variables in the immersive environment in response to a detected bias condition.",
  "filing_date": "20160628",
  "patent_number": "None",
  "summary": "<SOH> BRIEF SUMMARY <EOH>In a first aspect, the invention provides a system for optimizing a team to solve a problem, comprising: a team building system for building a fundamental analytic team from a database of analysts to solve an inputted problem, wherein the fundamental analytic team includes at least one cluster of analysts characterized with specificity and at least one cluster of analysts characterized with sensitivity; and a problem analysis system that collects sensor data from the fundamental analytic team operating within an immersive environment, wherein the problem analysis system includes a system for evaluating the sensor data to identify a bias condition from the fundamental analytic team, and includes a system for altering variables in the immersive environment in response to a detected bias condition. In a second aspect, the invention provides a program product stored on a computer readable storage medium for optimizing a team to solve a problem, comprising: program code configured for building a fundamental analytic team from a database of analysts to solve an inputted problem, wherein the fundamental analytic team includes at least one cluster of analysts characterized with specificity and at least one cluster of analysts characterized with sensitivity; and program code configured for collecting sensor data from the fundamental analytic team operating within an immersive environment, including program code configured for evaluating the sensor data to identify a bias condition from the fundamental analytic team, and program code configured for altering variables in the immersive environment in response to a detected bias condition. In a third aspect, the invention provides a method for optimizing a team to solve a problem, comprising: building a fundamental analytic team from a database of analysts to solve an inputted problem, wherein the fundamental analytic team includes at least one cluster of analysts characterized with specificity and at le...",
  "date_published": "20161020",
  "title": "SYSTEM AND METHOD FOR OPTIMIZING TEAMS",
  "ipcr_labels": [
    "G06N700",
    "G06N9900",
    "G06N504"
  ],
  "_processing_info": {
    "original_size": 48781,
    "optimized_size": 3809,
    "reduction_percent": 92.19
  }
}