{
  "date_produced": "20171213",
  "publication_number": "US20170372224A1-20171228",
  "main_ipcr_label": "G06N9900",
  "decision": "PENDING",
  "application_number": "15195347",
  "inventor_list": [
    {
      "inventor_name_last": "REIMANN",
      "inventor_name_first": "Johan Michael",
      "inventor_city": "Clifton Park",
      "inventor_state": "NY",
      "inventor_country": "US"
    }
  ],
  "abstract": "A method for imputing multivariate-time series data in a predictive model includes performing historical training of the predictive model by accessing data element information obtained from a real world physical asset, the data element information representing operational characteristics or measurements of the real world physical asset, examining configuration details of the real world physical asset, evaluating an expressiveness of the predictive model by comparing the predicative model to the configuration details, developing the model to express the configuration details, training the developed model by running scenarios based on the data element information, comparing error metrics between a model prediction and a corresponding one of the data element information, deploying the model if the error metrics are within predetermined parameters, and retraining the model if the error metrics are outside the predetermined parameters. A non-transitory computer readable medium and a system ...",
  "filing_date": "20160628",
  "patent_number": "None",
  "summary": "<SOH> BRIEF DESCRIPTION OF THE DRAWINGS <EOH>FIG. 1 depicts a system for implementing deep learning techniques to impute missing multivariate time series data in accordance with embodiments; and FIG. 2 depicts a process for implementing deep learning techniques in accordance with embodiments. detailed-description description=\"Detailed Description\" end=\"lead\"?",
  "date_published": "20171228",
  "title": "DEEP LEARNING FOR IMPUTATION OF INDUSTRIAL MULTIVARIATE TIME-SERIES",
  "ipcr_labels": [
    "G06N9900",
    "G06N502"
  ],
  "_processing_info": {
    "original_size": 19558,
    "optimized_size": 1945,
    "reduction_percent": 90.06
  }
}