{
  "date_produced": "20171219",
  "publication_number": "US20180005133A1-20180104",
  "main_ipcr_label": "G06N9900",
  "decision": "PENDING",
  "application_number": "15197854",
  "inventor_list": [
    {
      "inventor_name_last": "Caffrey",
      "inventor_name_first": "James M.",
      "inventor_city": "Poughkeepsie",
      "inventor_state": "NY",
      "inventor_country": "US"
    }
  ],
  "abstract": "Examples of techniques for determining an interval duration and a training period length for log anomaly detection are disclosed. In one example implementation according to aspects of the present disclosure, a computer-implemented method may include: determining, by a processing resource, an interval duration for a time series from a plurality of message IDs; and determining, by the processing resource, a training period length based on the interval duration.",
  "filing_date": "20160630",
  "patent_number": "None",
  "summary": "<SOH> SUMMARY <EOH>According to examples of the present disclosure, techniques including methods, systems, and/or computer program products for determining an interval duration and a training period length for log anomaly detection are provided. An example method may include: determining, by a processing resource, an interval duration for a time series from a plurality of message IDs; and determining, by the processing resource, a training period length based on the interval duration. Additional features and advantages are realized through the techniques of the present disclosure. Other aspects are described in detail herein and are considered a part of the disclosure. For a better understanding of the present disclosure with the advantages and the features, refer to the following description and to the drawings.",
  "date_published": "20180104",
  "title": "DETERMINE AN INTERVAL DURATION AND A TRAINING PERIOD LENGTH FOR LOG ANOMALY DETECTION",
  "ipcr_labels": [
    "G06N9900",
    "G06F2155"
  ],
  "_processing_info": {
    "original_size": 33756,
    "optimized_size": 1878,
    "reduction_percent": 94.44
  }
}