{
  "date_produced": "20161005",
  "publication_number": "US20160307116A1-20161020",
  "main_ipcr_label": "G06N9900",
  "decision": "PENDING",
  "application_number": "15195380",
  "inventor_list": [
    {
      "inventor_name_last": "Kaushal",
      "inventor_name_first": "Sanjeev",
      "inventor_city": "San Jose",
      "inventor_state": "CA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Patel",
      "inventor_name_first": "Sukesh Janubhai",
      "inventor_city": "Cupertino",
      "inventor_state": "CA",
      "inventor_country": "US"
    }
  ],
  "abstract": "A system and method for learning and/or optimizing processes related to semiconductor manufacturing is provided. A learning component generates a set of candidate process models based on process data associated with one or more fabrication tools. The learning component also selects a particular process model from the set of candidate process models that is associated with lowest error. An optimization component generates a set of candidate solutions associated with the particular process model. The optimization component also selects a particular solution from the set of candidate solutions based on a target output value and an output value associated with the particular solution.",
  "filing_date": "20160628",
  "patent_number": "None",
  "summary": "<SOH> SUMMARY <EOH>The following presents a simplified summary of the specification in order to provide a basic understanding of some aspects of the specification. This summary is not an extensive overview of the specification. It is intended to neither identify key or critical elements of the specification, nor delineate any scope of the particular implementations of the specification or any scope of the claims. Its sole purpose is to present some concepts of the specification in a simplified form as a prelude to the more detailed description that is presented later. In accordance with an implementation, a system includes a learning component and an optimization component. The learning component generates a set of candidate process models based on process data associated with one or more fabrication tools, and selects a particular process model from the set of candidate process models that is associated with lowest error. The optimization component generates a set of candidate solutions associated with the particular process model, and selects a particular solution from the set of candidate solutions based on a target output value and an output value associated with the particular solution In accordance with another implementation, a method provides for generating a set of candidate process models based on process data associated with one or more fabrication tools, generating a quality value for each candidate process model in the set of candidate process models, selecting a particular process model from the set of candidate process models based on the quality value associated with each candidate process model in the set of candidate process models, generating a set of candidate solutions associated with the particular process model, and selecting a particular solution from the set of candidate solutions based on a target output value and an output value associated with the particular solution. In accordance with yet another implementation, a computer-readable medi...",
  "date_published": "20161020",
  "title": "SYSTEM AND METHOD FOR LEARNING AND/OR OPTIMIZING MANUFACTURING PROCESSES",
  "ipcr_labels": [
    "G06N9900",
    "G05B19418"
  ],
  "_processing_info": {
    "original_size": 131112,
    "optimized_size": 3421,
    "reduction_percent": 97.39
  }
}