{
  "date_produced": "20171213",
  "publication_number": "US20170372220A1-20171228",
  "main_ipcr_label": "G06N9900",
  "decision": "PENDING",
  "application_number": "15190487",
  "inventor_list": [
    {
      "inventor_name_last": "Krishnamurthy",
      "inventor_name_first": "Lakshminarayanan",
      "inventor_city": "Round Rock",
      "inventor_state": "TX",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Parameswaran",
      "inventor_name_first": "Niyati",
      "inventor_city": "Mountain View",
      "inventor_state": "CA",
      "inventor_country": "US"
    }
  ],
  "abstract": "A computer-implemented method includes creating a classifier by: training a machine learning model using two or more tasks, wherein the tasks lie in two or more domains; including in the machine learning model at least one attribute common to at least two of said two or more domains; including in the machine learning model at least one latent feature that affects at least two of the two or more tasks that fall within one of the at least two domains; and constructing the classifier based on said machine learning model. The computer-implemented method further includes applying the classifier to at least one operational task.",
  "filing_date": "20160623",
  "patent_number": "None",
  "summary": "<SOH> SUMMARY <EOH>A computer-implemented method includes creating a classifier by: training a machine learning model using two or more tasks, wherein the two or more tasks lie in two or more domains; including in the machine learning model at least one attribute common to at least two of said two or more domains; including in the machine learning model at least one latent feature that affects at least two of the two or more tasks that fall within one of the at least two domains; and constructing the classifier based on said machine learning model. The computer-implemented method further includes applying the classifier to at least one operational task.",
  "date_published": "20171228",
  "title": "COGNITIVE MACHINE LEARNING CLASSIFIER GENERATION",
  "ipcr_labels": [
    "G06N9900",
    "G06N504"
  ],
  "_processing_info": {
    "original_size": 62627,
    "optimized_size": 2013,
    "reduction_percent": 96.79
  }
}