{
  "decision": "ACCEPTED",
  "application_number": "15195486",
  "date_published": "20161020",
  "date_produced": "20161005",
  "title": "BANKING MACHINE CONTROLLED RESPONSIVE TO DATA READ FROM DATA BEARING RECORDS",
  "filing_date": "20160628",
  "inventor_list": [
    {
      "inventor_name_last": "LEWIS",
      "inventor_name_first": "David N.",
      "inventor_city": "Canal Fulton",
      "inventor_state": "OH",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "ENRIGHT",
      "inventor_name_first": "Jeffery M.",
      "inventor_city": "Akron",
      "inventor_state": "OH",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "RAMACHANDRAN",
      "inventor_name_first": "Natarajan",
      "inventor_city": "Uniontown",
      "inventor_state": "OH",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "DOUGLASS",
      "inventor_name_first": "Mark A.",
      "inventor_city": "North Canton",
      "inventor_state": "OH",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "CREWS",
      "inventor_name_first": "Tim",
      "inventor_city": "Alliane",
      "inventor_state": "OH",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "MA",
      "inventor_name_first": "Songtao",
      "inventor_city": "Wadsworth",
      "inventor_state": "OH",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "JENKINS",
      "inventor_name_first": "Randall W.",
      "inventor_city": "Orrville",
      "inventor_state": "OH",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "GRAEF",
      "inventor_name_first": "H. Thomas",
      "inventor_city": "Bolivar",
      "inventor_state": "OH",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "IRUDAYAM",
      "inventor_name_first": "Sathish M.",
      "inventor_city": "North Canton",
      "inventor_state": "OH",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "STEINBACH",
      "inventor_name_first": "Klaus",
      "inventor_city": "Canton",
      "inventor_state": "OH",
      "inventor_country": "US"
    }
  ],
  "ipcr_labels": [
    "G07F1900",
    "G06K19073",
    "G06K700",
    "G06K708"
  ],
  "main_ipcr_label": "G07F1900",
  "summary": "<SOH> BRIEF DESCRIPTION OF DRAWINGS <EOH>FIG. 1 is a side schematic view of an automated banking machine. FIG. 2 shows a front view of the automated banking machine of FIG. 1 . FIG. 3 shows an alternative fascia of an automated banking machine. FIG. 4 shows a card including an RFID tag. FIG. 5 shows an alternative RFID card. FIG. 6 shows a side view of an automated banking machine drive-thru arrangement. FIG. 7 shows a top view of an automated banking machine drive-thru arrangement. FIG. 8 shows a facility having plural RFID tag reading devices. FIG. 9 shows an automated banking machine having a dual use card reader slot. FIG. 10 shows an RFID reader is positioned adjacent to a magnetic stripe reader. FIG. 11 shows an interior portion of an automated banking machine with components arranged in wireless communication. FIG. 12 shows an automated transaction machine and host arrangement, with the machine having card data image reading capabilities. FIG. 13 shows a mobile device having image display capabilities, with the image including card data. FIG. 14 shows a relationship among a customer, an automated banking machine having electronic card data handling capability, and a host. FIG. 15 shows the orientation of a magnetic stripe card that is being inserted into a card slot of an example card reader arrangement. FIG. 16 shows the card of FIG. 15 inserted in the slot at a position that is adjacent to a movable magnetic read head of the example card reader arrangement. FIG. 17 shows an alternative mounting arrangement for a movable magnetic read head in an example card reader arrangement. FIG. 18 shows an angled view of a card in a card slot of an example user fascia portion. FIG. 19 shows a card reader housing located adjacent to the fascia portion of FIG. 18 . FIG. 20 shows a smart card inserted into a card slot of another an example card reader arrangement. FIG. 21 shows a card reader arrangement having dual read heads. FIG. 22 shows an example embodiment of a card ...",
  "patent_number": "9607485",
  "abstract": "A banking system operates responsive to data read from data bearing records. The system includes an automated banking machine comprising a card reader. The card reader includes a movable read head that can read card data along a magnetic stripe of a card that was inserted long-edge first. The card reader includes a card entry gate. The gate is opened for a card that is determined to be properly oriented for data reading. The card reader can encrypt card data, including account data. The card data is usable by the machine to authorize a user to carry out a financial transfer involving the account.",
  "publication_number": "US20160307412A1-20161020",
  "_processing_info": {
    "original_size": 284437,
    "optimized_size": 4555,
    "reduction_percent": 98.4
  }
}