{
  "decision": "PENDING",
  "application_number": "15191353",
  "date_published": "20170316",
  "date_produced": "20170301",
  "title": "Managing Functions on an iOS-Based Mobile Device Using ANCS Notifications",
  "filing_date": "20160623",
  "inventor_list": [
    {
      "inventor_name_last": "Breaux",
      "inventor_name_first": "Joseph E.",
      "inventor_city": "Baton Rouge",
      "inventor_state": "LA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Kennedy",
      "inventor_name_first": "Chad A.",
      "inventor_city": "Baton Rouge",
      "inventor_state": "LA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Lynn",
      "inventor_name_first": "Michael W.",
      "inventor_city": "Baton Rouge",
      "inventor_state": "LA",
      "inventor_country": "US"
    }
  ],
  "ipcr_labels": [
    "G06F954",
    "H04W4804",
    "H04W400"
  ],
  "main_ipcr_label": "G06F954",
  "summary": "<SOH> SUMMARY OF THE PRESENT TECHNOLOGY <EOH>The present inventions described herein relate generally to systems, methods, and devices for monitoring, managing, controlling, and making effective use of mobile communication devices within a vehicle and, more particularly, to accurately identifying vehicular drivers, collecting vehicular status and driving data, and interfacing with one or more mobile communication devices within the vehicle regarding the same. Briefly described, aspects of the present invention include the following. In a first aspect of the present invention, a system for determining the location of a mobile device within a vehicle, includes (a) a controller located within the vehicle and configured to transmit at least two audio signals, a first audio signal directed generally into a driver space within the vehicle and a second audio signal directed generally into a passenger space within the vehicle, and (b) software code stored in memory of the mobile device and having instructions executable by the processor that performs the steps of: (i) detecting the at least two audio signals, (ii) sampling the at least two audio signals for a predetermined period of time; (iii) performing digital signal processing on the sampled at least two audio signals; and (iv) based on the results of the digital signal processing, determining whether the mobile device was located within the driver space of the vehicle during the predetermined period of time. In a feature, the controller is mounted within the vehicle in proximity to a central axis of the vehicle, the central axis extending generally between the driver space and the passenger space within the vehicle. In some embodiments, the controller is mounted on the inside surface of the front windshield of the vehicle. In other embodiments, the controller is built into the vehicle. In another feature, the controller includes a built-in speaker system for transmitting the at least two audio signals. In some embodime...",
  "patent_number": "None",
  "abstract": "Systems, methods, and devices for managing predetermined functions on a mobile device within a moving vehicle, the mobile device having an operating system (OS) that includes an event API installed therein that is configured for two-way communication with an external control device, the control device being installed within the vehicle and further configured to communicate with a software application installed and running in memory resident on the mobile device. In response to initiation of a predetermined function on the mobile device, a notification message is transmitted by the event API to the control device. The control device then communicates with the software application to determine a desired action for the mobile device to take with respect to the predetermined function. The control device then instructs the mobile device on the action to take on the predetermined function by transmitting an action message to the event API.",
  "publication_number": "US20170075740A1-20170316",
  "_processing_info": {
    "original_size": 222717,
    "optimized_size": 3839,
    "reduction_percent": 98.28
  }
}