{
  "decision": "REJECTED",
  "application_number": "15190329",
  "date_published": "20171228",
  "date_produced": "20171213",
  "title": "Touch Sensor Device and Method",
  "filing_date": "20160623",
  "inventor_list": [
    {
      "inventor_name_last": "David",
      "inventor_name_first": "Albert M.",
      "inventor_city": "Ontario",
      "inventor_state": "",
      "inventor_country": "CA"
    },
    {
      "inventor_name_last": "PAVLOV",
      "inventor_name_first": "Gueorgui",
      "inventor_city": "Ontario",
      "inventor_state": "",
      "inventor_country": "CA"
    }
  ],
  "ipcr_labels": [
    "G06F3041",
    "G06F3044"
  ],
  "main_ipcr_label": "G06F3041",
  "summary": "<SOH> SUMMARY <EOH>According to one aspect, there is provided a capacitive touch sensor device comprising: a substrate layer; and a plurality of resonant circuits, each comprising at least one respective electrode, the electrodes of the plurality of resonant circuits being distributed on the substrate layer, and each of the plurality of resonant circuits having a respective resonance frequency that is unique within the plurality of resonant circuits. In some embodiments, the capacitive touch sensor further comprises, a respective circuit input and a respective circuit output, the plurality of resonant circuits being collectively connected to the respective circuit input and collectively connected to the respective circuit output. In some embodiments, for each said resonant circuit, the at least one respective electrode comprises at least one electrode strip. In some embodiments, the at least one electrode strip comprises a first electrode strip and a second electrode strip parallel to and spaced apart from the first electrode strip. In some embodiments, the capacitive touch sensor further comprises, a signal generator that selectively generates signals at each of the resonance frequencies to drive the plurality of resonant circuits. In some embodiments, the capacitive touch sensor further comprises, a detector that measures output of the plurality of resonant circuits. In some embodiments, the capacitive touch sensor further comprises, a processor that controls the tunable signal generator and the detector to scan the plurality of resonant circuits, said scanning comprising sequentially generating the signals at each of the resonant frequencies, and measuring the output of the plurality of resonant circuits. In some embodiments, the capacitive touch sensor further comprises, a respective circuit input and a respective circuit output, the plurality of resonant circuits being collectively connected to the respective circuit input and collectively connected to the resp...",
  "patent_number": "None",
  "abstract": "A common capacitive touch sensor may have a two dimensional array of transparent conductive strips going from edge to edge on a substrate layer or sheet of a touch sensor. According to some aspects, there is provided a capacitive touch sensor device including a substrate layer and a plurality of resonant circuits. Each resonant circuit includes an electrode, and each resonant circuit has a respective resonance frequency that is unique within the plurality of resonant circuits. The electrodes of the resonant circuits are distributed on the substrate layer. A controller for a touch sensor is also provided that includes a signal generator to drive at least one plurality of resonant circuits, where each resonant circuit has a respective resonance frequency. The signal generator is tunable to generate input signals at each of the resonance frequencies. The controller also includes a detector.",
  "publication_number": "US20170371473A1-20171228",
  "_processing_info": {
    "original_size": 94350,
    "optimized_size": 3577,
    "reduction_percent": 96.21
  }
}