{
  "decision": "PENDING",
  "application_number": "15199333",
  "date_published": "20180104",
  "date_produced": "20171219",
  "title": "FORCE SENSING IN A TOUCH DISPLAY",
  "filing_date": "20160630",
  "inventor_list": [
    {
      "inventor_name_last": "EL KALLASSI",
      "inventor_name_first": "Pascale",
      "inventor_city": "Menlo Park",
      "inventor_state": "CA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "KIM",
      "inventor_name_first": "Do Hee",
      "inventor_city": "San Jose",
      "inventor_state": "CA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "SMITH",
      "inventor_name_first": "Patrick",
      "inventor_city": "San Jose",
      "inventor_state": "CA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "SCHEDIWY",
      "inventor_name_first": "Richard",
      "inventor_city": "Union City",
      "inventor_state": "CA",
      "inventor_country": "US"
    }
  ],
  "ipcr_labels": [
    "G06F3041",
    "G06F3044"
  ],
  "main_ipcr_label": "G06F3041",
  "summary": "<SOH> SUMMARY <EOH>Embodiments described herein include a display device that includes a display substrate coupled to a frame. A stiffener substrate is also coupled to the frame. A first force sensing element is disposed on the stiffener substrate, and the stiffener substrate is disposed between the first force sensing element and the display substrate. The display device also includes a second force sensing element, wherein a distance between the first force sensing element and the second force sensing element decreases when the display substrate is deflected. In another embodiment, an input device includes a plurality of capacitive sensing electrodes configured to receive a signal. The input device also includes a display device coupled to the plurality of sensing electrodes. The display device includes a display substrate coupled to a frame and a stiffener substrate coupled to the frame. The display device also includes a first force sensing element disposed on the stiffener substrate. The stiffener substrate is disposed between the first force sensing element and the display substrate. The display device also includes a second force sensing element. A distance between the first force sensing element and the second force sensing element decreases when the display substrate is deflected. In another embodiment, a processing system for a force sensing device includes a force determination module configured to determine a force detected by a first force sensing element, wherein the force is received at an input surface, and wherein the first force sensing element is configured to deflect toward a second force sensing element. The processing system also includes force driver circuitry configured to drive the first force sensing element and the second force sensing element for sensing the force applied to an input surface. The force is transmitted from a display substrate to a stiffener substrate, and the first force sensing element is disposed on the stiffener substra...",
  "patent_number": "None",
  "abstract": "Embodiments described herein include a display device that includes a display substrate coupled to a frame. A stiffener substrate is also coupled to the frame. A first force sensing element is disposed on the stiffener substrate, and the stiffener substrate is disposed between the first force sensing element and the display substrate. The display device also includes a second force sensing element, where a distance between the first force sensing element and the second force sensing element decreases when the display substrate is deflected.",
  "publication_number": "US20180004337A1-20180104",
  "_processing_info": {
    "original_size": 63529,
    "optimized_size": 3528,
    "reduction_percent": 94.45
  }
}