{
  "decision": "PENDING",
  "application_number": "15198037",
  "date_published": "20180104",
  "date_produced": "20171219",
  "title": "PACKAGE BIDDING DELIVERY LOCATION DETERMINATION",
  "filing_date": "20160630",
  "inventor_list": [
    {
      "inventor_name_last": "Eda",
      "inventor_name_first": "Sasikanth",
      "inventor_city": "Pune",
      "inventor_state": "",
      "inventor_country": "IN"
    },
    {
      "inventor_name_last": "Ghuge",
      "inventor_name_first": "Deepak R.",
      "inventor_city": "Sangamer",
      "inventor_state": "",
      "inventor_country": "IN"
    },
    {
      "inventor_name_last": "Patil",
      "inventor_name_first": "Sandeep R.",
      "inventor_city": "Pune",
      "inventor_state": "",
      "inventor_country": "IN"
    },
    {
      "inventor_name_last": "Sivakumar",
      "inventor_name_first": "Gandhi",
      "inventor_city": "Bentleigh",
      "inventor_state": "",
      "inventor_country": "AU"
    }
  ],
  "ipcr_labels": [
    "G06Q1008",
    "G06Q3008",
    "G06Q3002"
  ],
  "main_ipcr_label": "G06Q1008",
  "summary": "<SOH> SUMMARY <EOH>A first aspect of the invention provides a bidding based product delivery determination method comprising: presenting, by a computer processor of server computing device, a product for purchase via a bidding process, wherein packages comprising the product are pre-loaded on a plurality of delivery vehicles for delivery, and wherein the plurality of delivery vehicles are programmed to deliver the product within associated geographical zones comprising associated specified maximum travel distances; presenting, by the computer processor to the plurality of users, a list describing each of the plurality of delivery vehicles with respect to each geographical zone of the associated geographical zones; receiving, by the computer processor from the plurality of users, monetary bids for the product with respect to the plurality of delivery vehicles, wherein each monetary bid of the monetary bids is associated with a specified delivery vehicles of the plurality of delivery vehicles such that each the specified delivery vehicles is programmed to travel within a specified geographical zone of the associated geographical zones with respect to an associated location of an associated user of the plurality of users; identifying, by the computer processor after a specified time period has elapsed since initiating the receiving, a first user of the users submitting a first highest monetary bid of the monetary bids with respect to all other monetary bids of the monetary bids; directing, by the computer processor in response to the identifying, a first delivery vehicle of the plurality of delivery vehicles to a first location of the first user; and enabling, by the computer processor based on the monetary bids and the plurality of users with respect to associated locations, a profit sharing process with respect to the plurality of users and an entity providing the product. A second aspect of the invention provides a control computing device comprising a computer proc...",
  "patent_number": "None",
  "abstract": "A method and system for determining implementing a bidding based product delivery determination process is provided. The method includes presenting a product for purchase via a bidding process. Packages including the product are pre-loaded on delivery vehicles for delivery within geographical zones including maximum travel distances. Monetary bids for the product are received from users with respect to the delivery vehicles and a user submitting a highest monetary bid is identified. In response, a first delivery vehicle is directed to a location of the user. A profit sharing process with respect to the users and an entity providing the product is enabled.",
  "publication_number": "US20180005168A1-20180104",
  "_processing_info": {
    "original_size": 56346,
    "optimized_size": 3655,
    "reduction_percent": 93.51
  }
}