{
  "decision": "PENDING",
  "application_number": "15192656",
  "date_published": "20171228",
  "date_produced": "20171213",
  "title": "REMOVABLE MARKING ELEMENT WITH ACCESS CREDENTIALS",
  "filing_date": "20160624",
  "inventor_list": [
    {
      "inventor_name_last": "Friant",
      "inventor_name_first": "Jillian",
      "inventor_city": "Foster City",
      "inventor_state": "CA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Moore",
      "inventor_name_first": "Angela",
      "inventor_city": "Willoughby",
      "inventor_state": "",
      "inventor_country": "AU"
    }
  ],
  "ipcr_labels": [
    "G06K1907",
    "G07C900",
    "G06K19077",
    "G06K700",
    "G06K1906",
    "H04L2906",
    "G06Q2040"
  ],
  "main_ipcr_label": "G06K1907",
  "summary": "<SOH> SUMMARY <EOH>One embodiment of the invention is directed to a method. The method comprises obtaining, by a mobile device, a product identifier by obtaining a machine readable code associated with a removable marking element adapted to adhere to skin. The removable marking element includes an integrated circuit that is configured to transmit a first access credential associated with a first account over a wireless communication channel to an access device during a transaction. The method also comprises transmitting, by the mobile device, to a server computer, a message comprising the product identifier, a value, and a second access credential associated with a second account. The server computer identifies the first account based on the product identifier, and the server computer loads the first account with the value from the second account. Another embodiment of the invention is directed to a mobile device configured to perform the above-described method. Another embodiment of the invention is directed to a method comprising receiving, by a server computer, from a mobile device, a message including a value, a second access credential associated with a second account, and a product identifier associated with a removable marking element adapted to adhere to skin. The mobile device obtained the product identifier by obtaining a machine readable code associated with a removable marking element. The removable marking element includes an integrated circuit that is configured to transmit a first access credential associated with a first account over a wireless communication channel to an access device during a transaction. The method further comprises identifying the first account based on the product identifier, and loading the first account with the value from the second account. Another embodiment of the invention is directed to a server computer configured to perform the above-described method. Another embodiment of the invention is directed to a method comprisi...",
  "patent_number": "None",
  "abstract": "A method and system for transacting with a removable marking element is disclosed. A removable marking element including credentials can be associated with an account. A user can activate and manage the account via a mobile device. The mobile device can access the account by providing a product identifier. A product identifier may be provided in removable marking element packaging. For example, the product identifier may be encoded in a machine readable code on the packaging.",
  "publication_number": "US20170372185A1-20171228",
  "_processing_info": {
    "original_size": 94826,
    "optimized_size": 3239,
    "reduction_percent": 96.58
  }
}