{
  "date_produced": "20171219",
  "publication_number": "US20180005127A1-20180104",
  "main_ipcr_label": "G06N504",
  "decision": "PENDING",
  "application_number": "15196264",
  "inventor_list": [
    {
      "inventor_name_last": "Akyamac",
      "inventor_name_first": "Ahmet",
      "inventor_city": "Bridgewater",
      "inventor_state": "NJ",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Uzunalioglu",
      "inventor_name_first": "Huseyin",
      "inventor_city": "Millington",
      "inventor_state": "NJ",
      "inventor_country": "US"
    }
  ],
  "abstract": "The present disclosure generally discloses a problem event prediction capability. The problem event prediction capability may be configured to predict various types of problem events (e.g., customer problems, customer tickets, customer outages, network problems, network tickets, network outages, or the like, as well as various combinations thereof) based on various types of asynchronous machine data (e.g., alarms, alerts, triggers, machine logs, machine messages, diagnostic logs, diagnostic messages, or the like, as well as various combinations thereof). The problem event prediction capability may be configured to generate a set of problem prediction rules based on historical machine data and to apply the problem prediction rules to observed machine data in order to predict various types of problem events.",
  "filing_date": "20160629",
  "patent_number": "None",
  "summary": "<SOH> SUMMARY <EOH>The present disclosure generally discloses a problem event prediction capability for predicting problem events. In at least some embodiments, an apparatus is provided. The apparatus includes a processor and a memory communicatively connected to the processor. The processor is configured to receive historical problem event data associated with a device, where the device includes a network device or a customer device. The processor is configured to receive historical machine data generated by the device. The processor is configured to create, based on a predictive time epoch, a temporal association between the historical problem event data associated with the device and the machine data generated by the device. The processor is configured to generate a problem prediction rule associated with the device based on the temporal association between the historical problem event data associated with the device and the machine data generated by the device. In at least some embodiments, a corresponding method is provided. In at least some embodiments, an apparatus is provided. The apparatus includes a processor and a memory communicatively connected to the processor. The processor is configured to receive a set of problem prediction rules and information indicative of a length of an observation window. The information indicative of the length of the observation window is based on a length of an analysis time period used to create at least one of the problem prediction rules based on analysis of historical problem data and historical machine data. The processor is configured to receive machine data generated by a device within the observation window. The processor is configured to identify a predicted problem event associated with the device based on a determination that the machine data matches one of the problem prediction rules. In at least some embodiments, a corresponding method is provided.",
  "date_published": "20180104",
  "title": "PREDICTING PROBLEM EVENTS FROM MACHINE DATA",
  "ipcr_labels": [
    "G06N504",
    "H04L1224"
  ],
  "_processing_info": {
    "original_size": 87116,
    "optimized_size": 3450,
    "reduction_percent": 96.04
  }
}