{
  "decision": "ACCEPTED",
  "application_number": "15197792",
  "date_published": "20170126",
  "date_produced": "20170110",
  "title": "ELECTRONIC DEVICE AND FACIAL EXPRESSION OPERATION METHOD",
  "filing_date": "20160630",
  "inventor_list": [
    {
      "inventor_name_last": "LIU",
      "inventor_name_first": "TING-KAI",
      "inventor_city": "New Taipei",
      "inventor_state": "",
      "inventor_country": "TW"
    }
  ],
  "ipcr_labels": [
    "G06F301",
    "G06K900",
    "G06F30484",
    "G06F303",
    "G06T700"
  ],
  "main_ipcr_label": "G06F301",
  "summary": "<SOH> BRIEF DESCRIPTION OF THE DRAWINGS <EOH>Many aspects of the disclosure can be better understood with reference to the following drawings. The components in the drawings are not necessarily drawn to scale, the emphasis instead being placed upon clearly illustrating the principles of the disclosure. Moreover, in the drawings, like reference numerals designate corresponding parts throughout the several views. FIG. 1 is a block diagram of one embodiment of an electronic device including a facial expression operation system. FIG. 2 is a block diagram of one embodiment of modules of the facial expression operation system. FIG. 3 illustrates a flowchart of one embodiment of a method of operating the electronic device base on facial expression. FIG. 4 illustrates an example of a display window of the electronic device of FIG. 1 . FIG. 5 illustrates an example of a face image sample in the system of FIG. 1 . FIG. 6 illustrates an example of a face area of an image in the system of FIG. 1 . FIG. 7 illustrates an example of a right eye of a user winking in the system of FIG. 1 . FIG. 8 illustrates an example of a left eye of a user winking in the system of FIG. 1 . FIG. 9 illustrates an example of both eyes of the user winking in the system of FIG. 1 . FIG. 10 illustrates an example of glaring eyes of the user in the system of FIG. 1 . FIG. 11 illustrates an example of a changed mouth shape in the system of FIG. 1 . detailed-description description=\"Detailed Description\" end=\"lead\"?",
  "patent_number": "9904361",
  "abstract": "A facial expression operation method includes capturing images using a camera device of an electronic device. A face area of the user exists in the images is determined by comparing the images with face image samples stored in a storage device. Feature values of the face area are calculated when the face area exists in the images. A facial expression is determined by comparing the feature values of the face area and the feature values of the face image samples. The electronic device is operated automatically to perform a corresponding function according to the facial expression.",
  "publication_number": "US20170024005A1-20170126",
  "_processing_info": {
    "original_size": 29207,
    "optimized_size": 2680,
    "reduction_percent": 90.82
  }
}