{
  "date_produced": "20171219",
  "publication_number": "US20180005128A1-20180104",
  "main_ipcr_label": "G06N700",
  "decision": "PENDING",
  "application_number": "15196742",
  "inventor_list": [
    {
      "inventor_name_last": "Sheppard",
      "inventor_name_first": "Michael",
      "inventor_city": "Brooklyn",
      "inventor_state": "NY",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Donato",
      "inventor_name_first": "Paul",
      "inventor_city": "New York",
      "inventor_state": "NY",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Doe",
      "inventor_name_first": "Peter C.",
      "inventor_city": "Ridgewood",
      "inventor_state": "NJ",
      "inventor_country": "US"
    }
  ],
  "abstract": "Methods, apparatus, systems to determine a conditional probability based on audience member probability distributions for media audience measurement are disclosed. Disclosed example methods for media audience measurement include determining a first audience probability distribution for a first member of a household and determining a second audience probability distribution for a second member of the household. Disclosed example methods also include calculating probabilities for audience combinations of the first member and the second member of the household based on the first audience probability distribution and the second audience probability distribution. Disclosed example methods further include determining a household audience characteristic probability based on the calculated probabilities of the audience combinations of the household. The household audience characteristic indicates likelihoods of different possible audience compositions of the household for a media event.",
  "filing_date": "20160629",
  "patent_number": "None",
  "summary": "<SOH> BRIEF DESCRIPTION OF THE DRAWINGS <EOH>FIG. 1 is a block diagram of an example environment including an example household characteristic calculator to calculate probability distributions of members of the household to determine a probability of an audience measurement characteristic of the household. FIG. 2 is a block diagram of an example implementation of the household characteristic calculator of FIG. 1 that is to calculate the probability of the audience measurement characteristic of the household. FIG. 3 is a flow diagram representative of example machine readable instructions that may be executed to implement the example household characteristic calculator of FIGS. 1 and/or 2 to determine the probability of the audience measurement characteristic of the household. FIG. 4 is a flow diagram representative of first example machine readable instructions that may be executed to implement the example distribution determiner of FIG. 2 to determine the probability distributions of the members of the household. FIG. 5 is a flow diagram representative of second example machine readable instructions that may be executed to implement the example distribution determiner of FIG. 2 to determine the probability distributions of the members of the household. FIG. 6 is a block diagram of an example processor system structured to execute the example machine readable instructions represented by FIGS. 3, 4 and/or 5 to implement the example household characteristic calculator of FIGS. 1 and/or 2 . detailed-description description=\"Detailed Description\" end=\"lead\"? The figures are not to scale. Wherever possible, the same reference numbers will be used throughout the drawing(s) and accompanying written description to refer to the same or like parts.",
  "date_published": "20180104",
  "title": "METHODS AND APPARATUS TO DETERMINE A CONDITIONAL PROBABILITY BASED ON AUDIENCE MEMBER PROBABILITY DISTRIBUTIONS FOR MEDIA AUDIENCE MEASUREMENT",
  "ipcr_labels": [
    "G06N700",
    "H04N21442",
    "H04N2145",
    "H04N21466"
  ],
  "_processing_info": {
    "original_size": 114655,
    "optimized_size": 3723,
    "reduction_percent": 96.75
  }
}