{
  "decision": "PENDING",
  "application_number": "15190145",
  "date_published": "20161229",
  "date_produced": "20161214",
  "title": "SYSTEM AND METHODS FOR NAVIGATION BAR PRESENTATION AND DEVICE CONTROL",
  "filing_date": "20160622",
  "inventor_list": [
    {
      "inventor_name_last": "SIRPAL",
      "inventor_name_first": "Sanjiv",
      "inventor_city": "Oakville",
      "inventor_state": "",
      "inventor_country": "CA"
    },
    {
      "inventor_name_last": "DE PAZ",
      "inventor_name_first": "Alexander",
      "inventor_city": "Burlington",
      "inventor_state": "",
      "inventor_country": "CA"
    },
    {
      "inventor_name_last": "SELIM",
      "inventor_name_first": "Mohammed",
      "inventor_city": "Oakville",
      "inventor_state": "",
      "inventor_country": "CA"
    }
  ],
  "ipcr_labels": [
    "G06F30482",
    "G06F30484",
    "G06F30488"
  ],
  "main_ipcr_label": "G06F30482",
  "summary": "<SOH> BRIEF SUMMARY OF THE EMBODIMENTS <EOH>Disclosed and claimed herein are methods for device control and device configurations. One embodiment is directed to a method for device control that includes displaying, by a device, a user interface including a navigation bar, wherein the navigation bar is presented to include one or more selectable elements and wherein the navigation bar includes a plurality of swipe zones. The method also includes detecting, by the device, an input command relative to a display of the device, wherein the input command is a swipe command relative to one of the plurality of swipe areas of the navigation bar. The method also includes determining, by the device, a navigation bar command based on identification of a swipe area of the input command and a swipe length of the input command and updating presentation of the navigation bar based on the navigation bar command. In one embodiment, the navigation bar includes a graphical element associated with each of the plurality of swipe zones. In one embodiment, the navigation bar includes three swipe zones. In one embodiment, the input command is a touch command to the display, the touch command associated with a position of display for the navigation bar. In one embodiment, the navigation bar command expands presentation of the navigation bar from a bottom bar to an expanded view including additional graphical elements. In one embodiment, the navigation bar command launches an application associated with and preassigned to a swipe zone associated with the input command. In one embodiment, updating presentation of the navigation bar includes expanding the display area of the navigation bar on the display and increasing the number of graphical elements displayed with the navigation bar. In one embodiment, updating presentation of the navigation bar includes modifying the graphical elements display in the navigation bar based on the navigation bar command. In one embodiment, the method includes c...",
  "patent_number": "None",
  "abstract": "The present disclosure relates to device control. In one embodiment, a method for device control includes displaying a user interface including a navigation bar. The navigation bar may be presented to include one or more selectable elements and wherein the navigation bar includes a plurality of swipe zones. The method also includes detecting an input command relative to a display of the device, wherein the input command is a swipe command relative to one of the plurality of swipe areas of the navigation bar, and determining a navigation bar command based on identification of a swipe area of the input command and a swipe length of the input command. Presentation of the navigation bar may be updated based on the navigation bar command. Another embodiment is directed to a device configured to control operation based on navigation bar commands.",
  "publication_number": "US20160378281A1-20161229",
  "_processing_info": {
    "original_size": 37374,
    "optimized_size": 3731,
    "reduction_percent": 90.02
  }
}