{
  "decision": "PENDING",
  "application_number": "15193952",
  "date_published": "20171228",
  "date_produced": "20171213",
  "title": "Multi-Level System Memory With Near Memory Scrubbing Based On Predicted Far Memory Idle Time",
  "filing_date": "20160627",
  "inventor_list": [
    {
      "inventor_name_last": "WANG",
      "inventor_name_first": "Zhe",
      "inventor_city": "Hillsboro",
      "inventor_state": "OR",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "WILKERSON",
      "inventor_name_first": "Christopher B.",
      "inventor_city": "Portland",
      "inventor_state": "OR",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "CHISHTI",
      "inventor_name_first": "Zeshan A.",
      "inventor_city": "Hillsboro",
      "inventor_state": "OR",
      "inventor_country": "US"
    }
  ],
  "ipcr_labels": [
    "G06F120873",
    "G06F12123",
    "G06F120804"
  ],
  "main_ipcr_label": "G06F120873",
  "summary": "",
  "patent_number": "None",
  "abstract": "An apparatus is described that includes a memory controller to interface to a multi-level system memory. The memory controller includes least recently used (LRU) circuitry to keep track of least recently used cache lines kept in a higher level of the multi-level system memory. The memory controller also includes idle time predictor circuitry to predict idle times of a lower level of the multi-level system memory. The memory controller is to write one or more lesser used cache lines from the higher level of the multi-level system memory to the lower level of the multi-level system memory in response to the idle time predictor circuitry indicating that an observed idle time of the lower level of the multi-level system memory is expected to be long enough to accommodate the write of the one or more lesser used cache lines from the higher level of the multi-level system memory to the lower level of the multi-level system memory.",
  "publication_number": "US20170371795A1-20171228",
  "_processing_info": {
    "original_size": 49562,
    "optimized_size": 1852,
    "reduction_percent": 96.26
  }
}