{
  "decision": "PENDING",
  "application_number": "15191538",
  "date_published": "20170105",
  "date_produced": "20161220",
  "title": "TOUCH CONTROL DEVICE AND OPERATING METHOD THEREOF",
  "filing_date": "20160624",
  "inventor_list": [
    {
      "inventor_name_last": "Chen",
      "inventor_name_first": "Ya-Ting",
      "inventor_city": "Taipei City",
      "inventor_state": "",
      "inventor_country": "TW"
    },
    {
      "inventor_name_last": "Lin",
      "inventor_name_first": "Hung-Yi",
      "inventor_city": "Taipei City",
      "inventor_state": "",
      "inventor_country": "TW"
    },
    {
      "inventor_name_last": "Wang",
      "inventor_name_first": "Yi-Ou",
      "inventor_city": "Taipei City",
      "inventor_state": "",
      "inventor_country": "TW"
    }
  ],
  "ipcr_labels": [
    "G06F3041",
    "G06F30354",
    "G06F30488",
    "G06F3044"
  ],
  "main_ipcr_label": "G06F3041",
  "summary": "<SOH> BRIEF SUMMARY OF THE INVENTION <EOH>According to a first aspect, a touch control device including a touchpad, a first driving circuit coupled to the touchpad, configured to drive the touchpad to detect a sensed value frame of a touch event on the touchpad; and a system circuit coupled to the first driving circuit, configured to analyze the sensed value frame provided by the first driving circuit to recognize a first finger position, a second finger position and a third finger position, and to define the first finger position as a left key position of a virtual mouse, the second finger position as a right key position of the virtual mouse according to a position relationship among the first finger position, the second finger position and the third finger position. According to a second aspect, an operating method of a touch control device is provided. The operating method of the touch control device comprising: providing a touchpad; driving the touchpad by a first driving circuit to detect a sensed value frame of a touch event on the touchpad; analyzing the sensed value frame by a system circuit to recognize a first finger position, a second finger position and a third finger position; and defining the first finger position as a left key position of a virtual mouse and the second finger position as a right key position of the virtual mouse by the system circuit according to a position relationship among the first finger position, the second finger position and the third finger position. In sum, a touch control device and an operating method thereof are provided to recognize the first finger position, the second finger position and the third finger position of a gesture for operating the mouse and track the state of the first finger position, the second finger position and the third finger position. The first finger position of the gesture for operating the mouse corresponds to a left key position of the virtual mouse, while the second finger position of the ges...",
  "patent_number": "None",
  "abstract": "A touch control device including a touchpad, a first driving circuit and a system circuit is provided. The first driving circuit is coupled to the touchpad for driving the touchpad to detect a sensed value frame of a touch event on the touchpad. The system circuit is coupled to the first driving circuit for analyzing the sensed value frame provided by the first driving circuit to recognize a first finger position, a second finger position and a third finger position, and defining the first finger position as a left key position of a virtual mouse, the second finger position as a right key position of the virtual mouse according to a position relationship among the first finger position, the second finger position and the third finger position. An operating method of a touch control device is also provided.",
  "publication_number": "US20170003805A1-20170105",
  "_processing_info": {
    "original_size": 50702,
    "optimized_size": 3683,
    "reduction_percent": 92.74
  }
}