{
  "decision": "PENDING",
  "application_number": "15198963",
  "date_published": "20180104",
  "date_produced": "20171219",
  "title": "CONTROLLING ACCESS TO NAMESPACES OF A STORAGE DEVICE",
  "filing_date": "20160630",
  "inventor_list": [
    {
      "inventor_name_last": "Geml",
      "inventor_name_first": "Adam Christopher",
      "inventor_city": "Rochester",
      "inventor_state": "MN",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "McCambridge",
      "inventor_name_first": "Colin Christopher",
      "inventor_city": "Rochester",
      "inventor_state": "MN",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Sanders",
      "inventor_name_first": "Philip James",
      "inventor_city": "Rochester",
      "inventor_state": "MN",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Sendelbach",
      "inventor_name_first": "Lee Anton",
      "inventor_city": "Rochester",
      "inventor_state": "MN",
      "inventor_country": "US"
    }
  ],
  "ipcr_labels": [
    "G06F9455",
    "G06F2162"
  ],
  "main_ipcr_label": "G06F9455",
  "summary": "<SOH> SUMMARY <EOH>In one example, a method includes receiving, by virtual machine manager and from a virtual machine, a request for a set of namespace identifiers corresponding to a set of namespaces associated with one or more storage devices; determining, by the virtual machine manager, one or more namespaces associated with the virtual machine from the set of namespaces associated with the one or more storage devices; and in response to determining the one or more namespaces associated with the virtual machine, sending, by the virtual machine manager and to the virtual machine, a subset of the set of namespace identifiers, the subset of namespace identifiers corresponding to the one or more namespaces associated with the virtual machine. In another example, a system includes a virtual machine and a virtual machine manager. The virtual machine manager is configured to: receive, from the virtual machine, a request for a set of namespace identifiers corresponding to a set of namespaces associated. with one or more storage devices; determine one or more namespaces associated with the virtual machine from the set of namespaces associated with the one or more storage devices; and in response to determining the one or more namespaces associated with the virtual machine, send, to the virtual machine, a subset of the set of namespace identifiers, the subset of namespace identifiers corresponding to the one or more namespaces associated with the virtual machine. In another example, a non-transitory computer-readable storage medium includes instructions that, when executed, cause one or more processors of a host device to: receive, from a virtual machine, a request for a set of namespace identifiers corresponding to a set of namespaces associated with one or more storage devices; determine one or more namespaces associated with the virtual machine from the set of namespaces associated with the one or more storage devices; and in response to determining the one or more name...",
  "patent_number": "None",
  "abstract": "A method includes receiving, by virtual machine manager and from a virtual machine, a request for a set of namespace identifiers corresponding to a set of namespaces associated with one or more storage devices. The method also includes determining, by the virtual machine manager, one or more namespaces associated with the virtual machine from the set of namespaces associated with the one or more storage devices. The method further includes, in response to determining the one or more namespaces associated with the virtual machine, sending, by the virtual machine manager and to the virtual machine, a subset of the set of namespace identifiers, the subset of namespace identifiers corresponding to the one or more namespaces associated with the virtual machine.",
  "publication_number": "US20180004559A1-20180104",
  "_processing_info": {
    "original_size": 55992,
    "optimized_size": 3800,
    "reduction_percent": 93.21
  }
}