{
  "date_produced": "20171219",
  "publication_number": "US20180005121A1-20180104",
  "main_ipcr_label": "G06N504",
  "decision": "PENDING",
  "application_number": "15196083",
  "inventor_list": [
    {
      "inventor_name_last": "Hoque",
      "inventor_name_first": "Rezaul",
      "inventor_city": "Oslo",
      "inventor_state": "",
      "inventor_country": "NO"
    },
    {
      "inventor_name_last": "Pereira",
      "inventor_name_first": "Vando",
      "inventor_city": "Oslo",
      "inventor_state": "",
      "inventor_country": "NO"
    },
    {
      "inventor_name_last": "Platakis",
      "inventor_name_first": "Manolis",
      "inventor_city": "Oslo",
      "inventor_state": "",
      "inventor_country": "NO"
    },
    {
      "inventor_name_last": "Ifrim",
      "inventor_name_first": "Olivia",
      "inventor_city": "Oslo",
      "inventor_state": "",
      "inventor_country": "NO"
    }
  ],
  "abstract": "Enhanced relationship graph signals are provided. A productivity service initiates operations to provide enhanced relationship graph signals by retrieving relationship attribute(s) between two users of a productivity service. Interactivity attribute(s) between the two users of the product service are also retrieved. An enhanced signal is generated based on the relationship and interactivity attributes. The enhanced signal is stored within a relationship graph.",
  "filing_date": "20160629",
  "patent_number": "None",
  "summary": "<SOH> SUMMARY <EOH>This summary is provided to introduce a selection of concepts in a simplified form that are further described below in the Detailed Description. This summary is not intended to exclusively identify key features or essential features of the claimed subject matter, nor is it intended as an aid in determining the scope of the claimed subject matter. Embodiments are directed to providing enhanced relationship graph signals. A productivity service, according to embodiments, may initiate operations to provide enhanced relationship graph signals by retrieving relationship attribute(s) between two users of a productivity service. Interactivity attribute(s) between the two users of the product service may also be retrieved. An enhanced signal may be generated based on the relationship and interactivity attributes. The enhanced signal may be stored within a relationship graph. These and other features and advantages will be apparent from a reading of the following detailed description and a review of the associated drawings. It is to be understood that both the foregoing general description and the following detailed description are explanatory and do not restrict aspects as claimed.",
  "date_published": "20180104",
  "title": "PROVIDE ENHANCED RELATIONSHIP GRAPH SIGNALS",
  "ipcr_labels": [
    "G06N504",
    "G06F1730",
    "G06N9900"
  ],
  "_processing_info": {
    "original_size": 65678,
    "optimized_size": 2642,
    "reduction_percent": 95.98
  }
}