{
  "date_produced": "20161214",
  "publication_number": "US20160379139A1-20161229",
  "main_ipcr_label": "G06N9900",
  "decision": "PENDING",
  "application_number": "15194007",
  "inventor_list": [
    {
      "inventor_name_last": "Eldar",
      "inventor_name_first": "Yuval",
      "inventor_city": "Shoham",
      "inventor_state": "",
      "inventor_country": "IL"
    },
    {
      "inventor_name_last": "Oz",
      "inventor_name_first": "Roee",
      "inventor_city": "Tel Aviv",
      "inventor_state": "",
      "inventor_country": "IL"
    }
  ],
  "abstract": "Described are embodiments for adaptive classification of data items which may include receiving a classification training set, the classification training set comprising a set of items associated with classification events made by a group of selected users, each item in the set of items having been designated as belonging to a particular classification by a selected user while manipulating the each item; determining from the classification training set a set of rules which can be used to classify unknown data items such that the classification of the unknown data items is consistent with the manual or automatic classification of the classification training set; adaptively updating the set of rules, according to classifications made to additional data items by additional users; and automatically classifying, based on the set of rules, one or more data items that are manipulated by a second set of one or more users.",
  "filing_date": "20160627",
  "patent_number": "None",
  "summary": "<SOH> BRIEF SUMMARY <EOH>Embodiments presented herein relate to adaptive classification of data items in an enterprise. As noted above, classification may be used to determine proper access, visibility, and/or distribution of data items. Similarly, classification of data items and documents may facilitate such searching, sorting, categorization, etc., of the data and documents. Embodiments presented herein relate to methods, systems, and products which can facilitate the automatic classification of data items and documents such that the resulting classifications may be used by enterprises, individuals, organizations, systems, etc., in whatever beneficial applications which may be useful. Information classification can be useful in almost in any organization for purposes of allowing better information management. Such purposes include security measurements, access control, information governance (a set of multi-disciplinary structures, policies, procedures, processes and controls implemented to manage information at an enterprise level, supporting an organization's immediate and future regulatory, legal, risk, environmental and operational requirements), business relevance, data categorization, assistance for better knowledge management, storage efficiency, data retention (continued storage of an organization's data for compliance or business reasons). Of course, an enterprise or organization in this context may be any of various and diverse organizations, including government entities and subgroups, educational institutions and organizations, commercial enterprises, charitable and non-profits organizations, etc. Further still, data categorization as described herein may also be used by and be useful to individuals and consumers. Information classification can be useful in many organizations to enforce encryption, access blocking and other protection methods (like blocking transmissions) on corporate sensitive information from unauthorized access and usage by users. ...",
  "date_published": "20161229",
  "title": "ADAPTIVE CLASSIFICATION OF DATA ITEMS",
  "ipcr_labels": [
    "G06N9900",
    "G06F1730"
  ],
  "_processing_info": {
    "original_size": 76597,
    "optimized_size": 3598,
    "reduction_percent": 95.3
  }
}