{
  "decision": "ACCEPTED",
  "application_number": "15194014",
  "date_published": "20161020",
  "date_produced": "20161005",
  "title": "MANAGING CONSISTENT DATA OBJECTS",
  "filing_date": "20160627",
  "inventor_list": [
    {
      "inventor_name_last": "KRIG",
      "inventor_name_first": "Scott A.",
      "inventor_city": "Santa Clara",
      "inventor_state": "CA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "TAYLOR",
      "inventor_name_first": "Stewart N.",
      "inventor_city": "Los Altos",
      "inventor_state": "CA",
      "inventor_country": "US"
    }
  ],
  "ipcr_labels": [
    "G06F1730",
    "G06T120"
  ],
  "main_ipcr_label": "G06F1730",
  "summary": "<SOH> BRIEF DESCRIPTION OF THE DRAWINGS <EOH>FIG. 1 is a block diagram of an example of a computing system that can manage consistent data objects. FIG. 2 is a block diagram of an example of a data management module for managing consistent data objects. FIG. 3 is a process flow diagram illustrating an example of a method for storing a consistent data object. FIG. 4 is a process flow diagram illustrating an example of a method for accessing a consistent data object. FIG. 5 is a block diagram depicting an example of a tangible, non-transitory computer-readable medium that can manage consistent data objects. FIG. 6 is a process flow diagram illustrating an example method of printing a consistent data object in a printing device. detailed-description description=\"Detailed Description\" end=\"lead\"?",
  "patent_number": "9697212",
  "abstract": "A method and system for managing consistent data objects are included herein. The method includes detecting an operation to store a consistent data object. Additionally, the method includes detecting an attribute for the consistent data object. Furthermore, the method includes storing the consistent data object based on the attribute. In addition, the method includes determining an additional format of the consistent data object is to be stored. The method also includes generating a second consistent data object based on the additional format and storing the second consistent data object.",
  "publication_number": "US20160306807A1-20161020",
  "_processing_info": {
    "original_size": 66382,
    "optimized_size": 2090,
    "reduction_percent": 96.85
  }
}