{
  "date_produced": "20171219",
  "publication_number": "US20180005118A1-20180104",
  "main_ipcr_label": "G06N502",
  "decision": "PENDING",
  "application_number": "15199797",
  "inventor_list": [
    {
      "inventor_name_last": "Kapoor",
      "inventor_name_first": "Ashish",
      "inventor_city": "Kirkland",
      "inventor_state": "WA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Sadigh",
      "inventor_name_first": "Dorsa",
      "inventor_city": "Walnut Creek",
      "inventor_state": "CA",
      "inventor_country": "US"
    }
  ],
  "abstract": "Various technologies described herein pertain to generating control inputs for a cyber-physical system. A prediction concerning a phenomenon can be generated, utilizing a classifier, based on sensor data acquired by a sensor. The prediction can include a probability distribution over a set of possible values of the phenomenon, where the phenomenon pertains to the cyber-physical system or an environment in which the cyber-physical system operates. Control inputs for the cyber-physical system that satisfy constraints that maintain safe operation of the cyber-physical system in the environment can be synthesized. The constraints can be based on the prediction that includes the probability distribution over the set of possible values of the phenomenon. Further, the cyber-physical system can be caused to operate in the environment based on the control inputs.",
  "filing_date": "20160630",
  "patent_number": "None",
  "summary": "<SOH> SUMMARY <EOH>Described herein are various technologies that pertain to generation of control inputs for a cyber-physical system. A prediction concerning a phenomenon can be generated, utilizing a classifier, based on sensor data acquired by a sensor. The prediction can include a probability distribution over a set of possible values of the phenomenon, where the phenomenon pertains to the cyber-physical system or an environment in which the cyber-physical system operates. Control inputs for the cyber-physical system that satisfy constraints that maintain safe operation of the cyber-physical system in the environment can be synthesized. The constraints can be based on the prediction that includes the probability distribution over the set of possible values of the phenomenon. Further, the cyber-physical system can be caused to operate in the environment based on the control inputs According to various embodiments, a probabilistic framework can be provided. The probabilistic framework can enable constraints to be defined for synthesis of control inputs of a cyber-physical system. Further, the constraints for the cyber-physical system can be formed based on the probabilistic framework. The constraints can be based on predictions that include probability distributions over sets of possible values of phenomena. Moreover, the phenomena can pertain to the cyber-physical system and/or an environment in which the cyber-physical system operates. Moreover, pursuant to various embodiments, predictions generated by classifiers can be joined for generating controls for a cyber-physical system. A first prediction generated utilizing a first classifier and a second prediction generated utilizing a second classifier can be combined. The first prediction can include a first probability distribution and the second prediction can include a second probability distribution. Moreover, constraints that maintain safe operation of the cyber-physical system in an environment can be based ...",
  "date_published": "20180104",
  "title": "CONTROL OF CYBER-PHYSICAL SYSTEMS UNDER UNCERTAINTY",
  "ipcr_labels": [
    "G06N502",
    "G06N700"
  ],
  "_processing_info": {
    "original_size": 95336,
    "optimized_size": 3565,
    "reduction_percent": 96.26
  }
}