{
  "date_produced": "20171219",
  "publication_number": "US20180005129A1-20180104",
  "main_ipcr_label": "G06N700",
  "decision": "PENDING",
  "application_number": "15197074",
  "inventor_list": [
    {
      "inventor_name_last": "Moyerman",
      "inventor_name_first": "Stephanie",
      "inventor_city": "Phoenix",
      "inventor_state": "AZ",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Hall",
      "inventor_name_first": "James Brian",
      "inventor_city": "Tucson",
      "inventor_state": "AZ",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Fetters",
      "inventor_name_first": "Tyler",
      "inventor_city": "Hillsboro",
      "inventor_state": "OR",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Ozer",
      "inventor_name_first": "Caleb",
      "inventor_city": "Berkeley",
      "inventor_state": "CA",
      "inventor_country": "US"
    }
  ],
  "abstract": "Systems and techniques for predictive classification in action sports are described herein. A start point for an action may be identified in a data stream including a plurality of data sets corresponding to the action. The data stream may be collected from a sensor array. Action performance features may be extracted from the data stream subsequent to the start point. The action performance features may be compared in real-time to a set of statistical models. A label may be selected for the action based on the comparison. A likelihood of success may be generated for the action based on the comparison. The label for the action and the likelihood of success may be output for display on a display device.",
  "filing_date": "20160629",
  "patent_number": "None",
  "summary": "<SOH> BRIEF DESCRIPTION OF THE DRAWINGS <EOH>To easily identify the discussion of any particular element or act, the most significant digit or digits in a reference number refer to the figure number in which that element is first introduced. FIG. 1 illustrates an environment including a predictive classifier for predictive classification in action sports, according to various embodiments. FIG. 2 illustrates an example of a sensor hub for predictive classification in action sports, according to various embodiments. FIG. 3 illustrates a graph of an example data stream from a sensor array for predictive classification in action sports, according to various embodiments. FIG. 4 illustrates an example of a system for predictive classification in action sports, according to various embodiments. FIG. 5 illustrates a flowchart of an example of a method for predictive classification in action sports, according to various embodiments. FIG. 6 illustrates a flowchart of an example of a method for predictive classification in action sports, according to various embodiments. FIG. 7 illustrates a flowchart of an example of a method for predictive classification in action sports, according to various embodiments. FIG. 8 is a block diagram illustrating an example of a machine upon which one or more embodiments may be implemented. detailed-description description=\"Detailed Description\" end=\"lead\"?",
  "date_published": "20180104",
  "title": "PREDICTIVE CLASSIFICATION IN ACTION SPORTS",
  "ipcr_labels": [
    "G06N700",
    "H04W400",
    "G06N502"
  ],
  "_processing_info": {
    "original_size": 86061,
    "optimized_size": 3104,
    "reduction_percent": 96.39
  }
}