{
  "date_produced": "20171213",
  "publication_number": "US20170372189A1-20171228",
  "main_ipcr_label": "G06N300",
  "decision": "PENDING",
  "application_number": "15192880",
  "inventor_list": [
    {
      "inventor_name_last": "Joo",
      "inventor_name_first": "Tae Hong",
      "inventor_city": "Redmond",
      "inventor_state": "WA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Elabbady",
      "inventor_name_first": "Tarek Z.",
      "inventor_city": "Redmond",
      "inventor_state": "WA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Habib",
      "inventor_name_first": "Mona Soliman",
      "inventor_city": "Bellevue",
      "inventor_state": "WA",
      "inventor_country": "US"
    }
  ],
  "abstract": "Methods, systems, apparatuses, and computer program products are provided for altering the behavior of an electronic personal assistant based on a situation associated with a mobile device. A situation is sensed with a plurality of sensors to generate sensor data. A situation score is calculated based on the sensor data. Behavior of an electronic personal assistant is altered based on the calculated situation score. In one aspect, the situation is a driving situation in which a driver drives a vehicle on a roadway. In such case, a driving situation score is calculated based on the sensor data, and behavior of the electronic personal assistant is altered based on the calculated driving situation score, such as suspending interactions by the electronic personal assistant with the driver to avoid the driver being distracted.",
  "filing_date": "20160624",
  "patent_number": "None",
  "summary": "<SOH> SUMMARY <EOH>This Summary is provided to introduce a selection of concepts in a simplified form that are further described below in the Detailed Description. This Summary is not intended to identify key features or essential features of the claimed subject matter, nor is it intended to be used to limit the scope of the claimed subject matter. Methods, systems, apparatuses, and computer program products are provided for altering the behavior of an electronic personal assistant based on a situation. A situation is sensed with a plurality of sensors to generate sensor data. A situation score is calculated based on the sensor data. Behavior of an electronic personal assistant is altered based on the calculated situation score. In one aspect, the situation is a driving situation in which a driver drives a vehicle on a roadway. In such case, a driving situation score is calculated based on the sensor data, and the behavior of the electronic personal assistant is altered based on the calculated driving situation score, such as suspending interactions by the electronic personal assistant with the driver to avoid the driver being distracted. Further features and advantages of the invention, as well as the structure and operation of various embodiments of the invention, are described in detail below with reference to the accompanying drawings. It is noted that the invention is not limited to the specific embodiments described herein. Such embodiments are presented herein for illustrative purposes only. Additional embodiments will be apparent to persons skilled in the relevant art(s) based on the teachings contained herein.",
  "date_published": "20171228",
  "title": "SITUATION AWARE PERSONAL ASSISTANT",
  "ipcr_labels": [
    "G06N300",
    "B60W4006"
  ],
  "_processing_info": {
    "original_size": 69039,
    "optimized_size": 3308,
    "reduction_percent": 95.21
  }
}