{
  "date_produced": "20170802",
  "publication_number": "US20170236068A1-20170817",
  "main_ipcr_label": "G06N9900",
  "decision": "PENDING",
  "application_number": "15194614",
  "inventor_list": [
    {
      "inventor_name_last": "Byron",
      "inventor_name_first": "Donna K.",
      "inventor_city": "Petersham",
      "inventor_state": "MA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "DiMascio",
      "inventor_name_first": "Carmine M.",
      "inventor_city": "West Roxbury",
      "inventor_state": "MA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Pinel",
      "inventor_name_first": "Florian",
      "inventor_city": "New York",
      "inventor_state": "NY",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Winkler",
      "inventor_name_first": "Timothy P.",
      "inventor_city": "Clinton",
      "inventor_state": "MA",
      "inventor_country": "US"
    }
  ],
  "abstract": "According to one exemplary embodiment, a method for adjusting taste balance in culinary recipes is provided. The method may include receiving a template recipe, and a new recipe. The method may include determining a first taste profile corresponding with the template recipe. The method may include determining a second taste profile corresponding with the new recipe. The method may include identifying a taste to boost based on comparing the first taste profile to the second taste profile. The method may include determining a boosting ingredient from a substitution ingredients list. The method may include determining a boosting ingredient quantity based on the boosting ingredient and comparing the first taste profile to the second taste profile. The method may include determining a step alteration for the new recipe based on the boosting ingredient and the boosting ingredient quantity.",
  "filing_date": "20160628",
  "patent_number": "None",
  "summary": "<SOH> SUMMARY <EOH>According to one exemplary embodiment, a method for adjusting taste balance in culinary recipes is provided. The method may include receiving a template recipe having a first plurality of ingredients and a first plurality of recipe steps, and a new recipe having a second plurality of ingredients and a second plurality of recipe steps. The method may also include determining a first taste profile corresponding with the received template recipe based on the first plurality of ingredients. The method may then include determining a second taste profile corresponding with the received new recipe based on the second plurality of ingredients. The method may further include identifying a taste to boost based on comparing the first taste profile to the second taste profile. The method may also include determining a boosting ingredient from a substitution ingredients list based on the second plurality of ingredients and the identified taste. The method may then include determining a boosting ingredient quantity based on the determined boosting ingredient and comparing the first taste profile to the second taste profile. The method may further include determining a step alteration based on the first plurality of ingredients, the first plurality of steps, the determined boosting ingredient, the determined boosting ingredient quantity, the second plurality of ingredients, and the second plurality of ingredient steps. According to another exemplary embodiment, a computer system for adjusting taste balance in culinary recipes is provided. The computer system may include one or more processors, one or more computer-readable memories, one or more computer-readable tangible storage devices, and program instructions stored on at least one of the one or more storage devices for execution by at least one of the one or more processors via at least one of the one or more memories, whereby the computer system is capable of performing a method. The method may include rece...",
  "date_published": "20170817",
  "title": "ADJUSTING BALANCE IN CULINARY RECIPES",
  "ipcr_labels": [
    "G06N9900",
    "G06N504"
  ],
  "_processing_info": {
    "original_size": 64124,
    "optimized_size": 3888,
    "reduction_percent": 93.94
  }
}