{
  "date_produced": "20171213",
  "publication_number": "US20170372205A1-20171228",
  "main_ipcr_label": "G06N504",
  "decision": "PENDING",
  "application_number": "15192036",
  "inventor_list": [
    {
      "inventor_name_last": "Brown",
      "inventor_name_first": "Michael Sean",
      "inventor_city": "Wahroonga",
      "inventor_state": "",
      "inventor_country": "AU"
    },
    {
      "inventor_name_last": "Costello",
      "inventor_name_first": "Sean R.",
      "inventor_city": "St. Leonards",
      "inventor_state": "",
      "inventor_country": "AU"
    },
    {
      "inventor_name_last": "Harrer",
      "inventor_name_first": "Stefan",
      "inventor_city": "Hampton",
      "inventor_state": "",
      "inventor_country": "AU"
    },
    {
      "inventor_name_last": "Plant",
      "inventor_name_first": "Laurence J.",
      "inventor_city": "North Balwyn",
      "inventor_state": "",
      "inventor_country": "AU"
    }
  ],
  "abstract": "A method and system for predicting system states is provided. The method includes receiving a first reference model associated with a first operational attribute of a system from a first integrated circuit internally comprising a first processing circuit and a first sensor measuring a first parameter of the system. Additionally, a second reference model associated with a second operational attribute of the system is received from a second integrated circuit internally comprising a second processing circuit and a second sensor measuring a second parameter of the system. A combination reference model based on the first reference model and the second reference model is generated and a predicted future state and associated operational attributes for the system are determined based on the combination reference model.",
  "filing_date": "20160624",
  "patent_number": "None",
  "summary": "<SOH> SUMMARY <EOH>A first aspect of the invention provides a distributed sensor network based predictive method comprising: receiving, by a processor of a hardware device from a first integrated circuit, a first reference model associated with a first operational attribute of a hardware system, wherein the first integrated circuit internally comprises a first processing circuit and a first sensor, wherein the first sensor measures a first parameter of the hardware system, and wherein the first processing circuit generates the first reference model based on the first parameter; receiving, by the processor from a second integrated circuit, a second reference model associated with a second operational attribute of the hardware system, wherein the second integrated circuit internally comprises a second processing circuit and a second sensor, wherein the second sensor measures a second parameter of the hardware system, wherein the second processing circuit generates the second reference model based on the second parameter, wherein the second operational attribute differs from the first operational attribute, and wherein the second parameter differs from the first parameter; generating, by the processor, a combination reference model based on the first reference model and the second reference model; and generating, by the processor based on the combination reference model, a predicted future state and associated operational attributes for the hardware system. A second aspect of the invention provides a computer program product, comprising a computer readable hardware storage device storing a computer readable program code, the computer readable program code comprising an algorithm that when executed by a processor of a hardware device implements a distributed sensor network based predictive method, the method comprising: receiving, by the processor from a first integrated circuit, a first reference model associated with a first operational attribute of a hardware system,...",
  "date_published": "20171228",
  "title": "SENSOR BASED SYSTEM STATE PREDICTION",
  "ipcr_labels": [
    "G06N504",
    "G06N9900",
    "G06T700"
  ],
  "_processing_info": {
    "original_size": 68385,
    "optimized_size": 3820,
    "reduction_percent": 94.41
  }
}