{
  "date_produced": "20171213",
  "publication_number": "US20170372225A1-20171228",
  "main_ipcr_label": "G06N9900",
  "decision": "PENDING",
  "application_number": "15195944",
  "inventor_list": [
    {
      "inventor_name_last": "Foresti",
      "inventor_name_first": "Adalberto",
      "inventor_city": "Kirkland",
      "inventor_state": "WA",
      "inventor_country": "US"
    }
  ],
  "abstract": "A method is provided that includes obtaining individual behavior data of a target user and crowd behavior data of other users, and executing a machine learning algorithm to determine performance benchmarks for tasks based on the crowd behavior data. The method further includes aggregating the other users into a plurality of user clusters, classifying the target user into one of the clusters, identifying one or more focus features of the target user that underperform at least one benchmark of the one or more features of the plurality of users in the user cluster to which the target user is classified, identify targeted content associated with the one or more tasks or chains of tasks based on the one or more identified features of the target user, and deliver the targeted content via the computing device.",
  "filing_date": "20160628",
  "patent_number": "None",
  "summary": "<SOH> SUMMARY <EOH>To address the above described challenges, a method is provided that includes obtaining individual behavior data from interactions of a target user with an application program on at least one computing devices, and obtaining crowd behavior data from interactions of a plurality of users with other instances of the application program on other computing devices. The method further includes executing a machine learning algorithm to determine one or more performance benchmarks for one or more tasks or chains of tasks based on the crowd behavior data, and aggregating the plurality of users into a plurality of user clusters based on similarity of one or more features between users. The method further includes classifying the target user into one of the plurality of user clusters based on similarity of one or more features between the target user and users in the user clusters, and from the individual behavior data and the crowd behavior data, identifying one or more focus features of the target user that underperform one or more benchmarks of the one or more features of the plurality of users in the user cluster to which the target user is classified. The method further includes, identifying targeted content associated with the one or more tasks or chains of tasks based on the one or more identified features of the target user, and delivering the targeted content via the computing device. This Summary is provided to introduce a selection of concepts in a simplified form that are further described below in the Detailed Description. This Summary is not intended to identify key features or essential features of the claimed subject matter, nor is it intended to be used to limit the scope of the claimed subject matter. Furthermore, the claimed subject matter is not limited to implementations that solve any or all disadvantages noted in any part of this disclosure.",
  "date_published": "20171228",
  "title": "TARGETING CONTENT TO UNDERPERFORMING USERS IN CLUSTERS",
  "ipcr_labels": [
    "G06N9900",
    "G06N308",
    "G06N304",
    "G06N700",
    "G06F1730"
  ],
  "_processing_info": {
    "original_size": 70611,
    "optimized_size": 3308,
    "reduction_percent": 95.32
  }
}