{
  "date_produced": "20171219",
  "publication_number": "US20180005110A1-20180104",
  "main_ipcr_label": "G06N308",
  "decision": "PENDING",
  "application_number": "15196346",
  "inventor_list": [
    {
      "inventor_name_last": "Gokmen",
      "inventor_name_first": "Tayfun",
      "inventor_city": "Briarcliff Manor",
      "inventor_state": "NY",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Perrone",
      "inventor_name_first": "Michael P.",
      "inventor_city": "Yorktown Heights",
      "inventor_state": "NY",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Vlasov",
      "inventor_name_first": "Yurii A.",
      "inventor_city": "Katonah",
      "inventor_state": "NY",
      "inventor_country": "US"
    }
  ],
  "abstract": "An array of resistive processing units (RPUs) comprises a plurality of rows of RPUs and a plurality of columns of RPUs wherein each RPU comprises an AND gate configured to perform an AND operation of a first stochastic bit stream received from a first stochastic translator translating a number encoded from a neuron in a row and a second stochastic bit stream received from a second stochastic translator translating a number encoded from a neuron in a column. A first storage is configured to store a weight value of the RPU, and a second storage is configured to store an amount of change to the weight value of the RPU. When the first stochastic bit stream and the second stochastic bit stream coincide, the amount of change to the weight value of the RPU is added to the weight value of the RPU.",
  "filing_date": "20160629",
  "patent_number": "None",
  "summary": "<SOH> SUMMARY <EOH>According to an embodiment of the present invention, an array of resistive processing units comprises a plurality of rows of resistive processing units and a plurality of columns of resistive processing units wherein each resistive processing unit comprises an AND gate configured to perform an AND operation of a first stochastic bit stream received from a first stochastic translator translating a number encoded from a neuron in a row and a second stochastic bit stream received from a second stochastic translator translating a number encoded from a neuron in a column. A first storage is configured to store a weight value of the resistive processing unit, and a second storage is configured to store an amount of change to the weight value of the resistive processing unit. When the first stochastic bit stream and the second stochastic bit stream coincide, the amount of change to the weight value of the resistive processing unit is added to the weight value of the resistive processing unit. According to another embodiment of the present invention, a neural network comprises an array of resistive processing units having a plurality of rows of resistive processing units; and a plurality of columns of resistive processing units, wherein each resistive processing unit comprises: an AND gate configured to perform an AND operation of a first stochastic bit stream received from a first stochastic translator translating a number encoded from a neuron in a row and a second stochastic bit stream received from a second stochastic translator translating a number encoded from a neuron in a column. A first storage is configured to store a weight value of the resistive processing unit, and a second storage is configured to store an amount of change to the weight value of the resistive processing unit. When the first stochastic bit stream and the second stochastic bit stream coincide, the amount of change to the weight value of the resistive processing unit is added t...",
  "date_published": "20180104",
  "title": "RESISTIVE PROCESSING UNITS AND NEURAL NETWORK TRAINING METHODS",
  "ipcr_labels": [
    "G06N308",
    "G06N3063",
    "G06N304"
  ],
  "_processing_info": {
    "original_size": 45068,
    "optimized_size": 3687,
    "reduction_percent": 91.82
  }
}