{
  "date_produced": "20161220",
  "publication_number": "US20170004416A1-20170105",
  "main_ipcr_label": "G06N9900",
  "decision": "PENDING",
  "application_number": "15198942",
  "inventor_list": [
    {
      "inventor_name_last": "Hummel",
      "inventor_name_first": "Robert",
      "inventor_city": "Great Falls",
      "inventor_state": "VA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Swetnam",
      "inventor_name_first": "Michael",
      "inventor_city": "Arlington",
      "inventor_state": "VA",
      "inventor_country": "US"
    }
  ],
  "abstract": "Systems and methods to determine machine intelligence are disclosed. Input information provided to a machine is evaluated via an interface with the machine. One or more operations automatically performed by the machine based on the input information are evaluated via the interface. A level of intelligence associated with the machine is determined based on the evaluation of the input information and the operations performed by the machine.",
  "filing_date": "20160630",
  "patent_number": "None",
  "summary": "<SOH> BRIEF SUMMARY OF THE INVENTION <EOH>Systems and methods to determine machine intelligence are disclosed. Input information provided to a machine is evaluated via an interface with the machine. One or more operations automatically performed by the machine based on the input information are evaluated via the interface. A level of intelligence associated with the machine is determined based on the evaluation of the input information and the operations performed by the machine. Additional features, advantages, and embodiments of the invention are set forth or apparent from consideration of the following detailed description, drawings and claims. Moreover, it is to be understood that both the foregoing summary of the invention and the following detailed description are exemplary and intended to provide further explanation without limiting the scope of the invention as claimed.",
  "date_published": "20170105",
  "title": "SYSTEMS AND METHODS FOR DETERMINING MACHINE INTELLIGENCE",
  "ipcr_labels": [
    "G06N9900",
    "G06F306"
  ],
  "_processing_info": {
    "original_size": 81424,
    "optimized_size": 2038,
    "reduction_percent": 97.5
  }
}