{
  "decision": "ACCEPTED",
  "application_number": "15194556",
  "date_published": "20161020",
  "date_produced": "20161005",
  "title": "COMPUTER-IMPLEMENTED SYSTEM AND METHOD FOR NOTIFYING USERS UPON THE OCCURRENCE OF AN EVENT",
  "filing_date": "20160627",
  "inventor_list": [
    {
      "inventor_name_last": "Kalajan",
      "inventor_name_first": "Kevin E.",
      "inventor_city": "Nevada City",
      "inventor_state": "CA",
      "inventor_country": "US"
    }
  ],
  "ipcr_labels": [
    "H04L1258",
    "H04N544",
    "H04W414",
    "G06F2162"
  ],
  "main_ipcr_label": "H04L1258",
  "summary": "<SOH> BRIEF DESCRIPTION OF THE DRAWINGS <EOH>Embodiments are illustrated by way of example and not limitation in the figures of the accompanying drawings, in which FIGS. 1-3 illustrate a prior art camera-enabled cellular telephone. FIG. 4 illustrates a camera-enabled mobile device supporting the functionality of an embodiment. FIG. 5 illustrates a system architecture for uploading images to one or more servers via the Internet. FIG. 6 illustrates a system architecture for uploading images to one or more servers via a proprietary network. FIG. 7 illustrates the image upload operation of one embodiment. FIG. 8 illustrates one embodiment of the image download process of an embodiment. FIG. 9 illustrates one embodiment of the image download process of an embodiment for use with animations. FIG. 10 illustrates one embodiment of the image download process of an embodiment for use with various client devices. FIG. 11 is a flow diagram illustrating processing for initial service ordering. FIG. 12 is a flow diagram illustrating processing for initial service activation, client side. FIG. 13 is a flow diagram illustrating processing for initial service activation, server side. FIGS. 14-15 are flow diagrams illustrating image pre-processing. FIG. 16 is a flow diagram illustrating subscriber processing. FIG. 17 is a flow diagram illustrating invited guest processing. FIG. 18 is a flow diagram illustrating processing for subscriber guest access management. FIG. 19 is a flow diagram illustrating processing for subscriber library access management. FIG. 20 is a flow diagram illustrating processing for invited guest animation generation. FIG. 21 is a flow diagram illustrating processing for invited guest voiceover interaction. FIGS. 22-24 illustrate various embodiments of the client control user interface. FIG. 25 is a processing flow diagram illustrating a processing sequence performed in one embodiment of the event notification process. detailed-description description=\"Detailed ...",
  "patent_number": "9667581",
  "abstract": "A computer-implemented system and method for notifying users on the occurrence of an event is disclosed. An embodiment further includes notifying selected users upon the occurrence of particular events in sessions using a variety of notification methods.",
  "publication_number": "US20160308813A1-20161020",
  "_processing_info": {
    "original_size": 110855,
    "optimized_size": 2879,
    "reduction_percent": 97.4
  }
}