{
  "date_produced": "20171219",
  "publication_number": "US20180005122A1-20180104",
  "main_ipcr_label": "G06N504",
  "decision": "PENDING",
  "application_number": "15199514",
  "inventor_list": [
    {
      "inventor_name_last": "McDaid",
      "inventor_name_first": "Joseph John",
      "inventor_city": "Seattle",
      "inventor_state": "WA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Campbell",
      "inventor_name_first": "Johnny S.",
      "inventor_city": "Woodinville",
      "inventor_state": "WA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Rampson",
      "inventor_name_first": "Benjamin Edward",
      "inventor_city": "Woodinville",
      "inventor_state": "WA",
      "inventor_country": "US"
    }
  ],
  "abstract": "Aspects of the present disclosure relate to systems and methods for automatically constructing a new formula based upon an existing formula. Various methods are employed to analyze an existing formula in order to determine an intent. Once the intent is determined, a new formula may be constructed that satisfies the intent of the existing formula. Further aspects relate to validating the new formula to ensure it produces the same result as the existing formula which it is intended to replace. Various user interface elements are also disclosed which may be employed to provide the newly constructed formulas to users of an application. The various aspects to disclosed herein may be performed by an application, such as a spreadsheet application, performed in real-time, or provided as a remote service.",
  "filing_date": "20160630",
  "patent_number": "None",
  "summary": "<SOH> SUMMARY <EOH>Aspects of the present disclosure relate to systems and methods for automatically constructing a new formula based upon an existing formula. A formula may be analyzed to determine an intent of the formula. The new formula may then automatically be constructed based upon the determined intent. Various methods for determining the intent of a formula are disclosed herein. Additional aspects relate to validating a new formula to ensure that it produces the same result as the existing formula it is intended to replace. The validation may be used to generate audit information for display to the user prior to committing the new formula. The various aspects to disclosed herein may be performed by an application, such as a spreadsheet application, performed in real-time, or provided as a remote service. This summary is provided to introduce a selection of concepts in a simplified form that are further described below in the Detailed Description. This summary is not intended to identify key features or essential features of the claimed subject matter, nor is it intended to be used to limit the scope of the claimed subject matter.",
  "date_published": "20180104",
  "title": "CONSTRUCTING NEW FORMULAS THROUGH AUTO REPLACING FUNCTIONS",
  "ipcr_labels": [
    "G06N504",
    "G06N700"
  ],
  "_processing_info": {
    "original_size": 98276,
    "optimized_size": 2834,
    "reduction_percent": 97.12
  }
}