{
  "date_produced": "20161005",
  "publication_number": "US20160307112A1-20161020",
  "main_ipcr_label": "G06N9900",
  "decision": "ACCEPTED",
  "application_number": "15195459",
  "inventor_list": [
    {
      "inventor_name_last": "Dilabio",
      "inventor_name_first": "Gino A.",
      "inventor_city": "Edmonton",
      "inventor_state": "",
      "inventor_country": "CA"
    },
    {
      "inventor_name_last": "Wolkow",
      "inventor_name_first": "Robert A.",
      "inventor_city": "Edmonton",
      "inventor_state": "",
      "inventor_country": "CA"
    },
    {
      "inventor_name_last": "Pitters",
      "inventor_name_first": "Jason L.",
      "inventor_city": "Edmonton",
      "inventor_state": "",
      "inventor_country": "CA"
    },
    {
      "inventor_name_last": "Piva",
      "inventor_name_first": "Paul G.",
      "inventor_city": "Edmonton",
      "inventor_state": "",
      "inventor_country": "CA"
    }
  ],
  "abstract": "A quantum device is provided that includes controllably quantum mechanically coupled dangling bonds extending from a surface of a semiconductor material. Each of the controllably quantum mechanically coupled dangling bonds has a separation of at least one atom of the semiconductor material. At least one electrode is provided for selectively modifying an electronic state of the controllably quantum mechanically coupled dangling bonds. By providing at least one additional electron within the controllably quantum mechanically coupled dangling bonds with the proviso that there exists at least one unoccupied dangling bond for each one additional electron present, the inventive device is operable at least to 293 degrees Kelvin and is largely immune to stray electrostatic perturbations. Room temperature operable quantum cellular automata and qubits are constructed therefrom.",
  "filing_date": "20160628",
  "patent_number": "9704101",
  "summary": "<SOH> SUMMARY OF THE INVENTION <EOH>A quantum device is provided that includes controllably quantum mechanically coupled dangling bonds of a material. Each of the controllably quantum mechanically coupled dangling bonds has a separation from the remainder of the controllably quantum mechanically coupled dangling bonds of at least one atom of the material. At least one electrode is provided for selectively modifying an electronic state of the controllably quantum mechanically coupled dangling bonds. Silicon surface atoms bonded to only three other silicon atoms are well suited for formation of the dangling bonds and are formed with a desired separation. Separations of between 3 and 40 Angstroms are well suited for quantum mechanical coupling interactions between the dangling bonds. By providing at least one additional electron within the controllably quantum mechanically coupled dangling bonds with the proviso that there exists at least one unoccupied dangling bond for each one additional electron present, the inventive device is operable at least to 293 degrees Kelvin and is largely immune to stray electrostatic perturbations. Quantum cellular automata operable at temperatures of 293 Kelvin and above are formed by providing multiple such devices in communication through interconnects. A qubit operable at temperatures of 293 Kelvin and above has controllably quantum mechanically coupled dangling bonds extending from a surface of a material and at least two electrodes forming a quantum circuit for quantum computation that provides an infinite set of superpositioned values intermediate between digital logic levels of 0 and 1.",
  "date_published": "20161020",
  "title": "ATOMISTIC QUANTUM DOTS",
  "ipcr_labels": [
    "G06N9900",
    "H01L4900"
  ],
  "_processing_info": {
    "original_size": 68927,
    "optimized_size": 3492,
    "reduction_percent": 94.93
  }
}