{
  "date_produced": "20161228",
  "publication_number": "US20170011288A1-20170112",
  "main_ipcr_label": "G06N304",
  "decision": "PENDING",
  "application_number": "15193741",
  "inventor_list": [
    {
      "inventor_name_last": "Brothers",
      "inventor_name_first": "John W.",
      "inventor_city": "Calistoga",
      "inventor_state": "CA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Lee",
      "inventor_name_first": "Joohoon",
      "inventor_city": "East Palo Alto",
      "inventor_state": "CA",
      "inventor_country": "US"
    }
  ],
  "abstract": "Implementing a neural network can include receiving a macro instruction for implementing the neural network within a control unit of a neural network processor. The macro instruction can indicate a first data set, a second data set, a macro operation for the neural network, and a mode of operation for performing the macro operation. The macro operation can be automatically initiated using a processing unit of the neural network processor by applying the second data set to the first data set based on the mode of operation.",
  "filing_date": "20160627",
  "patent_number": "None",
  "summary": "<SOH> SUMMARY <EOH>One or more embodiments include a method. The method includes receiving a macro instruction for implementing a neural network within a control unit of a neural network processor. The macro instruction indicates a first data set, a second data set, a macro operation for the neural network, and a mode of operation for performing the macro operation. The method also includes automatically initiating the macro operation using a processing unit of the neural network processor by applying the second data set to the first data set based on the mode of operation. One or more other embodiments include an apparatus. The apparatus includes a control unit configured to receive a macro instruction. The macro instruction indicates a first data set, a second data set, a macro operation for the neural network, and a mode of operation for performing the macro operation. The apparatus includes a memory unit coupled to the control unit. The memory unit is configured to store the data sets. The apparatus also includes a processing unit coupled to the memory unit. The processing unit is configured to automatically initiate the macro operation by applying the second data set to the first data set based on the mode of operation. One or more other embodiments include a computer program product including a computer readable storage medium having program code stored thereon. The program code is executable by a processor to receive a macro instruction for implementing a neural network. The macro instruction indicates a first data set, a second data set, a macro operation for the neural network, and a mode of operation for performing the macro operation. The program code is further executable by the processor to automatically initiate the macro operation by applying the second data set to the first data set based on the mode of operation. This Summary section is provided merely to introduce certain concepts and not to identify any key or essential features of the claimed sub...",
  "date_published": "20170112",
  "title": "NEURAL NETWORK PROCESSOR",
  "ipcr_labels": [
    "G06N304",
    "G06F930"
  ],
  "_processing_info": {
    "original_size": 96325,
    "optimized_size": 3204,
    "reduction_percent": 96.67
  }
}