{
  "decision": "PENDING",
  "application_number": "15208533",
  "date_published": "20170223",
  "date_produced": "20170208",
  "title": "SYSTEM AND METHOD FOR CREATING AN ELECTRONICALLY STORED CONSENSUAL SEX AFFIRMATION",
  "filing_date": "20160712",
  "inventor_list": [
    {
      "inventor_name_last": "MARK",
      "inventor_name_first": "GERALD",
      "inventor_city": "IRVINE",
      "inventor_state": "CA",
      "inventor_country": "US"
    }
  ],
  "ipcr_labels": [
    "G06Q5018",
    "H04L1258"
  ],
  "main_ipcr_label": "G06Q5018",
  "summary": "<SOH> SUMMARY OF THE DISCLOSURE <EOH>To minimize the limitations found in the prior art, and to minimize other limitations that will be apparent upon the reading of the specification, the present invention is a system of creating an electronically stored sex affirmation consent between two individuals before engaging in sexual activity. In the preferred embodiment, a consensual sex affirmation storing system is in communication with at least one electronic portable communication device via a communication network. The consensual sex affirmation storing system resides on a central computer having a processor installed with a consensual sex affirmation software application and coupled with a memory unit integrated with a central database. The consensual sex affirmation storing system further comprising, a welcome module, a consensual sex affirmation acknowledgement module, a user authorization module, an identification module, a verification module, a code generation module, a declaration module, a consensual sex affirmation sending module, and a consensual sex affirmation storage module. The method initiates by enabling a first individual to open the consensual sex affirmation software application utilizing a welcome module through at least one electronic portable communication device such as a smart phone, a laptop, a tablet computer and a hand-held digital media communication device. A continue button on a welcome screen of the consensual sex affirmation software application leads the first individual to the consensual sex affirmation acknowledgement process. During the consensual sex affirmation acknowledgement process, the first individual and a second individual accepts a plurality of terms to move forward with the process utilizing a consensual sex affirmation acknowledgement module. An authorization module authorizes whether the first individual is the owner of the at least one electronic portable communication device and stores a plurality of the contact deta...",
  "patent_number": "None",
  "abstract": "The consensual sex affirmation storing system for creating an electronically stored sex affirmation consent, resides on a central computer having a processor installed with a consensual sex affirmation software application and coupled with a memory unit integrated with a central database. The central computer executes a computer readable program code embodied in a non-transitory computer-readable medium. The computer readable program code includes a set of instructions for executing a method for creating an electronically stored consensual sex affirmation between two individuals prior to the sexual activity. The consensual sex affirmation storing system further comprising, a welcome module, a consensual sex affirmation acknowledgement module, a user authorization module, an identification module, a verification module, a code generation module, a declaration module, a consensual sex affirmation sending module, and a consensual sex affirmation storage module.",
  "publication_number": "US20170053364A1-20170223",
  "_processing_info": {
    "original_size": 52582,
    "optimized_size": 3552,
    "reduction_percent": 93.24
  }
}