{
  "date_produced": "20171227",
  "publication_number": "US20180012119A1-20180111",
  "main_ipcr_label": "G06N300",
  "decision": "PENDING",
  "application_number": "15206286",
  "inventor_list": [
    {
      "inventor_name_last": "Datta",
      "inventor_name_first": "Asim Kumar",
      "inventor_city": "Cambridge",
      "inventor_state": "",
      "inventor_country": "GB"
    }
  ],
  "abstract": "This invention relates to non-mechanical robotic software for conducting, dictating and monitoring day-to-day regular activities of business operations of an organisation being automated by adaptation of principle of servomechanism closed loop feedback control system of engineering. A “Business Operation” is defined as a sequence of particular order in which related structured activities that serve a particular business goal follow each other, and structured activities are processes and events. The control system operates in real time and automatic generation of feedback for identifying next activity to be conducted is enabled by an innovative data driven automatic generation of feedback technique. This closed loop feedback control system continues conducting activities of all occurrences of business operations automatically until a feedback identifies a terminator activity of a particular occurrence marking completion of conducting that occurrence.",
  "filing_date": "20160710",
  "patent_number": "None",
  "summary": "<SOH> BRIEF SUMMARY OF THE INVENTION <EOH>[01] “Robotic Conductor of Business Operations Software” (RCBOS) is invented with the main objective of producing a fully automated ongoing non-mechanical robotic software for business system operating in real time for conducting business operations of any organisation. In doing so the software behaves like a human by acting as the sole driving force by taking full responsibility of conducting all day-to-day regular activities of business operations of an organisation from start to finish, as distinct from business process management type of software that are primarily for aiding and improving business functions. In the course of conducting business activities the system robotically dictates and monitors tasks of human operators of the business. [02] Regular business activities of a business operation conducted by the software are defined as follows: A “Business Operation” is defined as sequence of combination of related structured business activities in a particular order that follow each other to serve a particular business goal and related structured business activities conducted by this software are of two types, one type is process and the other type is event, and these two types of activities are defined as follows: A “Process” of a business operation is defined as a method of the stages involved in performing a certain business procedure. An “Event” of a business operation is defined as a happening of importance or outcome of a Process in the course of a Business Operation. Hereinafter the term business activity will collectively mean overall business activity of business operation and also two related business activities of said process and said event. Whereas the aforesaid two related business activities of said process and said event hereinafter may be collectively referred to as activity or activities to mean process or event or both. However, although overall business activity of whole of a business operation con...",
  "date_published": "20180111",
  "title": "Robotic Conductor of Business Operations Software",
  "ipcr_labels": [
    "G06N300",
    "G06Q1010",
    "G06Q1006"
  ],
  "_processing_info": {
    "original_size": 145442,
    "optimized_size": 3576,
    "reduction_percent": 97.54
  }
}