{
  "decision": "PENDING",
  "application_number": "15200945",
  "date_published": "20170216",
  "date_produced": "20170201",
  "title": "MINICOMPUTER WITH A ROTATING UNIT AND METHOD OF OPERATING THE MINICOMPUTER",
  "filing_date": "20160701",
  "inventor_list": [
    {
      "inventor_name_last": "BATTLOGG",
      "inventor_name_first": "STEFAN",
      "inventor_city": "ST. ANTON I.M.",
      "inventor_state": "",
      "inventor_country": "AT"
    }
  ],
  "ipcr_labels": [
    "G06F30362",
    "G05G108",
    "F16D5700",
    "G04G2108",
    "G06F116",
    "G06F30482",
    "G06F30487",
    "G05G503",
    "G06F3038"
  ],
  "main_ipcr_label": "G06F30362",
  "summary": "<SOH> SUMMARY OF THE INVENTION <EOH>It is accordingly an object of the invention to provide a device and a method which overcome the above-mentioned and other disadvantages of the heretofore-known devices and methods of this general type and which provide for an improved operation option for minicomputers and, in particular, for smartwatches. With the foregoing and other objects in view there is provided, in accordance with the invention, a minicomputer, comprising: (1) a processor, a display unit connected to said processor and a communication unit connected to said processor; (2) a haptic operating device including a rotatable rotating unit having a rotational resistance opposing a rotation thereof; (3) a controllable transmission apparatus operatively associated with said rotating unit and configured for dynamically changing a rotational resistance against a rotation of said rotating unit during the rotation thereof, said controllable transmission apparatus including a magnetic field generating unit and an amount of magnetorheological medium disposed to magnetically adhere to said rotating unit upon being subjected to a magnetic field generated by said magnetic field generating unit and to thereby vary the rotational resistance acting on said haptic operating device against a rotation thereof; and (4) a control device configured for adjusting the rotational resistance of said haptic operating device A minicomputer according to the invention is in the form of a smartwatch or a smart device, in particular, and can be worn on a user's wrist, for example. The minicomputer has at least one processor and at least one display unit and at least one communication unit. A haptic operating device is also provided. The haptic operating device has, in particular, a basic body and a rotatable rotating unit. The haptic operating device has a rotational resistance which can be changed by means of a control device. The haptic operating device also preferably has a controllable tr...",
  "patent_number": "None",
  "abstract": "A minicomputer has a processor and a display unit and a communication unit and a haptic operating device. The haptic operating device has a rotatable rotating unit with a rotational resistance which can be changed by way of a control device. Selectable menu items are displayed on a display unit and a menu item is selected by rotating the rotating unit. A rotational resistance of the rotating unit is dynamically changed during a rotation of the rotating unit and the rotating unit is latched at a plurality of haptically perceptible latching points during the rotation of the rotating unit.",
  "publication_number": "US20170045958A1-20170216",
  "_processing_info": {
    "original_size": 202039,
    "optimized_size": 3260,
    "reduction_percent": 98.39
  }
}