{
  "decision": "PENDING",
  "application_number": "15207445",
  "date_published": "20180111",
  "date_produced": "20171227",
  "title": "QUESTION GENERATION SYSTEMS AND METHODS FOR AUTOMATING DIAGNOSIS",
  "filing_date": "20160711",
  "inventor_list": [
    {
      "inventor_name_last": "Zhong",
      "inventor_name_first": "Erheng",
      "inventor_city": "Sunnyvale",
      "inventor_state": "CA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Liu",
      "inventor_name_first": "Chaochun",
      "inventor_city": "San Jose",
      "inventor_state": "CA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Xie",
      "inventor_name_first": "Yusheng",
      "inventor_city": "Campbell",
      "inventor_state": "CA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Du",
      "inventor_name_first": "Nan",
      "inventor_city": "Palo Alto",
      "inventor_state": "CA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Fei",
      "inventor_name_first": "Hongliang",
      "inventor_city": "Sunnyvale",
      "inventor_state": "CA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Zhen",
      "inventor_name_first": "Yi",
      "inventor_city": "San Jose",
      "inventor_state": "CA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Cao",
      "inventor_name_first": "Yu",
      "inventor_city": "Santa Clara",
      "inventor_state": "CA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Wang",
      "inventor_name_first": "Richard Chun Ching",
      "inventor_city": "Mountain View",
      "inventor_state": "CA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Zhou",
      "inventor_name_first": "Dawen",
      "inventor_city": "Fremont",
      "inventor_state": "CA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Fan",
      "inventor_name_first": "Wei",
      "inventor_city": "Sunnyvale",
      "inventor_state": "CA",
      "inventor_country": "US"
    }
  ],
  "ipcr_labels": [
    "G06F1900",
    "G06F1730"
  ],
  "main_ipcr_label": "G06F1900",
  "summary": "<SOH> BRIEF DESCRIPTION OF THE DRAWINGS <EOH>References will be made to embodiments of the invention, examples of which may be illustrated in the accompanying figures. These figures are intended to be illustrative, not limiting. Although the invention is generally described in the context of these embodiments, it should be understood that it is not intended to limit the scope of the invention to these particular embodiments. Items in the figures are not to scale. FIG. 1 shows an overall framework for automatic diagnostics according to embodiments of the present disclosure. FIG. 2 illustrates an exemplary knowledge graph according to embodiments of the present disclosure. FIG. 3 illustrates an exemplary flow diagram for automatic diagnostics based on collected symptoms according to embodiments of the present disclosure. FIG. 4 depicts an exemplary flow diagram of generating candidate symptoms based on observed symptoms according to embodiments of the present disclosure. FIG. 5 depicts an exemplary flow diagram of selecting discriminating candidate symptoms according to embodiments of the present disclosure. FIG. 6 shows an exemplary flow diagram of candidate symptom filtering and dimensional information verification according to embodiments of the present disclosure. FIG. 7 depicts a simplified block diagram of a computing device/information handling system, in accordance with embodiments of the present disclosure. detailed-description description=\"Detailed Description\" end=\"lead\"?",
  "patent_number": "None",
  "abstract": "Systems and methods are disclosed for question generation to obtain more related medical information based on observed symptoms from a patient. In embodiments, possible diseases associated with the observed symptoms are generated by querying a knowledge graph. In embodiments, candidate symptoms associated with the possible diseases are also identified and are combined with the observed symptoms to obtain combined symptom sets. In embodiments, discriminative scores for the candidate symptom sets are determined and candidate symptoms with top discriminative scores are selected. In embodiments, these selected candidate symptoms may be checked for conflicts with observed symptoms and removed from further consideration if a conflict exists. In embodiments, one or more questions may be generated based on the remaining selected candidate systems to aid in collecting information about the patient. In embodiments, the process may be repeated with the updated observed symptoms.",
  "publication_number": "US20180011979A1-20180111",
  "_processing_info": {
    "original_size": 39771,
    "optimized_size": 4356,
    "reduction_percent": 89.05
  }
}