{
  "decision": "PENDING",
  "application_number": "15206038",
  "date_published": "20170112",
  "date_produced": "20161228",
  "title": "INFORMATION PROCESSING APPARATUS, METHOD FOR CONTROLLING INFORMATION PROCESSING APPARATUS, AND STORAGE MEDIUM",
  "filing_date": "20160708",
  "inventor_list": [
    {
      "inventor_name_last": "Sato",
      "inventor_name_first": "Kei",
      "inventor_city": "Kawasaki-shi",
      "inventor_state": "",
      "inventor_country": "JP"
    }
  ],
  "ipcr_labels": [
    "H04N144",
    "H04N100",
    "G06F2131"
  ],
  "main_ipcr_label": "H04N144",
  "summary": "<SOH> SUMMARY <EOH>According to an aspect of the present invention, an information processing apparatus includes a storage unit configured to store, as user information of a user capable of logging into the information processing apparatus, first user information of a user having particular authority and second user information of a user having no particular authority, a display control unit configured to display a list of, from the user information stored in the storage unit, user information including the second user information but not first user information, and a login processing unit configured to perform a login process that, according to selection of user information from the list, enables a user corresponding to the selected user information to log into the information processing apparatus. Further features of aspects of the present invention will become apparent from the following description of exemplary embodiments with reference to the attached drawings.",
  "patent_number": "None",
  "abstract": "An information processing apparatus stores, as user information of a user capable of logging into the information processing apparatus, first user information of a user having particular authority and second user information of a user having no particular authority. The information processing apparatus displays a list of, from the stored user information, user information that includes the second user information and no first user information. Then, the information processing apparatus performs a login process enabling a user corresponding to user information selected from the list to log into the information processing apparatus.",
  "publication_number": "US20170013170A1-20170112",
  "_processing_info": {
    "original_size": 47366,
    "optimized_size": 2233,
    "reduction_percent": 95.29
  }
}