{
  "date_produced": "20161019",
  "publication_number": "US20160321552A1-20161103",
  "main_ipcr_label": "G06N504",
  "decision": "ACCEPTED",
  "application_number": "15208772",
  "inventor_list": [
    {
      "inventor_name_last": "Peev",
      "inventor_name_first": "Igor",
      "inventor_city": "Arlington",
      "inventor_state": "WA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Sun",
      "inventor_name_first": "Jimmy Y.",
      "inventor_city": "Sammamish",
      "inventor_state": "WA",
      "inventor_country": "US"
    }
  ],
  "abstract": "Automatic recognition and presentation of insights of data is provided through analysis of overall data to infer locations of a user's data. Statistical, heuristic, and comparable analysis on the user's data sets is used to determine insights such as trends, correlations, outliers, comparisons, and patterns. The insights are then presented to the user through automatically optimized visualizations (highlighting determined insights), emphasis on presented raw data, data formatting suggestions, and similar ones with the capability to explore further.",
  "filing_date": "20160713",
  "patent_number": "9589233",
  "summary": "<SOH> SUMMARY <EOH>This summary is provided to introduce a selection of concepts in a simplified form that are further described below in the Detailed Description. This summary is not intended to exclusively identify key features or essential features of the claimed subject matter, nor is it intended as an aid in determining the scope of the claimed subject matter. Embodiments are directed to automatic recognition and presentation of insights in various types of data. In some examples, overall data may be analyzed and full extent of data sets within the overall data determined in order to infer locations of a user's data. The user's data sets may then be subjected to various analyses such as statistical, heuristic, and comparable ones to determine insights such as trends, correlations, outliers, comparisons, and patterns. The insights may be presented to the user in form of automatically optimized visualizations (highlighting determined insights), emphasis on presented raw data, data formatting suggestions, and similar ones with the capability to explore further. These and other features and advantages will be apparent from a reading of the following detailed description and a review of the associated drawings. It is to be understood that both the foregoing general description and the following detailed description are explanatory and do not restrict aspects as claimed.",
  "date_published": "20161103",
  "title": "AUTOMATIC RECOGNITION AND INSIGHTS OF DATA",
  "ipcr_labels": [
    "G06N504",
    "G06N700",
    "G06N9900"
  ],
  "_processing_info": {
    "original_size": 41292,
    "optimized_size": 2643,
    "reduction_percent": 93.6
  }
}