{
  "date_produced": "20171219",
  "publication_number": "US20180005124A1-20180104",
  "main_ipcr_label": "G06N504",
  "decision": "PENDING",
  "application_number": "15201068",
  "inventor_list": [
    {
      "inventor_name_last": "Obara",
      "inventor_name_first": "Yachiko",
      "inventor_city": "Tokyo",
      "inventor_state": "",
      "inventor_country": "JP"
    },
    {
      "inventor_name_last": "Ohsawa",
      "inventor_name_first": "Shohei",
      "inventor_city": "Tokyo",
      "inventor_state": "",
      "inventor_country": "JP"
    },
    {
      "inventor_name_last": "Osogami",
      "inventor_name_first": "Takayuki",
      "inventor_city": "Tokyo",
      "inventor_state": "",
      "inventor_country": "JP"
    }
  ],
  "abstract": "Rating models may be generated by obtaining a plurality of consumption values, obtaining a plurality of rating values, training a model that estimates consumption values and rating values by utilizing a plurality of consumer attributes for each consumer, a plurality of item attributes for each item, and a plurality of weights for each attribute of each combination of a consumer and an item. Each estimated consumption value is a function of the plurality of weights for each attribute of each combination of each consumer and each item that corresponds with the estimated consumption value, and each estimated rating value is a function of the plurality of consumer attributes of a consumer that corresponds with the estimated rating value, the plurality of item attributes of an item that corresponds with the estimated rating value, and the plurality of weights that corresponds with the estimated rating value.",
  "filing_date": "20160701",
  "patent_number": "None",
  "summary": "<SOH> SUMMARY <EOH>According to a first aspect of the present invention, provided is an apparatus including a processor and one or more computer readable mediums collectively including instructions that, when executed by the processor, cause the processor to obtain a plurality of consumption values, wherein each consumption value indicates whether a consumer among a plurality of consumers has rated an item among a plurality of items, obtain a plurality of rating values, wherein each rating value represents a rating of an item by a consumer for each consumption value indicating that the corresponding consumer rated the corresponding item, train a model that estimates consumption values and rating values by utilizing a plurality of consumer attributes for each consumer, a plurality of item attributes for each item, and a plurality of weights for each attribute of each combination of a consumer and an item. Each estimated consumption value is a function of the plurality of weights for each attribute of each combination of each consumer and each item that corresponds with the estimated consumption value, and each estimated rating value is a function of the plurality of consumer attributes of a consumer that corresponds with the estimated rating value, the plurality of item attributes of an item that corresponds with the estimated rating value, and the plurality of weights that corresponds with the estimated rating value. The first aspect may also include a method implemented by the apparatus and a program product for performing the method. The summary clause does not necessarily describe all features of the embodiments of the present invention. Embodiments of the present invention may also include sub-combinations of the features described above.",
  "date_published": "20180104",
  "title": "RATING MODEL GENERATION",
  "ipcr_labels": [
    "G06N504",
    "G06N9900",
    "G06N700",
    "G06Q3006",
    "G06F1716"
  ],
  "_processing_info": {
    "original_size": 62791,
    "optimized_size": 3523,
    "reduction_percent": 94.39
  }
}