{
  "decision": "PENDING",
  "application_number": "15207015",
  "date_published": "20170112",
  "date_produced": "20161228",
  "title": "ELECTRONIC DEVICE AND NOTIFICATION METHOD THEREOF",
  "filing_date": "20160711",
  "inventor_list": [
    {
      "inventor_name_last": "LEE",
      "inventor_name_first": "Ji Hun",
      "inventor_city": "Seoul",
      "inventor_state": "",
      "inventor_country": "KR"
    },
    {
      "inventor_name_last": "PARK",
      "inventor_name_first": "Joo Yeon",
      "inventor_city": "Seoul",
      "inventor_state": "",
      "inventor_country": "KR"
    },
    {
      "inventor_name_last": "YOON",
      "inventor_name_first": "Hae Mi",
      "inventor_city": "Seoul",
      "inventor_state": "",
      "inventor_country": "KR"
    },
    {
      "inventor_name_last": "LEE",
      "inventor_name_first": "Hyun Yeul",
      "inventor_city": "Seoul",
      "inventor_state": "",
      "inventor_country": "KR"
    }
  ],
  "ipcr_labels": [
    "H04M1725",
    "G06F30488",
    "H04M1904",
    "G06F30481"
  ],
  "main_ipcr_label": "H04M1725",
  "summary": "<SOH> SUMMARY <EOH>An aspect of the present disclosure is to provide an electronic device that provides a notification through a user interface selected according to a kind of notification and provides an additional service associated with a notification event and a notification method of the electronic device. In accordance with an aspect of the present disclosure, an electronic device is provided. The electronic device includes an input module configured to receive a user input, a display configured to display a user interface, and a processor configured to execute a first application if a notification event is generated, display an incoming call user interface provided by the first application, on the display, and provide a user with a conversation service through the first application if a call acceptance command is input from the user. In accordance with another aspect of the present disclosure, a notification method of an electronic device is provided. The notification method of the electronic device includes executing, by the electronic device, a first application if a notification event is generated, displaying, on a display, an incoming call user interface provided by the first application, receiving, by the electronic device, a call acceptance command from a user, and providing, by the electronic device, the user with a conversation service through the first application.",
  "patent_number": "None",
  "abstract": "An electronic device and a notification method of the electronic device are provided. The electronic device includes an input module configured to receive a user input, a display configured to display a user interface, and a processor configured to execute a first application if a notification event is generated, display an incoming call user interface provided by the first application, on the display, and provide a user with a conversation service through the first application if a call acceptance command is input from the user. The notification method of the electronic device includes executing, by the electronic device, a first application if a notification event is generated; displaying, on a display, an incoming call user interface provided by the first application; receiving, by the electronic device, a call acceptance command from a user; and providing, by the electronic device, the user with a conversation service through the first application.",
  "publication_number": "US20170013118A1-20170112",
  "_processing_info": {
    "original_size": 59719,
    "optimized_size": 3356,
    "reduction_percent": 94.38
  }
}