{
  "date_produced": "20161228",
  "publication_number": "US20170011308A1-20170112",
  "main_ipcr_label": "G06N9900",
  "decision": "PENDING",
  "application_number": "15202723",
  "inventor_list": [
    {
      "inventor_name_last": "Sun",
      "inventor_name_first": "Seng",
      "inventor_city": "Wesley Chapel",
      "inventor_state": "FL",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Porth",
      "inventor_name_first": "Joshua",
      "inventor_city": "Tampa",
      "inventor_state": "FL",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Panicker",
      "inventor_name_first": "George",
      "inventor_city": "Broomfield",
      "inventor_state": "CO",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Kramer",
      "inventor_name_first": "Kurt",
      "inventor_city": "St. Petersburg",
      "inventor_state": "FL",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "McNally",
      "inventor_name_first": "Daniel N.",
      "inventor_city": "Tampa",
      "inventor_state": "FL",
      "inventor_country": "US"
    }
  ],
  "abstract": "A method for receiving a description of a problem and applying machine learning to automatically solve the problem includes receiving, by a first computing device, from a second computing device, via a user interface component, a description of a first problem. The method includes assigning, by a clustering engine executing on the first computing device, the first problem to a class. The method includes identifying, by a correlation engine executing on the first computing device, a first database associated with the class. The method includes retrieving, by the correlation engine, from the identified database, first data relevant to the first problem. The method includes providing, by the first computing device, via the user interface component, a suggestion for solving the first problem, based on the retrieved first data.",
  "filing_date": "20160706",
  "patent_number": "None",
  "summary": "<SOH> SUMMARY <EOH>In one aspect, a method for receiving a description of a problem and applying machine learning to automatically solve the problem includes receiving, by a first computing device, from a second computing device, via a user interface component, a description of a first problem. The method includes assigning, by a clustering engine executing on the first computing device, the first problem to a class. The method includes identifying, by a correlation engine executing on the first computing device, a first database associated with the class. The method includes retrieving, by the correlation engine, from the identified database, first data relevant to the first problem. The method includes providing, by the first computing device, via the user interface component, a suggestion for solving the first problem, based on the retrieved first data.",
  "date_published": "20170112",
  "title": "Methods and Systems for Applying Machine Learning to Automatically Solve Problems",
  "ipcr_labels": [
    "G06N9900",
    "G06F30484",
    "G06F1730"
  ],
  "_processing_info": {
    "original_size": 94506,
    "optimized_size": 2884,
    "reduction_percent": 96.95
  }
}