{
  "date_produced": "20171219",
  "publication_number": "US20180005130A1-20180104",
  "main_ipcr_label": "G06N700",
  "decision": "PENDING",
  "application_number": "15200509",
  "inventor_list": [
    {
      "inventor_name_last": "DONG",
      "inventor_name_first": "WEI SHAN",
      "inventor_city": "BEIJING",
      "inventor_state": "",
      "inventor_country": "CN"
    },
    {
      "inventor_name_last": "GAO",
      "inventor_name_first": "PENG",
      "inventor_city": "BEIJING",
      "inventor_state": "",
      "inventor_country": "CN"
    },
    {
      "inventor_name_last": "LI",
      "inventor_name_first": "CHANG SHENG",
      "inventor_city": "BEIJING",
      "inventor_state": "",
      "inventor_country": "CN"
    },
    {
      "inventor_name_last": "MA",
      "inventor_name_first": "CHUN YANG",
      "inventor_city": "BEJING",
      "inventor_state": "",
      "inventor_country": "CN"
    },
    {
      "inventor_name_last": "YAN",
      "inventor_name_first": "JUNCHI",
      "inventor_city": "SHANGHAI",
      "inventor_state": "",
      "inventor_country": "CN"
    },
    {
      "inventor_name_last": "YAO",
      "inventor_name_first": "REN JIE",
      "inventor_city": "BEIJING",
      "inventor_state": "",
      "inventor_country": "CN"
    }
  ],
  "abstract": "A method of generating a predictor to classify data includes: training each of a plurality of first classifiers arranged in a first level on current training data; operating each classifier of the first level on the training data to generate a plurality of predictions; combining the current training data with the predictions to generated new training data; and training each of a plurality of second classifiers arranged in a second level on the new training data. The first classifiers are classifiers of different classifier types, respectively and the second classifiers are classifiers of the different classifier types, respectively.",
  "filing_date": "20160701",
  "patent_number": "None",
  "summary": "<SOH> BRIEF SUMMARY <EOH>According to an exemplary embodiment of the inventive concept, a method is provided to generate a predictor to classify data. The method includes: training each of a plurality of first classifiers arranged in a first level on current training data; operating each classifier of the first level on the training data to generate a plurality of predictions; combining the current training data with the predictions to generated new training data; and training each of a plurality of second classifiers arranged in a second level on the new training data. The first classifiers are classifiers of different classifier types, respectively and the second classifiers are classifiers of the different classifier types, respectively. According to an exemplary embodiment of the inventive concept, a computer system is configured to generate a predictor to classify data. The system includes: a memory storing a computer program; and a processor configured to execute the computer program. The computer program is configured to train each of a plurality of first classifiers arranged in a first level on current training data, operate each classifier of the first level on the training data to generate a plurality of predictions, combine the current training data with the predictions to generated new training data, and train each of a plurality of second classifiers arranged in a second level on the new training data. The first classifiers are classifiers of different classifier types, respectively and the second classifiers are classifiers of the different classifier types, respectively. According to an exemplary embodiment of the inventive concept, a computer program product is configured to generate a predictor to classify data. The program product includes a computer readable storage medium having program instructions embodied therewith. The program instructions are executable by a computer to perform a method including: training each of a plurality of first classi...",
  "date_published": "20180104",
  "title": "MULTI-LAYER INFORMATION FUSING FOR PREDICTION",
  "ipcr_labels": [
    "G06N700",
    "G06N9900"
  ],
  "_processing_info": {
    "original_size": 49121,
    "optimized_size": 3887,
    "reduction_percent": 92.09
  }
}