{
  "decision": "PENDING",
  "application_number": "15204455",
  "date_published": "20170112",
  "date_produced": "20161228",
  "title": "SYSTEM AND METHOD FOR RECONSTRUCTING CARDIAC ACTIVATION INFORMATION",
  "filing_date": "20160707",
  "inventor_list": [
    {
      "inventor_name_last": "Narayan",
      "inventor_name_first": "Sanjiv",
      "inventor_city": "La Jolla",
      "inventor_state": "CA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Briggs",
      "inventor_name_first": "Carey Robert",
      "inventor_city": "La Jolla",
      "inventor_state": "CA",
      "inventor_country": "US"
    }
  ],
  "ipcr_labels": [
    "A61B500",
    "G06F1900",
    "A61B504",
    "A61B50452",
    "A61B5024",
    "A61B5042"
  ],
  "main_ipcr_label": "A61B500",
  "summary": "<SOH> SUMMARY <EOH>The present invention is applicable to reconstructing activation information of various rhythm disorders, including heart rhythm disorders, as well as other biological rhythm disorders, such as neurological seizures, esophageal spasms, bladder instability, irritable bowel syndrome, and other biological disorders for which biological activation information can be reconstructed to permit determination, diagnosis, and/or treatment of the cause or source of the disorders. It is particularly useful, however, in complex rhythm disorders that result in complex activation patterns, and especially useful in complex rhythm disorders of the heart, in order to find the cause(s) or source(s) of the disorders such that they can be treated with expediency. Local activation is activation that originates from, or is associated with, a specific location in the heart (sensed location). A sensor may be proximate to the sensed location (if it is a sensor in direct contact with the sensed location) or associated with the sensed location (if it is a sensor not in direct contact with the sensed location). Far-field activation, on the other hand, is activation that originates at a location in the heart that is different than the sensed location associated with the sensor. Conventionally, local activation has been clinically detected by characteristic patterns in individual signals. For example, in a simple focal arrhythmia, conventionally, monophasic negative (“QS”) complexes on a unipolar electrogram characterize the origin of a simple focal arrhythmia. However, in complex rhythm disorders, colliding electrical waves may be superimposed upon this local activation making detection via such conventional methods difficult or impossible. This is independent of relative sensor locations. Thus, in a complex rhythm disorder, even sensors associated with sensed locations that are close together will have local and far-field activations superimposed. Additionally, sensors associa...",
  "patent_number": "None",
  "abstract": "Reconstruction of cardiac information associated with a heart rhythm disorder includes accessing a plurality of neighboring cardiac signals and eliminating far-field activations from the neighboring cardiac signals using one or more divergence criteria that define local activations, where the divergence criteria is associated with divergence among the plurality of neighboring cardiac signals. The local activations in the plurality of neighboring cardiac signals may be used to construct a clinical representation of the heart rhythm disorder.",
  "publication_number": "US20170007176A1-20170112",
  "_processing_info": {
    "original_size": 91457,
    "optimized_size": 3324,
    "reduction_percent": 96.37
  }
}