{
  "decision": "PENDING",
  "application_number": "15207412",
  "date_published": "20180111",
  "date_produced": "20171227",
  "title": "METHODS, SYSTEMS AND COMPUTER READABLE MEDIA FOR TESTING NETWORK DEVICES USING VARIABLE TRAFFIC BURST PROFILES",
  "filing_date": "20160711",
  "inventor_list": [
    {
      "inventor_name_last": "Gintis",
      "inventor_name_first": "Noah Steven",
      "inventor_city": "Westlake Village",
      "inventor_state": "CA",
      "inventor_country": "US"
    }
  ],
  "ipcr_labels": [
    "G06F1750",
    "H04L1226"
  ],
  "main_ipcr_label": "G06F1750",
  "summary": "<SOH> SUMMARY <EOH>A method for testing a network device using a variable traffic burst profile includes providing for user selection of at least one type of simulated traffic to be transmitted to a network device under test (DUT). The method further includes receiving user input regarding selection of the type of simulated traffic. The method further includes providing for user selection of a transmission rate for transmitting the simulated traffic to the DUT. The method further includes receiving user input regarding selection of the transmission rate. The method further includes transmitting the simulated traffic to the DUT according to the selected type, rate, and a variable traffic burst profile. A system for testing a network device using a variable traffic burst profile includes a network equipment test device including at least one processor. The system further includes a user interface implemented by the at least one processor for providing for user selection of at least one type of simulated traffic to be transmitted to a network device under test (DUT), receiving user input regarding selection of the type of simulated traffic, providing for user selection of a transmission rate for transmitting the simulated traffic to the DUT, and receiving user input regarding selection of the transmission rate. The system further includes a simulated traffic generator for transmitting the simulated traffic to the DUT according to the selected type, rate, and a variable traffic burst profile. The subject matter described herein for testing a network device using a variable burst profile may be implemented in hardware, software, firmware, or any combination thereof. As such, the terms “function” or “module” as used herein refer to hardware, software, and/or firmware for implementing the feature being described. In one exemplary implementation, the subject matter described herein may be implemented using a non-transitory computer readable medium having stored thereon comp...",
  "patent_number": "None",
  "abstract": "A method for testing a network device using a variable traffic burst profile includes providing for user selection of at least one type of simulated traffic to be transmitted to a network device under test (DUT). The method further includes receiving user input regarding selection of the type of simulated traffic. The method further includes providing for user selection of a transmission rate for transmitting the simulated traffic to the DUT. The method further includes receiving user input regarding selection of the transmission rate. The method further includes transmitting the simulated traffic to the DUT according to the selected traffic type, the selected transmission rate, and a variable traffic burst profile.",
  "publication_number": "US20180011955A1-20180111",
  "_processing_info": {
    "original_size": 32828,
    "optimized_size": 3370,
    "reduction_percent": 89.73
  }
}