{
  "date_produced": "20171227",
  "publication_number": "US20180012131A1-20180111",
  "main_ipcr_label": "G06N504",
  "decision": "PENDING",
  "application_number": "15204732",
  "inventor_list": [
    {
      "inventor_name_last": "Tseng",
      "inventor_name_first": "Erick",
      "inventor_city": "San Francisco",
      "inventor_state": "CA",
      "inventor_country": "US"
    }
  ],
  "abstract": "An online system receives a request from a user of the online system to generate a content item specifying content (e.g., an image) received from the user and one or more modifications to the appearance of the content to be included in the content item. The online system generates multiple instances of the content item based on the request, in which each instance includes a different set of the specified modifications. Using an identifier that identifies each instance based on the set of modifications to the appearance of the included content (e.g., using an image fingerprint), the online system tracks a performance metric associated with each instance. By comparing the performance metrics associated with the instances, the online system identifies one or more modifications responsible for one or more differences between the performance metrics and predicts an effect on the performance metrics associated with content item instances including the identified modifications.",
  "filing_date": "20160707",
  "patent_number": "None",
  "summary": "<SOH> SUMMARY <EOH>An online system receives content (e.g., images, text, etc.) from users of the online system (“content-providing users”) and provides a tool that enables the content-providing users to submit requests to generate content items (e.g., advertisements) that may include the content. For example, a content-providing user may use the tool to request to generate a content item that includes a photograph uploaded by the content-providing user and text describing the photograph. The tool may include various features enabling content-providing users to modify the content to be included in content items. For example, content-providing users may crop photographs with a cropping feature and alter colors in the photographs with a filter feature. Features of the tool also may allow content-providing users to change the size, color, or placement of text or other elements included in the content, or perform any other suitable modification to the appearance of the content. For example, features of the tool may allow a content-providing user to modify an image of a bouquet of roses that includes text, such that the content-providing user may change the color of the roses from pink to red and change the text from print to cursive. Using the tool, content-providing users may request to generate multiple versions (i.e., instances) of a content item by specifying one or more modifications to the content included in the content item, in which each instance includes a different set of the specified modifications. For example, the online system may generate two instances of an advertisement for a car requested by an advertiser that differ only in a photograph of the car included in each instance—one instance includes a photograph of the car taken in the daytime, while the other instance includes the same photograph of the car that was modified using a filter that makes the photograph appear to have been taken in the evening. In some embodiments, if a content-providing user...",
  "date_published": "20180111",
  "title": "PREDICTING AN EFFECT OF A SET OF MODIFICATIONS TO AN APPEARANCE OF CONTENT INCLUDED IN A CONTENT ITEM ON A PERFORMANCE METRIC ASSOCIATED WITH THE CONTENT ITEM",
  "ipcr_labels": [
    "G06N504",
    "G06T1160",
    "G06N9900"
  ],
  "_processing_info": {
    "original_size": 140907,
    "optimized_size": 3673,
    "reduction_percent": 97.39
  }
}