{
  "date_produced": "20161228",
  "publication_number": "US20170011290A1-20170112",
  "main_ipcr_label": "G06N308",
  "decision": "PENDING",
  "application_number": "15202995",
  "inventor_list": [
    {
      "inventor_name_last": "Taha",
      "inventor_name_first": "Tarek M.",
      "inventor_city": "Centerville",
      "inventor_state": "OH",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Hasan",
      "inventor_name_first": "Raqibul",
      "inventor_city": "Dayton",
      "inventor_state": "OH",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Yakopcic",
      "inventor_name_first": "Chris",
      "inventor_city": "Dayton",
      "inventor_state": "OH",
      "inventor_country": "US"
    }
  ],
  "abstract": "An analog neuromorphic circuit is disclosed having resistive memories that provide a resistance to an input voltage signal as the input voltage signal propagates through the resistive memories generating a first output voltage signal and to provide a resistance to a first error signal that propagates through the resistive memories generating a second output voltage signal. A comparator generates the first error signal that is representative of a difference between the first output voltage signal and the desired output signal and generates the first error signal so that the first error signal propagates back through the plurality of resistive memories. A resistance adjuster adjusts a resistance value associated with each resistive memory based on the first error signal and the second output voltage signal to decrease the difference between the first output voltage signal and the desired output signal.",
  "filing_date": "20160706",
  "patent_number": "None",
  "summary": "<SOH> SUMMARY OF THE INVENTION <EOH>The present invention provides an analog neuromorphic circuit that implements a plurality of resistive memories, a first comparator, and a resistance adjuster. A plurality of resistive memories is configured to provide a resistance to the input voltage signal as the input voltage signal propagates through the plurality of resistive memories generating a first output voltage signal. The plurality of resistive memories is also configured to provide a resistance to the first error signal that propagates through the plurality of resistive memories generating a second output voltage signal. A first comparator is configured to compare the first output voltage signal to a desired output signal. The desired output signal is a signal level that the first output voltage signal is desired to be within a threshold of the signal level. The first comparator is also configured to generate the first error signal that is representative of a difference between the first output voltage signal and the desired output signal. The first comparator is also configured to generate the first error signal so that the first error signal propagates back through the plurality of resistive memories. A resistance adjuster is configured to adjust a resistance value associated with each resistive memory based on the first error signal and the second output voltage signal to decrease the difference between the first output voltage signal and the desired output signal. The present invention also provides a method for adjusting resistances of a plurality of resistive memories positioned in an analog neuromorphic circuit. The method starts with applying an input voltage signal of the analog neuromorphic circuit. The method further includes providing a resistance to the input voltage signal by each resistive memory as the input voltage signal propagates through the plurality of resistive memories to generate a first output voltage signal. The method further includes com...",
  "date_published": "20170112",
  "title": "ON-CHIP TRAINING OF MEMRISTOR CROSSBAR NEUROMORPHIC PROCESSING SYSTEMS",
  "ipcr_labels": [
    "G06N308"
  ],
  "_processing_info": {
    "original_size": 91212,
    "optimized_size": 3763,
    "reduction_percent": 95.87
  }
}