{
  "decision": "ACCEPTED",
  "application_number": "15208972",
  "date_published": "20170706",
  "date_produced": "20170621",
  "title": "Touch Screen and Touch-Sensitive Apparatus",
  "filing_date": "20160713",
  "inventor_list": [
    {
      "inventor_name_last": "Feng",
      "inventor_name_first": "Xuqing",
      "inventor_city": "Beijing",
      "inventor_state": "",
      "inventor_country": "CN"
    },
    {
      "inventor_name_last": "Zhao",
      "inventor_name_first": "Tingting",
      "inventor_city": "Beijing",
      "inventor_state": "",
      "inventor_country": "CN"
    },
    {
      "inventor_name_last": "Sun",
      "inventor_name_first": "Haiwei",
      "inventor_city": "Beijing",
      "inventor_state": "",
      "inventor_country": "CN"
    }
  ],
  "ipcr_labels": [
    "G06F3041",
    "G06F3044"
  ],
  "main_ipcr_label": "G06F3041",
  "summary": "<SOH> SUMMARY OF THE INVENTION <EOH>Embodiments of the present disclosure provide a touch screen and a touch-sensitive apparatus to prevent light rays outside a display region of the touch-sensitive apparatus from being reflected toward the display region through a silver paste layer, thereby reducing a light leak of the touch-sensitive apparatus and thus improving display effect and yield rate thereof. According to one aspect of the present disclosure, there is provided a touch screen comprising a first transparent substrate layer and a first tin indium oxide layer and a silver paste layer formed on the first transparent substrate layer. The silver paste layer is electrically connected with the first tin indium oxide layer and arranged within a non-display region of the touch screen. The touch screen further comprises a shielding layer arranged on a side of the silver paste layer where the first transparent substrate layer is located and configured for shielding the silver paste layer. With the touch screen according to exemplary embodiments of the present disclosure, by providing the shielding layer, it is possible to allow light rays outside the display region to be absorbed by the shielding layer arranged on the one side of the sliver paste layer toward the first transparent substrate firstly rather than being irradiated onto the silver paste layer and then reflected toward the display region of the touch screen. Therefore, the touch screen according to the exemplary embodiments of the present disclosure can reduce a light leak of the touch-sensitive apparatus, thereby improving display effect and yield rate thereof. In some exemplary embodiments of the present disclosure, the above touch screen further comprises a first optical transparent adhesive layer arranged on a side of the first transparent substrate layer facing away from the silver paste layer; a second tin indium oxide layer arranged on a side of the first optical transparent adhesive layer facing awa...",
  "patent_number": "9880665",
  "abstract": "The present disclosure relates to field of display technique and discloses a touch screen and a touch-sensitive apparatus to prevent light rays outside a display region of the touch-sensitive apparatus from being reflected toward the display region through a silver paste layer, thereby reducing a light leak of the touch-sensitive apparatus and thus improving display effect and yield rate thereof. The touch screen comprises a first transparent substrate layer and a first tin indium oxide layer and a silver paste layer formed on the first transparent substrate layer. The silver paste layer is electrically connected with the first tin indium oxide layer and arranged within a non-display region of the touch screen. The touch screen further comprises a shielding layer arranged on a side of the silver paste layer where the first transparent substrate layer is located and configured for shielding the silver paste layer.",
  "publication_number": "US20170192609A1-20170706",
  "_processing_info": {
    "original_size": 30034,
    "optimized_size": 3752,
    "reduction_percent": 87.51
  }
}