{
  "decision": "PENDING",
  "application_number": "15203113",
  "date_published": "20180111",
  "date_produced": "20171227",
  "title": "System and Method for Commercial and Residential Systems Monitoring and Notification",
  "filing_date": "20160706",
  "inventor_list": [
    {
      "inventor_name_last": "Seaton",
      "inventor_name_first": "Tim",
      "inventor_city": "Pittsboro",
      "inventor_state": "NC",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Parkkila",
      "inventor_name_first": "Tommi",
      "inventor_city": "Cary",
      "inventor_state": "NC",
      "inventor_country": "US"
    }
  ],
  "ipcr_labels": [
    "G08B2118",
    "G06Q3006",
    "H04L1258",
    "H04L2908"
  ],
  "main_ipcr_label": "G08B2118",
  "summary": "<SOH> BRIEF DESCRIPTION OF THE DRAWINGS <EOH>Certain illustrative embodiments exemplifying the organization and method of operation, together with objects and advantages, may be best understood by reference to the detailed description that follows, taken in conjunction with the accompanying drawings in which: FIG. 1 is a view of a view of the data communication configuration of the monitoring system consistent with certain embodiments of the present invention. FIG. 2 is a block diagram of an embodiment of the HVAC monitoring system consistent with certain embodiments of the present invention. FIG. 3 is a flow chart of an exemplary method of monitoring an air filter operation and condition consistent with certain embodiments of the present invention. FIG. 4 is a flow chart of an exemplary method of sending alerts from the monitoring system to one or more users consistent with certain embodiments of the present invention. detailed-description description=\"Detailed Description\" end=\"lead\"?",
  "patent_number": "None",
  "abstract": "A monitoring system for apparatus and systems in commercial and residential properties is provided. The monitoring system consists of a head unit and a tail unit, each of which has one or more sensors that measure performance parameters that are important to understanding the performance of the apparatus and system being monitored. As an example, an HVAC system may be monitored to determine when an air filter needs to be changed, or to predict when failure of the HVAC system may be imminent. The sensor array in the head unit and tail unit measure performance and report alerts and historical system performance to users through a mobile app, social media accounts, or any other system for communicating over a wired or wireless network connection.",
  "publication_number": "US20180012479A1-20180111",
  "_processing_info": {
    "original_size": 51662,
    "optimized_size": 2506,
    "reduction_percent": 95.15
  }
}