{
  "decision": "ACCEPTED",
  "application_number": "15207691",
  "date_published": "20180118",
  "date_produced": "20180103",
  "title": "INTEGRATED CIRCUIT IMPLEMENTING STANDARD CELLS WITH METAL LAYER SEGMENTS EXTENDING OUT OF CELL BOUNDARY",
  "filing_date": "20160712",
  "inventor_list": [
    {
      "inventor_name_last": "Rowhani",
      "inventor_name_first": "Omid",
      "inventor_city": "Markham",
      "inventor_state": "",
      "inventor_country": "CA"
    },
    {
      "inventor_name_last": "Cordos",
      "inventor_name_first": "Ioan",
      "inventor_city": "Markham",
      "inventor_state": "",
      "inventor_country": "CA"
    },
    {
      "inventor_name_last": "Hamel",
      "inventor_name_first": "Kerry",
      "inventor_city": "Boxborough",
      "inventor_state": "MA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Clay",
      "inventor_name_first": "Donald",
      "inventor_city": "Boxborough",
      "inventor_state": "MA",
      "inventor_country": "US"
    }
  ],
  "ipcr_labels": [
    "G06F1750",
    "H01L2702"
  ],
  "main_ipcr_label": "G06F1750",
  "summary": "<SOH> BRIEF DESCRIPTION OF THE DRAWINGS <EOH>The present disclosure may be better understood, and its numerous features and advantages made apparent to those skilled in the art by referencing the accompanying drawings. The use of the same reference symbols in different drawings indicates similar or identical items. FIG. 1 is a diagram illustrating an example two-cell layout with design rule check violations and a corresponding conventional standard cell design to mitigate the design rule check violations in accordance with some embodiments. FIG. 2 is a diagram illustrating an example cell layout with metal tracks permitting extension of metal segments beyond a cell boundary in accordance with some embodiments. FIG. 3 is a diagram illustrating an example layout of two abutting cells with metal segments that overlap metal tracks in accordance with some embodiments. FIG. 4 is a diagram illustrating expanded Metal 1 (M1) layer to Metal 2 (M2) layer connections facilitated by the cell layout of FIG. 2 in accordance with some embodiments. FIG. 5 is a flow diagram illustrating a method for designing and fabricating an integrated circuit structure in accordance with some embodiments. detailed-description description=\"Detailed Description\" end=\"lead\"?",
  "patent_number": "9977854",
  "abstract": "A computer-implemented method of fabricating an integrated circuit structure includes selecting a first cell from a standard cell library, the first cell having a cell boundary and comprising a metal segment at a first metal track at a metal layer, the metal segment extending along a direction and terminating a specified distance beyond a first edge of the cell boundary. The method further includes placing the first cell at a first location of a physical layout for the integrated circuit structure. The method also includes selecting a second cell from the standard cell library and placing the second cell at a second location of the physical layout such that a second edge of a cell boundary of the second cell abuts the first edge of the cell boundary of the first cell, and wherein the metal segment extends into a metal track at the metal layer of the second cell.",
  "publication_number": "US20180018419A1-20180118",
  "_processing_info": {
    "original_size": 44191,
    "optimized_size": 3175,
    "reduction_percent": 92.82
  }
}