{
  "date_produced": "20171227",
  "publication_number": "US20180012123A1-20180111",
  "main_ipcr_label": "G06N3063",
  "decision": "PENDING",
  "application_number": "15202729",
  "inventor_list": [
    {
      "inventor_name_last": "Han",
      "inventor_name_first": "Jin P.",
      "inventor_city": "Fishkill",
      "inventor_state": "NY",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Sun",
      "inventor_name_first": "Xiao",
      "inventor_city": "White Plains",
      "inventor_state": "NY",
      "inventor_country": "US"
    }
  ],
  "abstract": "A synapse network device includes an array of field effect transistor (FET) devices having controllable channel resistance. Pre-neurons are coupled to the array to provide input pulses to the array on first terminals of the FET devices. Post-neurons are coupled to the array to receive outputs from the array on second terminals of the FET devices and provide feedback to the array on third terminals of the FET devices, wherein a state of the FET devices is indicated based upon signals applied to the FET devices.",
  "filing_date": "20160706",
  "patent_number": "None",
  "summary": "<SOH> SUMMARY <EOH>In accordance with an embodiment of the present principles, a synapse network device includes an array of field effect transistor (FET) devices having controllable channel resistance. Pre-neurons are coupled to the array to provide input pulses to the array on first terminals of the FET devices. Post-neurons are coupled to the array to receive outputs from the array on second terminals of the FET devices and provide feedback to the array on third terminals of the FET devices, wherein a state of the FET devices is indicated based upon the input pulses of the FET devices. A synapse network device includes an array of field effect transistor (FET) devices having controllable channel resistance. Pre-neurons are coupled to the array to provide input pulses to the array on first terminals of the FET devices. Post-neurons are coupled to the array to receive outputs from the array on second terminals of the FET devices and provide feedback to the array on third terminals of the FET devices, wherein a state of the FET devices is indicated based upon the input pulses from pre-neurons and/or post-neurons, as well as the various correlations thereof, including a timing delay between the signals from the pre-neurons and the post neurons. The second terminal may receive the same signals as the first or third terminal(s) during the change of the states. A time delay between the signals can change the states of the FET devices. Another synapse network device includes a substrate and an array of field effect transistor (FET) devices formed on the substrate and having controllable channel resistance and connected in a crossbar arrangement of metal lines. Pre-neurons are coupled to the array to provide input signals to the array on first terminals of the FET devices, wherein the input pulses are controlled to change channel resistances. Post-neurons coupled to the array to receive outputs from the array on second terminals of the FET devices and provide feedback to ...",
  "date_published": "20180111",
  "title": "FET BASED SYNAPSE NETWORK",
  "ipcr_labels": [
    "G06N3063",
    "H01L27092",
    "G06N304",
    "H01L2910",
    "H01L2978"
  ],
  "_processing_info": {
    "original_size": 50176,
    "optimized_size": 3220,
    "reduction_percent": 93.58
  }
}