{
  "decision": "PENDING",
  "application_number": "15204269",
  "date_published": "20161027",
  "date_produced": "20161012",
  "title": "PATTERN LABELING",
  "filing_date": "20160707",
  "inventor_list": [
    {
      "inventor_name_last": "Vaccari",
      "inventor_name_first": "Andrea",
      "inventor_city": "San Francisco",
      "inventor_state": "CA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Grisè",
      "inventor_name_first": "Gabriel",
      "inventor_city": "San Francisco",
      "inventor_state": "CA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Lahiri",
      "inventor_name_first": "Mayank",
      "inventor_city": "San Francisco",
      "inventor_state": "CA",
      "inventor_country": "US"
    }
  ],
  "ipcr_labels": [
    "G06F1730",
    "G06Q5000"
  ],
  "main_ipcr_label": "G06F1730",
  "summary": "<SOH> SUMMARY OF PARTICULAR EMBODIMENTS <EOH>In particular embodiments, information of the user is inferred from the calculated routine. For example, the home location of the user may be inferred from location of the user between 2-5:00 AM every morning. In particular embodiments, the social-networking system may determine the locations frequented by the user based on the database of businesses and physical locations in conjunction with the routine of the user. For example, the social-networking system may infer the user is getting coffee at a particular Starbucks based on the routine of the user indicates the user is frequently at a particular location at a time prior to arriving at the work place. As another example, the social-networking system may infer the user is on vacation when the user is away from the inferred work location for an extended period of time or at a location that is a significant distance from the inferred work location.",
  "patent_number": "None",
  "abstract": "In one embodiment, a method includes accessing a log associated with a user. The log includes a number of entries that each indicate a geo-location of the user at a particular time of day of a particular day of a week. At least some of the data points being based on a geo-location determined and reported by a mobile computing device of the user without manual user input. The method also includes determining one or more geo-location centroids based on a distance between the respective geo-location centroid and each geo-location data point. Each geo-location centroid is representative of one or more of the geo-location data points obtained during the particular time of day of the particular day of a week.",
  "publication_number": "US20160314133A1-20161027",
  "_processing_info": {
    "original_size": 96229,
    "optimized_size": 2497,
    "reduction_percent": 97.41
  }
}