{
  "decision": "PENDING",
  "application_number": "15201591",
  "date_published": "20161027",
  "date_produced": "20161012",
  "title": "Remote Data Viewer",
  "filing_date": "20160704",
  "inventor_list": [
    {
      "inventor_name_last": "Wise",
      "inventor_name_first": "Kelley D.",
      "inventor_city": "Villa Park",
      "inventor_state": "CA",
      "inventor_country": "US"
    }
  ],
  "ipcr_labels": [
    "G06F2162",
    "G06T1100",
    "G06F1900",
    "G06F2153",
    "G06F2160"
  ],
  "main_ipcr_label": "G06F2162",
  "summary": "<SOH> SUMMARY OF THE INVENTION <EOH>In the preferred embodiment of the invention, one or more servers with medical image files stored on them, run application service provider software and send streams of medical data and images, to temporarily reconstruct and manipulate the image files remotely in a secure execution environment on an authorized user's personal computer. In the existing embodiment of the invention a computer or other capture device, captures a lossy image file then compresses and transmits the compressed image file which is then downloaded onto a computer hard drive and decompressed by the remote receiver for viewing. In contrast, the preferred embodiment of the invention does not require transmitting the actual medical image files to a receiver and is therefore a more efficient method of remote medical image viewing. Besides the objectives and advantages of the preferred embodiment of the invention described above, there are objectives and advantages also which are: a) to lower the cost and provide high security or regulatory compliance with the need for remote viewing of medical images and data for medical diagnostics and any other field requiring secure remote viewing of image files and data. b) to provide a faster way to view digital images remotely c) To view and manipulate all image files without compressing, uncompressing, and downloading the files into a hard drive or opening the actual patient image file on the remote server. d) To be able to use a digital imaging viewer without having to buy and install medical imaging or any other viewing or compression/decompression software. e) To be able to see large numbers of images in sequence animated in rapid succession and manipulate them remotely faster than existing methods. f) To provide physicians a more efficient method of using diagnostic images to plan a surgery g) To create incentives for physicians to refer patients to radiologists or medical diagnostic imaging providers. These objects d...",
  "patent_number": "None",
  "abstract": "A medical image and data application service provider system provides a way of remotely viewing and manipulating medical images and data for diagnostic and visualization purposes by users unconstrained by geography. Medical images and data are stored on one or more servers running application service provider software along with meta-data such as access control information, origin of information and references to related data. A set of medical data consisting of related information is sent as an encrypted stream to a viewing station running client software in a secure execution environment that is logically independent of the viewing station's operating system.",
  "publication_number": "US20160314317A1-20161027",
  "_processing_info": {
    "original_size": 19857,
    "optimized_size": 3228,
    "reduction_percent": 83.74
  }
}