{
  "decision": "PENDING",
  "application_number": "15209725",
  "date_published": "20180118",
  "date_produced": "20180103",
  "title": "Online Assessment Systems And Methods",
  "filing_date": "20160713",
  "inventor_list": [
    {
      "inventor_name_last": "Oni",
      "inventor_name_first": "Adeboyejo Adetokunbo",
      "inventor_city": "Bethesda",
      "inventor_state": "MD",
      "inventor_country": "US"
    }
  ],
  "ipcr_labels": [
    "G06Q1010",
    "G06Q5020"
  ],
  "main_ipcr_label": "G06Q1010",
  "summary": "<SOH> SUMMARY <EOH>In accordance with the present invention, online career, educational and occupational assessments are provided for individuals. The assessments include the ability to map assessment results to academic majors and occupations and further apply confidence and work value filters to identify potential majors and occupations that may best match an individual's interests and desires. Accordingly, the inventive assessments provide a user (e.g., student) with an improved ability to identify majors, occupations and vocations that best match his or her interests and desires, among other novel and non-obvious improvements. In one embodiment, a system for providing online assessments may comprise a network, hardware platform (e.g., one or more hardware servers) operable to (i) receive current or historical user assessment data, over a communications network (e.g., wired or wireless network); (ii) identify one or more reference academic majors or occupations that best matches the user assessment data, as well as identify one or more academic institutions, vocational institutions or potential employers based on the identified, reference academic majors or occupations, and (iii) transmit data representing the one or more reference academic majors or occupations, and data representing the one or more academic institutions, vocational institutions or potential employers, to the electronic device, over the communications network. The user assessment data may comprise either current or historical user interest data (e.g., current or historical Holland code associated user data), or both, and the platform may be further operable to (iv) identify the one or more reference academic majors or occupations that best matches the received user interest data, and (v) transmit data representing the one or more identified, academic majors or occupations, over the communications network, to the electronic device. In more detail, the platform may further operable to (vi) compare...",
  "patent_number": "None",
  "abstract": "Online career, educational and occupational assessments are provided for individuals. The assessments include the ability to map a Holland code to academic majors and occupations and further apply confidence and work value filters to identify potential majors and occupations that may best match an individual's interests and desires.",
  "publication_number": "US20180018630A1-20180118",
  "_processing_info": {
    "original_size": 102443,
    "optimized_size": 2884,
    "reduction_percent": 97.18
  }
}