{
  "date_produced": "20171219",
  "publication_number": "US20180005116A1-20180104",
  "main_ipcr_label": "G06N502",
  "decision": "PENDING",
  "application_number": "15200243",
  "inventor_list": [
    {
      "inventor_name_last": "Pickover",
      "inventor_name_first": "Clifford A.",
      "inventor_city": "Yorktown Heights",
      "inventor_state": "NY",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Schloss",
      "inventor_name_first": "Robert J.",
      "inventor_city": "Briarcliff Manor",
      "inventor_state": "NY",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Weldemariam",
      "inventor_name_first": "Komminist S.",
      "inventor_city": "Canada",
      "inventor_state": "",
      "inventor_country": "KE"
    },
    {
      "inventor_name_last": "Zhou",
      "inventor_name_first": "Lin",
      "inventor_city": "LaGrangeville",
      "inventor_state": "NY",
      "inventor_country": "US"
    }
  ],
  "abstract": "A method is disclosed including presenting a concept to a user via one or more presentation devices and monitoring the user's response to the presentation of the concept by a sensing device. The sensing device may generate sensor data based on the monitored user's response. The method further includes determining based on the sensor data generated by the sensor that the user requires clarification of the presented concept. In response to determining that the user requires clarification of the presented concept, the method further includes identifying an analogy that is configured to clarify the presented concept and presenting the identified analogy to the user via one or more of the presentation devices.",
  "filing_date": "20160701",
  "patent_number": "None",
  "summary": "<SOH> BRIEF SUMMARY <EOH>The methods, systems, and computer program products described herein provide ways to automatically and in real-time identify and present analogies to users for clarifying presented concepts. In an aspect of the present disclosure, a method is disclosed including presenting a concept to a user via one or more presentation devices and monitoring the user's response to the presentation of the concept by a sensing device. The sensing device may generate sensor data based on the monitored user's response. The method further includes determining based on the sensor data generated by the sensor that the user requires clarification of the presented concept. In response to determining that the user requires clarification of the presented concept, the method further includes identifying an analogy that is configured to clarify the presented concept and presenting the identified analogy to the user via one or more of the presentation devices. In an aspect of the present disclosure, the method may further include monitoring a user's response to the presentation of the identified analogy by the sensing device. The sensing device may generate sensor data of the user's response to the identified analogy. The method may further include determining based on the generated sensor data of the user's response to the identified analogy that further clarification of the presented concept is required. In response to determining that further clarification of the presented concept is required, the method may further include identifying an additional analogy that is configured to clarify the presented concept and presenting the identified additional analogy to the user via one or more of the presentation devices. In aspects of the present disclosure apparatus, systems, and computer program products in accordance with the above aspect may also be provided. Further features as well as the structure and operation of various embodiments are described in detail below with ...",
  "date_published": "20180104",
  "title": "METHOD AND SYSTEM FOR AUTOMATIC REAL-TIME IDENTIFICATION AND PRESENTATION OF ANALOGIES TO CLARIFY A CONCEPT",
  "ipcr_labels": [
    "G06N502",
    "H04L2908"
  ],
  "_processing_info": {
    "original_size": 77212,
    "optimized_size": 3793,
    "reduction_percent": 95.09
  }
}