{
  "date_produced": "20171227",
  "publication_number": "US20180012126A1-20180111",
  "main_ipcr_label": "G06N502",
  "decision": "PENDING",
  "application_number": "15203740",
  "inventor_list": [
    {
      "inventor_name_last": "Ahern",
      "inventor_name_first": "Shane",
      "inventor_city": "Foster City",
      "inventor_state": "CA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Roberts",
      "inventor_name_first": "Michael",
      "inventor_city": "Los Gatos",
      "inventor_state": "CA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Tucker",
      "inventor_name_first": "Simon",
      "inventor_city": "Oakland",
      "inventor_state": "CA",
      "inventor_country": "US"
    }
  ],
  "abstract": "A computer-implemented system and method for predicting activity outcome based on user attention is provided. Sensor data is collected for a user, and an activity performed by a user is identified based on the sensor data. Features of the user are collected while performing the activity and a subject of focus of the user is determined based on the collected features. An outcome of the activity performed by the user is predicted based on the features and the determined subject of focus.",
  "filing_date": "20160706",
  "patent_number": "None",
  "summary": "<SOH> SUMMARY <EOH>To ensure that a service is timely completed, unexpected problems and need for assistance can be predicted based on an identified activity being performed by a service provider and a subject of focus by the service provider during the activity. Specifically, upon identifying the performed activity, a connection between the service provider and a remote expert is made such that the remote expert can provide assistance to the service provider. During this connection, actions of the service provider are monitored to determine the service provider's subject of focus. Based on the determined focus subject, an outcome for completion of the service is determined and assistance, if necessary, can be provided to the service provider based on the predicted outcome. An embodiment provides a computer-implemented system and method for predicting activity outcome based on user attention. Sensor data is collected for a user, and an activity performed by a user is identified based on the sensor data. Features of the user are collected while performing the activity and a subject of focus of the user is determined based on the collected features. An outcome of the activity performed by the user is predicted based on the features and the determined subject of focus. Still other embodiments of the present invention will become readily apparent to those skilled in the art from the following detailed description, wherein is described embodiments of the invention by way of illustrating the best mode contemplated for carrying out the invention. As will be realized, the invention is capable of other and different embodiments and its several details are capable of modifications in various obvious respects, all without departing from the spirit and the scope of the present invention. Accordingly, the drawings and detailed description are to be regarded as illustrative in nature and not as restrictive.",
  "date_published": "20180111",
  "title": "Computer-Implemented System And Method For Predicting Activity Outcome Based On User Attention",
  "ipcr_labels": [
    "G06N502",
    "H04L2908",
    "H04W400",
    "H04W402"
  ],
  "_processing_info": {
    "original_size": 42057,
    "optimized_size": 3323,
    "reduction_percent": 92.1
  }
}