{
  "decision": "ACCEPTED",
  "application_number": "15208134",
  "date_published": "20180118",
  "date_produced": "20180103",
  "title": "SYSTEM AND METHOD FOR A COGNITIVE SYSTEM PLUG-IN ANSWERING SUBJECT MATTER EXPERT QUESTIONS",
  "filing_date": "20160712",
  "inventor_list": [
    {
      "inventor_name_last": "Marrelli",
      "inventor_name_first": "Carl M.",
      "inventor_city": "Westerville",
      "inventor_state": "OH",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Matteo",
      "inventor_name_first": "Jeffrey T.",
      "inventor_city": "Powell",
      "inventor_state": "OH",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Narayanan",
      "inventor_name_first": "Ram S.",
      "inventor_city": "Canton",
      "inventor_state": "MI",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Oberhofer",
      "inventor_name_first": "Martin",
      "inventor_city": "Bondorf",
      "inventor_state": "DE",
      "inventor_country": "US"
    }
  ],
  "ipcr_labels": [
    "H04M351",
    "G06F1730",
    "G06N504",
    "H04L1258"
  ],
  "main_ipcr_label": "H04M351",
  "summary": "<SOH> SUMMARY <EOH>Embodiments can provide a computer implemented method, in a data processing system comprising a processor and a memory comprising instructions which are executed by the processor to cause the processor to implement a call center question and answer system, the method comprising ingesting, in real-time through an instant messaging application, one or more questions from one or more call center agents; ingesting, in real-time through the instant messaging application, one or more answers associated with the one or more questions; storing one or more question and answer pairs in a corpus; analyzing, through a cognitive system, the corpus of the one or more question and answer pairs; receiving, through the instant messaging system, one or more additional questions; determining a proposed answer to each additional question based on the analysis of the corpus; analyze, through the cognitive system, the proposed answer; and incorporate the analysis of the proposed answer into the analysis of the one or more question and answer pairs. Embodiments can further provide a method further comprising utilizing a plug-in module to moderate the interactions between the cognitive system and the instant messaging application without providing an external notification. Embodiments can further provide a method wherein the plug-in module utilizes one or more registration commands to identify the one or more questions and answers sent between the instant messaging application and the cognitive system. Embodiments can further provide a method further comprising ingesting, through the instant messaging application, one or more answers provided by one or more subject matter experts. Embodiments can further provide a method further comprising providing the proposed answer to the call center agent through the instant messaging application. Embodiments can further provide a method further comprising receiving, through a feedback module, feedback on the proposed answer from on...",
  "patent_number": "10009466",
  "abstract": "Embodiments provide a system and method for integrating a cognitive system into a call center. The system and method include ingesting, in real-time through an instant messaging application, one or more questions from one or more call center agents; ingesting, in real-time through the instant messaging application, one or more answers associated with the one or more questions; storing one or more question and answer pairs in a corpus; analyzing, through a cognitive system, the corpus of the one or more question and answer pairs; receiving, through the instant messaging system, one or more additional questions; determining a proposed answer to each additional question based on the analysis of the corpus; analyzing, through the cognitive system, the proposed answer; and incorporating the analysis of the proposed answer into the analysis of the one or more question and answer pairs. The answers can be provided by subject matter experts or call center managers. The cognitive system can int...",
  "publication_number": "US20180020097A1-20180118",
  "_processing_info": {
    "original_size": 75235,
    "optimized_size": 4070,
    "reduction_percent": 94.59
  }
}