{
  "decision": "PENDING",
  "application_number": "15203955",
  "date_published": "20180111",
  "date_produced": "20171227",
  "title": "INTEGRATED SYSTEM FOR OPTIMIZING VEHICLE UTILIZATION",
  "filing_date": "20160707",
  "inventor_list": [
    {
      "inventor_name_last": "Yao",
      "inventor_name_first": "Raymond",
      "inventor_city": "Shanghai",
      "inventor_state": "",
      "inventor_country": "CN"
    },
    {
      "inventor_name_last": "Chen",
      "inventor_name_first": "Xin",
      "inventor_city": "Shanghai",
      "inventor_state": "",
      "inventor_country": "CN"
    },
    {
      "inventor_name_last": "Nemery",
      "inventor_name_first": "Philippe",
      "inventor_city": "Shanghai",
      "inventor_state": "",
      "inventor_country": "CN"
    }
  ],
  "ipcr_labels": [
    "G06Q1006",
    "G06Q3006",
    "G06Q1010"
  ],
  "main_ipcr_label": "G06Q1006",
  "summary": "<SOH> BRIEF DESCRIPTION OF THE DRAWINGS <EOH>The embodiments are illustrated by way of examples and not by way of limitation in the figures of the accompanying drawings in which like references indicate similar elements. The embodiments may be best understood from the following detailed description taken in conjunction with the accompanying drawings. FIG. 1 is a block diagram illustrating architecture of various components of an integrated system for optimizing vehicle utilization, according to an embodiment. FIG. 2 is a flow diagram illustrating repositioning of a vehicle, according to an embodiment. FIG. 3 is a graphical representation illustrating waiting period, according to an embodiment. FIGS. 4A-4B illustrate assignment of vehicles for waiting period, empty repositioning, and loaded move, according to an embodiment. FIG. 5 is a block diagram illustrating output tables generated by network flow solver based upon various input tables, according to an embodiment. FIGS. 6A-6B illustrate an exemplary use case of network flow solver, according to an embodiment. FIG. 7 is a flow diagram illustrating a process of computing supply-demand flow, according to an embodiment. FIG. 8 is a flowchart illustrating a process of integrated system for optimizing vehicle utilization, according to an embodiment. FIG. 9 is a block diagram illustrating an exemplary computer system, according to an embodiment. detailed-description description=\"Detailed Description\" end=\"lead\"?",
  "patent_number": "None",
  "abstract": "Various embodiments of systems and methods for optimizing vehicle utilization are described herein. The method includes determining demand, supply, and availability of vehicles. A graph with nodes (representing source and destination stations of orders) and arcs connecting nodes is generated based on validity conditions, e.g., there is network connectivity from source to destination node, etc. The arc is assigned for repositioning, waiting, and loaded move based upon input such as tolerable delay for orders, waiting cost at stations, repositioning cost, long stand cost, revenue generated from orders, order priority, etc. A network flow solver is successively executed to solve the graph to maximize profit, optimized utilization of vehicles, fulfill order on time, and balance demand and supply. Output tables including key performance indicators (KPIs) and information of fulfilled and unfulfilled orders are generated. Vehicle allocation, repositioning, waiting, and loaded move may in turn...",
  "publication_number": "US20180012160A1-20180111",
  "_processing_info": {
    "original_size": 79071,
    "optimized_size": 3333,
    "reduction_percent": 95.78
  }
}