{
  "decision": "PENDING",
  "application_number": "15208026",
  "date_published": "20180118",
  "date_produced": "20180103",
  "title": "CONTEXTUAL SUGGESTIONS FROM USER HISTORY",
  "filing_date": "20160712",
  "inventor_list": [
    {
      "inventor_name_last": "Kesamreddy",
      "inventor_name_first": "Venkata Pavan Kumar",
      "inventor_city": "Hyderabad",
      "inventor_state": "",
      "inventor_country": "IN"
    }
  ],
  "ipcr_labels": [
    "G06F1730"
  ],
  "main_ipcr_label": "G06F1730",
  "summary": "<SOH> SUMMARY <EOH>Non-limiting examples of the present disclosure describe pattern recognition determined based on evaluation of context associated with a user history. Contextual suggestions may be generated based on evaluation of different contexts identified in the user history. Input may be received from a processing device of a user. A plurality of contexts associated with a user history may be evaluated. In at least one example, the evaluating of the plurality of contexts may further comprise identifying contexts within a time period of the user history. The evaluating may further comprise generating, for the identified contexts, a score based on at least one time period associated with a searching of a context and a frequency of searching for the context within the at least one time period. In examples, a first weightage is assigned to a time period associated with the context and a second weightage is assigned to the context based on the frequency of searching for the context within the time period. A score for a context is generated based on a processing operation using the first weightage and the second weightage. The evaluating may further comprise ranking the identified contexts based on the score corresponding with each context. One or more contextual suggestions may be output for the received input based on the ranked contexts. In one example, the outputting of the contextual suggestions further comprises displaying one or more contextual suggestions using the processing device of the user. In one example, one or more auto-complete suggestions are output based on the ranked contexts for the received input. In another example, the outputting described above further comprises: outputting one or more spelling and/or grammatical suggestions for the received input. In yet another example, the outputting as described above further comprises: outputting one or more translational suggestions for voice to text processing of the received input. In further examp...",
  "patent_number": "None",
  "abstract": "Non-limiting examples of the present disclosure describe pattern recognition determined based on evaluation of contexts associated with a user history of a user. Input may be received from a processing device of a user. A plurality of contexts associated with user history data of the user history may be evaluated. In examples, the evaluating comprises: generating, for each of the plurality of contexts, a score based on: at least one time period of the user history that is associated with a searching of a context and a frequency of searching for the context within the at least one time period. The evaluating may further comprise ranking the plurality of contexts based on the score corresponding with each of the plurality of contexts. One or more contextual suggestions may be generated and output for the received input based on the ranked plurality of contexts.",
  "publication_number": "US20180018331A1-20180118",
  "_processing_info": {
    "original_size": 64008,
    "optimized_size": 3417,
    "reduction_percent": 94.66
  }
}