{
  "decision": "PENDING",
  "application_number": "15200912",
  "date_published": "20161027",
  "date_produced": "20161012",
  "title": "Method and Apparatus for GPS Based Z-Axis Difference Parameter Computation",
  "filing_date": "20160701",
  "inventor_list": [
    {
      "inventor_name_last": "HUNT",
      "inventor_name_first": "BRYAN",
      "inventor_city": "SPOKANE",
      "inventor_state": "WA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "MCQUADE",
      "inventor_name_first": "CHARLES MICHAEL",
      "inventor_city": "ISSAQUAH",
      "inventor_state": "WA",
      "inventor_country": "US"
    }
  ],
  "ipcr_labels": [
    "B60W4009",
    "G06F1711",
    "G06F1130",
    "G05B1502"
  ],
  "main_ipcr_label": "B60W4009",
  "summary": "<SOH> SUMMARY <EOH>One aspect of the novel concepts presented herein is a method of producing a numerical ranking of a driver's performance based on a plurality of metrics (recognizing that the concepts disclosed herein also encompass the use of only a single metric), and then sharing those metrics on a hosted website, such that the drivers can compare their performance metrics to those of their peers. Fleet operators can use these performance metrics as incentives, by linking driver pay with performance. Such a method comprises the steps of automatically collecting a plurality of metrics while a driver is operating a vehicle, automatically determining a numerical value for each metric, automatically combining the numerical values for the plurality of metrics to achieve a numerical performance value, and normalizing the numerical performance value to achieve a numerical ranking of the driver's performance while operating a vehicle, and then posting the driver performance data to the hosted website. In at least one related embodiment, fleet operators will pay drivers using a mileage component (i.e., paying drivers a fixed rate per loaded mile), while also making additional payments to drivers meeting predefined performance characteristics. In at least one related embodiment, only drivers having top ranking performance metrics (such as drivers having performance scores in the top 10% of the fleet, or the 25 drivers having the best performance scores in the fleet, recognizing that such specific examples are not intended to be limiting) will be eligible for the performance pay. In at least one other related embodiment, any driver in the fleet will be eligible for performance bonus pay once they have met a predefined performance metric. While many embodiments will employ a single normalized numerical performance score (i.e., a numerical score that combines several different metrics together), it should be recognized that in some embodiments performance pay can be linked ...",
  "patent_number": "None",
  "abstract": "Data is collected during the operation of a vehicle and used to produce a ranking of a driver's efficiency performance, and that ranking is shared on a hosted website, such that the drivers can compare their performance metrics to their peers. Fleet operators can use these performance metrics as incentives, by linking driver pay with efficiency performance. Individual fleet operators can host their own website, where driver rankings in that fleet can be compared, or the website can be hosted by a third party, and multiple fleet operators participate. The third party can offset their costs for operating the website by charging participating fleet operators a fee, and/or by advertising revenue. In some embodiments, all driver efficiency performance data is displayed in an anonymous format, so that individual drivers cannot be identified unless the driver shares their user ID.",
  "publication_number": "US20160311441A1-20161027",
  "_processing_info": {
    "original_size": 136552,
    "optimized_size": 3638,
    "reduction_percent": 97.34
  }
}