{
  "decision": "ACCEPTED",
  "application_number": "15201987",
  "date_published": "20161027",
  "date_produced": "20161012",
  "title": "SYSTEM AND A METHOD FOR THE DETECTION OF MULTIPLE NUMBER-PLATES OF MOVING CARS IN A SERIES OF 2-D IMAGES",
  "filing_date": "20160705",
  "inventor_list": [
    {
      "inventor_name_last": "Besiris",
      "inventor_name_first": "Dimitrios",
      "inventor_city": "Patras",
      "inventor_state": "",
      "inventor_country": "GR"
    },
    {
      "inventor_name_last": "Fragoulis",
      "inventor_name_first": "Nikos",
      "inventor_city": "Patras",
      "inventor_state": "",
      "inventor_country": "GR"
    }
  ],
  "ipcr_labels": [
    "G06K932",
    "G06K946",
    "G06F1730",
    "G06K962"
  ],
  "main_ipcr_label": "G06K932",
  "summary": "<SOH> SUMMARY <EOH>An exemplary embodiment of the invention refers to a stand-alone computer-camera system capable of extracting car-plates. This is achieved by using an on-board computer in order to analyze the video stream recorded by the camera sensor, and can be used with any type of camera sensor. The system features specific characteristics making it extremely fast and able to catch plates of cars moving at high-speed. The special algorithms incorporated in this system, are specially implemented, in order to be able to be ported on an embedded computer system, which has usually lower capabilities in terms of processing power and memory than a general-purpose computer.",
  "patent_number": "9547800",
  "abstract": "A stand-alone computer-camera system capable of extracting car-plate information. This is achieved by using an on-board computer in order to analyze the video stream recorded by the camera sensor, and can be used with any type of camera sensor. The system features specific characteristics making it extremely fast and able to catch plates of cars moving at high-speed. The special algorithms incorporated in this system, are specially implemented, in order to be able to be ported on an embedded computer system, which has usually lower capabilities in terms of processing power and memory than a general-purpose computer.",
  "publication_number": "US20160314368A1-20161027",
  "_processing_info": {
    "original_size": 54685,
    "optimized_size": 2076,
    "reduction_percent": 96.2
  }
}