{
  "date_produced": "20161228",
  "publication_number": "US20170011309A1-20170112",
  "main_ipcr_label": "G06N9900",
  "decision": "PENDING",
  "application_number": "15204905",
  "inventor_list": [
    {
      "inventor_name_last": "Tsutaoka",
      "inventor_name_first": "Greg",
      "inventor_city": "Oakland",
      "inventor_state": "CA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Thurston",
      "inventor_name_first": "Nathaniel J.",
      "inventor_city": "Oakland",
      "inventor_state": "CA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Tashkevych",
      "inventor_name_first": "Olena",
      "inventor_city": "Oakland",
      "inventor_state": "CA",
      "inventor_country": "US"
    }
  ],
  "abstract": "A method and apparatus to comprehend situations for an Emotionally Intelligent Technology-Aided Decision System, and more particularly, with an improved auto regression architecture and method for sporadic, heterogeneous, multimodal, unlabeled, unstructured, sequential data. Auto-regression architecture is used to abstract unlabeled, data with a layered approach involving co-occurrence matrix generation, vectoring, clustering, pattern finding, and trimming techniques combined together.",
  "filing_date": "20160707",
  "patent_number": "None",
  "summary": "<SOH> SUMMARY OF THE INVENTION <EOH>Many algorithms and techniques are required by technology-aided decision making applications with data like video, audio, text, image, Internet of Things sensors (e.g. location, temperature, heart rate, pressure) etc. The present invention comprehends situations based on data and results including, but not limited to, verbal communications, nonverbal communications, biometric data, autonomic data, genetic data, environmental data, internet data, and licensed data. The present invention improves upon prior art business intelligence and technology-aided decision making systems to comprehend who, what, when, where, feelings and why of a situation and/or pattern of situations over time. The present invention comprehends geometric representations of including, but not limited to, verbal communications, nonverbal communications, biometric data, autonomic data, genetic data, environmental data, internet data, and licensed data. The present invention is an auto-regression architecture and method. The present invention may be applied not only to the analysis of words and sentences but also to other forms of data, such as image-facial expressions, voice-emotions, video-context, medical (e.g., heart rates)-mental states, etc. The present invention accomplishes its objectives by combining multiple layers of vectorization, clustering, pattern finding and trimming in a specific order and fashion that optimizes efficiency and accuracy. As a consequence, the present invention is capable of more accurate and efficient abstractions of unstructured sequential data than was possible with prior inventions.",
  "date_published": "20170112",
  "title": "SYSTEM AND METHOD FOR LAYERED, VECTOR CLUSTER PATTERN WITH TRIM",
  "ipcr_labels": [
    "G06N9900"
  ],
  "_processing_info": {
    "original_size": 34257,
    "optimized_size": 2988,
    "reduction_percent": 91.28
  }
}