{
  "date_produced": "20170503",
  "publication_number": "US20170140292A1-20170518",
  "main_ipcr_label": "G06N700",
  "decision": "PENDING",
  "application_number": "15205155",
  "inventor_list": [
    {
      "inventor_name_last": "Byrne",
      "inventor_name_first": "Alan",
      "inventor_city": "Dublin",
      "inventor_state": "",
      "inventor_country": "IE"
    },
    {
      "inventor_name_last": "Lloyd",
      "inventor_name_first": "Jason",
      "inventor_city": "Dublin",
      "inventor_state": "",
      "inventor_country": "IE"
    },
    {
      "inventor_name_last": "Penrose",
      "inventor_name_first": "Andrew T.",
      "inventor_city": "Dublin",
      "inventor_state": "",
      "inventor_country": "IE"
    }
  ],
  "abstract": "An embodiment of the invention may include a method, computer program product and computer system for forecasting future states of a multi-active cloud. The method, computer program product and computer system may include a computing device that determines the operating state of the passive server. The operating state of the passive server is one or more of a deploying state and a smoke testing state. The computing device may determine the probability of the operating state successfully completing. The computing device may delay the second asynchronous workflow until the operating state successfully completes based on the probability of the operating state successfully completing exceeding a predetermined value.",
  "filing_date": "20160708",
  "patent_number": "None",
  "summary": "<SOH> BRIEF SUMMARY <EOH>An embodiment of the invention may include a method, computer program product and computer system for forecasting future states of a multi-active cloud. The method, computer program product and computer system may include a computing device that determines the operating state of the passive server. The operating state of the passive server is one or more of a deploying state and a smoke testing state. The computing device may determine the probability of the operating state successfully completing. The computing device may delay the second asynchronous workflow until the operating state successfully completes based on the probability of the operating state successfully completing exceeding a predetermined value.",
  "date_published": "20170518",
  "title": "FORECASTING FUTURE STATES OF A MULTI-ACTIVE CLOUD SYSTEM",
  "ipcr_labels": [
    "G06N700",
    "G06F1136",
    "H04L2908"
  ],
  "_processing_info": {
    "original_size": 61423,
    "optimized_size": 2311,
    "reduction_percent": 96.24
  }
}