{
  "date_produced": "20180103",
  "publication_number": "US20180018574A1-20180118",
  "main_ipcr_label": "G06N700",
  "decision": "PENDING",
  "application_number": "15208941",
  "inventor_list": [
    {
      "inventor_name_last": "Hara",
      "inventor_name_first": "Satoshi",
      "inventor_city": "Tokyo",
      "inventor_state": "",
      "inventor_country": "JP"
    },
    {
      "inventor_name_last": "Katsuki",
      "inventor_name_first": "Takayuki",
      "inventor_city": "Tokyo",
      "inventor_state": "",
      "inventor_country": "JP"
    },
    {
      "inventor_name_last": "Yanagisawa",
      "inventor_name_first": "Hiroki",
      "inventor_city": "Tokyo",
      "inventor_state": "",
      "inventor_country": "JP"
    }
  ],
  "abstract": "Methods and apparatus are provided for estimating anomalous sensors. The apparatus includes a target data acquiring to acquire a plurality of sets of target data serving as an examination target, each set of target data being output by a plurality of sensors. The apparatus further includes a calculating section calculate, for each of a plurality of sensor groups such that each sensor group includes at least two sensors among the plurality of sensors, a degree of difference of a target data distribution of the plurality of sets of target data relative to a reference data distribution of output from the sensor group. The apparatus additionally includes an estimating section to estimate one or more sensors among the plurality of sensors to be a source of outlierness, based on a calculation result of the calculating section.",
  "filing_date": "20160713",
  "patent_number": "None",
  "summary": "<SOH> SUMMARY <EOH>According to a first aspect of the present invention, provided is an apparatus including a target data acquiring section operable to acquire a plurality of sets of target data serving as an examination target, each set of target data output by a plurality of sensors; a calculating section operable to calculate, for each of a plurality of sensor groups that each include at least two sensors among the plurality of sensors, a degree of difference of a target data distribution of the plurality of sets of target data relative to a reference data distribution of output from the sensor group; and an estimating section operable to estimate one or more sensors among the plurality of sensors to be a source of outlierness, based on a calculation result of the calculating section. The first aspect may also include a system and a program for implementing the method performed by the apparatus. The summary clause does not necessarily describe all features of the embodiments of the present invention. The present invention may also be a sub-combination of the features described above.",
  "date_published": "20180118",
  "title": "ESTIMATION OF ABNORMAL SENSORS",
  "ipcr_labels": [
    "G06N700",
    "G06N504"
  ],
  "_processing_info": {
    "original_size": 79355,
    "optimized_size": 2744,
    "reduction_percent": 96.54
  }
}