{
  "decision": "PENDING",
  "application_number": "15205213",
  "date_published": "20170831",
  "date_produced": "20170816",
  "title": "SEMICONDUCTOR DEVICE, SEMICONDUCTOR SYSTEM, AND SYSTEM",
  "filing_date": "20160708",
  "inventor_list": [
    {
      "inventor_name_last": "CHO",
      "inventor_name_first": "Yong-Deok",
      "inventor_city": "Icheon-si Gyeonggi-do",
      "inventor_state": "",
      "inventor_country": "KR"
    }
  ],
  "ipcr_labels": [
    "G06F1214",
    "G11C800",
    "G06F121009"
  ],
  "main_ipcr_label": "G06F1214",
  "summary": "<SOH> SUMMARY <EOH>In an embodiment, there may be provided a semiconductor system wherein one semiconductor device of a first semiconductor device and a second semiconductor device suitable for transmitting and receiving addresses and encrypted data may include: an address output circuit configured to output the addresses; an encryption circuit configured to output the encrypted data based on normal data and the addresses; and a decryption circuit configured to output the normal data based on the addresses and the encrypted data. In an embodiment, a controller of a semiconductor system may be provided. The controller may include an address output circuit configured to provide addresses to a memory device. The controller may include an encryption circuit configured to generate encrypted data based on normal data and mapping addresses, and output the encrypted data to the memory device. The controller may include a decryption circuit configured to generate the normal data based on the encrypted data provided from the memory device and the mapping addresses. The controller may include an encryption control circuit configured to generate the mapping addresses based on a control signal and the addresses. In an embodiment, there may be provided a semiconductor device. The semiconductor device may include an address output circuit configured to generate addresses and output the addresses externally from the semiconductor device. The semiconductor device may include an encryption circuit configured to generate encrypted data based on normal data and mapping addresses, and output the encrypted data externally from the semiconductor device. The semiconductor device may include a decryption circuit configured to generate the normal data based on the encrypted data received externally from the semiconductor device and the mapping addresses. The semiconductor device may include an encryption control circuit configured to generate the mapping addresses based on the addresses.",
  "patent_number": "None",
  "abstract": "A semiconductor device, semiconductor system, and system may be provided. The semiconductor system may include one semiconductor device of a first semiconductor device and a second semiconductor device suitable for transmitting and receiving addresses and encrypted data. The one semiconductor device may include an address output circuit configured to output the addresses. The one semiconductor device may include an encryption circuit configured to output the encrypted data based on normal data and the addresses. The one semiconductor device may include a decryption circuit configured to output the normal data based on the addresses and the encrypted data.",
  "publication_number": "US20170249262A1-20170831",
  "_processing_info": {
    "original_size": 43108,
    "optimized_size": 3236,
    "reduction_percent": 92.49
  }
}