{
  "date_produced": "20170214",
  "publication_number": "US20170061280A1-20170302",
  "main_ipcr_label": "G06N308",
  "decision": "PENDING",
  "application_number": "15201499",
  "inventor_list": [
    {
      "inventor_name_last": "Kuznetsov",
      "inventor_name_first": "Georgiy Borisovich",
      "inventor_city": "Harwich",
      "inventor_state": "MA",
      "inventor_country": "US"
    }
  ],
  "abstract": "A system to produce spatiotemporal patterns, said system comprising: a plurality of cellular automata (CAa), and a plurality of inter-cellular memories; the contents of said inter-cellular memories condition the changes in said CAa. Once activated, said systems produce spatiotemporal patterns. Said patterns can be puzzling, aesthetically pleasing, and teaching. Said patterns can control other devices and computer programs, demonstrate the notions known in science and engineering, model real world phenomena and systems. To produce desired patterns, the users of said system edit the contents of said inter-cellular memories. To be able to do more, said users are encouraged to learn computer programming.",
  "filing_date": "20160703",
  "patent_number": "None",
  "summary": "<SOH> BRIEF SUMMARY OF THE INVENTION <EOH>Invented is a system producing spatiotemporal patterns. Said system can be used in at least 4 ways. First, creating and replicating said spatiotemporal patterns can be entertaining and puzzling. Second, through modeling spatiotemporal patterns found in nature or created artificially, said system teaches space, time, causality. Third, said system is a multipurpose spatiotemporal controller. Fourth, if based on a computer, said system provides ample material and motivations for learning computer programming. The difference between the system of this invention and the commonly studied and used cellular automata is demonstrated below. On the left, there is a plurality of cellular automata (A), wherein said cellular automata exist and operate in an isotropic space. On the right, is an example of the system taken from Embodiment 2, wherein the cellular automata are embedded in the inter-cellular medium comprising the inter-cellular memories (m). Said system provides eight inter-cellular memories per every cellular automata, and two inter-cellular memories between every two neighbor cellular automata. Hence, the relations between said cellular automata depend on their relative and absolute positions. AAAAAAAAA mmmmmmmmm AAAAAAAAA mAmmAmmAm AAAAAAAAA mmmmmmmmm AAAAAAAAA mmmmmmmmm AAAAAAAAA mAmmAmmAm AAAAAAAAA mmmmmmmmm AAAAAAAAA mmmmmmmmm AAAAAAAAA mAmmAmmAm AAAAAAAAA mmmmmmmmm Said inter-cellular memories condition the behavior of said cellular automata. The users of said system change the contents of said inter-cellular memories to make said cellular automata act as desired.",
  "date_published": "20170302",
  "title": "System for creating spatiotemporal patterns to entertain, teach and control",
  "ipcr_labels": [
    "G06N308",
    "G09B502",
    "G09B1900",
    "G06N9900"
  ],
  "_processing_info": {
    "original_size": 65119,
    "optimized_size": 2955,
    "reduction_percent": 95.46
  }
}