{
  "date_produced": "20171219",
  "publication_number": "US20180005119A1-20180104",
  "main_ipcr_label": "G06N502",
  "decision": "PENDING",
  "application_number": "15201102",
  "inventor_list": [
    {
      "inventor_name_last": "Ashrafi",
      "inventor_name_first": "Ali",
      "inventor_city": "Chapel Hills",
      "inventor_state": "NC",
      "inventor_country": "US"
    }
  ],
  "abstract": "Systems and methods for recognizing an analogous case from a knowledge base including a plurality of candidate cases are disclosed. The system may include a data receiver to receive a representation of a target case, and a microprocessor coupled to the data receiver to generate a plurality of target attributes from the representation of the target case. The microprocessor may query the knowledge base to recognize the analogous case similar to the target case in information content using the target attributes and a plurality of attribute memories each including first and second attributes and an inter-attribute contextual representation of interactions between the first and second attributes in a context of the plurality of candidate cases. The system may include an output circuit to output the recognized analogous case to a user or a process.",
  "filing_date": "20160701",
  "patent_number": "None",
  "summary": "<SOH> BRIEF DESCRIPTION OF THE DRAWINGS <EOH>In the drawings, which are not necessarily drawn to scale, like numerals may describe similar components in different views. Like numerals having different letter suffixes may represent different instances of similar components. Some embodiments are illustrated by way of example, and not limitation, in the figures of the accompanying drawings in which: FIG. 1 illustrates, by way of example and not limitation, a diagram of a system for recognizing an analogous case from a knowledge base. FIG. 2 illustrates, by way of example and not limitation, a diagram of a memory for use by a query system. FIG. 3 illustrates, by way of example and not limitation, a diagram of an associative query module for querying a knowledge base. FIG. 4 illustrates, by way of example and not limitation, a diagram of attribute memories before and after memory selection. FIG. 5 illustrates, by way of example and not limitation, a diagram of data representations produced by an associative query module. FIG. 6 illustrates, by way of example and not limitation, an example of a method for querying a knowledge base for an analogous case. FIG. 7 illustrates, by way of example of not limitation, a block diagram illustrating an example machine upon which any one or more of the techniques discussed herein may perform, according to an example embodiment. detailed-description description=\"Detailed Description\" end=\"lead\"?",
  "date_published": "20180104",
  "title": "SIMILARITY-BASED REASONING WITH ENSEMBLE MEMORY VOTING",
  "ipcr_labels": [
    "G06N502"
  ],
  "_processing_info": {
    "original_size": 82256,
    "optimized_size": 2848,
    "reduction_percent": 96.54
  }
}