{
  "decision": "ACCEPTED",
  "application_number": "15207783",
  "date_published": "20170119",
  "date_produced": "20170104",
  "title": "ELECTRONIC ANTI-COUNTERFEITING SYSTEM AND ELECTRONIC ANTI-COUNTERFEITING METHOD THEREOF",
  "filing_date": "20160712",
  "inventor_list": [
    {
      "inventor_name_last": "MING",
      "inventor_name_first": "LUI KAM",
      "inventor_city": "HONG KONG",
      "inventor_state": "",
      "inventor_country": "CN"
    }
  ],
  "ipcr_labels": [
    "G06Q3000",
    "G06K714",
    "G06K710"
  ],
  "main_ipcr_label": "G06Q3000",
  "summary": "<SOH> BRIEF DESCRIPTION OF THE DRAWINGS <EOH>FIG. 1 is a schematic view illustrating the composition of an electronic anti-counterfeiting system as provided in one example of the present invention; FIG. 2 is a schematic view illustrating the composition of an electronic anti-counterfeiting system as provided in one example of the present invention; FIG. 3 is a flow chart illustrating an electronic anti-counterfeiting method as provided in one example of the present invention; FIG. 4 is a schematic view illustrating the structure of the first Bluetooth readout unit of an electronic anti-counterfeiting system as provided in one example of the present invention; and FIG. 5 is a schematic view illustrating the structure of a RF shielding device as provided in one example of the present invention. detailed-description description=\"Detailed Description\" end=\"lead\"?",
  "patent_number": "10032173",
  "abstract": "The present invention, which is applicable to the field of electronic anti-counterfeiting technology, provides an electronic anti-counterfeiting system and an electronic anti-counterfeiting method using the same. The electronic anti-counterfeiting system comprises: a server disposed in a data center, the server comprising a database which stores the information about the logistics code and the anti-counterfeiting code of goods and the goods' production, transportation, sales and authenticity information corresponding to the information about the logistics code and the anti-counterfeiting code; at least one sales terminal in communication with the server, the sales terminal, after reading the logistics code of the goods, sending to the server such information that the goods is sold; and at least one query terminal in communication with the server, the query terminal, after reading the anti-counterfeiting code of the goods, sending the anti-counterfeiting code to the server to gain acces...",
  "publication_number": "US20170017967A1-20170119",
  "_processing_info": {
    "original_size": 117780,
    "optimized_size": 2477,
    "reduction_percent": 97.9
  }
}