{
  "decision": "PENDING",
  "application_number": "15209230",
  "date_published": "20180118",
  "date_produced": "20180103",
  "title": "UNDERLYING RECESSED COMPONENT PLACEMENT",
  "filing_date": "20160713",
  "inventor_list": [
    {
      "inventor_name_last": "CHAN",
      "inventor_name_first": "Alex L.",
      "inventor_city": "Ottawa",
      "inventor_state": "",
      "inventor_country": "CA"
    },
    {
      "inventor_name_last": "BROWN",
      "inventor_name_first": "Paul J.",
      "inventor_city": "Ottawa",
      "inventor_state": "",
      "inventor_country": "CA"
    }
  ],
  "ipcr_labels": [
    "H05K118",
    "G06F1750",
    "H05K300",
    "H05K111",
    "H05K346",
    "H05K334",
    "H05K102"
  ],
  "main_ipcr_label": "H05K118",
  "summary": "<SOH> SUMMARY <EOH>A brief summary of various exemplary embodiments is presented below. Some simplifications and omissions may be made in the following summary, which is intended to highlight and introduce some aspects of the various exemplary embodiments, but not to limit the scope of the invention. Detailed descriptions of a preferred exemplary embodiment adequate to allow those of ordinary skill in the art to make and use the inventive concepts will follow in later sections. According to an aspect of the invention there is provided a through-hole printed circuit board (PCB) having a ball grid array (BGA) of BGA pads on one side of the PCB, arranged in a tight-pitch grid pattern; a milled recess on the same side of the PCB in the PCB adjacent and between a first and a second of the BGA pads of the ball grid array of BGA pads; the recess sized to contain a Surface Mount Component (SMC); a first pair of separated conductive pads at the bottom of the milled recess, each pad respectively conductively coupled to the first and second BGA pads. In some embodiments of this aspect of the invention a second pair of separated conductive pads surround the opening of the milled recess, each pad respectively conductively coupled to the first and second BGA pads. In some embodiments of this aspect of the invention the tight-pitch grid pattern has a 1 mm pitch. In some of these embodiments the SMC has a industry nominal 0201 size; and the first and second BGA pads are diagonally situated relative to the grid pattern. In others of these embodiments the SMC has a industry nominal 01005 size; and the first and second BGA pads are diagonally situated relative to the grid pattern. In some embodiments of this aspect of the invention at least one BGA pad of the ball grid array of BGA pads has been removed; and the milled recess is located in the array grid where the at least one BGA has been removed. In some of these embodiments the SMC has an industry nominal 01005 size, in some an ind...",
  "patent_number": "None",
  "abstract": "An underlying recess is provided for component placement beneath Ball Grid Arrays allowing closer proximity for decoupling capacitors and other components. The underlying recess placement of components assists in minimizing reliability issues concerning surface mount components and provides closer proximity placement of components. The underlying recess placement of components is particularly useful for overcoming the problem of parasitic inductance of more distant component placements known in the art.",
  "publication_number": "US20180020547A1-20180118",
  "_processing_info": {
    "original_size": 33453,
    "optimized_size": 3239,
    "reduction_percent": 90.32
  }
}