{
  "decision": "PENDING",
  "application_number": "15203451",
  "date_published": "20180111",
  "date_produced": "20171227",
  "title": "PARALLEL TRANSFERS OF ELECTRONIC DATA",
  "filing_date": "20160706",
  "inventor_list": [
    {
      "inventor_name_last": "LeFevre",
      "inventor_name_first": "Jeffrey",
      "inventor_city": "Sunnyvale",
      "inventor_state": "CA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Castellanos",
      "inventor_name_first": "Maria",
      "inventor_city": "Sunnyvale",
      "inventor_state": "CA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Hsu",
      "inventor_name_first": "Meichun",
      "inventor_city": "Sunnyvale",
      "inventor_state": "CA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Liu",
      "inventor_name_first": "Rui",
      "inventor_city": "Sunnyvale",
      "inventor_state": "CA",
      "inventor_country": "US"
    }
  ],
  "ipcr_labels": [
    "G06F1730"
  ],
  "main_ipcr_label": "G06F1730",
  "summary": "<SOH> BRIEF DESCRIPTION OF THE DRAWINGS <EOH>The following detailed description references the drawings, wherein: FIG. 1 is a block diagram of an example system for parallel transfers of electronic data; FIG. 2 is a flowchart of an example method for parallel transfers of electronic data; FIG. 3 is a flowchart of an example method for parallel transfers of electronic data; FIG. 4 is a block diagram of an example implementation of the example method illustrated in FIG. 3 ; FIG. 5 is a block diagram of an example machine-readable medium for parallel transfers of electronic data; and FIG. 6 is a block diagram of an example system for parallel transfers of electronic data. detailed-description description=\"Detailed Description\" end=\"lead\"?",
  "patent_number": "None",
  "abstract": "Examples disclosed herein relate to parallel transfers of electronic data. Some examples disclosed herein may include executing, by a processing node of a computation engine, a computation task among a plurality of computation tasks generated by the computation engine for transferring an electronic data table to a target table. The computation task, when executed by the processing node, may cause the processing node to transfer a segment of the electronic data table to a staging table, update a task status table upon completing the transfer of the segment to the staging table, in response to determining that the plurality of computation tasks have completed, update a last committer table with a task identifier associated with the computation task, and in response to determining that the last committer table includes the task identifier associated with the computation task, transfer the staging table to the target table.",
  "publication_number": "US20180011886A1-20180111",
  "_processing_info": {
    "original_size": 59313,
    "optimized_size": 2646,
    "reduction_percent": 95.54
  }
}