{
  "date_produced": "20180103",
  "publication_number": "US20180018580A1-20180118",
  "main_ipcr_label": "G06N9900",
  "decision": "PENDING",
  "application_number": "15212037",
  "inventor_list": [
    {
      "inventor_name_last": "Coppin",
      "inventor_name_first": "Benjamin Kenneth",
      "inventor_city": "Cottenham",
      "inventor_state": "",
      "inventor_country": "GB"
    },
    {
      "inventor_name_last": "Suleyman",
      "inventor_name_first": "Mustafa",
      "inventor_city": "London",
      "inventor_state": "",
      "inventor_country": "GB"
    },
    {
      "inventor_name_last": "Walters",
      "inventor_name_first": "Thomas Chadwick",
      "inventor_city": "Bromley",
      "inventor_state": "",
      "inventor_country": "GB"
    },
    {
      "inventor_name_last": "Mann",
      "inventor_name_first": "Timothy",
      "inventor_city": "Harpenden",
      "inventor_state": "",
      "inventor_country": "GB"
    },
    {
      "inventor_name_last": "Chu",
      "inventor_name_first": "Chia-Yueh Carlton",
      "inventor_city": "London",
      "inventor_state": "",
      "inventor_country": "GB"
    },
    {
      "inventor_name_last": "Szummer",
      "inventor_name_first": "Martin",
      "inventor_city": "London",
      "inventor_state": "",
      "inventor_country": "GB"
    },
    {
      "inventor_name_last": "Cobo Rus",
      "inventor_name_first": "Luis Carlos",
      "inventor_city": "San Francisco",
      "inventor_state": "CA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Crespo",
      "inventor_name_first": "Jean-Francois",
      "inventor_city": "Palo Alto",
      "inventor_state": "CA",
      "inventor_country": "US"
    }
  ],
  "abstract": "Methods, systems, and apparatus, including computer programs encoded on computer storage media, for using a machine learning model that has been trained through reinforcement learning to select a content item. One of the methods includes receiving first data characterizing a first context in which a first content item may be presented to a first user in a presentation environment; and providing the first data as input to a long-term engagement machine learning model, the model having been trained through reinforcement learning to: receive a plurality of inputs, and process each of the plurality of inputs to generate a respective engagement score for each input that represents a predicted, time-adjusted total number of selections by the respective user of future content items presented to the respective user in the presentation environment if the respective content item is presented in the respective context.",
  "filing_date": "20160715",
  "patent_number": "None",
  "summary": "<SOH> SUMMARY <EOH>In general, this specification describes a system that is configured to determine whether or not to present a content item to a user using a machine learning model that has been trained through reinforcement learning. A system of one or more computers can be so configured by virtue of software, firmware, hardware, or a combination of them installed on the system that in operation cause the system to perform the actions. One or more computer programs can be so configured by virtue of having instructions that, when executed by data processing apparatus, cause the apparatus to perform the actions. Particular embodiments of the subject matter described in this specification can be implemented so as to realize one or more of the following advantages. A system can effectively predict the extent to which presenting a content item in a particular context to a particular user will have negative long-term consequences on the user's future engagement with subsequent content items. Accordingly, the system can determine not to present the current content item if the negative long-term consequences are too great, improving the user experience and maintaining long-term user engagement. The details of one or more embodiments of the subject matter of this specification are set forth in the accompanying drawings and the description below. Other features, aspects, and advantages of the subject matter will become apparent from the description, the drawings, and the claims.",
  "date_published": "20180118",
  "title": "SELECTING CONTENT ITEMS USING REINFORCEMENT LEARNING",
  "ipcr_labels": [
    "G06N9900",
    "G06F1730",
    "G06N700"
  ],
  "_processing_info": {
    "original_size": 50635,
    "optimized_size": 4035,
    "reduction_percent": 92.03
  }
}