{
  "decision": "ACCEPTED",
  "application_number": "15213328",
  "date_published": "20170316",
  "date_produced": "20170301",
  "title": "CLIENT-SERVER ELECTRONIC PROGRAM GUIDE",
  "filing_date": "20160718",
  "inventor_list": [
    {
      "inventor_name_last": "Ellis",
      "inventor_name_first": "Michael D.",
      "inventor_city": "Boulder",
      "inventor_state": "CO",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Lemmons",
      "inventor_name_first": "Thomas R.",
      "inventor_city": "Evergreen",
      "inventor_state": "CO",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Thomas",
      "inventor_name_first": "William L.",
      "inventor_city": "Golden",
      "inventor_state": "CO",
      "inventor_country": "US"
    }
  ],
  "ipcr_labels": [
    "H04N21482",
    "H04N21442",
    "G06F1730",
    "H04N2161",
    "H04N21858",
    "H04N21278",
    "H04N2184"
  ],
  "main_ipcr_label": "H04N21482",
  "summary": "<SOH> SUMMARY OF THE INVENTION <EOH>This and other objects of the present invention are accomplished in accordance with the principles of the present invention by providing a client-server based interactive television program guide system in which a main facility (e.g., a satellite uplink facility or a facility that feeds such an uplink facility) provides data from one or more data sources to a number of television distribution facilities such as cable system headends, broadcast distribution facilities, satellite television distribution facilities, or other suitable distribution facilities. Some of the data sources may be located at different facilities and have their data provided to the main facility for localization and distribution or may provide their data to the television distribution facilities directly. The data provided to the television distribution facilities includes television programming data (e.g., titles, channels, content information, rating information, program identifiers, series identifiers, or any other information associated with television programming), and other program guide data for additional services other than television program listings (e.g., weather information, associated Internet web links, computer software, etc.). The main facility (and other sources) may provide the program guide data to the television distribution facilities via a satellite link, a telephone network link, a cable or fiber optic link, a microwave link, an Internet link, a combination of such links, or any other suitable communications link. Each television distribution facility has a program guide server. If desired, program guide servers may also be located at cable system network nodes or other facilities separate from the television distribution facilities or other distribution facilities. Each program guide server stores the program guide data provided by the main facility and provides access to the program guide data to program guide clients implemented on ...",
  "patent_number": "9854321",
  "abstract": "A client-server interactive television program guide system is provided. An interactive television program guide client is implemented on user television equipment. The interactive television program guide provides users with an opportunity to define expressions that are processed by the program guide server. The program guide server may provide program guide data, schedules reminders, schedules program recordings, and parentally locks programs based on the expressions. Users' viewing histories may be tracked. The program guide server may analyze the viewing histories and generates viewing recommendations, targets advertising, and collects program ratings information based on the viewing histories.",
  "publication_number": "US20170078757A1-20170316",
  "_processing_info": {
    "original_size": 109034,
    "optimized_size": 3617,
    "reduction_percent": 96.68
  }
}