{
  "date_produced": "20161019",
  "publication_number": "US20160321557A1-20161103",
  "main_ipcr_label": "G06N700",
  "decision": "PENDING",
  "application_number": "15210805",
  "inventor_list": [
    {
      "inventor_name_last": "Hawkins",
      "inventor_name_first": "Jeffrey C.",
      "inventor_city": "Atherton",
      "inventor_state": "CA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Agarwal",
      "inventor_name_first": "Rahul",
      "inventor_city": "San Francisco",
      "inventor_state": "CA",
      "inventor_country": "US"
    }
  ],
  "abstract": "Detecting patterns and sequences associated with an anomaly in predictions made a predictive system. The predictive system makes predictions by learning spatial patterns and temporal sequences in an input data that change over time. As the input data is received, the predictive system generates a series of predictions based on the input data. Each prediction is compared with corresponding actual value or state. If the prediction does not match or deviates significantly from the actual value or state, an anomaly is identified for further analysis. A corresponding state or a series of states of the predictive system before or at the time of prediction are associated with the anomaly and stored. The anomaly can be detected by monitoring whether the predictive system is placed in the state or states that is the same or similar to the stored state or states.",
  "filing_date": "20160714",
  "patent_number": "None",
  "summary": "<SOH> SUMMARY <EOH>Embodiments are related to detecting an anomaly based on discrepancy between prediction made at one time by a predictive system and an actual value or state data corresponding to input data received at a subsequent time. At least a subset of states of the predictive system before the subsequent time is stored. An anomaly is detected by at least comparing the predicted value or state corresponding to the predictive output with an actual value or state at the subsequent time. The anomaly is associated with one or more stored states of the predictive system before the subsequent time. In one embodiment, a request to detect a subsequent occurrence of the detected anomaly is received. In response, the predictive system is monitored to determine if the predictive system is placed in the one or more stored states associated with the anomaly. In one embodiment, the anomaly is determined by tallying accuracy of predicted values or states corresponding to predictive outputs over a time period relative to actual values or states over a time period. In one embodiment, the predictive system is configured to learn and detect temporal sequences of spatial patterns in the input data. In one embodiment, the prediction output is generated using a series of spatial pooler outputs in sparse distributed representation by processing the input data over time by a spatial pooler. Each of the spatial pooler outputs indicates a spatial pattern detected in the input data at a time. The prediction output is generated by a sequence processor based on stored temporal relationships between the series of spatial pooler outputs. In one embodiment, the subset of the states of the predictive system includes states of the sequence processor. In one embodiment, the anomaly is determined by comparing the prediction output at one time with the spatial pooler output at a subsequent time.",
  "date_published": "20161103",
  "title": "ANOMALY DETECTION IN SPATIAL AND TEMPORAL MEMORY SYSTEM",
  "ipcr_labels": [
    "G06N700",
    "G06N502",
    "G06N9900"
  ],
  "_processing_info": {
    "original_size": 55725,
    "optimized_size": 3483,
    "reduction_percent": 93.75
  }
}