{
  "date_produced": "20170110",
  "publication_number": "US20170024647A1-20170126",
  "main_ipcr_label": "G06N502",
  "decision": "PENDING",
  "application_number": "15215525",
  "inventor_list": [
    {
      "inventor_name_last": "Cheong",
      "inventor_name_first": "Hyunmin",
      "inventor_city": "Toronto",
      "inventor_state": "",
      "inventor_country": "CA"
    },
    {
      "inventor_name_last": "Li",
      "inventor_name_first": "Wei",
      "inventor_city": "Toronto",
      "inventor_state": "",
      "inventor_country": "CA"
    },
    {
      "inventor_name_last": "Iorio",
      "inventor_name_first": "Francesco",
      "inventor_city": "Ontario",
      "inventor_state": "",
      "inventor_country": "CA"
    }
  ],
  "abstract": "A design application is configured to perform a system-level optimization of a collection of system components. The design application iteratively executes a multi-objective solver to optimize structural and functional relationships between the system components in order to meet global design criteria and generate a system design. The design application initializes the design process by extracting from a knowledge base system templates having taxonomic, structural, or functional attributes relevant to the system design. The design application generates the knowledge base by mining taxonomic, structural, and functional relationships from a corpus of engineering texts.",
  "filing_date": "20160720",
  "patent_number": "None",
  "summary": "<SOH> SUMMARY OF THE INVENTION <EOH>Various embodiments of the present invention set forth a computer-implemented method for generating a knowledge base, including extracting a first text segment from a corpora that describe one or more systems, applying a set of syntactic parsing rules to the first text segment to generate a first parsed text segment, and generating, based on the first parsed text segment, a first knowledge model element that indicates a first relationship between a first plurality of components of a first system. At least one advantage of the techniques described herein is that the knowledge base can be generated from a wealth of engineering knowledge included in the vast technical corpora available, making this engineering knowledge directly accessible to engineers during the design process.",
  "date_published": "20170126",
  "title": "SYSTEM-LEVEL APPROACH TO GOAL-DRIVEN DESIGN",
  "ipcr_labels": [
    "G06N502",
    "G06F1750"
  ],
  "_processing_info": {
    "original_size": 77614,
    "optimized_size": 2316,
    "reduction_percent": 97.02
  }
}