{
  "decision": "ACCEPTED",
  "application_number": "15217691",
  "date_published": "20170223",
  "date_produced": "20170208",
  "title": "BACKLIGHT MODULE AND LIGHT GUIDE PLATE THEREOF",
  "filing_date": "20160722",
  "inventor_list": [
    {
      "inventor_name_last": "CHEN",
      "inventor_name_first": "YEN-CHANG",
      "inventor_city": "Taoyuan County",
      "inventor_state": "",
      "inventor_country": "TW"
    }
  ],
  "ipcr_labels": [
    "F21V800",
    "G06F302"
  ],
  "main_ipcr_label": "F21V800",
  "summary": "<SOH> SUMMARY OF THE INVENTION <EOH>On object of the invention is to provide a light guide plate, which changes the direction of light by the cone shape structure of the opening to improve the leakage of light. Another object of the invention is to provide a backlight module for keyboard, which has an opening with a cone shape region including inclined edges in the horizontal direction to significantly reduce the light refracted into the opening, so as to reduce the leakage of light from the opening and improve the uniformity of brightness of the keyboard. In an embodiment, the invention provides a light guide plate for receiving light from a light source unit. The light guide plate includes a plate body substantially extending along an X-Y plane, a normal direction to the X-Y plane being a Z axis, the plate body having a light entrance surface, the light entering the light guide plate from the light entrance surface and traveling substantially along the X-Y plane; and at least one opening formed in the plate body, the opening extending along the Z axis, a cross section of the opening on the X-Y plane being a taper shape and having a base region and a cone shape region, wherein the cone shape region extends from one side of the base region and is positioned between the light entrance surface and the base region. In an embodiment, the cone shape region has a vertex angle in a range of 30˜45 degrees. In an embodiment, the base region has a central point. A straight line running through the central point and a middle point of the light entrance surface defines a light leakage path. The cone shape region has a vertex centerline. An included angle between the vertex centerline and the light leakage path is smaller than 90 degrees. In an embodiment, the base region has a circular shape. The central point is the center of the circular shape. The light leakage path is defined by the straight line running through the center of the circular shape and the middle point of the l...",
  "patent_number": "9983346",
  "abstract": "A backlight module includes a light source unit for providing light, a light guide plate including a plate body having a light entrance surface and extending along an X-Y plane and at least one opening in the plate body and extending along a Z axis, and an optical layer on one side of the light guide plate. The light enters the light guide plate from the light entrance surface and travels substantially along the X-Y plane. A cross section of the opening on the X-Y plane is a taper shape with a base region and a cone shape region extending from one side of the base region. The cone shape region is disposed between the light source unit and the base region. The optical layer has a through hole aligned and communicating with the base region. A projection of the cone shape region along the Z axis on the optical layer is at least partially outside the through hole.",
  "publication_number": "US20170052309A1-20170223",
  "_processing_info": {
    "original_size": 59005,
    "optimized_size": 3431,
    "reduction_percent": 94.19
  }
}