{
  "decision": "PENDING",
  "application_number": "15210154",
  "date_published": "20161103",
  "date_produced": "20161019",
  "title": "Apparatus, Systems, and Methods for Measuring Environmental Exposure and Physiological Response Thereto",
  "filing_date": "20160714",
  "inventor_list": [
    {
      "inventor_name_last": "LeBoeuf",
      "inventor_name_first": "Steven Francis",
      "inventor_city": "Raleigh",
      "inventor_state": "NC",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Tucker",
      "inventor_name_first": "Jesse Berkley",
      "inventor_city": "Youngsville",
      "inventor_state": "NC",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Aumer",
      "inventor_name_first": "Michael Edward",
      "inventor_city": "Raleigh",
      "inventor_state": "NC",
      "inventor_country": "US"
    }
  ],
  "ipcr_labels": [
    "A61B50205",
    "G06Q3002",
    "G06F1900",
    "A61B500",
    "A61B511"
  ],
  "main_ipcr_label": "A61B50205",
  "summary": "<SOH> SUMMARY <EOH>In view of the above discussion, systems and methods for monitoring various physiological and environmental factors, as well as systems and methods for using this information for a plurality of useful purposes, are provided. According to some embodiments of the present invention, real-time, noninvasive health and environmental monitors include a plurality of compact sensors integrated within small, low-profile devices. Physiological and environmental data is collected and wirelessly transmitted into a wireless network, where the data is stored and/or processed. This information is then used to support a variety of useful methods, such as clinical trials, marketing studies, biofeedback, entertainment, and others. Though the methods herein may apply broadly to a variety of form factors for a monitoring apparatus, in some embodiments of the invention an earpiece functions as a physiological monitor, an environmental monitor, and a wireless personal communicator. Because the ear region is located next to a variety of “hot spots” for physiological an environmental sensing—including the tympanic membrane, the carotid artery, the paranasal sinus, etc.—in some cases an earpiece monitor takes preference over other form factors. The earpiece can take advantage of commercially available open-architecture, ad hoc, wireless paradigms, such as Bluetooth®, Wi-Fi, or ZigBee. In some embodiments, a small, compact earpiece contains at least one microphone and one speaker, and is configured to transmit information wirelessly to a recording device such as, for example, a cell phone, a personal digital assistant (PDA), and/or a computer. The earpiece contains a plurality of sensors for monitoring personal health and environmental exposure. Health and environmental information, sensed by the sensors is transmitted wirelessly, in real-time, to a recording device, capable of processing and organizing the data into meaningful displays, such as charts. In some embodiments,...",
  "patent_number": "None",
  "abstract": "Systems and methods for monitoring various physiological and environmental factors, as well as systems and methods for using this information for a plurality of useful purposes, are provided. Real-time, noninvasive health and environmental monitors include a plurality of compact sensors integrated within small, low-profile devices. Physiological and environmental data is collected and wirelessly transmitted into a wireless network, where the data is stored and/or processed. This information is then used to support a variety of useful methods, such as clinical trials, marketing studies, biofeedback, entertainment, and others.",
  "publication_number": "US20160317049A1-20161103",
  "_processing_info": {
    "original_size": 172963,
    "optimized_size": 3614,
    "reduction_percent": 97.91
  }
}