{
  "date_produced": "20170816",
  "publication_number": "US20170249558A1-20170831",
  "main_ipcr_label": "G06N700",
  "decision": "PENDING",
  "application_number": "15210455",
  "inventor_list": [
    {
      "inventor_name_last": "Jain",
      "inventor_name_first": "Aastha",
      "inventor_city": "Sunnyvale",
      "inventor_state": "CA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Chatterjee",
      "inventor_name_first": "Shaunak",
      "inventor_city": "Sunnyvale",
      "inventor_state": "CA",
      "inventor_country": "US"
    }
  ],
  "abstract": "A machine may be configured to blend connection recommendation streams. For example, the machine, based on a member identifier of a member of a SNS, accesses a list of other members of the SNS and a list of guests (e.g., non-members). The machine identifies a member probability value representing a likelihood of the member inviting another member to connect via the social graph of the member, and identifies a guest probability value representing a likelihood of the member inviting a guest to connect via the social graph. The machine generates a blended list of other members and guests based on the member probability values, the guest probability values, and a coefficient value selected to control a presence of a type of connections in the blended list. The machine generates recommendations for the member to invite people included in the blended list to connect with the member via the social graph.",
  "filing_date": "20160714",
  "patent_number": "None",
  "summary": "<SOH> BRIEF DESCRIPTION OF THE DRAWINGS <EOH>Some embodiments are illustrated by way of example and not limitation in the figures of the accompanying drawings, in which: FIG. 1 is a network diagram illustrating a client-server system, according to some example embodiments; FIG. 2 is a block diagram illustrating components of a recommendation stream system, according to some example embodiments; FIG. 3 is a flowchart illustrating a method for generating a blended connection recommendation stream, according to some example embodiments; FIG. 4 is a flowchart illustrating a method for generating a blended connection recommendation stream, and representing additional steps of the method illustrated in FIG. 3 , according to some example embodiments; FIG. 5 is a flowchart illustrating a method for generating a blended connection recommendation stream, and representing additional steps of the method illustrated in FIG. 3 , according to some example embodiments; FIG. 6 is a flowchart illustrating a method for generating a blended connection recommendation stream, and representing additional steps of the method illustrated in FIG. 3 , according to some example embodiments; FIG. 7 is a flowchart illustrating a method for generating a blended connection recommendation stream, and representing step 308 of the method illustrated in FIG. 3 in more detail and an additional step of the method illustrated in FIG. 3 , according to some example embodiments; FIG. 8 is a flowchart illustrating a method for generating a blended connection recommendation stream, and representing steps 704 and 706 of the method illustrated in FIG. 7 in more detail, according to some example embodiments; FIG. 9 is a block diagram illustrating a mobile device, according to some example embodiments; and FIG. 10 is a block diagram illustrating components of a machine, according to some example embodiments, able to read instructions from a machine-readable medium and perform any one or more of the methodologies ...",
  "date_published": "20170831",
  "title": "BLENDING CONNECTION RECOMMENDATION STREAMS",
  "ipcr_labels": [
    "G06N700",
    "H04L2908",
    "G06N502"
  ],
  "_processing_info": {
    "original_size": 90528,
    "optimized_size": 3614,
    "reduction_percent": 96.01
  }
}