{
  "date_produced": "20180103",
  "publication_number": "US20180018560A1-20180118",
  "main_ipcr_label": "G06N308",
  "decision": "PENDING",
  "application_number": "15210164",
  "inventor_list": [
    {
      "inventor_name_last": "SALDANA",
      "inventor_name_first": "Manuel",
      "inventor_city": "Toronto",
      "inventor_state": "",
      "inventor_country": "CA"
    },
    {
      "inventor_name_last": "DALTON",
      "inventor_name_first": "Barnaby",
      "inventor_city": "Mississauga",
      "inventor_state": "",
      "inventor_country": "CA"
    },
    {
      "inventor_name_last": "COURVILLE",
      "inventor_name_first": "Vanessa",
      "inventor_city": "Etobicoke",
      "inventor_state": "",
      "inventor_country": "CA"
    }
  ],
  "abstract": "A memory control unit for handling data stored in a memory device includes a first interface to an interconnection with at least one memory bank; a second interface for communicating with a data requesting unit; and a memory quantization unit. The memory quantization unit is configured to: obtain, via the first interface, a first weight value from the at least one memory bank; quantize the first weight value to generate at least one quantized weight value having a shorter bit length than a bit length of the first weight value; and communicate the at least one quantized weight value to the data requesting unit via the second interface.",
  "filing_date": "20160714",
  "patent_number": "None",
  "summary": "<SOH> SUMMARY <EOH>In an aspect, there is provided a memory control unit including: a first interface to an interconnection with at least one memory bank; a second interface for communicating with a data requesting unit; and a memory quantization unit. The memory quantization unit is configured to: obtain, via the first interface, a first weight value from the at least one memory bank; quantize the first weight value to generate at least one quantized weight value having a shorter bit length than a bit length of the first weight value; and communicate the at least one quantized weight value to the data requesting unit via the second interface. In another aspect, there is provided a method for quantizing data stored in a memory device. The method includes: upon receiving, at a memory control unit, a quantized data request, obtaining a first weight value from the memory device; quantizing, with a memory quantization unit, the first weight value to generate at least one quantized weight value having a shorter bit length than a bit length of the first weight value; and communicating the at least one quantized weight value to a data requesting unit. In another aspect, there is provided a circuit including: a memory control unit having a first interface to an interconnection with at least one memory bank; a second interface for communicating with a data requesting unit; and a memory quantization unit. The memory quantization unit configured to: obtain, via the first interface, a first weight value from the at least one memory bank; quantize the first weight value to generate at least one quantized weight value having a shorter bit length than a bit length of the first weight value; and communicate the at least one quantized weight value to the data requesting unit via the second interface",
  "date_published": "20180118",
  "title": "SYSTEMS, METHODS AND DEVICES FOR DATA QUANTIZATION",
  "ipcr_labels": [
    "G06N308",
    "G06F306",
    "G06N304"
  ],
  "_processing_info": {
    "original_size": 38011,
    "optimized_size": 3307,
    "reduction_percent": 91.3
  }
}