{
  "decision": "PENDING",
  "application_number": "15215751",
  "date_published": "20171207",
  "date_produced": "20171121",
  "title": "SYSTEM AND METHOD FOR INPUT RECOGNITION LINGUISTIC RESOURCE MANAGEMENT",
  "filing_date": "20160721",
  "inventor_list": [
    {
      "inventor_name_last": "Rigouste",
      "inventor_name_first": "Lois",
      "inventor_city": "Nantes Cedex 3",
      "inventor_state": "",
      "inventor_country": "FR"
    }
  ],
  "ipcr_labels": [
    "G06F30488",
    "G06F1727",
    "G10L15197"
  ],
  "main_ipcr_label": "G06F30488",
  "summary": "<SOH> SUMMARY <EOH>The examples of the present invention that are described herein below provide systems and methods for providing a linguistic resource for input recognition of multiple input types to computing devices. Each computing device is connected to an input interface and has a processor, a memory and at least one non-transitory computer readable medium for recognizing input under control of the processor. In one example, a system for providing a linguistic resource for input recognition of multiple input types to computing devices is provided. The at least one non-transitory computer readable medium is configured to allow setting, in the memory, of a plurality of parameters of a linguistic resource which provides a language model of one or more languages and cause recognition of input to the input interface of one or more types of a plurality of different types of input in the one or more languages using the linguistic resource. The plurality of parameters are set in order to optimize performance characteristics of the recognition of each of the one or more types of recognized input while providing the linguistic resource with a pre-determined size. The different types of input may include handwriting input and typing input. The performance characteristics may include the word recognition rate of the handwriting input, the word prediction rate of the typing input and the keystroke saving rate of the typing input. The language model may be a class-based n-gram language model utilizing a lexicon built using one or more corpora related to the one or more languages. The plurality of parameters may include one or more of a first parameter related to the size of the lexicon, a second parameter related to the corpora content used to build the lexicon and the n-gram model, a third parameter related to the number of n-gram sequences, a fourth parameter related to the order of the n-gram model, and a fifth parameter related to the number of classes in the class-base...",
  "patent_number": "None",
  "abstract": "A system, method and computer program product for use in providing a linguistic resource for input recognition of multiple input types on a computing device are provided. The computing device is connected to an input interface. A user is able to provide input by applying pressure to or gesturing above the input interface using a finger or an instrument such as a stylus or pen. The computing device has an input management system for recognizing the input. The input management system is configured to allow setting, in the computing device memory, parameters of a linguistic resource for a language model of one or more languages, and cause recognition of input to the input interface of the different input types using the linguistic resource. The resource parameters are set to optimize recognition performance characteristics of each input type while providing the linguistic resource with the pre-determined size.",
  "publication_number": "US20170351420A1-20171207",
  "_processing_info": {
    "original_size": 97233,
    "optimized_size": 3511,
    "reduction_percent": 96.39
  }
}