{
  "date_produced": "20170104",
  "publication_number": "US20170017890A1-20170119",
  "main_ipcr_label": "G06N504",
  "decision": "PENDING",
  "application_number": "15210878",
  "inventor_list": [
    {
      "inventor_name_last": "Dohan",
      "inventor_name_first": "Jewel",
      "inventor_city": "Lady Lake",
      "inventor_state": "FL",
      "inventor_country": "US"
    }
  ],
  "abstract": "A method for identifying people who are potentially to have a successful dating relationship including embedding an application within a mobile computing device, having at least a first user and a second user to sign in into each's respective mobile device application to initiate a session; allowing the application to generate a question to the first user and the second user; deciding either the first user or the second user is in command mode; answering the question with response to each other by the first user and the second user; allowing the first user or the second user in command mode to decide if the received response is satisfactory; moving the first user or the second user forward or backward from an end point depending on whether the response is satisfactory.",
  "filing_date": "20160714",
  "patent_number": "None",
  "summary": "<SOH> SUMMARY OF THE INVENTION <EOH>In one aspect of the invention, a method for identifying people who are potentially to have a successful dating relationship comprising embedding an application within a mobile computing device, the method comprising: having at least a first user and a second user to sign in into each's respective mobile device application to initiate a session; allowing the application to generate a question to the first user and the second user; deciding either the first user or the second user is in command mode; answering the question with response to each other by the first user and the second user; allowing the first user or the second user in command mode to decide if the received response is satisfactory; moving the first user or the second user forward or backward from an end point depending on whether the response is satisfactory. In one embodiment, the method further comprises showing the gap between the end point and the first user or the second user. In one embodiment, the method further comprises showing the movement of the first user or the second user moving towards or away from the end point. In one embodiment, the method further comprises showing the gap between the end point and the first user or the second user. In one embodiment, the method further comprises showing the gap between the end point and the first user or the second user. In one embodiment, the first user and the second user be in command mode in alternate sequence. In one embodiment, the identities of the first user and the second user are not revealed to each other until both have reached to the end point. In one embodiment, the identities of the first user and the second user are not revealed to each other until at least either the first user or the second user has reached to the end point. In one embodiment, the session is terminated when the identities are revealed. In one embodiment, the session is terminated when the first user or the second user do not reac...",
  "date_published": "20170119",
  "title": "Method and System For Identifying Potentially Successful Dating Relationship",
  "ipcr_labels": [
    "G06N504",
    "G06N9900",
    "H04L2908"
  ],
  "_processing_info": {
    "original_size": 35499,
    "optimized_size": 3366,
    "reduction_percent": 90.52
  }
}