{
  "date_produced": "20170412",
  "publication_number": "US20170116542A1-20170427",
  "main_ipcr_label": "G06N9900",
  "decision": "ACCEPTED",
  "application_number": "15214757",
  "inventor_list": [
    {
      "inventor_name_last": "SHIM",
      "inventor_name_first": "Yun-Pil",
      "inventor_city": "Eldersburg",
      "inventor_state": "MD",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "TAHAN",
      "inventor_name_first": "Charles George",
      "inventor_city": "Silver Spring",
      "inventor_state": "MD",
      "inventor_country": "US"
    }
  ],
  "abstract": "Physical superconducting qubits are controlled according to an “encoded” qubit scheme, where a pair of physical superconducting qubits constitute an encoded qubit that can be controlled without the use of a microwave signal. For example, a quantum computing system has at least one encoded qubit and a controller. Each encoded qubit has a pair of physical superconducting qubits capable of being selectively coupled together. Each physical qubit has a respective tunable frequency. The controller controls a state of each of the pair of physical qubits to perform a quantum computation without using microwave control signals. Rather, the controller uses DC-based voltage or flux pulses.",
  "filing_date": "20160720",
  "patent_number": "9996801",
  "summary": "<SOH> SUMMARY <EOH>In embodiments, physical superconducting qubits (e.g., a superconducting Josephson junction quantum circuit) are controlled according to an “encoded” qubit scheme. The encoded qubit is embedded logically in a pair of physical superconducting qubits. Unlike conventional superconducting qubit control, the encoded superconducting qubit approach does not require microwave control. Rather, the encoded superconducting qubit approach enables microwave-free control of qubit states via fast DC-like pulses. Thus, the physical qubit frequency (and the corresponding operation of the superconductor-based quantum computer) can be divorced from the corresponding control electronics. In one or more embodiments, a method comprises controlling operation of a superconductor-based quantum computer without using a microwave signal. In one or more embodiments, a method comprises providing at least one encoded qubit and controlling the at least one encoded qubit to perform a quantum computation. Each encoded qubit can comprise a pair of physical qubits capable of being selectively coupled together. Each of the physical qubits of the pair has a respective tunable frequency. In one or more embodiments, a quantum computing system comprises at least one encoded qubit and a controller. Each encoded qubit comprises a pair of physical qubits capable of being selectively coupled together. Each physical qubit has a respective tunable frequency. The controller is configured to control a state of each of the pair of physical qubits to perform a quantum computation and to control said state via microwave-free control signals. Objects and advantages of embodiments of the disclosed subject matter will become apparent from the following description when considered in conjunction with the accompanying drawings.",
  "date_published": "20170427",
  "title": "MICROWAVE-FREE CONTROL OF A SUPERCONDUCTOR-BASED QUANTUM COMPUTER",
  "ipcr_labels": [
    "G06N9900",
    "G11C1144"
  ],
  "_processing_info": {
    "original_size": 70184,
    "optimized_size": 3256,
    "reduction_percent": 95.36
  }
}