{
  "date_produced": "20161026",
  "publication_number": "US20160328650A1-20161110",
  "main_ipcr_label": "G06N504",
  "decision": "PENDING",
  "application_number": "15212216",
  "inventor_list": [
    {
      "inventor_name_last": "Byron",
      "inventor_name_first": "Donna K.",
      "inventor_city": "Petersham",
      "inventor_state": "MA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "LaVoie",
      "inventor_name_first": "Jason D.",
      "inventor_city": "Littleton",
      "inventor_state": "MA",
      "inventor_country": "US"
    }
  ],
  "abstract": "An approach is provided for mining threaded online discussions. In the approach, performed by an information handling system, a natural language processing (NLP) analysis is performed on threaded discussions pertaining to a given topic. The analysis is performed across multiple web sites with each of the web sites including one or more threaded discussions. The analysis results in harvested discussions pertaining to the topic. The harvested discussions are correlated and a question is identified from the harvested discussions. A set of candidate answers is also identified from the harvested discussions, with one of the candidate answers being selected as the most likely answer to the identified question.",
  "filing_date": "20160716",
  "patent_number": "None",
  "summary": "<SOH> SUMMARY <EOH>An approach is provided for mining threaded online discussions. In the approach, performed by an information handling system, a natural language processing (NLP) analysis is performed on threaded discussions pertaining to a given topic. The analysis is performed across multiple web sites with each of the web sites including one or more threaded discussions. The analysis results in harvested discussions pertaining to the topic. The harvested discussions are correlated and a question is identified from the harvested discussions. A set of candidate answers is also identified from the harvested discussions, with one of the candidate answers being selected as the most likely answer to the identified question. The foregoing is a summary and thus contains, by necessity, simplifications, generalizations, and omissions of detail; consequently, those skilled in the art will appreciate that the summary is illustrative only and is not intended to be in any way limiting. Other aspects, inventive features, and advantages of the present invention, as defined solely by the claims, will become apparent in the non-limiting detailed description set forth below.",
  "date_published": "20161110",
  "title": "Mining Forums for Solutions to Questions",
  "ipcr_labels": [
    "G06N504",
    "G06F1730"
  ],
  "_processing_info": {
    "original_size": 63874,
    "optimized_size": 2580,
    "reduction_percent": 95.96
  }
}