{
  "decision": "ACCEPTED",
  "application_number": "15215182",
  "date_published": "20161110",
  "date_produced": "20161026",
  "title": "PLANAR CAVITY MEMS AND RELATED STRUCTURES, METHODS OF MANUFACTURE AND DESIGN STRUCTURES",
  "filing_date": "20160720",
  "inventor_list": [
    {
      "inventor_name_last": "Stamper",
      "inventor_name_first": "Anthony K.",
      "inventor_city": "Burlington",
      "inventor_state": "VT",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Twombly",
      "inventor_name_first": "John G.",
      "inventor_city": "Fairfax",
      "inventor_state": "VT",
      "inventor_country": "US"
    }
  ],
  "ipcr_labels": [
    "B81C100",
    "H01H5900",
    "G06F1750",
    "B81B300"
  ],
  "main_ipcr_label": "B81C100",
  "summary": "<SOH> SUMMARY <EOH>In a first aspect of the invention, a method of forming at least one Micro-Electro-Mechanical System (MEMS) comprises patterning a wiring layer to form at least one fixed plate and forming a sacrificial material on the wiring layer. The method further includes forming an insulator layer of one or more films over the at least one fixed plate and exposed portions of an underlying substrate to prevent formation of a reaction product between the wiring layer and a sacrificial material. The method further includes forming at least one MEMS beam that is moveable over the at least one fixed plate. The method further includes venting or stripping of the sacrificial material to form at least a first cavity. In another aspect of the invention, a method of forming at least one Micro-Electro-Mechanical System (MEMS) comprises patterning a wiring layer containing aluminum to form at least one fixed plate on a substrate. The method further comprises depositing a dielectric layer over the at least one fixed plate to form a tapered profile on the at least one fixed plate. The method further comprises depositing a sacrificial silicon layer on top of the dielectric layer, and over the at least one fixed plate. The dielectric layer blocks reaction, alloying, or interdiffusion of the aluminum and the sacrificial silicon layer during the depositing of the sacrificial silicon layer. The method further comprises forming at least one upper MEMS beam above the at least one fixed plate. The method further comprises venting or stripping of the sacrificial silicon layer to form at least a first cavity. In another aspect of the invention, a structure comprises a lower chamber with at least one fixed plate. The structure further comprises an insulator layer covering the at least one fixed plate. The insulator layer comprises tapered corners which are structured to prevent formation of aluminum silicide with a sacrificial material deposition. The structure further comprises at ...",
  "patent_number": "10005661",
  "abstract": "A method of forming at least one Micro-Electro-Mechanical System (MEMS) includes patterning a wiring layer to form at least one fixed plate and forming a sacrificial material on the wiring layer. The method further includes forming an insulator layer of one or more films over the at least one fixed plate and exposed portions of an underlying substrate to prevent formation of a reaction product between the wiring layer and a sacrificial material. The method further includes forming at least one MEMS beam that is moveable over the at least one fixed plate. The method further includes venting or stripping of the sacrificial material to form at least a first cavity.",
  "publication_number": "US20160325986A1-20161110",
  "_processing_info": {
    "original_size": 121553,
    "optimized_size": 3439,
    "reduction_percent": 97.17
  }
}