{
  "decision": "REJECTED",
  "application_number": "15210857",
  "date_published": "20180118",
  "date_produced": "20180103",
  "title": "FINGERPRINT IDENTIFICATION DEVICE AND MANUFACTURING METHOD THEREOF",
  "filing_date": "20160714",
  "inventor_list": [
    {
      "inventor_name_last": "Lin",
      "inventor_name_first": "Wei-Cheng",
      "inventor_city": "Zhudong Township",
      "inventor_state": "",
      "inventor_country": "TW"
    },
    {
      "inventor_name_last": "Hsiao",
      "inventor_name_first": "Chien-Jen",
      "inventor_city": "Zhudong Township",
      "inventor_state": "",
      "inventor_country": "TW"
    },
    {
      "inventor_name_last": "Tseng",
      "inventor_name_first": "Shih-Hsiu",
      "inventor_city": "Zhudong Township",
      "inventor_state": "",
      "inventor_country": "TW"
    }
  ],
  "ipcr_labels": [
    "G06K900",
    "H05K330",
    "H05K306"
  ],
  "main_ipcr_label": "G06K900",
  "summary": "<SOH> SUMMARY OF THE INVENTION <EOH>It is therefore a primary object of the present invention to provide a fingerprint identification device, which has simplified structure. It is a further object of the present invention to provide a simplified manufacturing method of a fingerprint identification device. To achieve the above and other objects, the fingerprint identification device of the present invention includes a substrate, a sensation electrode layer, a fingerprint identification sensation chip and multiple conductive layers. The substrate has a first face, a second face and multiple perforations in connection with the first and second faces. The sensation electrode layer is disposed on the first face of the substrate. The sensation electrode layer has multiple first electrodes, multiple second electrodes and an insulation layer. The first and second electrodes and the insulation layer are laminated with each other. A part of the insulation layer is disposed between the first and second electrodes and another part of the insulation layer encloses the first and second electrodes. The fingerprint identification sensation chip is disposed on the second face of the substrate. The conductive layers are partially positioned in the perforations of the substrate to extend through the perforations and partially disposed on the second face of the substrate. The first and second electrodes are electrically connected to the fingerprint identification sensation chip via the conductors. To achieve the above and other objects, the manufacturing method of the fingerprint identification device of the present invention includes steps of: providing a substrate and coating a first metal coating on one face of the substrate; etching the first metal coating by means of photolithography to form multiple first electrodes; coating an insulation layer on the first electrodes and a surface of the substrate; coating a second metal coating on one face of the insulation layer; etching the s...",
  "patent_number": "None",
  "abstract": "A fingerprint identification device and a manufacturing method of the fingerprint identification device. The fingerprint identification device includes a substrate, a sensation electrode layer and a fingerprint identification sensation chip. The substrate has a first face, a second face and multiple perforations in connection with the first and second faces. The sensation electrode layer is disposed on the first face of the substrate and has multiple first electrodes, multiple second electrodes and an insulation layer. The first and second electrodes and the insulation layer are laminated with each other. A part of the insulation layer is disposed between the first and second electrodes and another part of the insulation layer encloses the first and second electrodes. The fingerprint identification sensation chip is disposed on the second face of the substrate.",
  "publication_number": "US20180018493A1-20180118",
  "_processing_info": {
    "original_size": 22746,
    "optimized_size": 3764,
    "reduction_percent": 83.45
  }
}