{
  "decision": "PENDING",
  "application_number": "15212647",
  "date_published": "20161110",
  "date_produced": "20161026",
  "title": "VIRTUAL IMAGE DISPLAY DEVICE, HEAD-UP DISPLAY SYSTEM, AND VEHICLE",
  "filing_date": "20160718",
  "inventor_list": [
    {
      "inventor_name_last": "HAYASHI",
      "inventor_name_first": "Katsuhiko",
      "inventor_city": "Nara",
      "inventor_state": "",
      "inventor_country": "JP"
    }
  ],
  "ipcr_labels": [
    "B60R100",
    "G02B2722",
    "G06K900",
    "G02B2701",
    "B60K3500",
    "G06F301"
  ],
  "main_ipcr_label": "B60R100",
  "summary": "<SOH> SUMMARY <EOH>Fusion is realized by movement of eyeballs or a function of a visual center. Hence, the time required to realize fusion varies between individuals. Under a situation that a driver driving a vehicle needs to pay a great amount of attention, the more time required to realize fusion, the less preferable from a point of view of safety. An object of the present disclosure is to provide a virtual image display device, a head-up display system and a vehicle which improve convenience by supporting fusion. The virtual image display device according to the present disclosure includes: a display device which outputs a parallax image; an optical system which displays a virtual image based on the parallax image; an obtaining unit which obtains a change of a point of gaze of an observer; and a controller which, when obtaining from the obtaining unit a change of the point of gaze of the observer from a first point of gaze to a second point of gaze, controls the display device to generate at least one intermediate parallax image between a parallax image corresponding to the first point of gaze and a parallax image corresponding to the second point of gaze. The present disclosure can provide a virtual image display device, a head-up display system and a vehicle which improve convenience by supporting fusion.",
  "patent_number": "None",
  "abstract": "An object of the present disclosure is to provide a virtual image display device which improves convenience by supporting fusion. The virtual image display device according to the present disclosure includes: a display device which outputs a parallax image; an optical system which displays a virtual image based on the parallax image; an obtaining unit which obtains a change of a point of gaze of an observer; and a controller which, when obtaining from the obtaining unit a change of the point of gaze of the observer from a first point of gaze to a second point of gaze, controls the display device to generate at least one intermediate parallax image between a parallax image corresponding to the first point of gaze and a parallax image corresponding to the second point of gaze.",
  "publication_number": "US20160325683A1-20161110",
  "_processing_info": {
    "original_size": 33284,
    "optimized_size": 2722,
    "reduction_percent": 91.82
  }
}