{
  "decision": "PENDING",
  "application_number": "15214547",
  "date_published": "20170202",
  "date_produced": "20170119",
  "title": "ELECTRONIC DEVICE AND CONTROL METHOD THEREOF",
  "filing_date": "20160720",
  "inventor_list": [
    {
      "inventor_name_last": "KAJIYAMA",
      "inventor_name_first": "Hiroyuki",
      "inventor_city": "Kawasaki-shi",
      "inventor_state": "",
      "inventor_country": "JP"
    }
  ],
  "ipcr_labels": [
    "H04N5232",
    "G06F1730"
  ],
  "main_ipcr_label": "H04N5232",
  "summary": "<SOH> SUMMARY OF THE INVENTION <EOH>An aspect of the present invention provides an electronic device and a control method thereof that reduce the likelihood of a power saving function going into effect against a user's intentions when setting a time. According to one aspect of the present invention, there is provided an electronic device comprising: a power saving unit configured to execute a power saving function that reduces an amount of consumed power in response to a non-operating period, in which there are no operations from a user, reaching a predefined amount of time; a setting unit configured to set a time in accordance with an operation accepted when a time setting screen for setting a time is being displayed in a display unit; and a control unit configured to carry out control such that an amount of time until the power saving unit executes the power saving function is extended to be longer when the time setting screen is being displayed than when the time setting screen is not being displayed. According to another aspect of the present invention, there is provided an electronic device comprising: a power saving unit configured to execute a power saving function that reduces an amount of consumed power in response to a non-operating period, in which there are no operations from a user, reaching a predefined amount of time; a setting unit configured to set a time in accordance with an operation accepted when a time setting screen is being displayed in a display unit; and a control unit configured to carry out control such that the power saving function is not executed when the time setting screen is being displayed even in the case where the non-operating period has reached the predefined amount of time. According to another aspect of the present invention, there is provided a method of controlling an electronic device, the method comprising: executing a power saving function that reduces an amount of consumed power in response to a non-operating period, in...",
  "patent_number": "None",
  "abstract": "An electronic device has a power saving function that reduces an amount of consumed power in response to a non-operating period, in which there are no operations from a user, reaching a predefined amount of time. The electronic device displays a time setting screen for setting a time in a display unit and sets the time in accordance with an operation accepted when the time setting screen is being displayed in the display unit, and carries out control such that an amount of time until the power saving function is executed is extended to be longer when the time setting screen is being displayed than when the time setting screen is not being displayed.",
  "publication_number": "US20170034438A1-20170202",
  "_processing_info": {
    "original_size": 70653,
    "optimized_size": 3209,
    "reduction_percent": 95.46
  }
}