{
  "decision": "PENDING",
  "application_number": "15213451",
  "date_published": "20180125",
  "date_produced": "20180109",
  "title": "Employing Biometric Data for Data Storage Management",
  "filing_date": "20160719",
  "inventor_list": [
    {
      "inventor_name_last": "Liu",
      "inventor_name_first": "Su",
      "inventor_city": "Austin",
      "inventor_state": "TX",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Rozner",
      "inventor_name_first": "Eric J.",
      "inventor_city": "Austin",
      "inventor_state": "TX",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Sze",
      "inventor_name_first": "Chin Ngai",
      "inventor_city": "Austin",
      "inventor_state": "TX",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Wei",
      "inventor_name_first": "Yaoguang",
      "inventor_city": "Austin",
      "inventor_state": "TX",
      "inventor_country": "US"
    }
  ],
  "ipcr_labels": [
    "G06F1730",
    "G06F2162"
  ],
  "main_ipcr_label": "G06F1730",
  "summary": "<SOH> SUMMARY <EOH>A method, computer program product, and computer system are provided for employing biometric data for storage management. In one aspect, a computer system is provided with a processing unit operatively coupled to memory, a biosensor in communication with the processing unit, and a storage manager in communication with the processing unit and memory to allocate an electronic file in memory based on biometric data. The allocation conducted by the storage manager includes receipt of biometric data from the biosensor and association of the biometric data with the electronic file. The biometric data is stored with file metadata for the electronic file, and a biometric score is assigned to the electronic file. Allocation of the electronic file in data storage takes place in accordance with the biometric score. Storage characteristics of the electronic file are evaluated together with storage capacity of associated data storage. A storage optimization technique is selected and application for the file based on the evaluation. In another aspect, a method is provided to capture biometric data, associate the biometric data with an electronic file, and store the biometric data as file metadata for the electronic file. The biometric data is used to assign a biometric score to the electronic file, the biometric score associated with the captured biometric data. Following the assignment of the biometric score, the electronic file is allocated in data storage in accordance with the biometric score. Storage characteristics of the electronic file are evaluated together with storage capacity of associated data storage. A storage optimization technique is selected and applied to the file based on the evaluation. In yet another aspect, a computer program product is provided with a computer readable storage device having program code embodied therewith. The program code is executable by a processing unit to capture biometric data, associate the biometric data with an ...",
  "patent_number": "None",
  "abstract": "Embodiments relate to a system, method, and computer program product to allocate an electronic file in memory based on biometric data. Biometric data is captured from a biosensor and associated with an electronic file. The biometric data is stored with file metadata for the electronic file and used to assign a biometric score to the electronic file. The assigned biometric score is then used to allocate the electronic file within memory by evaluating storage characteristics of the electronic file together with storage capacity of associated data storage. In one embodiment, a storage optimization technique for the file is selected and applied based on the evaluation.",
  "publication_number": "US20180025014A1-20180125",
  "_processing_info": {
    "original_size": 69697,
    "optimized_size": 3650,
    "reduction_percent": 94.76
  }
}