{
  "decision": "PENDING",
  "application_number": "15212186",
  "date_published": "20161110",
  "date_produced": "20161026",
  "title": "DYNAMICALLY MANAGING WORKLOAD PLACEMENTS IN VIRTUALIZED ENVIRONMENTS BASED ON CURRENT USER GLOBALIZATION CUSTOMIZATION REQUESTS",
  "filing_date": "20160715",
  "inventor_list": [
    {
      "inventor_name_last": "DEIVANAYAGAM",
      "inventor_name_first": "ARUN",
      "inventor_city": "AUSTIN",
      "inventor_state": "TX",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "FANG",
      "inventor_name_first": "WU S.",
      "inventor_city": "BEIJING",
      "inventor_state": "",
      "inventor_country": "CN"
    },
    {
      "inventor_name_last": "LIU",
      "inventor_name_first": "SU",
      "inventor_city": "AUSTIN",
      "inventor_state": "TX",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "PAUL",
      "inventor_name_first": "PRIYA",
      "inventor_city": "AUSTIN",
      "inventor_state": "TX",
      "inventor_country": "US"
    }
  ],
  "ipcr_labels": [
    "G06F950",
    "G06F948"
  ],
  "main_ipcr_label": "G06F950",
  "summary": "<SOH> BRIEF SUMMARY <EOH>Different customers may require different customizations of the services provided to customers by service providers of virtualization services. Customers requesting service from virtualization service providers may use different globalization characteristics in their use of computing resources. Globalization characteristics may include, but are not limited to, language, cultural conventions and code set selections by customers. A customer may request that virtualization service providers provide service customized for the globalization characteristics used by that customer, however, the customization of application service for the globalization characteristics may be handled by the virtualization service and transparent to the user. Therefore, there is a need for a method, system, and computer program product for dynamically managing workload placements in virtualized environments based on current user globalization customization requests. In one embodiment, a method for dynamically managing workload placements in virtualized environments comprises receiving, by at least one computer system, multiple workloads from multiple users requesting access to at least one virtualized application, each of the workloads is specified with one or more separate globalization characteristics from among multiple globalization characteristics. The method comprises selectively categorizing, by the at least one computer system, each of the workloads separately for placement in one or more particular virtualized environments from among multiple virtualized environments based on the one or more separate globalization characteristics of each of the workloads, each virtualized environment comprising the at least one virtualized application configured for a separate selection of globalization services from among multiple globalization services for handling a separate selection of the one or more separate globalization characteristics. In another embodiment, a syste...",
  "patent_number": "None",
  "abstract": "Multiple workloads from multiple users requesting access to at least one virtualized application are received, wherein each of the workloads is specified with one or more separate globalization characteristics from among multiple globalization characteristics. To dynamically manage workload placement, each of the workloads is dynamically categorized separately for placement in one or more particular virtualized environments from among multiple virtualized environments based on the one or more separate globalization characteristics of each of the workloads, wherein each virtualized environment comprises the at least one virtualized application configured for a separate selection of globalization services from among multiple globalization services for handling a separate selection of the one or more separate globalization characteristics.",
  "publication_number": "US20160328274A1-20161110",
  "_processing_info": {
    "original_size": 130466,
    "optimized_size": 3894,
    "reduction_percent": 97.02
  }
}