{
  "date_produced": "20170517",
  "publication_number": "US20170154276A1-20170601",
  "main_ipcr_label": "G06N700",
  "decision": "PENDING",
  "application_number": "15214062",
  "inventor_list": [
    {
      "inventor_name_last": "SRIVASTAVA",
      "inventor_name_first": "Rajiv Radheyshyam",
      "inventor_city": "Pune",
      "inventor_state": "",
      "inventor_country": "IN"
    },
    {
      "inventor_name_last": "PALSHIKAR",
      "inventor_name_first": "Girish Keshav",
      "inventor_city": "Pune",
      "inventor_state": "",
      "inventor_country": "IN"
    },
    {
      "inventor_name_last": "PAWAR",
      "inventor_name_first": "Sachin",
      "inventor_city": "Pune",
      "inventor_state": "",
      "inventor_country": "IN"
    }
  ],
  "abstract": "Event prediction system and method includes gathering data corresponding to multiple entities to derive multiple entity profiles. Next, a first subset of entity profiles is identified from the multiple entity profiles generated. The identification is done on the basis of characteristics associated with the entities. Subsequent to identification of the first subset of the entity profiles, a second subset of entity profiles is shortlisted. Here, the second subset of entity profiles shows highest probability of occurrence of the event. Further, a determination of a factor that may lead to occurrence of the event is done.",
  "filing_date": "20160719",
  "patent_number": "None",
  "summary": "<SOH> BRIEF DESCRIPTION OF THE DRAWINGS <EOH>The detailed description is described with reference to the accompanying figure(s). In the figure(s), the left-most digit(s) of a reference number identifies the figure in which the reference number first appears. The same numbers are used throughout the figure(s) to reference like features and components. Some implementations of systems and/or methods in accordance with implementations of the present subject matter are now described, by way of example, and with reference to the accompanying figure(s), in which: FIG. 1 illustrates a network environment implementing an event prediction system, according to an implementation of the present subject matter. FIG. 2 illustrates a method for determining factors contributing to occurrence of an event, according to an implementation of the present subject matter. detailed-description description=\"Detailed Description\" end=\"lead\"?",
  "date_published": "20170601",
  "title": "EVENT PREDICTION SYSTEM AND METHOD",
  "ipcr_labels": [
    "G06N700",
    "G06N9900"
  ],
  "_processing_info": {
    "original_size": 44853,
    "optimized_size": 2386,
    "reduction_percent": 94.68
  }
}