{
  "decision": "PENDING",
  "application_number": "15217853",
  "date_published": "20180125",
  "date_produced": "20180109",
  "title": "TESTING PAIRINGS TO DETERMINE WHETHER THEY ARE PUBLICALLY KNOWN",
  "filing_date": "20160722",
  "inventor_list": [
    {
      "inventor_name_last": "Jonas",
      "inventor_name_first": "Jeffrey J.",
      "inventor_city": "Las Vegas",
      "inventor_state": "NV",
      "inventor_country": "US"
    }
  ],
  "ipcr_labels": [
    "G06F1730"
  ],
  "main_ipcr_label": "G06F1730",
  "summary": "<SOH> SUMMARY <EOH>Provided is a method for testing pairings to determine whether certain data are publically known. The method comprises: determining whether a pairing from a record is publicly known by searching public data stores, marking the pairing with an outcome of the determining and performing an operation on the pairing based on the outcome. Provided is a computer program product for testing pairings to determine whether certain data are publically known. The computer program product comprises a computer readable storage medium having program code embodied therewith, the program code executable by at least one processor to perform: determining whether a pairing from a record is publicly known by searching public data stores, marking the pairing with an outcome of the determining and performing an operation on the pairing based on the outcome. Provided is a computer system for testing pairings to determine whether certain data are publically known. The computer system comprises one or more processors, one or more computer-readable memories and one or more computer-readable, tangible storage devices and program instructions, stored on at least one of the one or more computer-readable, tangible storage devices for execution by at least one of the one or more processors via at least one of the one or more memories, to perform: determining whether a pairing from a record is publicly known by searching public data stores, marking the pairing with an outcome of the determining and performing an operation on the pairing based on the outcome.",
  "patent_number": "None",
  "abstract": "Provided are techniques for testing pairings to determine whether they are publically known. It is determined whether a pairing from a record is publicly known by searching public data stores. The pairing is marked with an outcome of the determining. An operation is performed on the pairing based on the outcome.",
  "publication_number": "US20180025080A1-20180125",
  "_processing_info": {
    "original_size": 45926,
    "optimized_size": 2436,
    "reduction_percent": 94.7
  }
}