{
  "date_produced": "20180103",
  "publication_number": "US20180018578A1-20180118",
  "main_ipcr_label": "G06N9900",
  "decision": "PENDING",
  "application_number": "15210280",
  "inventor_list": [
    {
      "inventor_name_last": "Yoshizumi",
      "inventor_name_first": "Takayuki",
      "inventor_city": "Tokyo",
      "inventor_state": "",
      "inventor_country": "JP"
    }
  ],
  "abstract": "Provided is an apparatus, method, and computer-readable storage medium for acquiring learning data that includes an evaluation of evaluation targets; generating a constraint condition to be satisfied by a value of an evaluation function that includes a weighting for each of a plurality of evaluation criteria of the evaluation target and an unknown term for each evaluation target corresponding to an unknown evaluation criterion that is not among the plurality of evaluation criteria, based on the learning data; determining a value of the unknown term and the weighting for each evaluation criterion in the evaluation function in a manner that satisfies the constraint condition; extracting a set of evaluation targets for which an evaluation of each evaluation criterion is opposite of an evaluation based on the unknown term, from among the plurality of evaluation targets; and outputting the extracted set of evaluation targets.",
  "filing_date": "20160714",
  "patent_number": "None",
  "summary": "<SOH> SUMMARY <EOH>Therefore, it is an object of an aspect of the innovations herein to provide an apparatus for assisting with the design of objective functions, which is capable of overcoming the above drawbacks accompanying the related art. The above and other objects can be achieved by combinations described in the claims. According to a first aspect of the present invention, provided is an apparatus comprising a processor and one or more computer readable mediums collectively including instructions that, when executed by the processor, cause the processor to: acquire learning data that includes an evaluation of evaluation targets; generate a constraint condition to be satisfied by a value of an evaluation function that includes a weighting for each of a plurality of evaluation criteria of the evaluation target and an unknown term for each evaluation target corresponding to an unknown evaluation criterion that is not among the plurality of evaluation criteria, based on the learning data; determine a value of the unknown term and the weighting for each evaluation criterion in the evaluation function in a manner that satisfies the constraint condition; extract a set of evaluation targets for which an evaluation of each evaluation criterion is opposite of an evaluation based on the unknown term, from among the plurality of evaluation targets; and output the extracted set of evaluation targets. Also provided is a method and computer-readable storage medium. The summary clause does not necessarily describe all necessary features of the embodiments of the present invention. The present invention may also be a sub-combination of the features described above.",
  "date_published": "20180118",
  "title": "APPARATUS ASSISTING WITH DESIGN OF OBJECTIVE FUNCTIONS",
  "ipcr_labels": [
    "G06N9900",
    "G06N504"
  ],
  "_processing_info": {
    "original_size": 113392,
    "optimized_size": 3169,
    "reduction_percent": 97.21
  }
}