{
  "decision": "ACCEPTED",
  "application_number": "15217107",
  "date_published": "20161110",
  "date_produced": "20161026",
  "title": "SPEED TYPING APPARATUS",
  "filing_date": "20160722",
  "inventor_list": [
    {
      "inventor_name_last": "BLUMBERG",
      "inventor_name_first": "Marvin",
      "inventor_city": "Bethesda",
      "inventor_state": "MD",
      "inventor_country": "US"
    }
  ],
  "ipcr_labels": [
    "G06F302",
    "G06F3023"
  ],
  "main_ipcr_label": "G06F302",
  "summary": "<SOH> SUMMARY OF THE INVENTION <EOH>By the present invention, a keyboard is provided having 26 letters assigned to only 16 to 21 keys, and preferably 21 keys. This advantageous system of typing makes use of either one or two hands. The 26 letters of the English alphabet are all displayed. In one example, five keys have two letters—those letters are PQ, JK, UW, VX and YZ for a total of ten letters. In the one example, sixteen keys have one letter assigned to each key—namely the letters A, B, C, D, E, F, G, H, I, L, M, O, N, R, S and T for a total of sixteen letters assigned to a specific key in a 21 key keyboard—for a total of 26 letters. Preferably, in at least one embodiment, the letters M and O are assigned to one key. A total of five groups of letters are assigned with two letters per key for a total of ten letters. The preferred keyboards have a “core grouping” of nine letters, which usually have only one letter per key. The letters in the core grouping are in alphabetical order, within each group, although the specific arrangement of the three letters in each group may not be consecutive. The core grouping, with each of three sets of three groups of alphabetical letters, abut an adjacent group of keys on at least one side which are also assigned letters which are in alphabetical order. For example, a core grouping consisting of nine letters may be A, B, C, D, E, F, G, H and I which are assigned to nine keys (one letter per key) within three groups of keys. The surrounding keys of additional groups are in adjacent columns and/or rows. The letters R, S and T are located immediately adjacent to the core grouping. This arrangement assists the user to recall the location and the letters within the core grouping and the letters and keys surrounding the core grouping. Six of the double lettered keys may be JK, MO, PQ, UW, VX, YZ (for example, a total of twelve letters). The remaining 14 letters are each assigned to a single key for a twenty key keyboard. This alphabet...",
  "patent_number": "9703391",
  "abstract": "A keyboard is provided having 26 letters assigned to only 16 to 21 keys, and preferably 21 keys. This advantageous system of typing makes use of either one or two hands. The 26 letters of the English alphabet are all displayed. Five keys have two letters—those letters are PQ, JK, UW, VX and YZ for a total of ten letters. Sixteen keys have one letter assigned to each key—namely the letters A, B, C, D, E, F, G, H, I, L, M, O, N, R, S and T for a total of sixteen letters assigned to a specific key—for a total of 26 letters.",
  "publication_number": "US20160328025A1-20161110",
  "_processing_info": {
    "original_size": 42559,
    "optimized_size": 3094,
    "reduction_percent": 92.73
  }
}