{
  "date_produced": "20161019",
  "publication_number": "US20160321536A1-20161103",
  "main_ipcr_label": "G06N300",
  "decision": "ACCEPTED",
  "application_number": "15210684",
  "inventor_list": [
    {
      "inventor_name_last": "PONOMAREV",
      "inventor_name_first": "Dmitrii Maximovich",
      "inventor_city": "Nizhny Novgorod",
      "inventor_state": "",
      "inventor_country": "RU"
    },
    {
      "inventor_name_last": "MIKHAYLOV",
      "inventor_name_first": "Nikolay Nikolaevich",
      "inventor_city": "Vyazniky",
      "inventor_state": "",
      "inventor_country": "RU"
    }
  ],
  "abstract": "A method for providing interaction over a communication network between a user and network entities are described. The method includes at the interface apparatus end, adjusting the interface apparatus to operating conditions of the communication network, including network availability, and reconfiguring and controlling functionality of the network entities for adjusting operation of the network entities to predetermined requirements imposed on the external entities for cooperation with the interface apparatus. The method further includes receiving verbal and visual user input information and user state information related to a state of the user from the user; processing the obtained input information and forwarding the corresponding processed signal to one or more network entities. The method also includes receiving coded information output signals from one or more network entities, and processing thereof to obtain user information output signals in a format suitable for outputting to ...",
  "filing_date": "20160714",
  "patent_number": "9691018",
  "summary": "<SOH> SUMMARY OF THE INVENTION <EOH>There is a need in the art to provide a smart toy apparatus equipped with a wireless communication platform that can operate as an interface for interaction between a user (e.g., a child) and the surrounding external world including various entities that are systems configured for providing various network communication services accessible in cyber-space. It would be beneficial to have an interface apparatus implemented in the form of a smart toy that can provide the possibility of enhanced interactive communication with children that may play and use such toys for communication with various entities over a communication network. In particular, such smart toys having an embedded wireless communication platform together with an intelligent communication system may be used for interaction with network entities in order to respond to requests from the users, measure vital signs of the users, control physiological and emotional states of the users and provide requested information targeted from different network entities to the user. It would also be advantageous to have a smart toy interface apparatus that can have the capabilities to interact with children, and also provide interactive communication between the children and the network entities for teaching various subjects. Thus, children will be able to receive new, useful knowledge through interaction with such a device. These features can significantly increase the value of toys for children, for example, through more interesting, exciting and useful learning and gameplay. It would be helpful to have the possibility of automatic reconfiguration and control of functionality of the interface apparatus in order to automatically adjust the interface apparatus to changes in operating conditions of the communication network. It would also be beneficial to have the possibility of automatic reconfiguration and control of functionality of the network entities in order to adjust their ope...",
  "date_published": "20161103",
  "title": "INTERFACE APPARATUS AND METHOD FOR PROVIDING INTERACTION OF A USER WITH NETWORK ENTITIES",
  "ipcr_labels": [
    "G06N300",
    "H04W400",
    "A63H336",
    "H04L2908",
    "G06N504",
    "A63H328",
    "H04J1100",
    "H04W402"
  ],
  "_processing_info": {
    "original_size": 219342,
    "optimized_size": 3842,
    "reduction_percent": 98.25
  }
}