{
  "decision": "PENDING",
  "application_number": "15217783",
  "date_published": "20180125",
  "date_produced": "20180109",
  "title": "TRIAGE OF INITIAL SCHEDULE SETUP FOR AN HVAC CONTROLLER",
  "filing_date": "20160722",
  "inventor_list": [
    {
      "inventor_name_last": "Quam",
      "inventor_name_first": "David",
      "inventor_city": "Golden Valley",
      "inventor_state": "MN",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Slate",
      "inventor_name_first": "Sara",
      "inventor_city": "Austin",
      "inventor_state": "TX",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Booth",
      "inventor_name_first": "Ted",
      "inventor_city": "Morris Plains",
      "inventor_state": "NJ",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Roberts",
      "inventor_name_first": "Shannon",
      "inventor_city": "Austin",
      "inventor_state": "TX",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Tiefenauer",
      "inventor_name_first": "Jason",
      "inventor_city": "Round Rock",
      "inventor_state": "TX",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Tran",
      "inventor_name_first": "Dan",
      "inventor_city": "Morris Plains",
      "inventor_state": "NJ",
      "inventor_country": "US"
    }
  ],
  "ipcr_labels": [
    "F24F1100",
    "G06F30482",
    "H04L1228",
    "G06F30484",
    "G05B19409",
    "G05B1502"
  ],
  "main_ipcr_label": "F24F1100",
  "summary": "<SOH> SUMMARY <EOH>The disclosure is directed to methods and systems for setting up HVAC controllers for a particular installation site. In one example, an HVAC controller may be configured to control at least part of an HVAC system in accordance with any one of several different scheduling options, including but not limited to location-based scheduling options (e.g. geo-fencing), time-based scheduling options, and no schedule. In some cases, a user may be guided through several different scheduling options in a methodical, easy to understand sequence of information displays. In a particular example of the disclosure, a non-transitory, computer-readable medium may contain program instructions for facilitating a user in setting up schedule settings of an HVAC controller. In some cases, execution of the program instructions by one or more processors causes a plurality of screens to be displayed on a user interface, the plurality of screens permitting a user to select one of several scheduling setup procedures, each of the several scheduling setup procedures being selectable for use via a different one of the plurality of screens. The plurality of screens may include a first screen that has an acceptance button that when selected by the user selects a first scheduling setup procedure as well as a navigation element that the user can use to move to a second screen of the plurality of screens that permit a user to select one of several scheduling setup procedures. In some cases, and if the user selects the acceptance button on the first screen, one or more subsequent screens may be displayed on the user interface that allow the user to make setting selections in accordance with the first scheduling setup procedure. In some cases, and if the user selects the navigation element on the first screen, the second screen of the plurality of screens is displayed in the user interface. The second screen may include an acceptance button that when selected by the user selects a sec...",
  "patent_number": "None",
  "abstract": "An HVAC controller may be configured to control at least part of an HVAC system in accordance with any one of several different scheduling options, such as a location-based scheduling option and time-based scheduling option. In some cases, a user may be guided through several different scheduling options in a methodical, easy to understand sequence of information displays.",
  "publication_number": "US20180023827A1-20180125",
  "_processing_info": {
    "original_size": 77693,
    "optimized_size": 3716,
    "reduction_percent": 95.22
  }
}