{
  "decision": "ACCEPTED",
  "application_number": "15211495",
  "date_published": "20161103",
  "date_produced": "20161019",
  "title": "COMPUTER-IMPLEMENTED SYSTEM AND METHOD FOR CLEARING A DERIVATIVE TRADE INVOLVING MULTIPLE TRADING EXCHANGES",
  "filing_date": "20160715",
  "inventor_list": [
    {
      "inventor_name_last": "KRONWALL",
      "inventor_name_first": "Mattias",
      "inventor_city": "Jarfalla",
      "inventor_state": "",
      "inventor_country": "SE"
    },
    {
      "inventor_name_last": "STÅHL",
      "inventor_name_first": "Cecilia",
      "inventor_city": "Stavsnas",
      "inventor_state": "",
      "inventor_country": "SE"
    },
    {
      "inventor_name_last": "JOSEFSSON",
      "inventor_name_first": "Magnus",
      "inventor_city": "Taby",
      "inventor_state": "",
      "inventor_country": "SE"
    }
  ],
  "ipcr_labels": [
    "G06Q4004"
  ],
  "main_ipcr_label": "G06Q4004",
  "summary": "<SOH> SUMMARY <EOH>A derivative trade order at a home marketplace is routed to an away market place having a better price for a counter position to the order where it is executed. The executed order triggers creation of a “balance derivative trade” at the home marketplace to balance at a home clearing house the away trade. The home clearing house uses the balance derivative trade to create derivative positions of the balance derivative trade and informs a balancing clearing entity which manages the balance derivative trade obligations. The balance derivative trade order account permits netting and reduced margin benefits for the trading participant. A dual derivative exercise operation allows balance derivative positions to be performed in one day to reduce overnight risk for the clearing entity. A first aspect of the technology relates to a computer-implemented method for A second aspect of the technology relates to a computer server for.",
  "patent_number": "9928551",
  "abstract": "A derivative trade order at a home marketplace is routed to an away market place having a better price for a counter position to the order where it is executed. The executed order triggers creation of a “balance derivative trade” at the home marketplace to balance at a home clearing house the away trade. The home clearing house uses the balance derivative trade to create derivative positions of the balance derivative trade and informs a balancing clearing entity which manages the balance derivative trade obligations. The balance derivative trade order account permits netting and reduced margin benefits for the trading participant. A dual derivative exercise operation allows balance derivative positions to be performed in one day to reduce overnight risk for the clearing entity.",
  "publication_number": "US20160321755A1-20161103",
  "_processing_info": {
    "original_size": 62856,
    "optimized_size": 2652,
    "reduction_percent": 95.78
  }
}