{
  "decision": "PENDING",
  "application_number": "15211712",
  "date_published": "20170810",
  "date_produced": "20170726",
  "title": "SYSTEM AND METHOD FOR PROVIDING TRANSPORTATION SERVICES",
  "filing_date": "20160715",
  "inventor_list": [
    {
      "inventor_name_last": "MPHELA",
      "inventor_name_first": "Lucky",
      "inventor_city": "Johannesburg",
      "inventor_state": "",
      "inventor_country": "ZA"
    }
  ],
  "ipcr_labels": [
    "G06Q5014",
    "G06Q1002",
    "G06F314"
  ],
  "main_ipcr_label": "G06Q5014",
  "summary": "<SOH> SUMMARY <EOH>In broad terms, and in accordance with a first aspect of this invention there is provided a system for providing transportation services to a traveler arriving at a transportation hub, the system comprising a plurality of uprights, each upright having a display means connected thereto, the plurality of uprights arranged in discrete rows, the length of the uprights being selected so as to prevent obstruction of any one of the display means, each display means being connected to a computer which causes at least a first name of a first traveler to be displayed on one of the plurality of display means, such that in use, the first traveler identifies a display means displaying his/her name and positions himself/herself at the display means bearing his/her name to be met by a representative of a transportation service provider. It is to be understood that typically the computer causes second and subsequent names of second and subsequent travelers to be displayed on at least one of the plurality of display means. Typically, each of the first, second and subsequent names are independently displayed on separate display means forming part of the plurality of display means. In a certain embodiment of the invention it is envisioned that a single display means may display more than one name. Typically, the uprights in each different row are of a particular length, such that in use, a front row includes uprights of a lowest length and a back row includes uprights of a greatest length allowing the display means in each of the rows to be un-obscured for visual recognition by the traveler. It is to be understood that the uprights comprising the discrete rows may be of various lengths and arranged to prevent obstruction of any one of the display means in use. The uprights may comprise hydraulic adjustment means in use to adjust the length of the upright. The rows may form straight lines, or the rows may be curved. It is to be understood that alone, or in combinatio...",
  "patent_number": "None",
  "abstract": "A system and method for providing transportation services to a traveler arriving at a transportation hub are provided, the system comprising a plurality of uprights, each upright having a display, with the plurality of uprights arranged in discrete rows. The length of the uprights are selected to prevent obstruction of any one of the displays, and each display is connected to a computer which causes at least a first name of a first traveler to be displayed on the corresponding display. In use, the first traveler identifies a display displaying his/her name and positions himself/herself at the display bearing his/her name to be met by a representative of a transportation service provider.",
  "publication_number": "US20170228836A1-20170810",
  "_processing_info": {
    "original_size": 52435,
    "optimized_size": 3265,
    "reduction_percent": 93.77
  }
}