{
  "decision": "ACCEPTED",
  "application_number": "15219908",
  "date_published": "20161117",
  "date_produced": "20161102",
  "title": "STATIC SECURITY ANALYSIS USING A HYBRID REPRESENTATION OF STRING VALUES",
  "filing_date": "20160726",
  "inventor_list": [
    {
      "inventor_name_last": "Guarnieri",
      "inventor_name_first": "Salvatore A.",
      "inventor_city": "New York",
      "inventor_state": "NY",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Pistoia",
      "inventor_name_first": "Marco",
      "inventor_city": "Amawalk",
      "inventor_state": "NY",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Tripp",
      "inventor_name_first": "Omer",
      "inventor_city": "Har-Adar",
      "inventor_state": "",
      "inventor_country": "IL"
    }
  ],
  "ipcr_labels": [
    "G06F2155",
    "G06F1722",
    "G06F1721"
  ],
  "main_ipcr_label": "G06F2155",
  "summary": "<SOH> SUMMARY <EOH>A method for creating a hybrid string representation includes determining string components from input string information that may be represented concretely by comparing the one or more components to a set of known concretizations using a processor. The set of known concretizations includes string configurations that cannot be interfered with by an attacker. All string components that could not be represented concretely are abstracted. A hybrid string representation is created that includes at least one concrete string component and at least one abstracted string component. These and other features and advantages will become apparent from the following detailed description of illustrative embodiments thereof, which is to be read in connection with the accompanying drawings.",
  "patent_number": "9940464",
  "abstract": "Methods for creating a hybrid string representation include determining string components from input string information that may be represented concretely by comparing the one or more components to a set of known concretizations using a processor. The set of known concretizations includes string configurations that cannot be interfered with by an attacker. All string components that could not be represented concretely are abstracted. A hybrid string representation is created that includes at least one concrete string component and at least one abstracted string component.",
  "publication_number": "US20160335434A1-20161117",
  "_processing_info": {
    "original_size": 27426,
    "optimized_size": 2262,
    "reduction_percent": 91.75
  }
}