{
  "date_produced": "20180103",
  "publication_number": "US20180018568A1-20180118",
  "main_ipcr_label": "G06N502",
  "decision": "PENDING",
  "application_number": "15212893",
  "inventor_list": [
    {
      "inventor_name_last": "Katsuki",
      "inventor_name_first": "Takayuki",
      "inventor_city": "Tokyo",
      "inventor_state": "",
      "inventor_country": "JP"
    },
    {
      "inventor_name_last": "Morimura",
      "inventor_name_first": "Tetsuro",
      "inventor_city": "Tokyo",
      "inventor_state": "",
      "inventor_country": "JP"
    }
  ],
  "abstract": "An assistance strategy may be generated with a generating apparatus including a processor, and one or more computer readable mediums collectively including instructions that, when executed by the processor, cause the processor to create a reward estimation model for estimating a reward for assisting at least one subject by analyzing a history of input by the subject, create a decision making model including a plurality of forms of assistance and estimated rewards for each form of assistance based on the reward estimation model and the history of input by the subject, and generate an assistance strategy based on the decision making model.",
  "filing_date": "20160718",
  "patent_number": "None",
  "summary": "<SOH> SUMMARY <EOH>According to a first aspect of the present invention, provided is a generating apparatus including a processor, and one or more computer readable mediums collectively including instructions that, when executed by the processor, cause the processor to create a reward estimation model for estimating a reward for assisting at least one subject by analyzing a history of input by the subject, create a decision making model including a plurality of forms of assistance and estimated rewards for each form of assistance based on the reward estimation model and the history of input by the subject, and generate an assistance strategy based on the decision making model. The first aspect may also include the method performed by the apparatus, and a program for implementing the method. According to a second aspect of the present invention, provided is a device including a processor, an interface in communication with the processor, and one or more computer readable mediums collectively including instructions that, when executed by the processor, cause the processor to receive a reward estimation model created for estimating a reward for assisting at least one person by analyzing a history of input by the person, receive an assistance strategy generated based on a decision making model, the decision making model created based on the reward estimation model and the history of input by the person, the decision making model including a plurality of states, state transitions caused by assistances, and rewards for assistances, estimate a reward for assisting a target person who operates the device, select an assistance to be presented to the target person based on the assistance strategy, and present the selected assistance through the interface. The summary clause does not necessarily describe all necessary features of the embodiments of the present invention. The present invention may also be a sub-combination of the features described above.",
  "date_published": "20180118",
  "title": "ASSISTANCE GENERATION",
  "ipcr_labels": [
    "G06N502",
    "G06N9900"
  ],
  "_processing_info": {
    "original_size": 76958,
    "optimized_size": 3282,
    "reduction_percent": 95.74
  }
}