{
  "date_produced": "20180109",
  "publication_number": "US20180025276A1-20180125",
  "main_ipcr_label": "G06N502",
  "decision": "PENDING",
  "application_number": "15214622",
  "inventor_list": [
    {
      "inventor_name_last": "Hill",
      "inventor_name_first": "Thomas",
      "inventor_city": "Tulsa",
      "inventor_state": "OK",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Butler",
      "inventor_name_first": "George R.",
      "inventor_city": "Tulsa",
      "inventor_state": "OK",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Rastunkov",
      "inventor_name_first": "Vladimir S.",
      "inventor_city": "Tulsa",
      "inventor_state": "OK",
      "inventor_country": "US"
    }
  ],
  "abstract": "A system, method, and computer-readable medium for performing an analytics workflow generation operation. The analytics workflow generation operation enables generation of targeted analytics workflows (e.g., via a data scientist (i.e., an expert in data modeling)) that are then published to a workflow storage repository so that the targeted analytics workflows can be used by domain experts and self-service business end-users to solve specific classes of analytics operations.",
  "filing_date": "20160720",
  "patent_number": "None",
  "summary": "<SOH> SUMMARY OF THE INVENTION <EOH>A system, method, and computer-readable medium are disclosed for performing an analytics workflow generation operation. The analytics workflow generation operation enables generation of targeted analytics workflows (e.g., created by a data scientist (i.e., an expert in data modeling)) that are then published to a workflow storage repository so that the targeted analytics workflows can be used by domain experts and self-service business end-users to solve specific classes of analytics operations. More specifically, in certain embodiments, an analytics workflow generation system provides a user interface for data modelers and data scientists to generate parameterized analytic templates. In certain embodiments, the parameterized analytic templates include one or more of data preparation, data modeling, model evaluation, and model deployment steps specifically optimized for a particular domain and data sets of interest. In certain embodiments, the user interface to create analytic workflows is flexible to permit data scientists to select data management and analytical tools from a comprehensive palette, to parameterize analytic workflows, to provide the self-service business users the necessary flexibility to address the particular challenges and goals of their analyses, without having to understand the details and theoretical justifications for a specific sequence of specific data preparation and modeling tasks. In certain embodiments, the analytics workflow generation system provides self-service analytic user interfaces (such as web-based user interfaces) so that self-service users can choose the analytic workflow templates to solve their specific analytic problems. In certain embodiments, when providing the self-service analytic user interfaces, the system analytics workflow generation accommodates role-based authentication so that particular groups of self-service users have access to the relevant templates to solve the analytic ...",
  "date_published": "20180125",
  "title": "System for Managing Effective Self-Service Analytic Workflows",
  "ipcr_labels": [
    "G06N502",
    "G06F30482",
    "G06F30481",
    "G06F30484"
  ],
  "_processing_info": {
    "original_size": 56680,
    "optimized_size": 3359,
    "reduction_percent": 94.07
  }
}