{
  "date_produced": "20170110",
  "publication_number": "US20170024655A1-20170126",
  "main_ipcr_label": "G06N700",
  "decision": "PENDING",
  "application_number": "15216412",
  "inventor_list": [
    {
      "inventor_name_last": "Stowell",
      "inventor_name_first": "Daniel E.",
      "inventor_city": "Cambridge",
      "inventor_state": "MA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Mershon",
      "inventor_name_first": "Stuart",
      "inventor_city": "Waltham",
      "inventor_state": "MA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "McDonald",
      "inventor_name_first": "Glenn P.",
      "inventor_city": "Cambridge",
      "inventor_state": "MA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Jacobson",
      "inventor_name_first": "Kurt",
      "inventor_city": "Stoneham",
      "inventor_state": "MA",
      "inventor_country": "US"
    }
  ],
  "abstract": "Methods, systems and computer program products for using a selected cohort of content consumers to rate a media object is provided by identifying a media object, determining a first value, where the first value is equal to a number of content consumers who belong to a cohort and who have played the media object, determining a second value. The second value is equal to a total number of content consumers who played the media object. A rating is computed using the first value and the second value.",
  "filing_date": "20160721",
  "patent_number": "None",
  "summary": "<SOH> SUMMARY <EOH>It is in view of the above considerations and others that the various embodiments of the present disclosure have been made. The embodiments described herein solve technical challenges to provide other unique and useful functions related to measuring potential breakout success that are significant. The appended independent claims also address technical challenges to provide other unique and useful functions related to measuring potential breakout success that are significant, and the appended dependent claims define advantageous embodiments. As will be appreciated, the example embodiments described herein address the foregoing difficulty by providing methods, systems and computer program products that go beyond human prediction methods to calculate a measurement of potential breakout success for an entire catalog using editorial content across the web and media streaming data. According to one embodiment of the invention, an automated system scrapes web content and transforms unstructured data on the worldwide web into structured data or clusters. The system identifies web pages that include the name of an artist or media item and clusters these web pages into one or more headlines. The system then counts the number of headlines for the artist or media item that occurred during a first time period and counts the number of content consumers who played the artist or media item during the first time period and during a second time period. The system calculates a breakout value for the artist or media item using the number of headlines over the first time period, the number of content consumers during the first time period and the number of content consumers during the second time period. In one embodiment, breakout content is predicted by scraping a network for pages that include a name of an entity, clustering the pages into one or more headline clusters, counting a number of the headline clusters over a first time period, counting a number of conten...",
  "date_published": "20170126",
  "title": "AUTOMATIC ARTIST AND CONTENT BREAKOUT PREDICTION",
  "ipcr_labels": [
    "G06N700",
    "H04L2906",
    "G06F1730",
    "H04L2908"
  ],
  "_processing_info": {
    "original_size": 60185,
    "optimized_size": 3520,
    "reduction_percent": 94.15
  }
}