{
  "decision": "PENDING",
  "application_number": "15214793",
  "date_published": "20180125",
  "date_produced": "20180109",
  "title": "PROVIDING PERPETUAL MEDIA GEO-SYNCHRONIZATION",
  "filing_date": "20160720",
  "inventor_list": [
    {
      "inventor_name_last": "Cruz Huertas",
      "inventor_name_first": "Luis C.",
      "inventor_city": "San Pedro",
      "inventor_state": "",
      "inventor_country": "CR"
    },
    {
      "inventor_name_last": "Hamilton, II",
      "inventor_name_first": "Rick A.",
      "inventor_city": "Charlottesville",
      "inventor_state": "VA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Mullen",
      "inventor_name_first": "Shawn P.",
      "inventor_city": "Buda",
      "inventor_state": "TX",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Zamora Duran",
      "inventor_name_first": "Edgar A.",
      "inventor_city": "Heredia",
      "inventor_state": "",
      "inventor_country": "CR"
    }
  ],
  "ipcr_labels": [
    "G06F1730",
    "G06F316",
    "H04R108",
    "H04R2900"
  ],
  "main_ipcr_label": "G06F1730",
  "summary": "<SOH> SUMMARY <EOH>Embodiments of the present invention disclose a method, computer program product, and system for identifying an identifiable media in response to an activation event in a surrounding environment. A processor may sample a surrounding environment for an identifiable media in response to an activation event. The processor may determine, based on the sampling, whether an identifiable media was detected. The processor may generate reference indicators from environmental. The processor may tag the identifiable media with one or more reference indicators associated with the environmental conditions. The processor may transmit a segment of the identifiable media to a media identification application. The processor may receive information about the identifiable media. In some embodiments of the present invention, a system may receive one or more reference indicators for an identifiable media and a segment of the identifiable media from a device. The system may identify the identifiable media with a media identification application. The media identification application may produce a name indicator for the identifiable media. The system may store the one or more reference indicators associated with the identifiable media and the name indicator in a database table. The above summary is not intended to describe each illustrated embodiment or every implementation of the present disclosure.",
  "patent_number": "None",
  "abstract": "A processor may sample a surrounding environment for an identifiable media in response to an activation event. The processor may determine, based on the sampling, whether an identifiable media was detected. The processor may generate reference indicators from environmental conditions. The processor may tag the identifiable media with one or more reference indicators associated with the environmental conditions. The processor may transmit a segment of the identifiable media to a media identification application. The processor may receive information about the identifiable media.",
  "publication_number": "US20180025077A1-20180125",
  "_processing_info": {
    "original_size": 89698,
    "optimized_size": 3028,
    "reduction_percent": 96.62
  }
}