{
  "decision": "PENDING",
  "application_number": "15215028",
  "date_published": "20170720",
  "date_produced": "20170705",
  "title": "ARC KEYBOARD LAYOUT",
  "filing_date": "20160720",
  "inventor_list": [
    {
      "inventor_name_last": "Paek",
      "inventor_name_first": "Timothy S.",
      "inventor_city": "Sammamish",
      "inventor_state": "WA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Rudchenko",
      "inventor_name_first": "Dmitry",
      "inventor_city": "Redmond",
      "inventor_state": "WA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Oligschlaeger",
      "inventor_name_first": "Zach",
      "inventor_city": "Redmond",
      "inventor_state": "WA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Gunawardana",
      "inventor_name_first": "Asela J.",
      "inventor_city": "Seattle",
      "inventor_state": "WA",
      "inventor_country": "US"
    }
  ],
  "ipcr_labels": [
    "G06F30488",
    "G06F30485",
    "G06F30481",
    "G06F30484"
  ],
  "main_ipcr_label": "G06F30488",
  "summary": "<SOH> SUMMARY <EOH>Described herein are techniques and processes for providing an arc layout for a soft input panel. In some examples, an electronic device can transition from providing a substantially straight and/or horizontal layout for a soft input panel to an arc layout for the soft input panel. For instance, the electronic device can display, via a touch surface, the soft input panel using the substantially straight layout. The electronic device can further display a graphical element at a specific location of the soft input panel. While displaying the soft input panel, the electronic device can receive input associated with the graphical element. For instance, in some examples, the electronic device can receive input corresponding to a swipe of the graphical element in a curved manner across the soft input panel. Based on the input, the electronic device can transition from displaying the soft input panel using the substantially straight layout to displaying the soft input panel using the arc layout. Additionally, described herein are techniques and processes for customizing a design of a soft input panel. For instance, an electronic device can provide a keyboard customization interface to enable a user to specify a color, font, background image, and so on for the soft input panel. The soft input panel can be configured to be transitioned to an arc layout. The user may provide input through the keyboard customization interface to customize the design (e.g., theme) of the soft input panel. In some instances, the user may provide an image to be used as a background for the soft input panel. The electronic device can analyze the image to determine a most prominent color of the image. A portion of the soft input panel can be set to a color that is based on the most prominent color of the image (e.g., set to the most prominent color, set to a color that is a particular percentage darker or lighter than the most prominent color, etc.).",
  "patent_number": "None",
  "abstract": "Techniques for providing an arc layout for a soft input panel are described. In some examples, an electronic device can transition from providing a substantially straight and/or horizontal layout for the soft input panel to an arc layout for the soft input panel. The electronic device can display a graphical element at a location on the soft input panel. The electronic device can receive input corresponding to, for example, a swipe of the graphical element in a curved manner across the soft input panel. Based on the input, the electronic device can transition from displaying the soft input panel using the substantially straight layout to displaying the soft input panel using the arc layout.",
  "publication_number": "US20170206003A1-20170720",
  "_processing_info": {
    "original_size": 91363,
    "optimized_size": 3669,
    "reduction_percent": 95.98
  }
}