{
  "decision": "PENDING",
  "application_number": "15217812",
  "date_published": "20161117",
  "date_produced": "20161102",
  "title": "APPARATUS, SYSTEMS AND METHODS FOR CROSS-CLOUD APPLICATION DEPLOYMENT",
  "filing_date": "20160722",
  "inventor_list": [
    {
      "inventor_name_last": "Fu",
      "inventor_name_first": "Tianying",
      "inventor_city": "San Jose",
      "inventor_state": "CA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Srinivasan",
      "inventor_name_first": "Venkat Narayan",
      "inventor_city": "Fremont",
      "inventor_state": "CA",
      "inventor_country": "US"
    }
  ],
  "ipcr_labels": [
    "G06F9455",
    "G06F948",
    "G06F9445"
  ],
  "main_ipcr_label": "G06F9455",
  "summary": "<SOH> SUMMARY <EOH>Consistent with embodiments disclosed herein, apparatus, systems and methods for facilitating the deployment and migration of application between clouds. In some embodiments, a processor-implemented method may comprise: obtaining a cloud agnostic image representation, the cloud agnostic image representation being obtained from a first Virtual Machine Image (VMI) on a first cloud, the cloud agnostic image representation being obtained, in part, by removing a cloud specific layer in the first VMI; and obtaining a second VMI for a second cloud different from the first cloud, wherein the second VMI is obtained based, at least in part, on the cloud agnostic image representation. Embodiments disclosed also pertain to an apparatus comprising: at least one processor coupled to at least one cloud, wherein the at least one processor is configured to: obtain a cloud agnostic image representation, the cloud agnostic image representation being obtained from a first Virtual Machine Image (VMI) on a first cloud, the cloud agnostic image representation being obtained, in part, by removing a cloud specific layer in the first VMI; and obtain a second VMI for a second cloud, wherein the second VMI is obtained based, at least in part, on the cloud agnostic image representation. Additional embodiments pertain to a computer-readable medium comprising instructions, which when executed by a processor, perform steps in a method comprising: obtaining a cloud agnostic image representation, the cloud agnostic image representation being obtained from a first Virtual Machine Image (VMI) on a first cloud, the cloud agnostic image representation being obtained, in part, by removing a cloud specific layer in the first VMI; and obtaining a second VMI for a second cloud different from the first cloud, wherein the second VMI is obtained based, at least in part, on the cloud agnostic image representation. In addition, in some embodiments, apparatus may comprise: at least one processi...",
  "patent_number": "None",
  "abstract": "Embodiments disclosed facilitate obtaining a cloud agnostic representation of a first Virtual Machine Image (VMI) on a first cloud; and obtaining a second VMI for a second cloud different from the first cloud, wherein the second VMI is obtained based, at least in part, on the cloud agnostic representation of the first VMI.",
  "publication_number": "US20160335114A1-20161117",
  "_processing_info": {
    "original_size": 75480,
    "optimized_size": 3061,
    "reduction_percent": 95.94
  }
}