{
  "decision": "PENDING",
  "application_number": "15217384",
  "date_published": "20161124",
  "date_produced": "20161109",
  "title": "UTILITY RESOURCE ASSET MANAGEMENT SYSTEM",
  "filing_date": "20160722",
  "inventor_list": [
    {
      "inventor_name_last": "RILAND",
      "inventor_name_first": "Chad",
      "inventor_city": "Windsor",
      "inventor_state": "CO",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "MURALIDHARAN",
      "inventor_name_first": "Shylesh",
      "inventor_city": "Fort Collins",
      "inventor_state": "CO",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "LEICK",
      "inventor_name_first": "Don",
      "inventor_city": "Burnsville",
      "inventor_state": "MN",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "WAGNER",
      "inventor_name_first": "Robert",
      "inventor_city": "Burnsville",
      "inventor_state": "MN",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "PETRECCA",
      "inventor_name_first": "Danny",
      "inventor_city": "Fort Collins",
      "inventor_state": "CO",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "HIGGINS",
      "inventor_name_first": "Scott",
      "inventor_city": "Fort Collins",
      "inventor_state": "CO",
      "inventor_country": "US"
    }
  ],
  "ipcr_labels": [
    "G06Q5006",
    "G06Q1006"
  ],
  "main_ipcr_label": "G06Q5006",
  "summary": "<SOH> BRIEF DESCRIPTION OF THE DRAWINGS <EOH>The accompanying appendices and/or drawings illustrate various non-limiting, example, inventive aspects in accordance with the present disclosure: FIG. 1 provides an exemplary interface for an implementation of URAMS; FIGS. 2A-2C illustrate features of some embodiments of URAMS; FIG. 3 illustrates real-time weather information overlay with GIS asset and network data according to an embodiment of URAMS; FIG. 4 illustrates an exemplary URAMS implementation showing advance automated alerts features; FIG. 5 illustrates a URAMS feature relating weather to utility network infrastructure and risk assessment; FIG. 6A shows an exemplary logic flow for risk analysis and asset allocation to determine threats and/or responses according to some embodiments of URAMS; FIG. 6B shows an example flow for an asset polygon determination component according to an embodiment of URAMS; FIG. 7A provides an exemplary at risk asset determination interface for one embodiment of URAMS; FIG. 7B provides an overview of some features and component according to some implementations of URAMS; FIGS. 7C and 7D provide exemplary logic flows for some embodiments; FIGS. 8A and 8B provide an example overviews for asset allocation, risk target/alert, and asset geo-location/search/positioning features according to some embodiments of URAMS; FIGS. 9A-9H provide overviews of features, components, and interfaces according to some implementations of URAMS; FIG. 10 provides an exemplary main dashboard according to some embodiments of URAMS; FIGS. 11-15 provide exemplary SCADA Events and Lightning Correlation reports and interfaces according to some embodiments of URAMS; and FIGS. 16A-16W provide exemplary interfaces, tools, and features for some implementations of URAMS embodiments; FIG. 17 shows a block diagram illustrating embodiments of a URAMS controller. The leading number of each reference number within the drawings indicates the figure in which that reference ...",
  "patent_number": "None",
  "abstract": "The UTILITY RESOURCE ASSET MANAGEMENT SYSTEM APPARATUSES, METHODS AND SYSTEMS (“URAMS”) transform weather, terrain, and utility asset parameter data via URAMS components into damage predictions with confidence metrics, alerts, and asset allocation and response plans.",
  "publication_number": "US20160343093A1-20161124",
  "_processing_info": {
    "original_size": 178845,
    "optimized_size": 3566,
    "reduction_percent": 98.01
  }
}