{
  "decision": "ACCEPTED",
  "application_number": "15213113",
  "date_published": "20161110",
  "date_produced": "20161026",
  "title": "INTERFERENCE BASED AUGMENTED REALITY HOSTING PLATFORMS",
  "filing_date": "20160718",
  "inventor_list": [
    {
      "inventor_name_last": "Soon-Shiong",
      "inventor_name_first": "Patrick",
      "inventor_city": "Los Angeles",
      "inventor_state": "CA",
      "inventor_country": "US"
    }
  ],
  "ipcr_labels": [
    "G06T1900",
    "A63F13212",
    "A63F13335",
    "A63F1365",
    "A63F1332"
  ],
  "main_ipcr_label": "G06T1900",
  "summary": "<SOH> SUMMARY OF THE INVENTION <EOH>The inventive subject matter provides apparatus, systems and methods in which one can utilize an augmented reality (AR) hosting platform to give rise to an augmented reality experience based on interference among elements of a digital representation of a scene. One aspect of the inventive subject matter includes an AR hosting platform. Contemplated hosting platforms comprise a mobile device interface through which the platform can obtained a digital representation of a scene, possibly local to the mobile device (e.g., cell phone, vehicle, tablet computer, PDA, AR-capable device, etc.). The digital representation can include data representing one or more elements of the scene. In some embodiments, the data includes sensor data captured by the mobile device, other sensing devices proximate to the scene, or devices capable of capturing data relevant to the scene. The platform can further include an object recognition engine in communication with the mobile device interface and able analyze the digital representation to recognize one or more elements of the scene as one or more target objects. The object recognition engine can further determine a context related to the scene based on the digital representation and pertaining to the target object. Further, the engine can identify a set of relevant AR objects from available AR objects with respect to the context based on a derived interference among elements (e.g., real-world elements, virtual elements, etc.). In more preferred embodiments the derived interference forms criteria through which an AR experience is presented to an individual via the mobile device. The object recognition engine can also configure one or more remote devices to allow an interaction with a member object of the set of relevant AR objects according to the derived interference. In especially preferred embodiments, the interaction involves participating in a commercial transaction with a commerce engine. For examp...",
  "patent_number": "9824501",
  "abstract": "Interference-based augmented reality hosting platforms are presented. Hosting platforms can include networking nodes capable of analyzing a digital representation of scene to derive interference among elements of the scene. The hosting platform utilizes the interference to adjust the presence of augmented reality objects within an augmented reality experience. Elements of a scene can constructively interfere, enhancing presence of augmented reality objects; or destructively interfere, suppressing presence of augmented reality objects.",
  "publication_number": "US20160328885A1-20161110",
  "_processing_info": {
    "original_size": 95741,
    "optimized_size": 3147,
    "reduction_percent": 96.71
  }
}