{
  "date_produced": "20161019",
  "publication_number": "US20160321558A1-20161103",
  "main_ipcr_label": "G06N9900",
  "decision": "PENDING",
  "application_number": "15211112",
  "inventor_list": [
    {
      "inventor_name_last": "NAKAMURA",
      "inventor_name_first": "Satoshi",
      "inventor_city": "Tokyo",
      "inventor_state": "",
      "inventor_country": "JP"
    },
    {
      "inventor_name_last": "ICHIMURA",
      "inventor_name_first": "Kouichi",
      "inventor_city": "Yokohama",
      "inventor_state": "",
      "inventor_country": "JP"
    },
    {
      "inventor_name_last": "GOTO",
      "inventor_name_first": "Hayato",
      "inventor_city": "Kawasaki",
      "inventor_state": "",
      "inventor_country": "JP"
    },
    {
      "inventor_name_last": "KUJIRAOKA",
      "inventor_name_first": "Mamiko",
      "inventor_city": "Kawasaki",
      "inventor_state": "",
      "inventor_country": "JP"
    }
  ],
  "abstract": "According to an embodiment, a quantum computer includes physical systems Xi, a physical system Yj and a light source unit. The physical systems Xi and the physical system Yj are provided in a cavity. Each physical system Xi includes states |0>i, |1>i, |2>i and |e>i, the states |0>i and |1>i being used for a qubit, a |2>i-|e>i transition being resonant with a cavity mode of the cavity. The physical system Yj includes states |2>′j and |e>′j, a |2>′j-|e>′j transition being resonant with the cavity mode. The light source unit applies laser beams to the cavity to manipulate states of two of physical systems Xi, the laser beams including a laser beam for collecting population in the state |2>′j in the |2>′j-|e>′j transition.",
  "filing_date": "20160715",
  "patent_number": "None",
  "summary": "<SOH> BRIEF DESCRIPTION OF DRAWINGS <EOH>FIG. 1 illustrates frequency domain quantum computation. FIG. 2 illustrates undesired interaction in the physical systems used for the frequency domain quantum computation. FIG. 3 illustrates a quantum computer according to an embodiment. FIG. 4 illustrates a physical system which is used for the frequency domain quantum computation in the embodiment. FIG. 5 illustrates part of the energy states of the Pr 3+ ion in the Y 2 SiO 5 used in the embodiment. FIG. 6 is a flowchart illustrating a method for manipulating two physical systems according to the embodiment. FIG. 7 is a waveform chart illustrating pulses used for the adiabatic passage via a cavity according to the embodiment. FIG. 8 illustrates a quantum computer according to another embodiment. FIG. 9 illustrates a quantum computer according to still another embodiment. detailed-description description=\"Detailed Description\" end=\"lead\"?",
  "date_published": "20161103",
  "title": "QUANTUM COMPUTER AND QUANTUM COMPUTING METHOD",
  "ipcr_labels": [
    "G06N9900"
  ],
  "_processing_info": {
    "original_size": 44522,
    "optimized_size": 2677,
    "reduction_percent": 93.99
  }
}