{
  "decision": "PENDING",
  "application_number": "15213685",
  "date_published": "20161222",
  "date_produced": "20161208",
  "title": "BATCH CONNECT",
  "filing_date": "20160719",
  "inventor_list": [
    {
      "inventor_name_last": "van de Bruggen",
      "inventor_name_first": "Hans",
      "inventor_city": "San Jose",
      "inventor_state": "CA",
      "inventor_country": "US"
    }
  ],
  "ipcr_labels": [
    "H04L2908",
    "G06Q5000",
    "H04L1258"
  ],
  "main_ipcr_label": "H04L2908",
  "summary": "<SOH> BRIEF DESCRIPTION OF THE DRAWINGS <EOH>In the drawings, which are not necessarily drawn to scale, like numerals may describe similar components in different views. Like numerals having different letter suffixes may represent different instances of similar components. The drawings illustrate generally, by way of example, but not by way of limitation, various embodiments discussed in the present document. FIG. 1 shows an interface for providing batch connect recommendations according to some examples of the present disclosure. FIG. 2 shows a notification according to some examples of the present disclosure. FIG. 3 shows a flowchart of a method for providing a batch connect functionality according to some examples of the present disclosure. FIG. 4 shows a schematic of a system for providing a batch connect according to some examples of the present disclosure. FIG. 5 shows a schematic of a machine according to some examples of the present disclosure. detailed-description description=\"Detailed Description\" end=\"lead\"?",
  "patent_number": "None",
  "abstract": "Disclosed in some examples is a method including determining a set of recommended connections for a member of a social networking service based upon a recommendation criteria; presenting the set of recommended connections to the member; receiving from the member a selection of a set of target members; and for each particular member in the set of target members: determining a second set of recommended connections for the particular target member, the second set of recommended connections based upon the recommendation criteria and based upon the set of target members; and sending a notification to the particular member, the notification including the second set of recommended connections.",
  "publication_number": "US20160373549A1-20161222",
  "_processing_info": {
    "original_size": 71233,
    "optimized_size": 2263,
    "reduction_percent": 96.82
  }
}