{
  "date_produced": "20161019",
  "publication_number": "US20160321556A1-20161103",
  "main_ipcr_label": "G06N700",
  "decision": "PENDING",
  "application_number": "15210099",
  "inventor_list": [
    {
      "inventor_name_last": "Bohra",
      "inventor_name_first": "Amit P.",
      "inventor_city": "Pune",
      "inventor_state": "",
      "inventor_country": "IN"
    },
    {
      "inventor_name_last": "Kummamuru",
      "inventor_name_first": "Krishna",
      "inventor_city": "Hyderabad",
      "inventor_state": "",
      "inventor_country": "IN"
    },
    {
      "inventor_name_last": "Sahu",
      "inventor_name_first": "Swapnasarit",
      "inventor_city": "Bangalore",
      "inventor_state": "",
      "inventor_country": "IN"
    },
    {
      "inventor_name_last": "Shivkumar",
      "inventor_name_first": "Abhishek",
      "inventor_city": "Bangalore",
      "inventor_state": "",
      "inventor_country": "IN"
    }
  ],
  "abstract": "A mechanism is provided in a data processing system for determining comprehensiveness of a question paper given a syllabus of topics. An answer and evidence generator of a question answering system executing on the data processing system finds one or more answers based on the syllabus of topics for each question in the question paper. The answer and evidence generator identifies evidence for the one or more answers in the syllabus for each question in the question paper. A concept identifier of the question answering system identifies a set of concepts in the syllabus corresponding to the evidence for each question in the question paper to form a plurality of sets of concepts. The mechanism determines a value for a comprehensiveness metric for the question paper with respect to the syllabus of topics based on the plurality of sets of concepts.",
  "filing_date": "20160714",
  "patent_number": "None",
  "summary": "<SOH> SUMMARY <EOH>In one illustrative embodiment, a method, in a data processing system, is provided for determining comprehensiveness of a question paper given a syllabus of topics. The method comprises finding, by an answer and evidence generator of a question answering system executing on the data processing system, one or more answers based on the syllabus of topics for each question in the question paper. The method further comprises identifying, by the answer and evidence generator, evidence for the one or more answers in the syllabus for each question in the question paper. The method further comprises identifying, by a concept identifier of the question answering system, a set of concepts in the syllabus corresponding to the evidence for each question in the question paper to form a plurality of sets of concepts. The method further comprises determining a value for a comprehensiveness metric for the question paper with respect to the syllabus of topics based on the plurality of sets of concepts. In other illustrative embodiments, a computer program product comprising a computer useable or readable medium having a computer readable program is provided. The computer readable program, when executed on a computing device, causes the computing device to perform various ones of, and combinations of, the operations outlined above with regard to the method illustrative embodiment. In yet another illustrative embodiment, a system/apparatus is provided. The system/apparatus may comprise one or more processors and a memory coupled to the one or more processors. The memory may comprise instructions which, when executed by the one or more processors, cause the one or more processors to perform various ones of, and combinations of, the operations outlined above with regard to the method illustrative embodiment. These and other features and advantages of the present invention will be described in, or will become apparent to those of ordinary skill in the art in view of, t...",
  "date_published": "20161103",
  "title": "Determining Comprehensiveness of Question Paper Given Syllabus",
  "ipcr_labels": [
    "G06N700",
    "G06F1730",
    "G09B700"
  ],
  "_processing_info": {
    "original_size": 67941,
    "optimized_size": 3869,
    "reduction_percent": 94.31
  }
}