{
  "decision": "ACCEPTED",
  "application_number": "15220262",
  "date_published": "20161117",
  "date_produced": "20161102",
  "title": "CARD READER HAVING DISCRIMINATOR CONTACT",
  "filing_date": "20160726",
  "inventor_list": [
    {
      "inventor_name_last": "Lamfalusi",
      "inventor_name_first": "Michael C.",
      "inventor_city": "Cupertino",
      "inventor_state": "CA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Lamba",
      "inventor_name_first": "Kartik",
      "inventor_city": "Berkeley",
      "inventor_state": "CA",
      "inventor_country": "US"
    }
  ],
  "ipcr_labels": [
    "G06K700",
    "G07G101"
  ],
  "main_ipcr_label": "G06K700",
  "summary": "<SOH> BRIEF DESCRIPTION OF THE DRAWINGS <EOH>In order to describe the manner in which features of the disclosure can be obtained, a more particular description of the principles will be rendered by reference to specific embodiments thereof which are illustrated in the appended drawings. Understanding that these drawings depict only exemplary embodiments of the disclosure and are not therefore to be considered to be limiting of its scope, the principles herein are described and explained with additional specificity and detail through the use of the accompanying drawings in which: FIG. 1 illustrates an example block diagram of a payment terminal configured to receive both magnetic stripe-type cards and IC chip-type cards, and having a discriminator contact, in accordance with various embodiments; FIG. 2A illustrates an example schematic diagram of a card reader configured to receive both magnetic stripe-type cards and IC chip-type cards, the card reader having a discriminator contact in accordance with an embodiment; FIG. 2B illustrates an example schematic diagram of the electrical contact and solenoid-actuated stopper, in accordance with an embodiment FIG. 3A illustrates an example partial cut-out view of an IC chip-type card, showing an internal IC chip and an external metal contact pad of the chip-type card, in accordance with an embodiment; FIG. 3B illustrates an example cross-sectional side view of a card reader configured to receive both magnetic stripe-type cards and IC chip-type cards, the card reader having front located discriminator contacts in accordance with an embodiment; FIG. 3C illustrates an example cross-sectional side view of a card reader configured to receive both magnetic stripe-type cards and IC chip-type cards, the card reader having back located discriminator contacts in accordance with an embodiment. FIG. 4 illustrates an example process for conducting a financial payment transaction in accordance with various embodiments; FIG. 5 illustrates...",
  "patent_number": "9652641",
  "abstract": "A card reader for a point-of-sale system that is configured to accept both magnetic strip-type and integrated circuit (IC) chip-type payment cards. The card reader is a component of a point-of-sale system including a portable computing device in communication with the card reader that is configured to present a first graphical user interface (GUI) when a magnetic stripe-type card is detected and a second GUI when an IC chip-type card is detected in the card reader. The card reader comprises a slot configured to receive the payment card, a magnetic reading device and an IC chip reading device. The card reader also includes a discriminator contact disposed within the slot that is configured to conduct across a surface of a metal pad of the IC chip-type card prior to the CI chip reading device making contact with the IC chip.",
  "publication_number": "US20160335461A1-20161117",
  "_processing_info": {
    "original_size": 55075,
    "optimized_size": 3530,
    "reduction_percent": 93.59
  }
}