{
  "decision": "PENDING",
  "application_number": "15224630",
  "date_published": "20180201",
  "date_produced": "20180117",
  "title": "ONLINE REAL-TIME BUSINESS INFORMATION INCLUDING LOCAL INVENTORY",
  "filing_date": "20160731",
  "inventor_list": [
    {
      "inventor_name_last": "Maynard",
      "inventor_name_first": "Jeremy",
      "inventor_city": "Richmond",
      "inventor_state": "KY",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Conlee",
      "inventor_name_first": "Roy G.",
      "inventor_city": "Lexington",
      "inventor_state": "KY",
      "inventor_country": "US"
    }
  ],
  "ipcr_labels": [
    "G06Q1008",
    "G06F128",
    "G06F1730"
  ],
  "main_ipcr_label": "G06Q1008",
  "summary": "<SOH> SUMMARY <EOH>Embodiments of the present invention include a method of compiling store data, including receiving a first store data by a server, wherein the first store data includes a store identifier, an operating status corresponding to whether the business is open at the time the store data is sent, and an inventory data, wherein the inventory data includes an item data including an item identifier and an item price. Further embodiments of the present invention include a computer program product for compiling store data, including a non-transitory computer readable storage medium having computer readable program code embodied therewith, the computer readable program code including computer readable program code configured to receive a first store data, wherein the first store data includes a store identifier, a current operating status corresponding to whether the business is open at the time the store data is sent, and an inventory data including an item data including an item identifier, an item price, and an item quantity. Further embodiments of the present invention include a system including a processor coupled with a memory, said memory including code executable by the processor, said code configured, when executed, to receive a first store data, wherein the first store data includes a store identifier, a current operating status corresponding to whether the business is open at the time the store data is sent, and an inventory data including an item data including an item identifier and a price.",
  "patent_number": "None",
  "abstract": "A method of compiling store data, including receiving a first store data by a server, wherein the first store data includes a store identifier, an operating status corresponding to whether the business is open at the time the store data is sent, and an inventory data, wherein the inventory data includes an item data including an item identifier and an item price.",
  "publication_number": "US20180032946A1-20180201",
  "_processing_info": {
    "original_size": 124139,
    "optimized_size": 2621,
    "reduction_percent": 97.89
  }
}