{
  "date_produced": "20180117",
  "publication_number": "US20180032873A1-20180201",
  "main_ipcr_label": "G06N502",
  "decision": "PENDING",
  "application_number": "15223750",
  "inventor_list": [
    {
      "inventor_name_last": "Andersen",
      "inventor_name_first": "John J.",
      "inventor_city": "Austin",
      "inventor_state": "TX",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Doucette",
      "inventor_name_first": "Jason E.",
      "inventor_city": "Saskatoon",
      "inventor_state": "",
      "inventor_country": "CA"
    },
    {
      "inventor_name_last": "Kottaram",
      "inventor_name_first": "Sanjay F.",
      "inventor_city": "Cedar Park",
      "inventor_state": "TX",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Turknett, JR.",
      "inventor_name_first": "Robert L.",
      "inventor_city": "Austin",
      "inventor_state": "TX",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Wu",
      "inventor_name_first": "Wilson L.",
      "inventor_city": "Arcadia",
      "inventor_state": "CA",
      "inventor_country": "US"
    }
  ],
  "abstract": "Technical solutions are described for visually depicting health of a cognitive system. An example computer-implemented method includes accessing a query-log of a question input to the cognitive system. The method also includes generating a query-node corresponding to the question. The method also includes configuring animation parameters of the query-node based on the query-log. The method also includes displaying the query-node according to the animation parameters.",
  "filing_date": "20160729",
  "patent_number": "None",
  "summary": "<SOH> SUMMARY <EOH>According to one or more embodiments, a computer-implemented method for visually depicting health of a cognitive system includes accessing a query-log of a question input to the cognitive system. The method also includes generating a query-node corresponding to the question. The method also includes configuring animation parameters of the query-node based on the query-log. The method also includes displaying the query-node according to the animation parameters. According to one or more embodiments, a system for visually depicting health of a cognitive system includes a memory, a display unit, and a processor coupled with the memory and the display unit. The processor accesses a query-log of a question input to the cognitive system. The processor also generates a query-node corresponding to the question. The processor also configures animation parameters of the query-node based on the query-log. The processor also causes the display unit to display the query-node according to the animation parameters. According to one or more embodiments, a computer program product for visually depicting health of a cognitive system includes a computer readable storage medium. The computer readable storage medium includes computer executable instructions to access a query-log of a question input to the cognitive system. The computer readable storage medium also includes instructions to generate a query-node corresponding to the question. The computer readable storage medium also includes instructions to configure animation parameters of the query-node based on the query-log. The computer readable storage medium also includes instructions to cause a display unit to display the query-node according to the animation parameters.",
  "date_published": "20180201",
  "title": "DETERMINING AND REPRESENTING HEALTH OF COGNITIVE SYSTEMS",
  "ipcr_labels": [
    "G06N502",
    "G06F1730",
    "H04W8412"
  ],
  "_processing_info": {
    "original_size": 63371,
    "optimized_size": 3392,
    "reduction_percent": 94.65
  }
}