{
  "date_produced": "20180117",
  "publication_number": "US20180032862A1-20180201",
  "main_ipcr_label": "G06N308",
  "decision": "PENDING",
  "application_number": "15224493",
  "inventor_list": [
    {
      "inventor_name_last": "Oliner",
      "inventor_name_first": "Adam",
      "inventor_city": "San Francisco",
      "inventor_state": "CA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Yang",
      "inventor_name_first": "Zidong",
      "inventor_city": "San Francisco",
      "inventor_state": "CA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Sreshta",
      "inventor_name_first": "Sinduja",
      "inventor_city": "San Francisco",
      "inventor_state": "CA",
      "inventor_country": "US"
    }
  ],
  "abstract": "Described herein is a technology that facilitates the production of and the use of automated datagens for event-based systems. A datagen (i.e., data-generator or data generation system) is a component, module, or subsystem of computer systems that searches, monitors, and analyzes machine data. Existing datagens are not capable of detecting an anomaly in machine data. An anomaly is a variance in the input data stream that exceeds some acceptable amount of deviation from the norm (i.e., standard, expectation, etc.). An embodiment of datagen, in accordance with the technology described herein, detects anomalies in the input machine data.",
  "filing_date": "20160729",
  "patent_number": "None",
  "summary": "<SOH> BRIEF DESCRIPTION OF THE DRAWINGS <EOH>FIG. 1 illustrates a networked computer environment in which an embodiment may be implemented. FIG. 2 illustrates a block diagram of an example data intake and query system in which an embodiment may be implemented. FIG. 3 is a flow diagram that illustrates how indexers process, index, and store data received from forwarders in accordance with the disclosed embodiments. FIG. 4 is a flow diagram that illustrates how a search head and indexers perform a search query in accordance with the disclosed embodiments. FIG. 5 illustrates a scenario where a common customer ID is found among log data received from three disparate sources in accordance with the disclosed embodiments. FIG. 6A illustrates a search screen in accordance with the disclosed embodiments. FIG. 6B illustrates a data summary dialog that enables a user to select various data sources in accordance with the disclosed embodiments. FIGS. 7A-7D illustrate a series of user interface screens for an example data model-driven report generation interface in accordance with the disclosed embodiments. FIG. 8 illustrates an example search query received from a client and executed by search peers in accordance with the disclosed embodiments. FIG. 9A illustrates a key indicators view in accordance with the disclosed embodiments. FIG. 9B illustrates an incident review dashboard in accordance with the disclosed embodiments. FIG. 9C illustrates a proactive monitoring tree in accordance with the disclosed embodiments. FIG. 9D illustrates a user interface screen displaying both log data and performance data in accordance with the disclosed embodiments. FIG. 10 illustrates a block diagram of an example cloud-based data intake and query system in which an embodiment may be implemented. FIG. 11 illustrates a block diagram of an example data intake and query system that performs searches across external data systems in accordance with the disclosed embodiments. FIGS. 12-14 illustrate a...",
  "date_published": "20180201",
  "title": "AUTOMATED ANOMALY DETECTION FOR EVENT-BASED SYSTEM",
  "ipcr_labels": [
    "G06N308",
    "G06N502"
  ],
  "_processing_info": {
    "original_size": 174889,
    "optimized_size": 3496,
    "reduction_percent": 98.0
  }
}