{
  "date_produced": "20180117",
  "publication_number": "US20180032882A1-20180201",
  "main_ipcr_label": "G06N504",
  "decision": "PENDING",
  "application_number": "15220833",
  "inventor_list": [
    {
      "inventor_name_last": "Joshi",
      "inventor_name_first": "Dhiraj",
      "inventor_city": "Ossining",
      "inventor_state": "NY",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Cooper",
      "inventor_name_first": "Matthew L.",
      "inventor_city": "San Francisco",
      "inventor_state": "CA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Chen",
      "inventor_name_first": "Francine",
      "inventor_city": "Menlo Park",
      "inventor_state": "CA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Chen",
      "inventor_name_first": "Yin-Ying",
      "inventor_city": "Sunnyvale",
      "inventor_state": "CA",
      "inventor_country": "US"
    }
  ],
  "abstract": "A method and system for generating recommendations. The method including extracting concept information from visual content associated with content posted to a social media platform, detecting one or more preferences based on the extracted concept information, generating a matrix based on the detected one or more preferences, calculating a first similarity between the one or more preferences associated with a first user and one or more preferences associated with a second user based on the generated matrix, and generating a recommendation based on the matrix and the calculated first similarity.",
  "filing_date": "20160727",
  "patent_number": "None",
  "summary": "<SOH> SUMMARY <EOH>Aspects of the present application may include a method of generating recommendations. The method includes extracting concept information from visual content associated with content posted to a social media platform, detecting one or more preferences based on the extracted concept information, generating a matrix based on the detected one or more preferences, calculating a first similarity between the one or more preferences associated with a first user and one or more preferences associated with a second user based on the generated matrix, and generating a recommendation based on the matrix and the calculated first similarity. Further aspects of the present application may include a non-transitory computer readable medium having stored therein a program for making a computer execute a method of generating recommendations. The method includes extracting concept information from visual content associated with content posted to a social media platform, detecting one or more preferences based on the extracted concept information, generating a matrix based on the detected one or more preferences, calculating a first similarity between the one or more preferences associated with a first user and one or more preferences associated with a second user based on the generated matrix, and generating a recommendation based on the matrix and the calculated first similarity. Additional aspects of the present application may include a server apparatus having a memory and a processor. The memory may store content posted to a social media platform. The processor may execute a process including extracting concept information from visual content associated with content posted to a social media platform, detecting one or more preferences based on the concept information, generating a matrix based on the detected one or more preferences, calculating a first similarity between the one or more preferences associated with a first user and one or more preferences associat...",
  "date_published": "20180201",
  "title": "METHOD AND SYSTEM FOR GENERATING RECOMMENDATIONS BASED ON VISUAL DATA AND ASSOCIATED TAGS",
  "ipcr_labels": [
    "G06N504",
    "G06N700",
    "G06N9900"
  ],
  "_processing_info": {
    "original_size": 47388,
    "optimized_size": 3650,
    "reduction_percent": 92.3
  }
}