{
  "decision": "PENDING",
  "application_number": "15224237",
  "date_published": "20180201",
  "date_produced": "20180117",
  "title": "SYSTEM AND METHOD FOR PIECEWISE LINEAR APPROXIMATION",
  "filing_date": "20160729",
  "inventor_list": [
    {
      "inventor_name_last": "Mathew",
      "inventor_name_first": "Deepak",
      "inventor_city": "Acton",
      "inventor_state": "MA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Ingle",
      "inventor_name_first": "Ajay Anant",
      "inventor_city": "Austin",
      "inventor_state": "TX",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Sun",
      "inventor_name_first": "Yurong",
      "inventor_city": "Acton",
      "inventor_state": "MA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Zhu",
      "inventor_name_first": "Jianming",
      "inventor_city": "Acton",
      "inventor_state": "MA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Hoffman",
      "inventor_name_first": "Marc",
      "inventor_city": "Mansfield",
      "inventor_state": "MA",
      "inventor_country": "US"
    }
  ],
  "ipcr_labels": [
    "G06F7483"
  ],
  "main_ipcr_label": "G06F7483",
  "summary": "<SOH> III. SUMMARY <EOH>In a particular aspect, an apparatus includes one or more registers configured to store a vector of input values. The apparatus also includes a coefficient determination unit configured to, responsive to execution by a processor of a single instruction, select a plurality of piecewise analysis coefficients. The plurality of piecewise analysis coefficients includes one or more sets of piecewise analysis coefficients, and each set of piecewise analysis coefficients corresponds to an input value of the vector of input values. The apparatus further includes arithmetic logic circuitry configured to, responsive to the execution of at least the single instruction, determine estimated output values of a function based on the plurality of piecewise analysis coefficients and the vector of input values. In another particular aspect, a method includes receiving a vector of input values. The method also includes executing a single instruction to select a plurality of piecewise analysis coefficients. The plurality of piecewise analysis coefficients includes one or more sets of piecewise analysis coefficients, and each set of piecewise analysis coefficients corresponds to an input value of the vector of input values. The method further includes determining estimated output values of a function based on the plurality of piecewise analysis coefficients and the vector of input values. In another particular aspect, an apparatus includes means for receiving a vector of input values. The apparatus also includes means for executing a single instruction to select a plurality of piecewise analysis coefficients. The plurality of piecewise analysis coefficients includes one or more sets of piecewise analysis coefficients, and each set of piecewise analysis coefficients corresponds to an input value of the vector of input values. The apparatus further includes means for determining estimated output values of a function based on the plurality of piecewise analysis coeff...",
  "patent_number": "None",
  "abstract": "An apparatus includes one or more registers configured to store a vector of input values. The apparatus also includes a coefficient determination unit configured to, responsive to execution by a processor of a single instruction, select a plurality of piecewise analysis coefficients. The plurality of piecewise analysis coefficients includes one or more sets of piecewise analysis coefficients, and each set of piecewise analysis coefficients corresponds to an input value of the vector of input values. The apparatus further includes arithmetic logic circuitry configured to, responsive to the execution of at least the single instruction, determine estimated output values of a function based on the plurality of piecewise analysis coefficients and the vector of input values.",
  "publication_number": "US20180032311A1-20180201",
  "_processing_info": {
    "original_size": 127596,
    "optimized_size": 3893,
    "reduction_percent": 96.95
  }
}