{
  "decision": "PENDING",
  "application_number": "15222072",
  "date_published": "20161117",
  "date_produced": "20161102",
  "title": "Ranking Recommended Search Queries",
  "filing_date": "20160728",
  "inventor_list": [
    {
      "inventor_name_last": "Garg",
      "inventor_name_first": "Avichal",
      "inventor_city": "Palo Alto",
      "inventor_state": "CA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Hua",
      "inventor_name_first": "Ming",
      "inventor_city": "Palo Alto",
      "inventor_state": "CA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Vernal",
      "inventor_name_first": "Michael S.",
      "inventor_city": "San Francisco",
      "inventor_state": "CA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Qin",
      "inventor_name_first": "Yang",
      "inventor_city": "Menlo Park",
      "inventor_state": "CA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Fechete",
      "inventor_name_first": "Dan lonut",
      "inventor_city": "Mountain View",
      "inventor_state": "CA",
      "inventor_country": "US"
    }
  ],
  "ipcr_labels": [
    "G06F1730"
  ],
  "main_ipcr_label": "G06F1730",
  "summary": "<SOH> SUMMARY OF PARTICULAR EMBODIMENTS <EOH>In particular embodiments, a social-networking system may generate structured queries that include references to particular social-graph elements. These structured queries may be generated, for example, in response to a text query provided by a user, or generated as default queries. By providing suggested structured queries to a user's text query, the social-networking system may provide a powerful way for users of an online social network to search for elements represented in a social graph based on their social-graph attributes and their relation to various social-graph elements. In particular embodiments, the card stack may be visual model indicating which applications or content of an application are being executed on a computing device. The card stack may have a card that is analogous to the launcher that displays all applications installed on the computing device. In particular embodiments, the user may access the card corresponding to the launcher by performing a gesture, such as for example swiping down from top, or pressing the “home” button of the computing device. Applications executed on the computing device or content of the applications (e.g. profile page of a user on a social network or tab of a web browser) may be displayed as a card stacked above the launcher card. In particular embodiments, the cards of the card stack may be ordered chronologically with the most recently executed applications being higher in the card stack. Each card may be accessed by swiping up on an exposed edge of the card or pulling down on the exposed edge of card depending on how the cards are stacked on the screen. In particular embodiments, the social-networking system may generating “cards” with recommended queries and query filters using signals that may provide clues to the interests, preferences, or tastes of a given user. The social network may provide a user interface comprising one or more cards for display to the user. T...",
  "patent_number": "None",
  "abstract": "In one embodiment, a method includes receiving, from a client system of a first user of the communication system, an input from the first user to access a card-stack interface, generating a card cluster comprising a plurality of cards, each card comprising a suggested query referencing a query-domain and one or more query-filters, wherein each query-filter references one or more objects associated with the communication system, and wherein each card in the card cluster is ranked within the card cluster based on a predicted click-thru rate (CTR) for the card based on one or more user-engagement factors, and sending, to the client system in response to the input from the first user, the card-stack interface for display to the first user, wherein the card-stack interface comprises the card cluster, the cards of the card cluster being ordered based on the rankings associated with the cards.",
  "publication_number": "US20160335270A1-20161117",
  "_processing_info": {
    "original_size": 180999,
    "optimized_size": 4038,
    "reduction_percent": 97.77
  }
}