{
  "date_produced": "20170119",
  "publication_number": "US20170032280A1-20170202",
  "main_ipcr_label": "G06N9900",
  "decision": "PENDING",
  "application_number": "15221541",
  "inventor_list": [
    {
      "inventor_name_last": "SOCHER",
      "inventor_name_first": "Richard",
      "inventor_city": "Menlo Park",
      "inventor_state": "CA",
      "inventor_country": "US"
    }
  ],
  "abstract": "A machine learning system may be implemented as a set of trained models. A set of trained models, for example, a deep learning system, is disclosed wherein one or more types of media input may be analyzed to determine an associated engagement of the one or more types of media input.",
  "filing_date": "20160727",
  "patent_number": "None",
  "summary": "<SOH> BRIEF DESCRIPTION OF THE FIGURES <EOH>The present invention is illustrated by way of example, and not by way of limitation, in the figures of the accompanying drawings and in which like reference numerals refer to similar elements and in which: FIG. 1 is a block diagram of an engagement estimator learning system in accordance with one embodiment of the present invention. FIG. 2 is a flow diagram of an engagement estimator learning system in accordance with one embodiment of the present invention. FIGS. 3A and 3B are example outputs of an engagement estimator learning system in accordance with one embodiment of the present invention. FIGS. 4A and 4B are example outputs of an engagement estimator learning system in accordance with one embodiment of the present invention. FIGS. 5A and 5B are example outputs of an engagement estimator learning system in accordance with one embodiment of the present invention. FIG. 6 is a block diagram of a computer system that may be used with the present invention. detailed-description description=\"Detailed Description\" end=\"lead\"?",
  "date_published": "20170202",
  "title": "ENGAGEMENT ESTIMATOR",
  "ipcr_labels": [
    "G06N9900",
    "G06N700"
  ],
  "_processing_info": {
    "original_size": 31765,
    "optimized_size": 1892,
    "reduction_percent": 94.04
  }
}