{
  "decision": "PENDING",
  "application_number": "15223233",
  "date_published": "20170914",
  "date_produced": "20170830",
  "title": "IMAGE PROCESSING DEVICE, IMAGE PROCESSING METHOD, AND NON-TRANSITORY COMPUTER READABLE MEDIUM",
  "filing_date": "20160729",
  "inventor_list": [
    {
      "inventor_name_last": "YASUDA",
      "inventor_name_first": "Shunichi",
      "inventor_city": "Kanagawa",
      "inventor_state": "",
      "inventor_country": "JP"
    },
    {
      "inventor_name_last": "TOKUCHI",
      "inventor_name_first": "Kengo",
      "inventor_city": "Kanagawa",
      "inventor_state": "",
      "inventor_country": "JP"
    }
  ],
  "ipcr_labels": [
    "H04N160",
    "G06T500"
  ],
  "main_ipcr_label": "H04N160",
  "summary": "<SOH> SUMMARY <EOH>According to an aspect of the invention, there is provided an image processing device including an image acquiring unit, a color aid information acquiring unit, and a restoring unit. The image acquiring unit acquires, as a processing target image, an image with modified color information or an image with color information degraded from an original image. The color aid information acquiring unit acquires color aid information to be referred to at the time of restoring the color information of the processing target image. The restoring unit restores the color information of the processing target image on the basis of the color aid information.",
  "patent_number": "None",
  "abstract": "An image processing device includes an image acquiring unit, a color aid information acquiring unit, and a restoring unit. The image acquiring unit acquires, as a processing target image, an image with modified color information or an image with color information degraded from an original image. The color aid information acquiring unit acquires color aid information to be referred to at the time of restoring the color information of the processing target image. The restoring unit restores the color information of the processing target image on the basis of the color aid information.",
  "publication_number": "US20170264790A1-20170914",
  "_processing_info": {
    "original_size": 32348,
    "optimized_size": 1990,
    "reduction_percent": 93.85
  }
}