{
  "date_produced": "20180117",
  "publication_number": "US20180032855A1-20180201",
  "main_ipcr_label": "G06N300",
  "decision": "PENDING",
  "application_number": "15220119",
  "inventor_list": [
    {
      "inventor_name_last": "Wang",
      "inventor_name_first": "Gang",
      "inventor_city": "San Diego",
      "inventor_state": "CA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Cabrera",
      "inventor_name_first": "Luis Felipe",
      "inventor_city": "Bellevue",
      "inventor_state": "WA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "McCluskey",
      "inventor_name_first": "Kevin M.",
      "inventor_city": "Carlsbad",
      "inventor_state": "CA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Balazs",
      "inventor_name_first": "Alex G.",
      "inventor_city": "San Diego",
      "inventor_state": "CA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Halvorsen",
      "inventor_name_first": "Per-Kristian G.",
      "inventor_city": "Los Altos Hills",
      "inventor_state": "CA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Eftekhari",
      "inventor_name_first": "Amir R.",
      "inventor_city": "San Diego",
      "inventor_state": "CA",
      "inventor_country": "US"
    }
  ],
  "abstract": "Computer-implemented systems, methods and articles for preparing and/or submitting a plurality of different types of compliance forms for submission to a regulatory agency. The system includes a computing device, a data store, and a compliance form software program executable by the computing device. The compliance program includes a universal calculation engine, logic agent and user interface manager which are configured to process a respective domain model configured for each type of compliance form. Each domain model includes a calculation graph, a completeness model comprising decision table(s) and/or completeness graph(s), user interface assets and filing rules configured specifically for a particular type of compliance form. The rules and regulations for each type of compliance form are embodied in the declaratory data structures of the respective calculation graph and completeness graph for each domain model. The calculation engine and logic agent are configured to process the c...",
  "filing_date": "20160726",
  "patent_number": "None",
  "summary": "<SOH> SUMMARY <EOH>Embodiments of the present invention are directed to computerized systems and methods for preparing and/or submitting compliance forms for meeting compliance requirements, such as applications and forms for permits, licenses, immigration cards, tax filings, etc. There are many activities of individuals and businesses which are subject to compliance with rules and regulations. Some examples or such activities include obtaining permits and licenses to perform certain activities such as driver's licenses, vehicle registrations, marriage licenses, business licenses, building permits, licenses to sell alcohol, professional licenses (e.g., investment licenses, attorney licenses, insurance licenses, healthcare provider licenses, etc.), and the like. There are also regulatory compliance requirements for taxation on property, taxation on business income (e.g., tax returns), taxation on personal income (e.g., tax returns), employer payroll tax forms, immigration procedures, applications for government programs and assistance, etc. In each case, the compliance entity, be it an individual or business entity, must submit a compliance form, such as an application or other form, to satisfy the required compliance process. Once completed, the compliance form must be submitted to an official agency in the jurisdiction which is responsible for reviewing regulatory compliance. The responsible agency may accept paper compliance forms and/or electronic submissions, depending on the systems and requirements of each agency. For example, some agencies have systems which allow compliance forms to completed and/or submitted in electronic form, while some agencies may require or allow compliance forms to be completed and submitted on paper, and some agencies accept both paper forms and electronic forms. As an example, the Internal Revenue Service (“IRS”) accepts both paper tax returns and electronic tax returns. Some agencies also have their own websites which allow an enti...",
  "date_published": "20180201",
  "title": "COMPUTER-IMPLEMENTED SYSTEMS AND METHODS FOR PREPARING COMPLIANCE FORMS TO MEET REGULATORY REQUIREMENTS",
  "ipcr_labels": [
    "G06N300",
    "G06F1730",
    "G06N504"
  ],
  "_processing_info": {
    "original_size": 135453,
    "optimized_size": 4391,
    "reduction_percent": 96.76
  }
}