{
  "date_produced": "20180124",
  "publication_number": "US20180039892A1-20180208",
  "main_ipcr_label": "G06N504",
  "decision": "PENDING",
  "application_number": "15226533",
  "inventor_list": [
    {
      "inventor_name_last": "RICHTER",
      "inventor_name_first": "WOLFGANG",
      "inventor_city": "Vancouver",
      "inventor_state": "",
      "inventor_country": "CA"
    },
    {
      "inventor_name_last": "ZADEH",
      "inventor_name_first": "Faranak",
      "inventor_city": "VANCOUVER",
      "inventor_state": "",
      "inventor_country": "CA"
    }
  ],
  "abstract": "Disclosed is a contactless powered and operated self-organizing sensing co-processor system for interacting with an object and one or more peripheral units. The system communicates with a communicating device over a communication network. It includes a hub for providing a modulated alternating electric field with variable frequency and releases routing instructions and further communicates data with the communicating device and one or more nanoCloud processors, wherein at least one of the one or more nanoCloud processors interact with the object and the hub. The nanoCloud processor includes a coupling electrode, an energy convertor, a bi-directional communication unit, a pulser, a counter, plurality of registers, a hardware interpreter, a sequencing circuit, an analog digital switch matrix, and a floating electrode; wherein the hardware interpreter creates an inherent artificial intelligence relation to determine the changes on the object by analyzing combinations of the routing instru...",
  "filing_date": "20160802",
  "patent_number": "None",
  "summary": "<SOH> SUMMARY OF THE INVENTION <EOH>In accordance with a preferred embodiment of the present invention, a contactless powered and operated self-organizing sensing co-processor system for interacting with an object and one or more peripheral units is being proposed. The goal of this invention is to provide a contactlessly powered and operated self-organizing sensing co-processor system that includes a hub for providing a modulated alternating electric field with variable frequency and further releasing routing instructions and further communicates data with the communicating device and one or more nanoCloud processors, wherein at least one of the one or more nanoCloud processors interacts with the object and the hub. The one or more nanoCloud processors includes a coupling electrode for receiving alternating electric field from the hub, an energy convertor for converting the alternating electric field into DC power and further extracting clock signals synchronized with the e-field frequency, and a bi-directional communication unit communicates results to the hub. The one or more nanoCloud processors further includes a pulser to measure the field strength of the received charges from the energy convertor and generates pulsed intervals depending upon the field strength. It also includes a counter to count the periods of the receiving alternating charges between two pulses as quantitative measurement and further the counter counts the pulses during the number of continuous count as a qualitative measurement. The register further stores the amount of pulses during a certain amount of counts and the amount of counts between one pulse interval. The nanoCloud processors also include multiple registers, where at least one of the register stores the corresponding count received from the counter. Additionally, the registers receive bit combination information from the hub and a hardware interpreter processes the bit combination information stored in the registers. The nanoClou...",
  "date_published": "20180208",
  "title": "INHERENT ARTIFICIAL INTELLIGENCE CONTACTLESS AND SELF-ORGANIZING SENSING CO-PROCESSOR SYSTEM INTERACTING WITH OBJECTS AND PERIPHERAL UNITS",
  "ipcr_labels": [
    "G06N504"
  ],
  "_processing_info": {
    "original_size": 77066,
    "optimized_size": 3776,
    "reduction_percent": 95.1
  }
}