{
  "decision": "PENDING",
  "application_number": "15225133",
  "date_published": "20161117",
  "date_produced": "20161102",
  "title": "CARDS AND DEVICES WITH MULTIFUNCTION MAGNETIC EMULATORS AND METHODS FOR USING SAME",
  "filing_date": "20160801",
  "inventor_list": [
    {
      "inventor_name_last": "Mullen",
      "inventor_name_first": "Jeffrey D.",
      "inventor_city": "Glenshaw",
      "inventor_state": "PA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Lambeth",
      "inventor_name_first": "David",
      "inventor_city": "Pittsburgh",
      "inventor_state": "PA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Cloutier",
      "inventor_name_first": "Bruce",
      "inventor_city": "Jeannette",
      "inventor_state": "PA",
      "inventor_country": "US"
    }
  ],
  "ipcr_labels": [
    "G06K1906",
    "G06K1907",
    "G06K19077"
  ],
  "main_ipcr_label": "G06K1906",
  "summary": "<SOH> SUMMARY OF THE INVENTION <EOH>A card is provided, such as a credit card or security card, that may transmit information to a magnetic stripe reader via a magnetic emulator. The magnetic emulator may be, for example, a circuit that emits electromagnetic fields operable to electrically couple with a read-head of a magnetic stripe reader such that data may be transmitted from the circuit to the magnetic stripe reader. The emulator may be operated serially such that information is transmitted serially to a magnetic stripe reader. Alternatively, for example, portions of a magnetic emulator may emit different electromagnetic fields at a particular instance such that the emulator is operated to provide physically parallel, instantaneous data. Alternatively still, a magnetic medium may be provided and a circuit may be provided to change the magnetic properties of the magnetic medium such that a magnetic stripe reader is operable to read information written on the magnetic medium. A processor may be provided on a card, or other device, that controls a magnetic emulator. The processor may be configured to operate the emulator such that the emulator transmits serial or parallel information. Particularly, the processor may decouple portions of an emulator from one another such that different portions of the emulator may transmit different information (e.g., transmit data in a parallel operation). The processor may couple portions of an emulator together (or drive the portions together) such that all portions of the emulator transmits the same information (e.g., transmit data in a serial operation). Alternatively, the processor may drive a portion of the emulator to transmit data using one method (e.g., serially) while the processor drives another portion of the emulator using a different method (e.g., in parallel). The processor may drive an emulator through a switching circuit. The switching circuit may control the direction and magnitude of current that flows through at...",
  "patent_number": "None",
  "abstract": "A payment card (e.g., credit and/or debit card) is provided with a magnetic emulator operable of communicating information to a magnetic stripe reader. Information used in validating a financial transaction is encrypted based on time such that a validating server requires receipt of the appropriate encrypted information for a period of time to validate a transaction for that period of time. Such dynamic information may be communicated using such an emulator such that a card may be swiped through a magnetic stripe reader—yet communicate different information based on time. An emulator may receive information as well as communicate information to a variety of receivers (e.g., an RFID receiver).",
  "publication_number": "US20160335529A1-20161117",
  "_processing_info": {
    "original_size": 59394,
    "optimized_size": 3603,
    "reduction_percent": 93.93
  }
}