{
  "date_produced": "20180124",
  "publication_number": "US20180039881A1-20180208",
  "main_ipcr_label": "G06N3063",
  "decision": "PENDING",
  "application_number": "15228653",
  "inventor_list": [
    {
      "inventor_name_last": "Frank",
      "inventor_name_first": "Martin M.",
      "inventor_city": "Dobbs Ferry",
      "inventor_state": "NY",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Han",
      "inventor_name_first": "Jin Ping",
      "inventor_city": "Fishkill",
      "inventor_state": "NY",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Ishii",
      "inventor_name_first": "Masatoshi",
      "inventor_city": "Kanagawa-ken",
      "inventor_state": "",
      "inventor_country": "JP"
    },
    {
      "inventor_name_last": "Phung",
      "inventor_name_first": "Timothy",
      "inventor_city": "Milpitas",
      "inventor_state": "CA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Pushp",
      "inventor_name_first": "Aakash",
      "inventor_city": "San Jose",
      "inventor_state": "CA",
      "inventor_country": "US"
    }
  ],
  "abstract": "A tunable resistance device and methods of forming the same include a magnetic fixed layer having a fixed magnetization, a magnetic free layer, and a non-magnetic conductive layer directly between the magnetic fixed layer and the magnetic free layer. The magnetic fixed layer, the magnetic free layer, and the non-magnetic conductive layer are formed in a lattice of wires, with each wire in the lattice being formed from a stack of the magnetic fixed layer, the magnetic free layer, and the non-magnetic conductive layer.",
  "filing_date": "20160804",
  "patent_number": "None",
  "summary": "<SOH> SUMMARY <EOH>A tunable resistance device include a magnetic fixed layer having a fixed magnetization, a magnetic free layer, and a non-magnetic conductive layer directly between the magnetic fixed layer and the magnetic free layer. The magnetic fixed layer, the magnetic free layer, and the non-magnetic conductive layer are formed in a lattice of wires, with each wire in the lattice being formed from a stack of the magnetic fixed layer, the magnetic free layer, and the non-magnetic conductive layer. A neural network includes multiple neurons, with a layer of input neurons, one or more layers of hidden neurons, and a layer of output neurons. The neural network further includes arrays of synapses, each array of synapses being configured to accept voltage pulses from a first layer of neurons and to output current to a second layer of neurons during a feed forward operation, each synapse in each array of synapses having a respective settable resistance. Each synapse includes a magnetic fixed layer having a fixed magnetization, a magnetic free layer, and a non-magnetic conductive layer directly between the magnetic fixed layer and the magnetic free layer. A method of forming a tunable resistance device includes forming a magnetic fixed layer having a fixed magnetization. A non-magnetic conductive layer is formed on the magnetic fixed layer. A magnetic free layer is formed on the non-magnetic conductive layer. The magnetic fixed layer, the magnetic free layer, and the non-magnetic conductive layer are formed in a lattice of wires, with each wire in the lattice being formed from a stack of the magnetic fixed layer, the magnetic free layer, and the non-magnetic conductive layer. These and other features and advantages will become apparent from the following detailed description of illustrative embodiments thereof, which is to be read in connection with the accompanying drawings.",
  "date_published": "20180208",
  "title": "RACETRACK SYNAPSE FOR NEUROMORPHIC APPLICATIONS",
  "ipcr_labels": [
    "G06N3063",
    "G06N304"
  ],
  "_processing_info": {
    "original_size": 40021,
    "optimized_size": 3566,
    "reduction_percent": 91.09
  }
}