{
  "decision": "PENDING",
  "application_number": "15228886",
  "date_published": "20180208",
  "date_produced": "20180124",
  "title": "SYSTEM AND METHOD FOR ESD PROTECTION IN A TOUCH SCREEN DISPLAY",
  "filing_date": "20160804",
  "inventor_list": [
    {
      "inventor_name_last": "Schwager",
      "inventor_name_first": "Mark",
      "inventor_city": "Cedar Park",
      "inventor_state": "TX",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Lee",
      "inventor_name_first": "Jason I.",
      "inventor_city": "Austin",
      "inventor_state": "TX",
      "inventor_country": "US"
    }
  ],
  "ipcr_labels": [
    "G06F3041"
  ],
  "main_ipcr_label": "G06F3041",
  "summary": "<SOH> SUMMARY <EOH>In some embodiments, a touch screen display for an Information Handling System (IHS) is disclosed. The IHS includes a coverglass, an ESD ground ring on the coverglass, and a touch panel proximate to the coverglass. In another embodiments, an information handling system is disclosed. The information handling system includes a display housing including a bezel adapted to retain a plurality of display components, the plurality of display components including a coverglass, an ESD ground ring on the coverglass, and a touch panel proximate to the coverglass. In a further embodiment, a method of manufacturing a touch panel display is disclosed. The method includes depositing an ESD ground ring on a coverglass, and affixing the coverglass to a touch panel.",
  "patent_number": "None",
  "abstract": "System and methods for ESD protection in a touch screen display are disclosed. A touch screen display for an Information Handling System (IHS) include a coverglass, an ESD ground ring on the coverglass; and a touch panel proximate to the coverglass. An information handling system includes a display housing including a bezel adapted to retain a plurality of display components; the plurality of display components including a coverglass, an ESD ground ring on the coverglass; and a touch panel proximate to the coverglass. Methods are also disclosed.",
  "publication_number": "US20180039348A1-20180208",
  "_processing_info": {
    "original_size": 46209,
    "optimized_size": 2022,
    "reduction_percent": 95.62
  }
}