{
  "decision": "PENDING",
  "application_number": "15227227",
  "date_published": "20170216",
  "date_produced": "20170201",
  "title": "POWER DISTRIBUTION IN A DOCKING STATION",
  "filing_date": "20160803",
  "inventor_list": [
    {
      "inventor_name_last": "Schneider",
      "inventor_name_first": "Gerhard A.",
      "inventor_city": "Cupertino",
      "inventor_state": "CA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Krueger",
      "inventor_name_first": "Scott",
      "inventor_city": "San Francisco",
      "inventor_state": "CA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Watson",
      "inventor_name_first": "Robert D.",
      "inventor_city": "Santa Clara",
      "inventor_state": "CA",
      "inventor_country": "US"
    }
  ],
  "ipcr_labels": [
    "G06F116",
    "H04M104",
    "H02J700",
    "G06F118",
    "G06F126"
  ],
  "main_ipcr_label": "G06F116",
  "summary": "<SOH> SUMMARY <EOH>Accordingly, embodiments of the present invention may provide portable computing device docking stations that may facilitate the sharing or transfer of power among a portable computing device, a docking station, and one or more accessories. In various configurations of embodiments of the present invention, power may be provided by a portable computing device to one or both of a docking station and accessory, power may be provided by a docking station to one or both of a portable computing device and accessory, or it may be provided by the accessory to one or both of a docking station and portable computing device. For example, the accessory may be a charger that receives power from a wall or car outlet and provides power to a portable computing device via the docking station. In this example, power may be provided to the docking station by either the portable computing device or the charger accessory. An illustrative embodiment of the present invention may provide a docking station where power may be provided by an accessory to a portable computing device. In this embodiment of the present invention, a wire, power conductor, or other conduit may be provided through the docking station from a first connector arranged to mate with the portable computing device to a second connector arranged to connect to an accessory. This docking station may also be capable of providing power from a portable computing device to an accessory. In this embodiment of the present invention, a second wire, power conductor, or other conduit may be provided through the docking station from the first connector to the second connector. In this illustrative embodiment, a voltage received from an accessory at the second connector may appear at the first connector. When a portable computing device is not connected at the first connector, this voltage may be present at terminals of the first connector where it may be inadvertently contacted by a user or a user's property. Accord...",
  "patent_number": "None",
  "abstract": "Docking stations that may facilitate the sharing or transfer of power among a portable computing device, a docking station, and an accessory. One example may provide power from an accessory to a portable computing device. Switches may be used to avoid harm from inadvertent contact with voltages on exposed terminals. Another example may provide power directly from a battery on a portable computing device to an accessory. Another may limit this direct connection to a first type of accessory. Examples may limit a power connection to another type of accessory through a regulator. Another example may power one or more internal circuits either through a portable computing device or an accessory, depending on a mode of operation of the portable computing device.",
  "publication_number": "US20170045913A1-20170216",
  "_processing_info": {
    "original_size": 64433,
    "optimized_size": 3647,
    "reduction_percent": 94.34
  }
}