{
  "decision": "PENDING",
  "application_number": "15220366",
  "date_published": "20170302",
  "date_produced": "20170214",
  "title": "METHOD FOR CONTROLLING INFORMATION TERMINAL AND INFORMATION TERMINAL",
  "filing_date": "20160726",
  "inventor_list": [
    {
      "inventor_name_last": "TOYA",
      "inventor_name_first": "SHOICHI",
      "inventor_city": "Hyogo",
      "inventor_state": "",
      "inventor_country": "JP"
    }
  ],
  "ipcr_labels": [
    "G07C500",
    "G06F2186",
    "G07C508",
    "G05B19408",
    "G06Q3006"
  ],
  "main_ipcr_label": "G07C500",
  "summary": "<SOH> SUMMARY <EOH>One non-limiting and exemplary embodiment provides a method for controlling an information terminal and an information terminal that make it easier to properly manage a use state and the like of an electric storage device in a server device. In one general aspect, the techniques disclosed here feature a method including: (a) transmitting a signal for unlocking an electric storage device locked in an unusable state to the electric storage device at at least one of a timing after an operator's instruction to install a program, in an information terminal, for transmitting history information of a state of the electric storage device to a server device is accepted and a timing after an operator's instruction to activate the program in the information terminal is accepted. According to a method for controlling an information terminal and an information terminal of the present disclosure, it becomes easier to properly manage a use state and the like of an electric storage device in a server device. It should be noted that general or specific embodiments may be implemented as a system, a method, an integrated circuit, a computer program, a computer-readable storage medium such as a CD-ROM, or any selective combination thereof. Additional benefits and advantages of the disclosed embodiments will become apparent from the specification and drawings. The benefits and/or advantages may be individually obtained by the various embodiments and features of the specification and drawings, which need not all be provided in order to obtain one or more of such benefits and/or advantages.",
  "patent_number": "None",
  "abstract": "A method for controlling an information terminal includes: (a) transmitting a signal for unlocking an electric storage device locked in an unusable state to the electric storage device at at least one of a timing after a user's instruction to install a program, in an information terminal, for transmitting history information of a state of the electric storage device to a server device is accepted and a timing after a user's instruction to activate the program in the information terminal is accepted.",
  "publication_number": "US20170061709A1-20170302",
  "_processing_info": {
    "original_size": 76334,
    "optimized_size": 2712,
    "reduction_percent": 96.45
  }
}