{
  "date_produced": "20170927",
  "publication_number": "US20170293840A1-20171012",
  "main_ipcr_label": "G06N500",
  "decision": "PENDING",
  "application_number": "15223120",
  "inventor_list": [
    {
      "inventor_name_last": "Ceugniet",
      "inventor_name_first": "Xavier",
      "inventor_city": "Le Rouret",
      "inventor_state": "",
      "inventor_country": "FR"
    },
    {
      "inventor_name_last": "Chabrier",
      "inventor_name_first": "Alain",
      "inventor_city": "Madrid",
      "inventor_state": "",
      "inventor_country": "ES"
    },
    {
      "inventor_name_last": "Michel",
      "inventor_name_first": "Stephane",
      "inventor_city": "Roquefort les Pins",
      "inventor_state": "",
      "inventor_country": "FR"
    },
    {
      "inventor_name_last": "Van den Heever",
      "inventor_name_first": "Susara A.",
      "inventor_city": "Chateauneuf de Grasse",
      "inventor_state": "",
      "inventor_country": "FR"
    }
  ],
  "abstract": "A method, system and computer program product for generating a solution to an optimization problem. A received structured set of data is analyzed with the prescriptive domains to identify one or more prescriptive domains that match the received structure set of data in data structure and/or semantic terms. A user selection of one of the presented possible prescriptive intentions from the intention templates in the identified one or more prescriptive domains that match the received structure set of data in data structure and/or semantic terms is received. A prescriptive model is then generated from the prescriptive domain containing the selected prescriptive intention. The prescriptive model is translated into a technical prescriptive model using a set of mapping rules. Furthermore, the technical prescriptive model is translated into an optimization model. The optimization model is solved and an output defining a solution from the solved optimization model is presented.",
  "filing_date": "20160729",
  "patent_number": "None",
  "summary": "<SOH> SUMMARY <EOH>In one embodiment of the present invention, a computer implemented method for generating a solution to an optimization problem comprises receiving a structured set of data. The method further comprises accessing, by a processor, a plurality of prescriptive domains containing one or more templates, each template defining an intention, goal or constraint. The method additionally comprises analyzing, by the processor, the received structured set of data with the prescriptive domains to identify one or more prescriptive domains that match the received structure set of data in data structure and/or semantic terms. Furthermore, the method comprises presenting a plurality of possible prescriptive intentions from the intention templates in the identified one or more prescriptive domains that match the received structure set of data in data structure and/or semantic terms. Additionally, the method comprises receiving a user input selecting one of the presented plurality of possible prescriptive intentions. In addition, the method comprises generating, by the processor, a prescriptive model from the prescriptive domain containing the selected prescriptive intention, the prescriptive model comprising the structured set of data and one or more instances of templates defining goals and/or constraints from the prescriptive domain containing the selected prescriptive intention. The method further comprises translating, by the processor, the prescriptive model into a technical prescriptive model using a set of mapping rules to translate instances of the templates of the prescriptive domain into instances of templates of a technical prescriptive domain. The method additionally comprises translating, by the processor, the technical prescriptive model into an optimization model. Furthermore, the method comprises solving, by the processor, the optimization model. Additionally, the method comprises presenting an output defining a solution from the solved optimization ...",
  "date_published": "20171012",
  "title": "GENERATING A SOLUTION FOR AN OPTIMIZATION PROBLEM",
  "ipcr_labels": [
    "G06N500",
    "G06Q3002"
  ],
  "_processing_info": {
    "original_size": 82005,
    "optimized_size": 4000,
    "reduction_percent": 95.12
  }
}