{
  "date_produced": "20180117",
  "publication_number": "US20180032907A1-20180201",
  "main_ipcr_label": "G06N9900",
  "decision": "PENDING",
  "application_number": "15224434",
  "inventor_list": [
    {
      "inventor_name_last": "Mehdad",
      "inventor_name_first": "Yashar",
      "inventor_city": "San Jose",
      "inventor_state": "CA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Tetreault",
      "inventor_name_first": "Joel",
      "inventor_city": "New York",
      "inventor_state": "NY",
      "inventor_country": "US"
    }
  ],
  "abstract": "Methods and apparatus for detecting abusive language are disclosed. In one embodiment, a set of character N-grams is ascertained for a set of text. Feature values for a plurality of features of the set of text are determined, based, at least in part, on the set of character N-grams. A computer-generated model is applied to the feature values for the plurality of features to generate a score for the set of text, where the model includes a plurality of weights, each of the weights corresponding to one of the features. It may then be determined whether the set of text includes abusive language based, at least in part, on the score.",
  "filing_date": "20160729",
  "patent_number": "None",
  "summary": "<SOH> SUMMARY OF THE INVENTION <EOH>Methods and apparatus for detecting abusive language in text are disclosed. In one embodiment, a set of character N-grams is ascertained for a set of text posted via the Internet. Feature values for a plurality of features of the set of text are determined, based, at least in part, on the set of character N-grams. A model is applied to the feature values for the plurality of features to generate a score for the set of text, where the model includes a plurality of weights, each of the weights corresponding to one of the features. It may then be determined whether the set of text includes abusive language based, at least in part, on the score. In another embodiment, the invention pertains to a computing system comprising a processor and a memory. The computing system may be configured to perform one or more of the disclosed method operations. In another embodiment, the invention pertains to a computer readable storage medium having computer program instructions stored thereon that are arranged to perform one or more of the disclosed method operations. These and other features and advantages of the present invention will be presented in more detail in the following specification of the invention and the accompanying figures which illustrate by way of example the principles of the invention.",
  "date_published": "20180201",
  "title": "DETECTING ABUSIVE LANGUAGE USING CHARACTER N-GRAM FEATURES",
  "ipcr_labels": [
    "G06N9900",
    "G06F1730"
  ],
  "_processing_info": {
    "original_size": 48063,
    "optimized_size": 2684,
    "reduction_percent": 94.42
  }
}