{
  "date_produced": "20161102",
  "publication_number": "US20160335539A1-20161117",
  "main_ipcr_label": "G06N308",
  "decision": "PENDING",
  "application_number": "15223854",
  "inventor_list": [
    {
      "inventor_name_last": "Spagnola",
      "inventor_name_first": "Perry M.",
      "inventor_city": "Phoenix",
      "inventor_state": "AZ",
      "inventor_country": "US"
    }
  ],
  "abstract": "A method/apparatus/system for generating a request for improvement of a data object in a neural network is described herein. The neural network contains a plurality of data objects each made of an aggregation of content. The data objects of the neural network are interconnected based on one or several skill levels embodied in the content of the data objects via a plurality of connecting vectors. These connecting vectors can be generated and/or modified based on data collected from the iterative transversal of the connecting vectors by one or several users of the neural network.",
  "filing_date": "20160729",
  "patent_number": "None",
  "summary": "<SOH> BRIEF SUMMARY OF THE INVENTION <EOH>One aspect of the present disclosure relates to a machine learning system for generating a request for improvement of a data object in a neural network. The machine learning system includes a database server including data identifying a plurality of data objects including an aggregation of content associated with an assessment. In some embodiments, the plurality of data objects are included in a neural network. The database can include information associated with the data objects and identifying an aspect of the therewith associated data object. The machine learning system can include a content management server that can be controlled by software code to identify a set of the plurality of data objects, output a query requesting information relating to at least one of the set of the plurality of data objects from the database server, and identify a plurality of connecting vectors. In some embodiments, each of the plurality of connecting vectors connects at least two of the set of the plurality of data objects in a prerequisite relationship. In some embodiments, each of the plurality of connecting vectors includes a direction identifying the hierarchy of the prerequisite relationship and a magnitude, and in some embodiments, the magnitude of at least one of the plurality of connecting vector is the aggregate of binary indicators based on a user experience with the at least one of the plurality of connecting vectors generated via machine learning from iterated traversals of the connecting vector. The content management server that can be controlled by software code to determine a deficiency in the content of at least one of the data objects based on the magnitude of at least one connecting vector of the at least one of the data objects. In some embodiments, determining a deficiency in the content of at least one of the data objects based on the magnitude of at least one connecting vector of the at least one of the data objects ...",
  "date_published": "20161117",
  "title": "NEURAL NETWORKING SYSTEM AND METHODS",
  "ipcr_labels": [
    "G06N308"
  ],
  "_processing_info": {
    "original_size": 278948,
    "optimized_size": 3111,
    "reduction_percent": 98.88
  }
}