{
  "decision": "PENDING",
  "application_number": "15229405",
  "date_published": "20170112",
  "date_produced": "20161228",
  "title": "SMART WEARABLE DEVICES AND METHODS FOR ACQUISITION OF SENSORIAL INFORMATION FROM SMART DEVICES",
  "filing_date": "20160805",
  "inventor_list": [
    {
      "inventor_name_last": "Tanaka",
      "inventor_name_first": "Nobuo",
      "inventor_city": "Glen Rock",
      "inventor_state": "NJ",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Elgort",
      "inventor_name_first": "Vladimir",
      "inventor_city": "Staten Island",
      "inventor_state": "NY",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Danielson",
      "inventor_name_first": "Jacelyn",
      "inventor_city": "San Mateo",
      "inventor_state": "CA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Kalachev",
      "inventor_name_first": "Anton",
      "inventor_city": "Burlingame",
      "inventor_state": "CA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Wong",
      "inventor_name_first": "John",
      "inventor_city": "Morristown",
      "inventor_state": "NJ",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "DaCosta",
      "inventor_name_first": "Behram",
      "inventor_city": "San Jose",
      "inventor_state": "CA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Bhat",
      "inventor_name_first": "Udupi Ramanath",
      "inventor_city": "Mountain View",
      "inventor_state": "CA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Copere",
      "inventor_name_first": "Ludovic",
      "inventor_city": "San Jose",
      "inventor_state": "CA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Kataoka",
      "inventor_name_first": "Masaki",
      "inventor_city": "Port Washington",
      "inventor_state": "NY",
      "inventor_country": "US"
    }
  ],
  "ipcr_labels": [
    "G06F301",
    "G06F116"
  ],
  "main_ipcr_label": "G06F301",
  "summary": "<SOH> BRIEF SUMMARY <EOH>This disclosure describes embodiments of smart wearable devices and methods for acquiring sensorial data from surrounding smart wearable devices and non-wearable devices. This data may be used to fill in the gaps when a wearable smart device collects incomplete or inaccurate data from sensors configured to, for example, collect biological data about the user or environmental and contextual data about an activity the user is engaged in. In an example embodiment, a single smart wearable device user from a group of users or the smart wearable device itself may require additional information to improve accuracy of the data collected by its sensors or may require additional information to augment data collected about an experience or the contextual environment or to adjust the behavior of the smart wearable device based on the information collected by the surrounding sensors. An exemplary embodiment of the method provides the capability to discover missing sensor information collected by a group of smart wearable device sensors engaged in the same activity in order to recreate an environment or experience based on defined criteria, where each smart wearable device sensor has its own contribution to make to the total data set. Additionally, a signal may be triggered in response to collected sensor data to activate a function on other wearable or non-wearable devices or change the logic for data collection. Further aspects of the technology will be brought out in the following portions of the specification, wherein the detailed description is for the purpose of fully disclosing preferred embodiments of the technology without placing limitations thereon.",
  "patent_number": "None",
  "abstract": "Smart wearable devices and methods for acquiring sensorial data from surrounding smart devices are presented. In particular, the smart wearable device identifies surrounding smart devices that may provide additional sensorial data to the smart wearable device. The smart wearable device can use the acquired relevant sensorial data from surrounding devices to augment incomplete data, correct incorrect sensorial data, activate a function of its own or activate a function on one or more of the surrounding devices.",
  "publication_number": "US20170010666A1-20170112",
  "_processing_info": {
    "original_size": 44620,
    "optimized_size": 4006,
    "reduction_percent": 91.02
  }
}