{
  "date_produced": "20180117",
  "publication_number": "US20180032894A1-20180201",
  "main_ipcr_label": "G06N9900",
  "decision": "PENDING",
  "application_number": "15225210",
  "inventor_list": [
    {
      "inventor_name_last": "EPSTEIN",
      "inventor_name_first": "RYAN J.",
      "inventor_city": "DENVER",
      "inventor_state": "CO",
      "inventor_country": "US"
    }
  ],
  "abstract": "Systems and methods are provided for performing noise-resilient quantum operations. A set of control signals are applied to a system to provide a first Hamiltonian for the system. The system includes an array of physical qubits and a plurality of coupling mechanisms configured such that each pair of neighboring physical qubits within the array is coupled by an associated coupling mechanism. The first Hamiltonian represents, for each coupling mechanism, a coupling strength between zero and a maximum value. An adiabatic interpolation of the Hamiltonian of the system from the first Hamiltonian to a second Hamiltonian is performed. The second Hamiltonian represents, for at least one of the plurality of coupling mechanisms, a coupling strength different from that of the first Hamiltonian.",
  "filing_date": "20160801",
  "patent_number": "None",
  "summary": "<SOH> SUMMARY OF THE INVENTION <EOH>In accordance with an aspect of the present invention, a method is provided for performing a quantum operation on a logical qubit that is resilient to noise on control signals, on the individual physical qubits, and on the coupling strengths between physical qubits. A set of control signals are applied to a system to provide a first Hamiltonian for the system, which determines the energies of the quantum states of the system. The system includes an array of physical qubits and a plurality of coupling mechanisms configured such that each pair of neighboring physical qubits within the array is coupled by an associated coupling mechanism. The first Hamiltonian represents, for each coupling mechanism, a coupling strength between zero and a maximum value. An adiabatic interpolation of the Hamiltonian of the system from the first Hamiltonian to a second Hamiltonian is performed. The second Hamiltonian represents, for at least one of the plurality of coupling mechanisms, a coupling strength different from that of the first Hamiltonian. In accordance with another aspect of the present invention, a system is provided for performing quantum operations on a logical qubit that are to noise on control signals, on the individual physical qubits, and on the coupling strengths between physical qubits. The system includes an array of physical qubits and a plurality of coupling mechanisms configured such that each pair of neighboring physical qubits within the array is coupled by an associated coupling mechanism. A first set of at least one control mechanism is configured to tune respective coupling strengths of the plurality of coupling mechanisms. A second set of at least one control mechanism is configured to selectively apply a local field to each physical qubit of the array of physical qubits as to provide an energy splitting between the states of the physical qubit into eigenstates associated with a quantum operator. In accordance with yet an...",
  "date_published": "20180201",
  "title": "QUANTUM OPERATIONS WITH PASSIVE NOISE SUPPRESSION",
  "ipcr_labels": [
    "G06N9900",
    "H03K19195"
  ],
  "_processing_info": {
    "original_size": 50346,
    "optimized_size": 3346,
    "reduction_percent": 93.35
  }
}