{
  "decision": "PENDING",
  "application_number": "15229956",
  "date_published": "20180208",
  "date_produced": "20180124",
  "title": "DATA FLOW BASED FEATURE VECTOR CLUSTERING",
  "filing_date": "20160805",
  "inventor_list": [
    {
      "inventor_name_last": "Ahn",
      "inventor_name_first": "Yong-Yeol",
      "inventor_city": "Bloomington",
      "inventor_state": "IN",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Nematzadeh Chekuvar",
      "inventor_name_first": "Azadeh",
      "inventor_city": "Bloomington",
      "inventor_state": "IN",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Wood",
      "inventor_name_first": "Ian Benjamin",
      "inventor_city": "Bloomington",
      "inventor_state": "IN",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Park",
      "inventor_name_first": "Jaehyuk",
      "inventor_city": "Bloomington",
      "inventor_state": "IN",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Jing",
      "inventor_name_first": "Yizhi",
      "inventor_city": "Bloomington",
      "inventor_state": "IN",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Conover",
      "inventor_name_first": "Michael David",
      "inventor_city": "San Francisco",
      "inventor_state": "CA",
      "inventor_country": "US"
    }
  ],
  "ipcr_labels": [
    "G06F1730",
    "H04L2908"
  ],
  "main_ipcr_label": "G06F1730",
  "summary": "<SOH> BRIEF DESCRIPTION OF THE SEVERAL VIEWS OF THE DRAWINGS <EOH>Some embodiments are illustrated by way of example and not limitation in the accompanying drawings, in which: FIG. 1 is a block diagram of the functional modules or components that comprise a computer-network based social network service, including a skills clustering machine consistent with some embodiments described herein; FIG. 2 is a block diagram depicting some example modules of the clustering machine of FIG. 1 ; FIG. 3 is a flow diagram illustrating an example method of generating entity clusters and graphical representation to identify microindustries within a set of entity profiles of a social network system, according to some embodiments of the present disclosure; FIG. 4 is a flow diagram illustrating an example method of generating entity clusters and graphical representation to identify microindustries within a set of entity profiles of a social network system, according to some embodiments of the present disclosure; FIG. 5 is a flow diagram illustrating an example method of generating entity clusters and graphical representation to identify microindustries within a set of entity profiles of a social network system, according to some embodiments of the present disclosure; FIG. 6 is a flow diagram illustrating an example method of generating entity clusters and graphical representation to identify microindustries within a set of entity profiles of a social network system, according to some embodiments of the present disclosure; FIG. 7 is a flow diagram illustrating an example method of lead generation and generating tailored notifications and search results based on cluster revision, according to some embodiments of the present disclosure; and FIG. 8 is a block diagram of a machine in the form of a computing device within which a set of instructions, for causing the machine to perform any one or more of the methodologies discussed herein, may be executed. detailed-description description=\"D...",
  "patent_number": "None",
  "abstract": "Methods and systems for generating tailored user interface presentations based on microindustry clustering. According to various embodiments, the system accesses a set of entity profiles and a set of member profiles. The system determines a set of feature vectors for each entity of the set of entity profiles and identifies a set of movement data representing changes in association of one or more members from a first entity to a second entity. The system generates an entity graph for the set of entities and the set of members. The systems generate a first set of clusters in the entity graph, a second set of clusters by partitioning one or more of the first clusters, and a set of third clusters from the set of second clusters, combining one or more of the second clusters.",
  "publication_number": "US20180039688A1-20180208",
  "_processing_info": {
    "original_size": 84528,
    "optimized_size": 4095,
    "reduction_percent": 95.16
  }
}