{
  "date_produced": "20170119",
  "publication_number": "US20170032249A1-20170202",
  "main_ipcr_label": "G06N502",
  "decision": "PENDING",
  "application_number": "15224931",
  "inventor_list": [
    {
      "inventor_name_last": "CHOUGULE",
      "inventor_name_first": "Sandeep",
      "inventor_city": "Pune",
      "inventor_state": "",
      "inventor_country": "IN"
    },
    {
      "inventor_name_last": "KURMI",
      "inventor_name_first": "Anil Kumar",
      "inventor_city": "Pune",
      "inventor_state": "",
      "inventor_country": "IN"
    },
    {
      "inventor_name_last": "VIN",
      "inventor_name_first": "Harrick Mayank",
      "inventor_city": "Pune",
      "inventor_state": "",
      "inventor_country": "IN"
    },
    {
      "inventor_name_last": "KELKAR",
      "inventor_name_first": "Rahul Ramesh",
      "inventor_city": "Pune",
      "inventor_state": "",
      "inventor_country": "IN"
    },
    {
      "inventor_name_last": "KULKARNI",
      "inventor_name_first": "Sharmishtha Prakash",
      "inventor_city": "Pune",
      "inventor_state": "",
      "inventor_country": "IN"
    },
    {
      "inventor_name_last": "PATHAK",
      "inventor_name_first": "Amrish Shashikant",
      "inventor_city": "Pune",
      "inventor_state": "",
      "inventor_country": "IN"
    },
    {
      "inventor_name_last": "PALSHIKAR",
      "inventor_name_first": "Girish Keshav",
      "inventor_city": "Pune",
      "inventor_state": "",
      "inventor_country": "IN"
    },
    {
      "inventor_name_last": "PAWAR",
      "inventor_name_first": "Sachin",
      "inventor_city": "Pune",
      "inventor_state": "",
      "inventor_country": "IN"
    },
    {
      "inventor_name_last": "RAMRAKHIYANI",
      "inventor_name_first": "Nitin Vijaykumar",
      "inventor_city": "Pune",
      "inventor_state": "",
      "inventor_country": "IN"
    }
  ],
  "abstract": "System and method for automatic entity relationship (ER) model generation for services as software is disclosed. ER model generation by automated knowledge acquisition is disclosed, and automation of knowledge generation process is disclosed. Information extraction process is automated and multilevel validation of information extraction process is provided. System comprises training module to train information extraction model, and knowledge generation module for population of ER model. Standard Operators are generated based on the ER model so generated (populated). Context aware entity extraction is implemented for the ER model generation. System and method leverages existing ER model to make the system self-learning and intelligent, and provides common platform for knowledge generation from different data sources comprising documents, database, website, web corpus, and blog.",
  "filing_date": "20160801",
  "patent_number": "None",
  "summary": "<SOH> SUMMARY OF THE INVENTION <EOH>The following presents a simplified summary of some embodiments of the disclosure in order to provide a basic understanding of the embodiments. This summary is not an extensive overview of the embodiments. It is not intended to identify key/critical elements of the embodiments or to delineate the scope of the embodiments. Its sole purpose is to present some embodiments in a simplified form as a prelude to the more detailed description that is presented below. In view of the foregoing, according to an embodiment, a system and method for automatic entity relationship (ER) model generation for services as software is disclosed. The system comprises a user interface, a memory and a processor. The user interface provides a plurality of documents as a first input and an existing entity relationship model as a second input. The processor is in communication with the memory. The processor comprises a training module, a validation module, an extraction module and a knowledge generation module. The training module trains an information extraction model using the first input and the second input. The validation module validates the trained information extraction model. The extraction module extracts one or more features from the data source using the trained information extraction model. The knowledge generation module generates the entity relationship model using a set pattern based on one or more extracted features. In another embodiment, the system and method for Entity Relationship (ER) model generation by automated knowledge acquisition is disclosed. The system and method more particularly automates the knowledge generation process. In one aspect, the system and method automates an information extraction process and provides a multilevel validation of the information extraction process and extracted information. In another aspect, the system and method provides a training module to train an information extraction model, and a knowledge ...",
  "date_published": "20170202",
  "title": "Automatic Entity Relationship (ER) Model Generation for Services as Software",
  "ipcr_labels": [
    "G06N502",
    "G06N9900"
  ],
  "_processing_info": {
    "original_size": 57146,
    "optimized_size": 4647,
    "reduction_percent": 91.87
  }
}