{
  "date_produced": "20180117",
  "publication_number": "US20180032881A1-20180201",
  "main_ipcr_label": "G06N502",
  "decision": "PENDING",
  "application_number": "15223485",
  "inventor_list": [
    {
      "inventor_name_last": "Hosn",
      "inventor_name_first": "Rafah A.",
      "inventor_city": "New York",
      "inventor_state": "NY",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Moore",
      "inventor_name_first": "Robert J.",
      "inventor_city": "San Jose",
      "inventor_state": "CA",
      "inventor_country": "US"
    }
  ],
  "abstract": "Technical solutions are described for analyzing a natural language conversation-generating machine. The computer implemented method includes identifying, from a conversation log, a plurality of adjacency pairs. The method further includes determining, from the adjacency pairs, a number of adjacency pairs with outcome success indicators. The method further includes determining, from the adjacency pairs, a number of adjacency pairs with outcome failure indicators. The method further includes computing a mutual understanding score for the machine by computing a ratio of the number of adjacency pairs with outcome success indicators and the number of adjacency pairs with outcome failure indicators.",
  "filing_date": "20160729",
  "patent_number": "None",
  "summary": "<SOH> SUMMARY <EOH>According to one or more embodiments, a computer implemented method for analyzing a natural language conversation-generating machine includes identifying, from a conversation log, a plurality of adjacency pairs. The method further includes determining, from the adjacency pairs, a number of adjacency pairs with outcome success indicators. The method further includes determining, from the adjacency pairs, a number of adjacency pairs with outcome failure indicators. The method further includes computing a mutual understanding score for the machine by computing a ratio of the number of adjacency pairs with outcome success indicators and the number of adjacency pairs with outcome failure indicators. According to one or more embodiments, a system for analyzing a natural language conversation-generating machine includes a memory, and a processor coupled with the memory. The processor identifies, from a conversation log, a plurality of adjacency pairs. The processor also determines, from the adjacency pairs, a number of adjacency pairs with outcome success indicators. The processor also determines, from the adjacency pairs, a number of adjacency pairs with outcome failure indicators. The processor also computes a mutual understanding score for the machine by computing a ratio of the number of adjacency pairs with outcome success indicators and the number of adjacency pairs with outcome failure indicators. According to one or more embodiments, a computer program product for analyzing a natural language conversation-generating machine. The computer program product includes a computer readable storage medium. The computer readable storage medium includes computer executable instructions to identify, from a conversation log, a plurality of adjacency pairs. The computer program product also includes instructions to determine, from the adjacency pairs, a number of adjacency pairs with outcome success indicators. The computer program product also includes instru...",
  "date_published": "20180201",
  "title": "MEASURING MUTUAL UNDERSTANDING IN HUMAN-COMPUTER CONVERSATION",
  "ipcr_labels": [
    "G06N502",
    "G06F1728"
  ],
  "_processing_info": {
    "original_size": 97632,
    "optimized_size": 3411,
    "reduction_percent": 96.51
  }
}