{
  "decision": "PENDING",
  "application_number": "15229686",
  "date_published": "20170202",
  "date_produced": "20170119",
  "title": "RAIL CAR TERMINAL FACILITY STAGING",
  "filing_date": "20160805",
  "inventor_list": [
    {
      "inventor_name_last": "Benedict",
      "inventor_name_first": "Albert James",
      "inventor_city": "Calgary",
      "inventor_state": "",
      "inventor_country": "CA"
    }
  ],
  "ipcr_labels": [
    "G06Q1008",
    "B61L2700",
    "B61L2502",
    "B61L2504"
  ],
  "main_ipcr_label": "G06Q1008",
  "summary": "<SOH> SUMMARY OF THE INVENTION <EOH>According to the invention there is provided an apparatus for use in a system for transporting bulk goods comprising a plurality of rail cars arranged to be transported on a rail network to a rail car handling terminal, each rail car having at least one RFID tag including data identifying the rail car; the handling terminal comprising a plurality of rail track spur lines each for receiving one or more rail cars and a center control data hub, the apparatus comprising: a plurality of trackside-mounted scanning stations each for mounting adjacent to a respective one of the spur lines; a wide area point-to-point wireless communications network communicating with each of said scanning stations; each scanning station comprising a self-contained, weatherproof unit; each scanning station being self-powered utilizing solar energy or other sources so as not to require connection to an exterior power supply; each scanning station comprising an RFID reader having an antenna for powering and reading the RFID tag of an adjacent rail car; each scanning station comprising two radar proximity transducers mounted on the unit so that each is responsive to presence of a rail car at a predetermined distance along the respective spur line in a respective direction; said RFID reader having a quiescent mode in which power from the antenna is turned off from which mode the reader can be activated; said radar proximity detectors being always-on so as to detect the presence of the railcars and being arranged to activate the reader from the quiescent mode on detection of a railcar; said RFID reader being arranged to revert to the quiescent mode after reading the RFID tag of the railcar. Preferably the RFID reader is arranged to revert to the quiescent mode after a predetermined time period. However alternative arrangements for determining the step of reverting to the quiescent mode can be provided including for example the detection of the necessary data fro...",
  "patent_number": "None",
  "abstract": "Bulk goods are transported on a rail network to a terminal which includes a loading with a metering device for measuring an amount of the bulk goods loaded or unloaded. At the terminal there is a control hub connecting to a plurality of portable hand held field computers and a communication system for communication with the rail network to obtain a Car Location Message (CLM), a way bill and mechanical data for each of the railcars. An input to the hub is provided by a plurality of self-powered scanning stations each including an RFID reader having an antenna for reading the RFID tag of an adjacent rail car where each scanning station has two radar proximity transducers responsive to presence of a rail car where the RFID reader has a quiescent mode and the radar proximity detectors activate the reader from the quiescent mode on detection of a railcar.",
  "publication_number": "US20170032316A1-20170202",
  "_processing_info": {
    "original_size": 94797,
    "optimized_size": 3427,
    "reduction_percent": 96.38
  }
}