{
  "date_produced": "20180117",
  "publication_number": "US20180032856A1-20180201",
  "main_ipcr_label": "G06N304",
  "decision": "PENDING",
  "application_number": "15220578",
  "inventor_list": [
    {
      "inventor_name_last": "Alvarez-Icaza",
      "inventor_name_first": "Rodrigo",
      "inventor_city": "Mountain View",
      "inventor_state": "CA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Datta",
      "inventor_name_first": "Pallab",
      "inventor_city": "San Jose",
      "inventor_state": "CA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Kusnitz",
      "inventor_name_first": "Jeffrey A.",
      "inventor_city": "Campbell",
      "inventor_state": "CA",
      "inventor_country": "US"
    }
  ],
  "abstract": "Neuron placement in a neuromorphic system to minimize cumulative delivery delay is provided. In some embodiments, a neural network description describing a plurality of neurons is read. A relative delivery delay associated with each of the plurality of neurons is determined. An ordering of the plurality of neurons is determined to optimize cumulative delivery delay over the plurality of neurons. An optimized neural network description based on the ordering of the plurality of neurons is written.",
  "filing_date": "20160727",
  "patent_number": "None",
  "summary": "<SOH> BRIEF SUMMARY <EOH>According to one embodiment of the present invention, a method of and computer program product for optimizing neuron placement in a neuromorphic system are provided. A neural network description describing a plurality of neurons is read. A relative delivery delay associated with each of the plurality of neurons is determined. An ordering of the plurality of neurons is determined to optimize cumulative delivery delay over the plurality of neurons. An optimized neural network description based on the ordering of the plurality of neurons is written.",
  "date_published": "20180201",
  "title": "OPTIMIZING NEURON PLACEMENT IN A NEUROMORPHIC SYSTEM",
  "ipcr_labels": [
    "G06N304",
    "G06N3063"
  ],
  "_processing_info": {
    "original_size": 35238,
    "optimized_size": 1935,
    "reduction_percent": 94.51
  }
}