{
  "date_produced": "20170119",
  "publication_number": "US20170032281A1-20170202",
  "main_ipcr_label": "G06N9900",
  "decision": "PENDING",
  "application_number": "15222325",
  "inventor_list": [
    {
      "inventor_name_last": "Hsu",
      "inventor_name_first": "Christopher",
      "inventor_city": "Appleton",
      "inventor_state": "WI",
      "inventor_country": "US"
    }
  ],
  "abstract": "A weld production knowledge system for processing welding data collected from one of a plurality of welding systems, the weld production knowledge system comprising a communication interface communicatively coupled with a plurality of welding systems situated at one or more physical locations. The communication interface may be configured to receive, from one of said plurality of welding systems, welding data associated with a weld. The weld production knowledge system may comprise an analytics computing platform operatively coupled with the communication interface and a weld data store. The weld data store employs a dataset comprising (1) welding process data associated with said one or more physical locations, and/or (2) weld quality data associated with said one or more physical locations. The analytics computing platform may employ a weld production knowledge machine learning algorithm to analyze the welding data vis-à-vis the weld data store to identify a defect in said weld.",
  "filing_date": "20160728",
  "patent_number": "None",
  "summary": "<SOH> BRIEF SUMMARY <EOH>The invention relates to the art of machine learning, data mining, and artificial intelligence in welding fabrication production, in order to automate human decision-making process in welding equipment preventative/predictive maintenance (PPM) and condition-based maintenance (CBM), weld quality control and weld engineering. The invention further relates to a cloud based predictive analytics platform of welding knowledge service in mass production and manufacturing, for example, by supervised classification and unsupervised data mining and clustering, to minimize human interaction in welding production activities, such as welding operation, welding equipment maintenance, weld quality inspection and weld engineering. The invention is scalable and cost-effective mass customization approach to build individualized digital replica or digital twin or thread of the human decisions of pre-existing weld quality control and weld equipment maintenance functions in any factory. According to a first aspect, a welding system comprises: a first processing circuitry to process a first welding input from a first data source to define first welding data, wherein the first data source is associated with a weld, weldment, or weld process; a second processing circuitry to process a second welding input from a second data source to define second welding data, wherein the second data source is associated with the weld, weldment, or weld process; and a communication network communicatively coupled with the first processing circuitry, the second first processing circuitry, and a remotely situated analytics computing platform, wherein the communication network communicates the first welding data and the second welding data to said remotely situated analytics computing platform via a communication network, wherein the remotely situated analytics computing platform is facilitated via a cloud computing framework that employs a distributed and scalable file system runnin...",
  "date_published": "20170202",
  "title": "System and Method to Facilitate Welding Software as a Service",
  "ipcr_labels": [
    "G06N9900",
    "B23K9095",
    "H04L2908",
    "B23K3112",
    "G06N504",
    "G06N700"
  ],
  "_processing_info": {
    "original_size": 162633,
    "optimized_size": 3611,
    "reduction_percent": 97.78
  }
}