{
  "date_produced": "20180117",
  "publication_number": "US20180032893A1-20180201",
  "main_ipcr_label": "G06N9900",
  "decision": "PENDING",
  "application_number": "15225162",
  "inventor_list": [
    {
      "inventor_name_last": "EPSTEIN",
      "inventor_name_first": "RYAN J.",
      "inventor_city": "DENVER",
      "inventor_state": "CO",
      "inventor_country": "US"
    }
  ],
  "abstract": "Systems and methods are provided for performing a quantum gate operation. The system includes a first physical qubit, and a second physical qubit operatively coupled to the first physical qubit via a coupling mechanism. The first physical qubit, the second physical qubit, and the coupling mechanism form a logical qubit. At least one control mechanism is configured to provide a control signal to one of the first physical qubit, the second physical qubit, and the coupling mechanism as to adjust a Hamiltonian of the logical qubit.",
  "filing_date": "20160801",
  "patent_number": "None",
  "summary": "<SOH> SUMMARY OF THE INVENTION <EOH>In accordance with an aspect of the present invention, a system is provided for performing a quantum gate operation. The system includes a first physical qubit, and a second physical qubit operatively coupled to the first physical qubit via a coupling mechanism. The first physical qubit, the second physical qubit, and the coupling mechanism form a logical qubit. At least one control mechanism is configured to provide a control signal to one of the first physical qubit, the second physical qubit, and the coupling mechanism as to adjust a Hamiltonian of the logical qubit. In accordance with another aspect of the present invention, a method for performing a quantum gate is provided. Each of a first physical qubit and a second physical qubit are prepared in a ground state associated with a first Hamiltonian associated with the quantum gate. A first control signal is applied to the system such that a Hamiltonian of the system is the first Hamiltonian of the system. The system includes the first physical qubit, the second physical qubit, and a coupling mechanism configured such that, when active, quantum information can pass between the first physical qubit and the second physical qubit. An adiabatic interpolation of the Hamiltonian of the system from the first Hamiltonian to a second Hamiltonian is performed adiabatically. An adiabatic interpolation of the Hamiltonian of the system from the second Hamiltonian to a third Hamiltonian is performed adiabatically. In accordance with yet another aspect of the present invention, a method for performing a quantum gate is provided. Each of a first physical qubit and a second physical qubit are prepared in a ground state associated with a first Hamiltonian of a system comprising the first physical qubit, the second physical qubit, and a coupling mechanism configured such that, when a coupling strength of the coupling mechanism is non-zero, quantum information can pass between the first physical ...",
  "date_published": "20180201",
  "title": "QUANTUM GATES VIA MULTI-STEP ADIABATIC DRAG",
  "ipcr_labels": [
    "G06N9900",
    "G06F1582"
  ],
  "_processing_info": {
    "original_size": 49635,
    "optimized_size": 3078,
    "reduction_percent": 93.8
  }
}