{
  "date_produced": "20170119",
  "publication_number": "US20170032265A1-20170202",
  "main_ipcr_label": "G06N700",
  "decision": "PENDING",
  "application_number": "15224475",
  "inventor_list": [
    {
      "inventor_name_last": "Ingerson",
      "inventor_name_first": "Marc-Charles",
      "inventor_city": "Provo",
      "inventor_state": "UT",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Williams",
      "inventor_name_first": "Richard Nephi",
      "inventor_city": "Provo",
      "inventor_state": "UT",
      "inventor_country": "US"
    }
  ],
  "abstract": "Systems and methods for predicting ethical behavior using a psychometric instrument. The method involves: computing an ethical concern score based on a first group of ethical cognition items, a second group of ethical affect items, a third group of ethical conation items, and a fourth group of ethical courage items; computing an ethical consistency score; and computing an ethical integrity score based on the ethical concern score and the ethical consistency score.",
  "filing_date": "20160729",
  "patent_number": "None",
  "summary": "<SOH> BRIEF SUMMARY <EOH>The present invention provides a new operational definition of ethical integrity which incorporates cognition, affect, conation, and ethical courage for the purpose of predicting future ethical behavior. A new scale for the assessment of ethical integrity is presented. The Ethical Integrity Scale (EIS) assesses the extent to which persons report thinking positively about ethics and ethical matters, the extent to which persons report feeling positively towards such matters, and the extent to which persons intend to act affirmatively toward ethical matters. However, ethical action is often required in the face of reasons and pressures against it. Thus, the EIS adds an additional component to the attitude-like nature of integrity, namely, ethical courage. Ethical courage is conceptualized in terms of the extent to which persons report recognizing the importance of and actually acting ethically even in situations where it might be hard. The mean score across these four dimensions is described as ethical concern. Results showed that the attitude-like construct of ethical concern was the strongest predictor of future (un)ethical behavior. Various other embodiments, aspects, and features are described in greater detail below.",
  "date_published": "20170202",
  "title": "Computer Systems and Methods For Constructing and Validating A Psychometric Instrument For Predicting Ethical Behavior",
  "ipcr_labels": [
    "G06N700"
  ],
  "_processing_info": {
    "original_size": 87320,
    "optimized_size": 2491,
    "reduction_percent": 97.15
  }
}