{
  "decision": "PENDING",
  "application_number": "15220761",
  "date_published": "20180201",
  "date_produced": "20180117",
  "title": "CROSS-PLATFORM COMPUTER APPLICATION QUERY CATEGORIES",
  "filing_date": "20160727",
  "inventor_list": [
    {
      "inventor_name_last": "Singhal",
      "inventor_name_first": "Aman",
      "inventor_city": "Bellevue",
      "inventor_state": "WA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "De Barros",
      "inventor_name_first": "Marcelo M.",
      "inventor_city": "Redmond",
      "inventor_state": "WA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Mittal",
      "inventor_name_first": "Manish",
      "inventor_city": "Redmond",
      "inventor_state": "WA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Shenoy",
      "inventor_name_first": "Siddharth S.",
      "inventor_city": "Sammamish",
      "inventor_state": "WA",
      "inventor_country": "US"
    }
  ],
  "ipcr_labels": [
    "G06F1730"
  ],
  "main_ipcr_label": "G06F1730",
  "summary": "<SOH> SUMMARY <EOH>The tools and techniques discussed herein relate to cross-platform computer application query categories. In one aspect, the tools and techniques can include accessing a category application query. Also, a limited first set of search engine results can be retrieved from running the query, with the limited first set of results being limited to applications associated with a first set of one or more computer application platforms. Categories associated with applications referenced in the limited first set of results can be identified, and a category stamp can be generated for the query. The generating of the category stamp can include generating and comparing scores that are based at least in part upon quantities of applications in the limited first set of results that are associated with each of multiple categories. A limited second set of search engine results can be retrieved from running the query. The limited second set of results can be limited to applications associated with a second set of one or more application platforms, and the limited second set of results can be limited to applications in a category corresponding to the category stamp for the query. An application list for the query can be generated using the limited second set of search engine results, with the application list including references to applications from the limited second set of search engine results for the query. This Summary is provided to introduce a selection of concepts in a simplified form. The concepts are further described below in the Detailed Description. This Summary is not intended to identify key features or essential features of the claimed subject matter, nor is it intended to be used to limit the scope of the claimed subject matter. Similarly, the invention is not limited to implementations that address the particular techniques, tools, environments, disadvantages, or advantages discussed in the Background, the Detailed Description, or the attached dra...",
  "patent_number": "None",
  "abstract": "A limited first set of search engine results can be retrieved from running an application query, with the limited first set of results being limited to applications associated with a first set of application platform(s). Categories of applications referenced in the limited first set of results can be identified, and a category stamp can be generated for the query based on applications in the first set of results that are associated with each of multiple categories. A limited second set of search engine results can be retrieved from running the query. The limited second set of results can be limited to applications associated with a second set of application platform(s), with the second set of results being limited to applications in a category corresponding to the category stamp for the query. An application list for the query can be generated using the limited second set of results.",
  "publication_number": "US20180032522A1-20180201",
  "_processing_info": {
    "original_size": 86021,
    "optimized_size": 3887,
    "reduction_percent": 95.48
  }
}