{
  "date_produced": "20180117",
  "publication_number": "US20180032860A1-20180201",
  "main_ipcr_label": "G06N308",
  "decision": "PENDING",
  "application_number": "15222863",
  "inventor_list": [
    {
      "inventor_name_last": "TAN",
      "inventor_name_first": "Xuan",
      "inventor_city": "Sunnyvale",
      "inventor_state": "CA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "NEDOVIC",
      "inventor_name_first": "Nikola",
      "inventor_city": "San Jose",
      "inventor_state": "CA",
      "inventor_country": "US"
    }
  ],
  "abstract": "A method of updating a neural network may be provided. A method may include computing gradients for an operating matrix of a current layer of the neural network based on data of at least one of the current layer and at least other layer of the neural network. The method may also include updating the operating matrix based on the computed gradients. Further, the method may include updating an indexing matrix of the current layer based on the updated operating matrix.",
  "filing_date": "20160728",
  "patent_number": "None",
  "summary": "<SOH> SUMMARY <EOH>One or more embodiments of the present disclosure may include a method of updating a neural network. The method may include computing gradients for an operating matrix of a current layer of the neural network based on data of at least one of the current layer and at least other layer of the neural network. Further, the method may include updating the operating matrix based on the computed gradients. The method may also include updating an indexing matrix of the current layer based on the updated operating matrix. The object and advantages of the embodiments will be realized and achieved at least by the elements, features, and combinations particularly pointed out in the claims. Both the foregoing general description and the following detailed description are exemplary and explanatory and are not restrictive.",
  "date_published": "20180201",
  "title": "SELF-ADAPTIVE NEURAL NETWORKS",
  "ipcr_labels": [
    "G06N308",
    "G06N304"
  ],
  "_processing_info": {
    "original_size": 39494,
    "optimized_size": 1976,
    "reduction_percent": 95.0
  }
}