{
  "decision": "PENDING",
  "application_number": "15220798",
  "date_published": "20171130",
  "date_produced": "20171115",
  "title": "MANAGING AN EFFECTIVE ADDRESS TABLE IN A MULTI-SLICE PROCESSOR",
  "filing_date": "20160727",
  "inventor_list": [
    {
      "inventor_name_last": "GIRI",
      "inventor_name_first": "AKASH V.",
      "inventor_city": "AUSTIN",
      "inventor_state": "TX",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "LEVITAN",
      "inventor_name_first": "DAVID S.",
      "inventor_city": "AUSTIN",
      "inventor_state": "TX",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "PATEL",
      "inventor_name_first": "MEHUL",
      "inventor_city": "AUSTIN",
      "inventor_state": "TX",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "VAN NORSTRAND, JR.",
      "inventor_name_first": "ALBERT J.",
      "inventor_city": "ROUND ROCK",
      "inventor_state": "TX",
      "inventor_country": "US"
    }
  ],
  "ipcr_labels": [
    "G06F932",
    "G06F1336",
    "G06F935"
  ],
  "main_ipcr_label": "G06F932",
  "summary": "<SOH> SUMMARY <EOH>Methods and apparatus for managing an effective address table (EAT) in a multi-slice processor. Managing an EAT includes receiving, from an instruction sequence unit, a next-to-complete instruction tag (ITAG); obtaining, from the EAT, a first ITAG from a tail-plus-one EAT row, wherein the EAT comprises a tail EAT row that precedes the tail-plus-one EAT row; determining, based on a comparison of the next-to-complete ITAG and the first ITAG, that the tail EAT row has completed; and retiring the tail EAT row based on the determination. The foregoing and other objects, features and advantages of the invention will be apparent from the following more particular descriptions of exemplary embodiments of the invention as illustrated in the accompanying drawings wherein like reference numbers generally represent like parts of exemplary embodiments of the invention.",
  "patent_number": "None",
  "abstract": "Methods and apparatus for managing an effective address table (EAT) in a multi-slice processor including receiving, from an instruction sequence unit, a next-to-complete instruction tag (ITAG); obtaining, from the EAT, a first ITAG from a tail-plus-one EAT row, wherein the EAT comprises a tail EAT row that precedes the tail-plus-one EAT row; determining, based on a comparison of the next-to-complete ITAG and the first ITAG, that the tail EAT row has completed; and retiring the tail EAT row based on the determination.",
  "publication_number": "US20170344378A1-20171130",
  "_processing_info": {
    "original_size": 45183,
    "optimized_size": 2429,
    "reduction_percent": 94.62
  }
}