{
  "date_produced": "20170214",
  "publication_number": "US20170061329A1-20170302",
  "main_ipcr_label": "G06N9900",
  "decision": "PENDING",
  "application_number": "15224702",
  "inventor_list": [
    {
      "inventor_name_last": "KOBAYASHI",
      "inventor_name_first": "Kenichi",
      "inventor_city": "Kawasaki",
      "inventor_state": "",
      "inventor_country": "JP"
    },
    {
      "inventor_name_last": "URA",
      "inventor_name_first": "Akira",
      "inventor_city": "Yokohama",
      "inventor_state": "",
      "inventor_country": "JP"
    },
    {
      "inventor_name_last": "Ueda",
      "inventor_name_first": "Haruyasu",
      "inventor_city": "Ichikawa",
      "inventor_state": "",
      "inventor_country": "JP"
    }
  ],
  "abstract": "A machine learning management device executes each of a plurality of machine learning algorithms by using training data. The machine learning management device calculates, based on execution results of the plurality of machine learning algorithms, increase rates of prediction performances of a plurality of models generated by the plurality of machine learning algorithms, respectively. The machine learning management device selects, based on the increase rates, one of the plurality of machine learning algorithms and executes the selected machine learning algorithm by using other training data.",
  "filing_date": "20160801",
  "patent_number": "None",
  "summary": "<SOH> SUMMARY <EOH>According to one aspect, there is provided a non-transitory computer-readable recording medium storing a computer program that causes a computer to perform a procedure including: executing each of a plurality of machine learning algorithms by using training data; calculating, based on execution results of the plurality of machine learning algorithms, increase rates of prediction performances of a plurality of models generated by the plurality of machine learning algorithms, respectively; and selecting, based on the increase rates, one of the plurality of machine learning algorithms and executing the selected machine learning algorithm by using other training data. The object and advantages of the invention will be realized and attained by means of the elements and combinations particularly pointed out in the claims. It is to be understood that both the foregoing general description and the following detailed description are exemplary and explanatory and are not restrictive of the invention.",
  "date_published": "20170302",
  "title": "MACHINE LEARNING MANAGEMENT APPARATUS AND METHOD",
  "ipcr_labels": [
    "G06N9900",
    "G06N700"
  ],
  "_processing_info": {
    "original_size": 147965,
    "optimized_size": 2455,
    "reduction_percent": 98.34
  }
}