{
  "date_produced": "20170201",
  "publication_number": "US20170046626A1-20170216",
  "main_ipcr_label": "G06N9900",
  "decision": "PENDING",
  "application_number": "15228154",
  "inventor_list": [
    {
      "inventor_name_last": "DUA",
      "inventor_name_first": "Rubal",
      "inventor_city": "Riyadh",
      "inventor_state": "",
      "inventor_country": "SA"
    },
    {
      "inventor_name_last": "WHITE",
      "inventor_name_first": "Kenneth J.",
      "inventor_city": "Riyadh",
      "inventor_state": "",
      "inventor_country": "SA"
    },
    {
      "inventor_name_last": "MABREY",
      "inventor_name_first": "Daniel",
      "inventor_city": "Riyadh",
      "inventor_state": "",
      "inventor_country": "SA"
    },
    {
      "inventor_name_last": "LINDLAND",
      "inventor_name_first": "Rebecca A.",
      "inventor_city": "Riyadh",
      "inventor_state": "",
      "inventor_country": "SA"
    }
  ],
  "abstract": "A system and method for ex post counterfactual simulation to identify and estimate the non-members who could counterfactually be categorized in a specific group of interest, based on probabilistically matching “nearest” non-members to the group of interest.",
  "filing_date": "20160804",
  "patent_number": "None",
  "summary": "<SOH> SUMMARY OF THE INVENTION <EOH>The invention segments a population of individuals into different groups and for a specific group of interest, identifies and estimates the numbers of non-members who could ex post, counterfactually, be categorized into that specific group. It is ex post because all the individuals have already taken a decision because of which they are categorized into specific groups. And it is counterfactual because the invention identifies those non-members who could have been categorized into a specific group of interest, although based on their decision they do not belong to that specific group of interest. Thus, the invention helps in ex post counterfactual simulation, i.e., speculating what the distribution of population within the different groups might have been had an appropriate intervention been made. The invention has broad applicability in facilitating decision-making of users. One example occurs in health care, where the invention can be used to identify patients at risk of an illness, wherein an early intervention could help in preventing the onset of illness, or to identify patients who qualify for a new medical treatment. Another example includes estimating convertible voter share in elections, which would be of value to election campaign managers for identifying and targeting convertible voters. The invention also has commercial applications, such as identifying and targeting potential customers, or estimating the market size for a newly introduced product. The invention can also facilitate the identification and anticipation of low-probability, high-risk events, which can have both non-commercial, military or civil defense applications, as well as commercial applications for risk avoidance. These are only a few examples of commercial and non-commercial applications of the invention, and the list is not intended to be limiting. The above objects and further advantages are provided by the present invention which broadly comprehe...",
  "date_published": "20170216",
  "title": "SYSTEM AND METHOD FOR EX POST COUNTERFACTUAL SIMULATION",
  "ipcr_labels": [
    "G06N9900",
    "G06N700"
  ],
  "_processing_info": {
    "original_size": 43613,
    "optimized_size": 3250,
    "reduction_percent": 92.55
  }
}