{
  "date_produced": "20170802",
  "publication_number": "US20170236056A1-20170817",
  "main_ipcr_label": "G06N308",
  "decision": "PENDING",
  "application_number": "15226196",
  "inventor_list": [
    {
      "inventor_name_last": "Shan",
      "inventor_name_first": "Ying",
      "inventor_city": "Sammamish",
      "inventor_state": "WA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Hoens",
      "inventor_name_first": "Thomas Ryan",
      "inventor_city": "Bellevue",
      "inventor_state": "WA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Jiao",
      "inventor_name_first": "Jian",
      "inventor_city": "Bothell",
      "inventor_state": "WA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Wang",
      "inventor_name_first": "Haijing",
      "inventor_city": "Sammamish",
      "inventor_state": "WA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Yu",
      "inventor_name_first": "Dong",
      "inventor_city": "Bothell",
      "inventor_state": "WA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Mao",
      "inventor_name_first": "JC",
      "inventor_city": "Bellevue",
      "inventor_state": "WA",
      "inventor_country": "US"
    }
  ],
  "abstract": "Systems and methods for providing a predictive framework are provided. The predictive framework comprises plural neural layers of adaptable, executable neurons. Neurons accept one or more input signals and produce an output signal that may be used by an upper-level neural layer. Input signals are received by an encoding neural layer, where there is a 1:1 correspondence between an input signal and an encoding neuron. Input signals for a set of data are received at the encoding layer and processed successively by the plurality of neural layers. An objective function utilizes the output signals of the topmost neural layer to generate predictive results for the data set according to an objective. In one embodiment, the objective is to determine the likelihood of user interaction with regard to a specific item of content in a set of search results, or the likelihood of user interaction with regard to any item of content in a set of search results.",
  "filing_date": "20160802",
  "patent_number": "None",
  "summary": "<SOH> SUMMARY <EOH>The following Summary is provided to introduce a selection of concepts in a simplified form that are further described below in the Detailed Description. The Summary is not intended to identify key features or essential features of the claimed subject matter, nor is it intended to be used to limit the scope of the claimed subject matter. According to aspects of the disclosed subject matter, systems and methods for providing a predictive framework are provided. The predictive framework comprises plural neural layers of adaptable, executable neurons. Neurons accept one or more input signals and produce an output signal that may be used by an upper-level neural layer. Input signals are received by an encoding neural layer, where there is a 1:1 correspondence between an input signal and an encoding neuron. Input signals for a set of data are received at the encoding layer and processed successively by the plurality of neural layers. An objective function utilizes the output signals of the topmost neural layer to generate predictive results for the data set according to an objective. In one embodiment, the objective is to determine the likelihood of user interaction with regard to a specific item of content in a set of search results, or the likelihood of user interaction with regard to any item of content in a set of search results. According to additional aspects of the disclosed subject matter, a computer-implemented framework for providing predicted results is presented. The framework comprises a plurality of neural layers including a plurality of middle neural layers and an encoding layer. The framework also comprises an objective function. Regarding the plurality of neural layers, each neural layer comprises a plurality of neurons, where each neuron is an executable object that accepts one or more inputs and generates an output. The encoding layer is the first neural layer and comprises a plurality of encoding neurons having a 1:1 correspondence ...",
  "date_published": "20170817",
  "title": "AUTOMATED PREDICTIVE MODELING AND FRAMEWORK",
  "ipcr_labels": [
    "G06N308",
    "G06F1730"
  ],
  "_processing_info": {
    "original_size": 65243,
    "optimized_size": 4211,
    "reduction_percent": 93.55
  }
}