{
  "date_produced": "20180117",
  "publication_number": "US20180032875A1-20180201",
  "main_ipcr_label": "G06N502",
  "decision": "PENDING",
  "application_number": "15221661",
  "inventor_list": [
    {
      "inventor_name_last": "Bostick",
      "inventor_name_first": "James E.",
      "inventor_city": "Cedar Park",
      "inventor_state": "TX",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Ganci, JR.",
      "inventor_name_first": "John M.",
      "inventor_city": "Cary",
      "inventor_state": "NC",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Keen",
      "inventor_name_first": "Martin G.",
      "inventor_city": "Cary",
      "inventor_state": "NC",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Rakshit",
      "inventor_name_first": "Sarbajit K.",
      "inventor_city": "Kolkata",
      "inventor_state": "",
      "inventor_country": "IN"
    }
  ],
  "abstract": "A set of data is received at a server from a corresponding set of mobile devices. At the server, a first data in the set of data is analyzed, the first data being received from a first device in the set of mobile devices, the analyzing detecting an event of interest in the first data, the event occurring in a first geographical area. Using the event, a future event is predicted in a second geographical area. A target area is computed, where the target area includes a location where the future event is likely to occur. A notification about the future event is sent to a second set of devices located in the target area.",
  "filing_date": "20160728",
  "patent_number": "None",
  "summary": "<SOH> SUMMARY <EOH>The illustrative embodiments provide a method, system, and computer program product. An embodiment includes a method that receives, at a server, a set of data is received from a corresponding set of mobile devices. The embodiment analyzes, at the server, a first data in the set of data, the first data being received from a first device in the set of mobile devices, the analyzing detecting an event of interest in the first data, the event occurring in a first geographical area. The embodiment predicts, using the event, a future event in a second geographical area. The embodiment computes a target area, wherein the target area includes a location where the future event is likely to occur. The embodiment sends a notification about the future event to a second set of devices located in the target area. An embodiment includes a computer usable program product. The computer usable program product includes one or more computer-readable storage devices, and program instructions stored on at least one of the one or more storage devices. An embodiment includes a computer system. The computer system includes one or more processors, one or more computer-readable memories, and one or more computer-readable storage devices, and program instructions stored on at least one of the one or more storage devices for execution by at least one of the one or more processors via at least one of the one or more memories.",
  "date_published": "20180201",
  "title": "EVENT DETECTION AND PREDICTION WITH COLLABORATING MOBILE DEVICES",
  "ipcr_labels": [
    "G06N502"
  ],
  "_processing_info": {
    "original_size": 72261,
    "optimized_size": 3054,
    "reduction_percent": 95.77
  }
}