{
  "date_produced": "20170125",
  "publication_number": "US20170039472A1-20170209",
  "main_ipcr_label": "G06N308",
  "decision": "PENDING",
  "application_number": "15228314",
  "inventor_list": [
    {
      "inventor_name_last": "KUDO",
      "inventor_name_first": "Kiwamu",
      "inventor_city": "Kamakura",
      "inventor_state": "",
      "inventor_country": "JP"
    }
  ],
  "abstract": "According to an embodiment, a machine learning apparatus includes an interlayer accelerator. The interlayer accelerator includes interlayer units that generate, based on (a) an input vector of a first layer included in a neural network that includes three or more layers and (b) a learning weight matrix of the first layer, an input vector of a second layer next to the first layer. Each of the interlayer units includes a coupled oscillator array. The coupled oscillator array includes oscillators that oscillate at frequencies corresponding to differences between elements of the input vector of the first layer and elements of a row vector that is one row of the learning weight matrix, and combines oscillated signals generated by the oscillators to obtain a calculated signal.",
  "filing_date": "20160804",
  "patent_number": "None",
  "summary": "<SOH> BRIEF DESCRIPTION OF THE DRAWINGS <EOH>FIG. 1 is a block diagram illustrating an interlayer accelerator included in a machine learning apparatus according to the first embodiment. FIG. 2 is a block diagram showing the machine learning apparatus according to the first embodiment. FIG. 3 is an explanatory diagram of an operation of the oscillator in FIG. 1 . FIG. 4 is an explanatory diagram of an interlayer matrix product calculation in a multilayer neural network. FIG. 5 is an explanatory diagram of an operation of a spin torque oscillator used by an interlayer accelerator included in a machine learning apparatus according to the second embodiment. FIG. 6 illustrates a hybrid chip included in a machine learning apparatus according to the third embodiment. FIG. 7 illustrates a hybrid chip included in a machine learning apparatus according to the fourth embodiment. FIG. 8 is a bird's-eye view of the hybrid chip of FIG. 7 . FIG. 9 is a graph illustrating dependency properties of an STO in FIG. 7 on a current and a magnetic field. detailed-description description=\"Detailed Description\" end=\"lead\"?",
  "date_published": "20170209",
  "title": "MACHINE LEARNING APPARATUS",
  "ipcr_labels": [
    "G06N308"
  ],
  "_processing_info": {
    "original_size": 41740,
    "optimized_size": 2407,
    "reduction_percent": 94.23
  }
}