{
  "date_produced": "20180117",
  "publication_number": "US20180032883A1-20180201",
  "main_ipcr_label": "G06N504",
  "decision": "PENDING",
  "application_number": "15221587",
  "inventor_list": [
    {
      "inventor_name_last": "Sullivan",
      "inventor_name_first": "Brendan M.",
      "inventor_city": "Harvard",
      "inventor_state": "MA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Karthikeyan",
      "inventor_name_first": "Gopikrishna",
      "inventor_city": "London",
      "inventor_state": "",
      "inventor_country": "GB"
    },
    {
      "inventor_name_last": "Liu",
      "inventor_name_first": "Zuli",
      "inventor_city": "Sunnyvale",
      "inventor_state": "CA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Massa",
      "inventor_name_first": "Wouter Lode Paul",
      "inventor_city": "Seattle",
      "inventor_state": "WA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Gupta",
      "inventor_name_first": "Mahima",
      "inventor_city": "Mountain View",
      "inventor_state": "CA",
      "inventor_country": "US"
    }
  ],
  "abstract": "An online system uses classifiers to predict the socioeconomic group of users of the online system. The classifiers use models that are trained using features based on global information about a population of users such as demographic information, device ownership, internet usage, household data, and socioeconomic status. The global information can be aggregated from market research questionnaires and provided to the online system. The classifiers input information about a user and output a probability that the user belongs to a given socioeconomic group. The input information is based on a user profile on the online system associated with the user as well as actions performed by the user on the online system. Thus, the online system can predict the user's socioeconomic group without using the user's income information. The online system can generate content for presentation to the user based on the predicted socioeconomic group.",
  "filing_date": "20160727",
  "patent_number": "None",
  "summary": "<SOH> SUMMARY <EOH>An online system uses classifiers to predict the socioeconomic group of users of the online system. The classifiers use models that are trained using features based on global information about a population of users such as demographic information, device ownership, internet usage, household data, and socioeconomic status. The global information can be aggregated from market research questionnaires and provided to the online system. The classifiers input information about a user and outputs a probability that the user belongs to a given socioeconomic group. The input information is based on a user profile on the online system associated with the user as well as actions performed by the user on the online system. Thus, the online system can predict the user's socioeconomic group without using the user's income information. In some embodiments, the online system generates content for presentation to the user based on the predicted socioeconomic group. The content can include sponsored content provided by a third party to the online system. For example, the third party is an entity that offers a product or service and wants to raise awareness of the product or service to target users of the online system belonging to a particular socioeconomic group. Thus, by predicting the socioeconomic groups of users, the online system is able to help the third party present sponsored content to the target users. Third parties are able to effectively promote their products or services, and the online system can provide a more engaging user experience to users by generating content that are more likely to interest users based on their predicted socioeconomic group. According to one embodiment, a method begins with receiving user information about a target user of an online system. The user information describes a user profile on the online system associated with the target user and describes actions performed by the target user on the online system. Next, the online...",
  "date_published": "20180201",
  "title": "SOCIOECONOMIC GROUP CLASSIFICATION BASED ON USER FEATURES",
  "ipcr_labels": [
    "G06N504",
    "G06N9900"
  ],
  "_processing_info": {
    "original_size": 58382,
    "optimized_size": 4103,
    "reduction_percent": 92.97
  }
}