{
  "decision": "PENDING",
  "application_number": "15223458",
  "date_published": "20171109",
  "date_produced": "20171025",
  "title": "GEOGRAPHIC SELECTION SYSTEM BASED ON RESOURCE ALLOCATION AND DISTRIBUTION",
  "filing_date": "20160729",
  "inventor_list": [
    {
      "inventor_name_last": "Dintenfass",
      "inventor_name_first": "Katherine",
      "inventor_city": "Lincoln",
      "inventor_state": "RI",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Nagalingam",
      "inventor_name_first": "Vasudevan",
      "inventor_city": "Wayland",
      "inventor_state": "MA",
      "inventor_country": "US"
    }
  ],
  "ipcr_labels": [
    "G06Q4006",
    "G06F30482"
  ],
  "main_ipcr_label": "G06Q4006",
  "summary": "<SOH> BRIEF SUMMARY <EOH>Usage of finite resources in a period of possible resource depletion can be difficult to navigate. Inefficient usage of resources can cause early depletion. Different geographic areas may provide differentiation in resource requirements, which can effect resource usage. By surveying the differences in geographic locations and determining optimized efficient resource usage, a system can provide an optimization resource usage plan. Embodiments of the present invention address the above needs and/or achieve other advantages by providing apparatuses (e.g., a system, computer program product, and/or other device) and methods that improve resource usage planning, such as retirement planning, for users (e.g., customers) and allows the users to factor in different variables (e.g., age, spending amounts over time, events that may affect retirement planning, or the like). In some embodiments, the invention generates and maintains of a modeling tool for pre-retirees for determination of location of living when aging. The modeling tool may take into consideration costs for assisted living, medical expenses, user's budget and expenses, remodeling of current home requirements, and the like. The model may determine or provide options and prices for aging in place or in a care facility. The model would compare costs to living in home, including modifications to the home required for living in place, home health care, and the like compared to costs of care facilities in the area. The model is generated based on finances and health, such as illnesses, or the like that may impact the living selection. Decision tool may be provided to trusted family members, doctors for input on determination, and insurance providers. Furthermore, the model may be integrated with a mechanism for the sharing of information to trusted individuals throughout the process of modeling such that the decision processing may be taking place during the process and not specifically presen...",
  "patent_number": "None",
  "abstract": "Embodiments of the invention are directed to a system, method, or computer program product for triggering of living option resource allocation. In some embodiments, the invention provides a system for triggering of a model generation for location selection. As such, the system may interconnect with market analysis devices, medical devices, and home repair associates to determine resource availability and requirement for location selection. In this way, the system generates a real-time interactive indication of location selection for the user. Furthermore, a decision tool may be linked to a trusted individual associated with the user and provided upon generation to the individual.",
  "publication_number": "US20170323384A1-20171109",
  "_processing_info": {
    "original_size": 140311,
    "optimized_size": 3422,
    "reduction_percent": 97.56
  }
}