{
  "date_produced": "20180109",
  "publication_number": "US20180025281A1-20180125",
  "main_ipcr_label": "G06N504",
  "decision": "PENDING",
  "application_number": "15223268",
  "inventor_list": [
    {
      "inventor_name_last": "Bose",
      "inventor_name_first": "Pradip",
      "inventor_city": "Yorktown Heights",
      "inventor_state": "NY",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Buyuktosunoglu",
      "inventor_name_first": "Alper",
      "inventor_city": "White Plains",
      "inventor_state": "NY",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Vega",
      "inventor_name_first": "Augusto Javier",
      "inventor_city": "Astoria",
      "inventor_state": "NY",
      "inventor_country": "US"
    }
  ],
  "abstract": "Techniques for implementing a safety protocol are provided. In one example, a system is provided that can execute a machine-learned model to determine cognitive data representing a prediction about a state of an environment and an action to be performed in response to the prediction. The system can determine that a connection with a remote device is unavailable, and in response activate a safety protocol.",
  "filing_date": "20160729",
  "patent_number": "None",
  "summary": "<SOH> SUMMARY <EOH>The following presents a summary to provide a basic understanding of one or more embodiments of the invention. This summary is not intended to identify key or critical elements, or delineate any scope of the particular embodiments or any scope of the claims. Its sole purpose is to present concepts in a simplified form as a prelude to the more detailed description that is presented later. In one or more embodiments described herein, systems, computer-implemented methods, apparatus and/or computer program products that facilitate synchronization of processing components for parallel deep learning are described. According to an embodiment of the present invention, a first system can comprise a memory that stores computer executable components and a processor that executes computer executable components stored in the memory. The computer executable components can comprise a communication component that receives context data. The context data can be received from a first device. The context data can be or comprise extrinsic data monitored by a sensor device. The computer executable components can comprise a cognitive server component that can determine first model data. Determination of the first model data can be based on a machine-learning analysis of the context data. The first model data can be or comprise an artificial intelligence-based model trained to interpret the context data. The communication component can transmit the first model data to the first device. In some embodiments, elements described in connection with the system can be embodied in different forms such as a computer-implemented method, a computer program product, or another form. According to another embodiment, a system can comprise a memory that stores computer executable components and a processor that executes computer executable components stored in the memory. The computer executable components can comprise a cognitive agent component that determines cognitive data. The co...",
  "date_published": "20180125",
  "title": "COGNITIVE COMPUTING FOR SERVERS AND MOBILE DEVICES",
  "ipcr_labels": [
    "G06N504",
    "G06N9900",
    "G06N700"
  ],
  "_processing_info": {
    "original_size": 100866,
    "optimized_size": 3283,
    "reduction_percent": 96.75
  }
}