{
  "date_produced": "20180117",
  "publication_number": "US20180032899A1-20180201",
  "main_ipcr_label": "G06N9900",
  "decision": "PENDING",
  "application_number": "15220877",
  "inventor_list": [
    {
      "inventor_name_last": "Nguyen",
      "inventor_name_first": "David Tong",
      "inventor_city": "Newark",
      "inventor_state": "CA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Mahler",
      "inventor_name_first": "Paul Justin",
      "inventor_city": "San Jose",
      "inventor_state": "CA",
      "inventor_country": "US"
    }
  ],
  "abstract": "A computer system constructs a decision-predictive recipient profile using sensatory data tied to an online profile of a recipient. After obtaining base sensatory data tied to the online profile of the recipient, the system may filter the base sensatory data by searching the base sensatory data for one or more machine-cognizable characteristics. The filtered sensatory data may be provided to an execution group, which may review displays of the sensatory data. Responsive to the displays of the sensatory data, the execution group may generate descriptors of the content of the filtered sensatory data and send the descriptors to the system. The system may process the descriptors to generate or augment the decision-predictive recipient profile.",
  "filing_date": "20160727",
  "patent_number": "None",
  "summary": "<SOH> BRIEF DESCRIPTION OF THE DRAWINGS <EOH>FIG. 1 shows example profile circuitry. FIG. 2 shows example profile logic. FIG. 3 shows an example analysis by profile logic of an image file. FIG. 4 shows an example analysis by profile logic of an audio file. FIG. 5 shows an example Recipient Genome (RGe) system architecture. FIG. 6 shows example logic 600 for RGe construction. FIG. 7 shows an example specific execution environment. FIG. 8 shows an example network environment. FIG. 9 shows an example processing environment for execution group review of sensatory data. FIG. 10 shows an example visualization of a RGe. detailed-description description=\"Detailed Description\" end=\"lead\"?",
  "date_published": "20180201",
  "title": "COMPLEX SYSTEM ARCHITECTURE FOR SENSATORY DATA BASED DECISION-PREDICTIVE PROFILE CONSTRUCTION AND ANALYSIS",
  "ipcr_labels": [
    "G06N9900",
    "G06N502"
  ],
  "_processing_info": {
    "original_size": 70308,
    "optimized_size": 2198,
    "reduction_percent": 96.87
  }
}