{
  "decision": "PENDING",
  "application_number": "15229393",
  "date_published": "20170112",
  "date_produced": "20161228",
  "title": "SMART WEARABLE DEVICES AND METHODS FOR ACQUISITION OF SENSORIAL INFORMATION FROM WEARABLE DEVICES TO ACTIVATE FUNCTIONS IN OTHER DEVICES",
  "filing_date": "20160805",
  "inventor_list": [
    {
      "inventor_name_last": "Tanaka",
      "inventor_name_first": "Nobuo",
      "inventor_city": "Glen Rock",
      "inventor_state": "NJ",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Elgort",
      "inventor_name_first": "Vladimir",
      "inventor_city": "Staten Island",
      "inventor_state": "NY",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Danielson",
      "inventor_name_first": "Jacelyn",
      "inventor_city": "San Mateo",
      "inventor_state": "CA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Kalachev",
      "inventor_name_first": "Anton",
      "inventor_city": "Burlingame",
      "inventor_state": "CA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Wong",
      "inventor_name_first": "John",
      "inventor_city": "Morristown",
      "inventor_state": "NJ",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "DaCosta",
      "inventor_name_first": "Behram",
      "inventor_city": "San Jose",
      "inventor_state": "CA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Bhat",
      "inventor_name_first": "Udupi Ramanath",
      "inventor_city": "Mountain View",
      "inventor_state": "CA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Copere",
      "inventor_name_first": "Ludovic",
      "inventor_city": "San Jose",
      "inventor_state": "CA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Kataoka",
      "inventor_name_first": "Masaki",
      "inventor_city": "Port Washington",
      "inventor_state": "NY",
      "inventor_country": "US"
    }
  ],
  "ipcr_labels": [
    "G06F301",
    "H04L2906",
    "G06F116"
  ],
  "main_ipcr_label": "G06F301",
  "summary": "<SOH> BRIEF SUMMARY <EOH>A secure network of wearable and non-wearable devices and status monitoring methods is provided that authenticates the identity of the user of the smart wearable device using biometrics, such as a user's heart rate signature. Access authorization between devices may also require authentication of the user. For example, activation or deactivation of other devices may occur only if the user of the wearable device is authenticated using some biometric signature of the user from a wearable device. Sensitive sensor data would not be transferred to another device without the proper biometric authentication. Authentication does not require any affirmative action on the part of the user such as entering a password. In one embodiment, a smart wearable device is provided that includes at least one biological or physiological sensor for acquiring biological input about the user. This input may be acquired through automatically sensing and collecting biological information about the user and may be supplemented with user input or input from other health care providers. Sensors placed on or around an individual can acquire biological or physical data in real time. Both non-invasive and invasive sensors, alone or collectively, can produce data that can be processed to determine the physical or mental status of the user at an instant or to identify trends over time. Multiple sensors with the capability of collecting biological or physical data (heart rate, blood oxygen and sugar levels, body temperature and etc.) of a user can be applied with the use of wearable devices. Other associated sensors can collect data on the environment including location, altitude, air pollution, pollen count, distance traveled, and external temperature etc. that can be considered within the context of the sensor data obtained from a particular user of sensors of a wearable device. Information regarding the location and environmental context of the wearer of wearable sensor dev...",
  "patent_number": "None",
  "abstract": "Smart wearable devices and methods for acquiring sensor data about a user to determine the physical and mental status of the user and automatically activate or deactivate other devices when authenticated by biometric security access specific to the wearer are presented. Specifically, the smart wearable device can automatically acquire a user's biological input, such as heart rate, breathing, body temperature, etc. and based on the input, automatically activate or deactivate a function in another device by sending a triggering signal to the other device.",
  "publication_number": "US20170010665A1-20170112",
  "_processing_info": {
    "original_size": 71413,
    "optimized_size": 4408,
    "reduction_percent": 93.83
  }
}