{
  "decision": "ACCEPTED",
  "application_number": "15228185",
  "date_published": "20170817",
  "date_produced": "20170802",
  "title": "LOW-PROFILE SWING GATE TO SUPPORT SERVICE ELEMENT INTERFACE HARDWARE",
  "filing_date": "20160804",
  "inventor_list": [
    {
      "inventor_name_last": "Ecker",
      "inventor_name_first": "Richard M.",
      "inventor_city": "Poughkeepsie",
      "inventor_state": "NY",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "McIntosh",
      "inventor_name_first": "Steven C.",
      "inventor_city": "Kingston",
      "inventor_state": "NY",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Mullady",
      "inventor_name_first": "Robert K.",
      "inventor_city": "Highland",
      "inventor_state": "NY",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Torok",
      "inventor_name_first": "John G.",
      "inventor_city": "Poughkeepsie",
      "inventor_state": "NY",
      "inventor_country": "US"
    }
  ],
  "ipcr_labels": [
    "G06F116",
    "H05K716",
    "H05K714"
  ],
  "main_ipcr_label": "G06F116",
  "summary": "<SOH> SUMMARY <EOH>According to one embodiment of the present invention, an apparatus for positioning service elements is provided. The apparatus comprises: a gate affixed to a computing rack by a gate hinge, wherein the gate hinge rotates on a vertical axis; a first tray affixed to the gate at a side edge of the first tray; a second tray affixed to the first tray at a bottom edge of the first tray by a hinge that rotates on a horizontal axis; a first display and a first keyboard affixed to an outer surface of the first tray; and a second display and a second keyboard affixed to an outer surface of the second tray.",
  "patent_number": "9921606",
  "abstract": "An apparatus for positioning service element interface devices is provided. A gate is affixed to a computing rack by a gate hinge, wherein the gate hinge rotates on a first axis. A first tray affixed to the gate at a side edge of the first tray. A second tray affixed to the first tray at a bottom edge of the first tray by a hinge that rotates on a second axis that is perpendicular to the first axis. A first display and a first keyboard affixed to an outer surface of the first tray. A second display and a second keyboard affixed to an outer surface of the second tray.",
  "publication_number": "US20170235329A1-20170817",
  "_processing_info": {
    "original_size": 36491,
    "optimized_size": 2232,
    "reduction_percent": 93.88
  }
}