{
  "date_produced": "20180124",
  "publication_number": "US20180039908A1-20180208",
  "main_ipcr_label": "G06N9900",
  "decision": "PENDING",
  "application_number": "15231492",
  "inventor_list": [
    {
      "inventor_name_last": "WANG",
      "inventor_name_first": "HAOHONG",
      "inventor_city": "San Jose",
      "inventor_state": "CA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "REN",
      "inventor_name_first": "XIAOBO",
      "inventor_city": "San Jose",
      "inventor_state": "CA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "BO",
      "inventor_name_first": "WENQIANG",
      "inventor_city": "San Jose",
      "inventor_state": "CA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "NING",
      "inventor_name_first": "GUANGHAN",
      "inventor_city": "San Jose",
      "inventor_state": "CA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "GUO",
      "inventor_name_first": "LIFAN",
      "inventor_city": "San Jose",
      "inventor_state": "CA",
      "inventor_country": "US"
    }
  ],
  "abstract": "An experience-aware anomaly processing system and a method for an experience-aware anomaly processing system are provided. The experience-aware anomaly processing system comprises an anomaly detection module configured to receive geographic location data with corresponding time information of a target object, and analyze target object behavior based on the geographic location data with corresponding time information of the target object; a user feedback module configured to receive user feedback from a user and model user feedback behavior when the user receives an alarm message indicating the target object is abnormal; and a decision module configured to receive user setting from the user, and make a detection decision through fusing target object behavior information corresponding to the target object behavior, user feedback behavior information corresponding to the user feedback behavior, and the user setting.",
  "filing_date": "20160808",
  "patent_number": "None",
  "summary": "<SOH> BRIEF SUMMARY OF THE DISCLOSURE <EOH>One aspect of the present disclosure includes an experience-aware anomaly processing system. The experience-aware anomaly processing system comprises an anomaly detection module configured to receive geographic location data with corresponding time information of a target object, and analyze target object behavior based on the geographic location data with corresponding time information of the target object; a user feedback module configured to receive user feedback from a user and model user feedback behavior when the user receives an alarm message indicating the target object is abnormal; and a decision module configured to receive user setting from the user, and make a detection decision through fusing target object behavior information corresponding to the target object behavior, user feedback behavior information corresponding to the user feedback behavior, and the user setting. One aspect of the present disclosure includes a method for an experience-aware anomaly processing system. The method comprises receiving geographic location data with corresponding time information of a target object; analyzing target object behavior based on the received geographic location data with corresponding time information of the target object; receiving user feedback and user setting from a user; modeling user feedback behavior when the user receives an alarm message indicating the target object is abnormal; and making a detection decision through fusing target object behavior information corresponding to the target object behavior, user feedback behavior information corresponding to the user feedback behavior, and the user setting Other aspects of the present disclosure can be understood by those skilled in the art in light of the description, the claims, and the drawings of the present disclosure.",
  "date_published": "20180208",
  "title": "EXPERIENCE-AWARE ANOMALY PROCESSING SYSTEM AND METHOD",
  "ipcr_labels": [
    "G06N9900"
  ],
  "_processing_info": {
    "original_size": 49157,
    "optimized_size": 3902,
    "reduction_percent": 92.06
  }
}