{
  "date_produced": "20170223",
  "publication_number": "US20170068901A1-20170309",
  "main_ipcr_label": "G06N700",
  "decision": "PENDING",
  "application_number": "15239457",
  "inventor_list": [
    {
      "inventor_name_last": "Yu",
      "inventor_name_first": "Kuifei",
      "inventor_city": "Beijing",
      "inventor_state": "",
      "inventor_country": "CN"
    }
  ],
  "abstract": "Embodiments of this application disclose a recommendation method, comprising: determining, according to a hidden variable characteristic parameter of a user and a hidden variable characteristic parameter of each branch node of a content tree, a probability that the user selects each branch node on an nth level of the content tree; and recommending, to the user according to the probability that the user selects each branch node on the nth level of the content tree, a content category corresponding to at least one branch node on the nth level of the content tree. This application further discloses another recommendation method and recommendation apparatus. According to the recommendation method and apparatus in the embodiments of this application, a probability that a user selects each node on a specific level in a tree structure of to-be-recommended contents can be determined according to a hidden variable characteristic parameter of the user, and a recommendation is given based on the ...",
  "filing_date": "20160817",
  "patent_number": "None",
  "summary": "<SOH> SUMMARY <EOH>An objective of this application is to provide a recommendation method and apparatus. According to a first aspect of at least one embodiment of this application, a recommendation method is provided, comprising: determining, according to a hidden variable characteristic parameter of a user and a hidden variable characteristic parameter of each branch node of a content tree, a probability that the user selects each branch node on an nth level of the content tree, where one branch node of the content tree corresponds to one content category, and n is a natural number greater than 1; and recommending, to the user according to the probability that the user selects each branch node on the nth level of the content tree, a content category corresponding to at least one branch node on the nth level of the content tree. According to a second aspect of at least one embodiment of this application, another recommendation method is provided, comprising: determining, according to a hidden variable characteristic parameter of a user and a hidden variable characteristic parameter of each leaf node of a content tree, a probability that the user selects each leaf node of the content tree, where one leaf node of the content tree corresponds to one content; and recommending, to the user according to the probability that the user selects each leaf node of the content tree, a content corresponding to at least one leaf node of the content tree. According to a third aspect of at least one embodiment of this application, a recommendation apparatus is provided, comprising: a probability determining module, configured to determine, according to a hidden variable characteristic parameter of a user and a hidden variable characteristic parameter of each branch node of a content tree, a probability that the user selects each branch node on an nth level of the content tree, where one branch node of the content tree corresponds to one content category, and n is a natural number gr...",
  "date_published": "20170309",
  "title": "RECOMMENDATION METHOD AND APPARATUS",
  "ipcr_labels": [
    "G06N700",
    "G06N502"
  ],
  "_processing_info": {
    "original_size": 52362,
    "optimized_size": 3530,
    "reduction_percent": 93.26
  }
}