{
  "decision": "PENDING",
  "application_number": "15239405",
  "date_published": "20170223",
  "date_produced": "20170208",
  "title": "QUANTIFYING AND REPORTING USER READINESS",
  "filing_date": "20160817",
  "inventor_list": [
    {
      "inventor_name_last": "LANZEL",
      "inventor_name_first": "AARON JOHN",
      "inventor_city": "Annapolis",
      "inventor_state": "MD",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "MORRIS",
      "inventor_name_first": "BENJAMIN DAVID",
      "inventor_city": "Annapolis",
      "inventor_state": "MA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "RUSSELL",
      "inventor_name_first": "BRIAN KEITH",
      "inventor_city": "Annapolis",
      "inventor_state": "MD",
      "inventor_country": "US"
    }
  ],
  "ipcr_labels": [
    "G06F1900",
    "A61B5024",
    "G06N700"
  ],
  "main_ipcr_label": "G06F1900",
  "summary": "<SOH> SUMMARY <EOH>Predictive health and wellness reports may be particularly useful to coaches and healthcare providers, in order to project a monitored user's health status or readiness for an upcoming day or athletic event. It may be particularly beneficial to provide a numerical representation of the user's readiness, such that the user's health status may be quickly and easily obtained and compared with that of other users, or compared with the monitored user's previously observed readiness levels. Furthermore, it may be beneficial to provide a more holistic representation of the user's health status by incorporating subjective health parameters, such as quality of sleep, level of stress, and the like, when deriving a numerical representation of the user's readiness. One method of accomplishing this may include receiving physiological data corresponding to one or more physiological parameters of the user, and receiving user input data corresponding to one or more subjective user state parameters of the user. The method may further include assigning a respective component score to each of the received physiological data and user input data. The method may also include assigning a respective weight to at least one of the one or more physiological parameters or one or more subject user state parameters of the user. A readiness score may then be derived for the user based at least in part on the component scores and the corresponding weights, and the derived readiness score may be communicated to the user via a display device. The respective component scores assigned to each of the received physiological data and user input data may be predetermined based at least in part on individual user physiological conditions. In this way, monitored physiological and subjective health data may be tailored to individual user health, and may be more accurately representative of the monitored user's health status. In some embodiments, deriving the readiness score may further inc...",
  "patent_number": "None",
  "abstract": "Methods, apparatuses and systems are described for determining a readiness of a user. The methods may include receiving physiological data corresponding to one or more physiological parameters of the user. The methods may also include receiving user input data corresponding to one or more subjective user state parameters of the user. The methods may also include assigning a respective component score to each of the received physiological data and user input data. The methods may further include assigning a respective weight to at least one of the one or more physiological parameters or one or more subjective user state parameters of the user. The methods may also include deriving a readiness score for the user based at least in part on the component scores of the corresponding weights. The derived readiness score may be communicated to the user via a display device.",
  "publication_number": "US20170053078A1-20170223",
  "_processing_info": {
    "original_size": 97311,
    "optimized_size": 3744,
    "reduction_percent": 96.15
  }
}