{
  "decision": "ACCEPTED",
  "application_number": "15236965",
  "date_published": "20170223",
  "date_produced": "20170208",
  "title": "IMAGE PROCESSING DEVICE, DISPLAY UNIT, AND ELECTRONIC APPARATUS",
  "filing_date": "20160815",
  "inventor_list": [
    {
      "inventor_name_last": "Funatsu",
      "inventor_name_first": "Yohei",
      "inventor_city": "Tokyo",
      "inventor_state": "",
      "inventor_country": "JP"
    }
  ],
  "ipcr_labels": [
    "G09G502",
    "G06F3041"
  ],
  "main_ipcr_label": "G09G502",
  "summary": "<SOH> SUMMARY <EOH>It is generally preferred to improve a sense of presence that is provoked during image display performed by a display unit. Accordingly, it is preferable to provide a technique to improve the sense of presence that is provoked during the image display. It is desirable to provide an image processing device, a display unit, and an electronic apparatus that make it possible to improve a sense of presence that is provoked during image display. An image processing device according to an illustrative embodiment of the disclosure includes an image processor that performs an image processing on an image signal on a basis of a result of detection of a contact condition in which a user makes contact with a display section. The image processing includes an enhancement processing performed on the image signal in accordance with the contact condition. A display unit according to an illustrative embodiment of the disclosure includes a display section, a detector, and an image processor. The detector performs detection of a contact condition in which a user makes contact with the display section. The image processor performs an image processing on an image signal on a basis of a result of the detection of the contact condition performed by the detector. The image processing includes an enhancement processing performed on the image signal in accordance with the contact condition. An electronic apparatus according to an illustrative embodiment of the disclosure includes a display unit that includes a display section, a detector, and an image processor. The detector performs detection of a contact condition in which a user makes contact with the display section. The image processor performs an image processing on an image signal on a basis of a result of the detection of the contact condition performed by the detector. The image processing includes an enhancement processing performed on the image signal in accordance with the contact condition.",
  "patent_number": "9971445",
  "abstract": "An image processing device includes an image processor. The image processor performs an image processing on an image signal on a basis of a result of detection of a contact condition in which a user makes contact with a display section. The image processing includes an enhancement processing performed on the image signal in accordance with the contact condition.",
  "publication_number": "US20170053618A1-20170223",
  "_processing_info": {
    "original_size": 65330,
    "optimized_size": 2902,
    "reduction_percent": 95.56
  }
}