{
  "date_produced": "20180131",
  "publication_number": "US20180046929A1-20180215",
  "main_ipcr_label": "G06N700",
  "decision": "PENDING",
  "application_number": "15236546",
  "inventor_list": [
    {
      "inventor_name_last": "Xuan",
      "inventor_name_first": "Chaoting",
      "inventor_city": "Atlanta",
      "inventor_state": "GA",
      "inventor_country": "US"
    }
  ],
  "abstract": "Systems and methods are provided for accurately setting notification priority levels for applications on a user device. An example system includes a user device and a management server. When an application generates a notification, it provides a priority level for the notification. A management agent executing on the user device can detect the notification and its assigned priority level, determine a predicted priority level using a prediction engine or prediction server, and cause the application the replace or update the assigned priority level based on the predicted priority level. The management agent can then receive user actions related to that notification from the application, and use that information to determine an observed priority level. The prediction engine or prediction server can be updated based on the observed priority level, thereby dynamically increasing the accuracy of predictions.",
  "filing_date": "20160815",
  "patent_number": "None",
  "summary": "<SOH> SUMMARY <EOH>Examples described herein include systems and methods for accurately setting notification priority levels for applications on a user device. An example method can include detecting, at a management agent installed on the user device, a first notification generated by a first application. A “notification” can include any type of message or marker that is made available outside of an application. For example, a notification can include a message notifying a user that an email has been received through an email application. In another example, a notification can include a number or other marker that appears on the icon of an application, such as on the home screen of the user device. A notification can include a priority level provided by the application that generated the notification. The example method can also include determining a predicted priority level for the first notification based on user actions, according to a prediction model. The management agent can then cause the first application to update the priority level for the first notification based on the predicted priority level. For example, the application can be forced to adopt the predicted priority level or adopt an average priority level value based on the predicted priority level and the original priority level. As the user interacts with the notification, or the application that generated the notification, user actions are generated. These user actions can be sent to the management agent for further processing. For example, the application can be wrapped, injected with features, or developed with a software development kit (“SDK”) to report some user actions to the management agent. The management agent can determine an observed priority level based on the user actions. The observed priority level can reflect the actual priority level to the user, based on the user's own actions. Information regarding the observed priority level can then be used to update the prediction model. Thi...",
  "date_published": "20180215",
  "title": "INTELLIGENT RANKING OF NOTIFICATIONS ON A USER DEVICE",
  "ipcr_labels": [
    "G06N700",
    "G06N502"
  ],
  "_processing_info": {
    "original_size": 87037,
    "optimized_size": 3486,
    "reduction_percent": 95.99
  }
}