{
  "date_produced": "20180131",
  "publication_number": "US20180046908A1-20180215",
  "main_ipcr_label": "G06N3063",
  "decision": "PENDING",
  "application_number": "15237459",
  "inventor_list": [
    {
      "inventor_name_last": "Cox",
      "inventor_name_first": "Charles E.",
      "inventor_city": "San Jose",
      "inventor_state": "CA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Huels",
      "inventor_name_first": "Harald",
      "inventor_city": "Horb am Neckar",
      "inventor_state": "",
      "inventor_country": "DE"
    },
    {
      "inventor_name_last": "Kumar",
      "inventor_name_first": "Arvind",
      "inventor_city": "Chappaqua",
      "inventor_state": "NY",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Narayanan",
      "inventor_name_first": "Pritish",
      "inventor_city": "San Jose",
      "inventor_state": "CA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Ozcan",
      "inventor_name_first": "Ahmet S.",
      "inventor_city": "San Jose",
      "inventor_state": "CA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Scott",
      "inventor_name_first": "J. Campbell",
      "inventor_city": "Los Gatos",
      "inventor_state": "CA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Wilcke",
      "inventor_name_first": "Winfried W.",
      "inventor_city": "Los Altos Hills",
      "inventor_state": "CA",
      "inventor_country": "US"
    }
  ],
  "abstract": "Three-dimensional (3D) neuromorphic computing systems are provided. A system includes a logic wafer having a plurality of processors. The system further includes a double-sided interposer bonded to the logic wafer and incorporating a signal port ring for sending and receiving signals. The system also includes a plurality of 3D memory modules bonded to the double-sided interposer. The double-sided interposer is a wafer scale or a panel scale providing communication between the plurality of processors and the plurality of 3D memory modules.",
  "filing_date": "20160815",
  "patent_number": "None",
  "summary": "<SOH> SUMMARY <EOH>According to an aspect of the present principles, a three-dimensional (3D) neuromorphic computing system is provided. The system includes a logic wafer having a plurality of processors. The system further includes a double-sided interposer bonded to the logic wafer and incorporating a signal port ring for sending and receiving signals. The system also includes a plurality of 3D memory modules bonded to the double-sided interposer. The double-sided interposer is a wafer scale or a panel scale providing communication between the plurality of processors and the plurality of 3D memory modules. According to another aspect of the present principles, a three-dimensional (3D) neuromorphic computing system is provided. The system includes a logic wafer having a plurality of fully integrated voltage regulators and a plurality of processors. The system further includes a double-sided interposer panel bonded to the logic wafer and incorporating a signal port region for sending and receiving signals. The system also includes a plurality of 3D memory modules bonded to the double-sided interposer panel. The system additionally includes a plurality of power modules disposed amongst the plurality of 3D memory modules and connected to the plurality of fully integrated voltage regulators. The double-sided interposer panel provides communication between the plurality of processors and the plurality of 3D memory modules. The logic wafer is substantially circular in shape and the double-sided interposer panel is substantially rectangular in shape and has a non-overlapping portion with respect to the logic wafer for incorporating at least a portion of the signal port region. These and other features and advantages will become apparent from the following detailed description of illustrative embodiments thereof, which is to be read in connection with the accompanying drawings.",
  "date_published": "20180215",
  "title": "HIGH MEMORY BANDWIDTH NEUROMORPHIC COMPUTING SYSTEM",
  "ipcr_labels": [
    "G06N3063"
  ],
  "_processing_info": {
    "original_size": 41810,
    "optimized_size": 3887,
    "reduction_percent": 90.7
  }
}