{
  "decision": "PENDING",
  "application_number": "15230274",
  "date_published": "20180208",
  "date_produced": "20180124",
  "title": "APPARATUSES, METHODS, AND COMPUTER PROGRAM PRODUCTS FOR PROVIDING DIETARY FEEDBACK",
  "filing_date": "20160805",
  "inventor_list": [
    {
      "inventor_name_last": "Astigarraga",
      "inventor_name_first": "Tara",
      "inventor_city": "Fairport",
      "inventor_state": "NY",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "DeRobertis",
      "inventor_name_first": "Christopher V.",
      "inventor_city": "Hopewell Junction",
      "inventor_state": "NY",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Dickens",
      "inventor_name_first": "Louie A.",
      "inventor_city": "Tucson",
      "inventor_state": "AZ",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Mosqueda Mejia",
      "inventor_name_first": "Jose R.",
      "inventor_city": "Puruandiro",
      "inventor_state": "",
      "inventor_country": "MX"
    },
    {
      "inventor_name_last": "Winarski",
      "inventor_name_first": "Daniel J.",
      "inventor_city": "Tucson",
      "inventor_state": "AZ",
      "inventor_country": "US"
    }
  ],
  "ipcr_labels": [
    "G06F1900"
  ],
  "main_ipcr_label": "G06F1900",
  "summary": "<SOH> BRIEF SUMMARY <EOH>A method for providing dietary feedback is disclosed. An apparatus and computer program product may also perform the functions of the method. In one embodiment, an apparatus includes a data collection module that receives digital information via one or more software applications. In such an embodiment, the digital information corresponds to a diet of a user. The apparatus, in a further embodiment, includes a nutrient evaluation module that determines a quantity of one or more intake nutrients in the diet of the user based on the digital information. In certain embodiments, the apparatus includes a data analysis module that determines a variance between the quantity of the one or more intake nutrients and one or more threshold nutrient levels. In some embodiment, the apparatus includes a feedback generation module that generates feedback for the user based on the variance, and provides the feedback to a display device. In various embodiments, at least a portion of the data collection module, the nutrient evaluation module, the data analysis module and the feedback module includes one or more of hardware and executable code with the executable code being stored on one or more computer readable storage media. A method for providing dietary feedback is disclosed. In one embodiment, the method includes receiving digital information via one or more software applications. In such an embodiment, the digital information corresponds to a diet of a user. In various embodiments, the method includes determining a quantity of one or more intake nutrients in the diet of the user based on the digital information. In some embodiments, the method includes determining a variance between the quantity of the one or more intake nutrients and one or more threshold nutrient levels. In certain embodiments, the method includes generating feedback for the user based on the variance. In one embodiment, the method includes providing the feedback to a display device. A c...",
  "patent_number": "None",
  "abstract": "An apparatus, method, system, and program product are disclosed for providing dietary feedback. One method includes receiving digital information via one or more software applications. The digital information corresponds to a diet of a user. The method also includes determining a quantity of one or more intake nutrients in the diet of the user based on the digital information. The method includes determining a variance between the quantity of the one or more intake nutrients and one or more threshold nutrient levels. The method also includes generating feedback for the user based on the variance. The method includes providing the feedback to a display device.",
  "publication_number": "US20180039759A1-20180208",
  "_processing_info": {
    "original_size": 58499,
    "optimized_size": 3860,
    "reduction_percent": 93.4
  }
}