{
  "date_produced": "20170214",
  "publication_number": "US20170061296A1-20170302",
  "main_ipcr_label": "G06N504",
  "decision": "ACCEPTED",
  "application_number": "15233400",
  "inventor_list": [
    {
      "inventor_name_last": "JOSHI",
      "inventor_name_first": "KALYAN",
      "inventor_city": "Pune",
      "inventor_state": "",
      "inventor_country": "IN"
    },
    {
      "inventor_name_last": "ROEHL",
      "inventor_name_first": "NITZI",
      "inventor_city": "Wellington",
      "inventor_state": "FL",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "CHIEN",
      "inventor_name_first": "YUNG-HSIN (ALEX)",
      "inventor_city": "Apex",
      "inventor_state": "NC",
      "inventor_country": "US"
    }
  ],
  "abstract": "Information related to a time series can be predicted. For example, a repetitive characteristic of the time series can be determined by analyzing the time series for a pattern that repeats over a predetermined time period. An adjusted time series can be generated by removing the repetitive characteristic from the time series. An effect of a moving event on the adjusted time series can be determined. The moving event can occur on different dates for two or more consecutive years. A residual time series can be generated by removing the effect of the moving event from the adjusted time series. A base forecast that is independent of the repetitive characteristic and the effect of the moving event can be generated using the residual time series. A predictive forecast can be generated by including the repetitive characteristic and the effect of the moving event into the base forecast.",
  "filing_date": "20160810",
  "patent_number": "9818063",
  "summary": "<SOH> SUMMARY <EOH>In one example, a non-transitory computer readable medium comprising program code that is executable by a processor is provided. The program code can cause the processor to receive a time series comprising a plurality of data points arranged in a sequential order over a period of time. The program code can cause the processor to determine a repetitive characteristic of the time series by analyzing the time series for a pattern that repeats over a predetermined time period. The program code can cause the processor to generate an adjusted time series by removing the repetitive characteristic from the time series. The program code can cause the processor to determine, using the adjusted time series, an effect of one or more moving events that occur on different dates for two or more consecutive years on the adjusted time series. The program code can cause the processor to generate a residual time series by removing the effect of the one or more moving events from the adjusted time series. The program code can cause the processor to generate, using the residual time series, a base forecast that is independent of the repetitive characteristic and the effect of the one or more moving events. The program code can cause the processor to generate a predictive forecast by including the repetitive characteristic and the effect of the one or more moving events into the base forecast. In another example, a method is provided that can include receiving a time series comprising a plurality of data points arranged in a sequential order over a period of time. The method can include determining a repetitive characteristic of the time series by analyzing the time series for a pattern that repeats over a predetermined time period. The method can include generating an adjusted time series by removing the repetitive characteristic from the time series. The method can include determining, using the adjusted time series, an effect of one or more moving events that occur ...",
  "date_published": "20170302",
  "title": "THREE-STAGE PREDICTOR FOR TIME SERIES",
  "ipcr_labels": [
    "G06N504"
  ],
  "_processing_info": {
    "original_size": 146442,
    "optimized_size": 3710,
    "reduction_percent": 97.47
  }
}