{
  "date_produced": "20170214",
  "publication_number": "US20170061298A1-20170302",
  "main_ipcr_label": "G06N504",
  "decision": "PENDING",
  "application_number": "15237551",
  "inventor_list": [
    {
      "inventor_name_last": "Lynes",
      "inventor_name_first": "Chris",
      "inventor_city": "New York",
      "inventor_state": "NY",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Balanda",
      "inventor_name_first": "Tom",
      "inventor_city": "Fairfield",
      "inventor_state": "CT",
      "inventor_country": "US"
    }
  ],
  "abstract": "Systems and methods for analyzing social media posts and social media campaigns are provided. The system may be a social media post analyzer processor configured to communicate with a plurality of external servers and a plurality of external user devices for the purposes of obtaining data on a plurality of social media posts and interactions with that plurality of posts, and configured to store and compute results based on interactions with those posts. The system can generate analysis and reports based on those interactions and provide users with information to alter and improve social media posts and campaigns by optimizing social media strategy. The present invention solves problems with the currently available social media metrics by providing social media post and campaign analysis to help users reach their intended audience, and offer analysis of trends and correlations.",
  "filing_date": "20160815",
  "patent_number": "None",
  "summary": "<SOH> SUMMARY OF THE INVENTION <EOH>The present invention meets all these needs, by disclosing systems, and methods, and instructions stored in non-transitory computer-readable media, for analyzing the impact and reach of a plurality of social media posts on at least one target audience segment. The goal of the present invention is to provide a solution for marketing analysis specific to marketing carried out on computer-implemented social media content and public interaction with that social media content, which is a current problem with computer-implemented social media marketing. In the present invention, a user can define one or more pluralities of target audience segments before posting a first post. The present invention then allows a user to assess a post or a campaign of a plurality of posts with weighting of interactions by groups of users, either to underweight the interactions of one or more pluralities of users, and/or to over-weight (emphasize) the interactions of one or more other pluralities of social media users, which one or more other pluralities of social media users can include but are not limited to the target audience or audiences. The presently disclosed inventions allow the user to track and analyze interactions with a post over a pre-defined time period and/or at pre-defined intervals, either spaced out or at set times after a social media post is posted by the user. The inventive systems and methods also allow a user to assess a plurality of posts as part of a social media campaign. Lastly, whether the present invention is being used to assess a single social media post or a campaign, the inventive methods and systems compare the assessed interactions to expected values for interactions, based on factors including but not limited to factors related to the user and factors related to the posts, delivering to the user an assessment of the social media post or social media campaign relative to the expected values for the post or campaign. This...",
  "date_published": "20170302",
  "title": "Analyzing Social Media Posts and Campaigns",
  "ipcr_labels": [
    "G06N504"
  ],
  "_processing_info": {
    "original_size": 61887,
    "optimized_size": 3562,
    "reduction_percent": 94.24
  }
}