{
  "date_produced": "20180131",
  "publication_number": "US20180046904A1-20180215",
  "main_ipcr_label": "G06N3063",
  "decision": "PENDING",
  "application_number": "15232370",
  "inventor_list": [
    {
      "inventor_name_last": "Andreopoulos",
      "inventor_name_first": "Alexander",
      "inventor_city": "San Jose",
      "inventor_state": "CA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Esser",
      "inventor_name_first": "Steven K.",
      "inventor_city": "San Jose",
      "inventor_state": "CA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Kusnitz",
      "inventor_name_first": "Jeffrey A.",
      "inventor_city": "Campbell",
      "inventor_state": "CA",
      "inventor_country": "US"
    }
  ],
  "abstract": "High dynamic range, high class count, high input rate winner-take-all on neuromorphic hardware is provided. In some embodiments, a plurality of thermometer codes are received by a neurosynaptic core. The plurality of thermometer codes are split into a plurality of intervals. One of the plurality of intervals is selected. A local maximum is determined within the one of the plurality of intervals. A global maximum is determined based on the local maximum.",
  "filing_date": "20160809",
  "patent_number": "None",
  "summary": "<SOH> BRIEF SUMMARY <EOH>According to embodiments of the present disclosure, a method of and computer program product for winner-take-all are provided. A plurality of thermometer codes are received by a neurosynaptic core. The plurality of thermometer codes are split into a plurality of intervals. One of the plurality of intervals is selected. A local maximum is determined within the one of the plurality of intervals. A global maximum is determined based on the local maximum. In some embodiments of the present disclosure, a neuromorphic system is provided. The neurosynaptic system includes a first corelet. The first corelet is adapted to receive a plurality of thermometer codes, split the plurality of thermometer codes into a plurality of intervals, and select one of the plurality of intervals. The neurosynaptic system also includes a second corelet. The second corelet is adapted to receive the one of the plurality of intervals, determine a local maximum within the one of the plurality of intervals, and determine a global maximum based on the local maximum.",
  "date_published": "20180215",
  "title": "HIGH DYNAMIC RANGE, HIGH CLASS COUNT, HIGH INPUT RATE WINNER-TAKE-ALL ON NEUROMORPHIC HARDWARE",
  "ipcr_labels": [
    "G06N3063"
  ],
  "_processing_info": {
    "original_size": 61299,
    "optimized_size": 2419,
    "reduction_percent": 96.05
  }
}