{
  "decision": "PENDING",
  "application_number": "15233458",
  "date_published": "20180215",
  "date_produced": "20180131",
  "title": "TRAILER WHEEL TARGETLESS TRAILER ANGLE DETECTION",
  "filing_date": "20160810",
  "inventor_list": [
    {
      "inventor_name_last": "Hu",
      "inventor_name_first": "Zheng",
      "inventor_city": "Farmington Hills",
      "inventor_state": "MI",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Lavoie",
      "inventor_name_first": "Erick Michael",
      "inventor_city": "Dearborn",
      "inventor_state": "MI",
      "inventor_country": "US"
    }
  ],
  "ipcr_labels": [
    "B62D1306",
    "B62D1502",
    "G06K900",
    "B60R1104"
  ],
  "main_ipcr_label": "B62D1306",
  "summary": "<SOH> SUMMARY OF THE INVENTION <EOH>According to one aspect of the present disclosure, a backup assist system for a vehicle and trailer combination includes a steering system, a camera generating an image of the trailer, and a controller. The controller receives the image and identifying a wheel therein, determines a value in a kinematic model of the vehicle and trailer combination using at least one of an aspect ratio or location of the wheel in the image, and uses the value in the kinematic model to control the steering system. According to another aspect of the present disclosure, a vehicle includes a steering system and a camera generating images of a predetermined area to a rear of the vehicle. The vehicle further includes a system for assisting in reversing the vehicle with a trailer coupled therewith and including a controller that processes sequential images received from the camera to identify a wheel and determine at least one of an aspect ratio or position of a wheel therein and determines a value for an unknown in a kinematic model of the vehicle and trailer combination using the aspect ratio. The controller then uses the solved variable in the kinematic model to control the steering system. According to another aspect of the present disclosure, a method for assisting a vehicle in reversing a trailer includes processing an image received from a camera to identify a wheel of the trailer and to determine at least one of an aspect ratio or position thereof within the image. The method further includes determining a value in a kinematic model of the vehicle and trailer combination using the aspect ratio and using the determined value in the kinematic model to control the steering system. These and other aspects, objects, and features of the present invention will be understood and appreciated by those skilled in the art upon studying the following specification, claims, and appended drawings.",
  "patent_number": "None",
  "abstract": "A backup assist system for a vehicle and trailer combination includes a steering system, a camera generating an image of the trailer, and a controller. The controller receives the image and identifying a wheel therein, determines a value in a kinematic model of the vehicle and trailer combination using at least one of an aspect ratio or location of the wheel in the image, and uses the value in the kinematic model to control the steering system.",
  "publication_number": "US20180043933A1-20180215",
  "_processing_info": {
    "original_size": 77209,
    "optimized_size": 3107,
    "reduction_percent": 95.98
  }
}