{
  "decision": "PENDING",
  "application_number": "15237698",
  "date_published": "20170406",
  "date_produced": "20170323",
  "title": "SYSTEM AND METHOD FOR PERFORMING DATA ANALYTICS FOR A MACHINE ON A MOBILE DEVICE",
  "filing_date": "20160816",
  "inventor_list": [
    {
      "inventor_name_last": "Hodel",
      "inventor_name_first": "Benjamin J.",
      "inventor_city": "Dunlap",
      "inventor_state": "IL",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Shatters",
      "inventor_name_first": "Aaron R.",
      "inventor_city": "Montgomery",
      "inventor_state": "IL",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Cler",
      "inventor_name_first": "Eric W.",
      "inventor_city": "Oswego",
      "inventor_state": "IL",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Prabhakaran",
      "inventor_name_first": "Vishnu Suganth",
      "inventor_city": "Chennai",
      "inventor_state": "",
      "inventor_country": "IN"
    }
  ],
  "ipcr_labels": [
    "G06F1136",
    "G06F9445"
  ],
  "main_ipcr_label": "G06F1136",
  "summary": "<SOH> SUMMARY <EOH>Various aspects of this disclosure are related to managing information flow and analytical processing for gaining machine operational insights using data analytics carried out on a mobile device, for example, a mobile phone. In one aspect of this disclosure, a method for operating a machine using a mobile device is provided. The method includes connecting wirelessly, by a mobile device processor, a mobile device to an electronic controller unit of a machine; receiving, at the mobile device processor, machine data for machine parameters associated with the machine from the electronic controller unit, the machine data being in a machine data structure; applying, at the mobile device processor, a constraint to the machine data in response to a query received at the mobile device processor; generating, at the mobile device processor, result data in a mobile device data structure based upon the constraint applied to the machine data; and modifying, by the mobile device processor, an operation of the machine based upon the result data. In another aspect of this disclosure, a system is provided. The system includes a machine including an electronic controller unit; and a mobile device wirelessly connected to the electronic controller unit. The mobile device includes a mobile device processor configured to communicate wirelessly with the electronic controller unit to receive machine data for machine parameters associated with the machine from the electronic controller unit, the machine data being in a machine data structure, apply a constraint to the machine data in response to a query received at the mobile device processor, generate result data in a mobile device format based upon the constraint applied to the machine data; and modify an operation of the machine based upon the result data. In yet another aspect of this disclosure, a non-transitory computer readable medium comprising computer executable instructions for operating a machine using a mobile...",
  "patent_number": "None",
  "abstract": "A method for operating a machine using a mobile device is provided. The method includes connecting wirelessly, by a mobile device processor, a mobile device to an electronic controller unit of a machine; receiving, at the mobile device processor, machine data for machine parameters associated with the machine from the electronic controller unit, the machine data being in a machine data structure; applying, at the mobile device processor, a constraint to the machine data in response to a query received at the mobile device processor; generating, at the mobile device processor, result data in a mobile device data structure based upon the constraint applied to the machine data; and modifying, by the mobile device processor, an operation of the machine based upon the result data.",
  "publication_number": "US20170097881A1-20170406",
  "_processing_info": {
    "original_size": 77681,
    "optimized_size": 3821,
    "reduction_percent": 95.08
  }
}