{
  "date_produced": "20161116",
  "publication_number": "US20160350676A1-20161201",
  "main_ipcr_label": "G06N9900",
  "decision": "PENDING",
  "application_number": "15232785",
  "inventor_list": [
    {
      "inventor_name_last": "BRUMLEY, II",
      "inventor_name_first": "Robert H.",
      "inventor_city": "Weems",
      "inventor_state": "VA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "BRUMLEY, III",
      "inventor_name_first": "Robert H.",
      "inventor_city": "Richmond",
      "inventor_state": "VA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "ROSENTHAL",
      "inventor_name_first": "Richard",
      "inventor_city": "Leesburg",
      "inventor_state": "VA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "BIRRELL",
      "inventor_name_first": "Steven",
      "inventor_city": "Charles Town",
      "inventor_state": "WV",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "REEDY",
      "inventor_name_first": "Michael J.",
      "inventor_city": "Kingsport",
      "inventor_state": "TN",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "BRUMLEY",
      "inventor_name_first": "Fletcher W.",
      "inventor_city": "Washington",
      "inventor_state": "DC",
      "inventor_country": "US"
    }
  ],
  "abstract": "The present disclosure describes an automated, cognitive based computing system using artificial intelligence (AI) and machine learning algorithms to sense, predict, and infer network conditions, configured to dynamically manage transmission of information between communication nodes. The communication nodes comprise orbital nodes positioned in orbit above earth and terrestrial nodes coupled with earth interconnected via a hybrid mesh network topology. One or more automated, cognitive based physical computing processors, using artificial intelligence (AI) and machine learning algorithms to sense, predict, and infer network conditions, determine a target terrestrial node to receive information initially stored on a first orbital node; determine transmission conditions between the target terrestrial node and the first orbital node based on output signals from sensors; dynamically determine whether transmission conditions between the first orbital node and the target terrestrial node prev...",
  "filing_date": "20160809",
  "patent_number": "None",
  "summary": "<SOH> SUMMARY <EOH>One aspect of the present disclosure relates to an automated and cognitive based computing system using artificial intelligence (AI) and machine learning algorithms to sense, predict, and infer network conditions, configured to dynamically manage transmission of information between communications nodes interconnected via a hybrid mesh network topology. The communication orbital nodes positioned in orbit above Earth, terrestrial nodes coupled with Earth, and/or other nodes. The automated and cognitive based system comprises one or more sensors, one or more physical computer processors, and/or other components. The one or more sensors are configured to dynamically generate output signals conveying information related to transmission conditions between nodes. The one or more automated physical computer processors are configured, by computer readable instructions, to dynamically determine a target terrestrial node to receive information initially stored on a first orbital node; determine transmission conditions between the target terrestrial node and the first orbital node based on the output signals; determine whether transmission conditions between the first orbital node and the target terrestrial node prevent optical transmission of the information directly from the first orbital node to the target terrestrial node; and, responsive to a determination that transmission conditions prevent optical transmission of the information to the target terrestrial node from the first orbital node, transmit the information along an alternate route between the first orbital node and the target terrestrial node, wherein the alternate route includes transmission between some orbital node and an alternative target terrestrial node other than the target terrestrial node. Another aspect of the present disclosure relates to an automated and cognitive based computing system using artificial intelligence (AI) and machine learning algorithms to sense, predict, and infer n...",
  "date_published": "20161201",
  "title": "OPTICAL COMMUNICATION SYSTEM",
  "ipcr_labels": [
    "G06N9900",
    "G06N502",
    "H04B1027"
  ],
  "_processing_info": {
    "original_size": 61367,
    "optimized_size": 4309,
    "reduction_percent": 92.98
  }
}