{
  "decision": "REJECTED",
  "application_number": "15237732",
  "date_published": "20161208",
  "date_produced": "20161122",
  "title": "METHODS AND SYSTEMS FOR FLEET MANAGEMENT",
  "filing_date": "20160816",
  "inventor_list": [
    {
      "inventor_name_last": "Walton",
      "inventor_name_first": "Mark Adam",
      "inventor_city": "Spring",
      "inventor_state": "TX",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Johnson",
      "inventor_name_first": "Eugene Thomas",
      "inventor_city": "Spring",
      "inventor_state": "TX",
      "inventor_country": "US"
    }
  ],
  "ipcr_labels": [
    "G06Q1000",
    "G07C500",
    "G07C508",
    "G06Q4008",
    "G08G100"
  ],
  "main_ipcr_label": "G06Q1000",
  "summary": "<SOH> SUMMARY OF THE INVENTION <EOH>In one embodiment, there is a system for analyzing an accident, the system may include an accident tracker app loaded on a device, a fleet management system, or combination thereof is in network communication and associated with logic, memory, processors, and data storage, wherein the accident tracker app, the fleet management system, or combination thereof are configured to identify, based on evidence, a type of the accident. Further, the system may include further logic, reduced to hardware and/or software, associated with the accident tracker app loaded on a device, a fleet management system, or combination thereof configured to assess, based on the evidence related to the accident, severity of the accident, and compare the evidence for the accident. Further still, the system may include additional enabling logic configured to determine a disposition for the accident, which may include determining a score of the driver or the driver's company in order to determine the disposition(s). In another example embodiment, disclosed is a system, which may include an accident tracker app loaded on a device, a fleet management system, or combination thereof is in network communication and associated with logic, memory, processors, and data storage, wherein the accident tracker app, the fleet management system, or combination thereof are configured to identify, based on evidence, a type of the accident. Further, the system may include further logic, reduced to hardware and/or software, associated with the accident tracker app loaded on a device, a fleet management system, or combination thereof configured to gather the evidence related to the accident from the one or more resources, and to determine, based on the evidence, the probability of the accident, wherein the evidence comprises weather conditions, mechanical fitness of type of fleet operated, time and day, traffic conditions, traffic patterns, severity, cost, downtime, the type, as...",
  "patent_number": "None",
  "abstract": "Methods and systems are disclosed for analyzing, predicting, and processing an accident. One embodiment for analyzing includes identifying a type of the accident based on evidence, wherein the identifying comprises by an accident tracker app loaded on a device and optionally a fleet management system, wherein the accident tracker app and the fleet management system are in network connection and associated with logic, processors, and data storage. The methods and systems may include enabling logic for assessing, by the accident tracker app, the fleet management system, or combination thereof, severity of the accident based on the evidence related to the accident. Further, the methods and systems may include enabling logic for comparing, by the accident tracker app, the fleet management system, or combination thereof, the evidence for the accident, and for determining, by the accident tracker app, the fleet management system, or combination thereof, a disposition for the accident.",
  "publication_number": "US20160358129A1-20161208",
  "_processing_info": {
    "original_size": 99738,
    "optimized_size": 3722,
    "reduction_percent": 96.27
  }
}