{
  "decision": "PENDING",
  "application_number": "15231127",
  "date_published": "20170309",
  "date_produced": "20170223",
  "title": "ELECTRONIC PROCESSING SYSTEM WITH SOCIAL NETWORK MECHANISM AND METHOD OF OPERATION THEREOF",
  "filing_date": "20160808",
  "inventor_list": [
    {
      "inventor_name_last": "Kunieda",
      "inventor_name_first": "Shunsuke",
      "inventor_city": "San Francisco",
      "inventor_state": "CA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Downes",
      "inventor_name_first": "Michelle",
      "inventor_city": "San Francisco",
      "inventor_state": "CA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Kruawongwanich",
      "inventor_name_first": "Wivat",
      "inventor_city": "Concord",
      "inventor_state": "CA",
      "inventor_country": "US"
    }
  ],
  "ipcr_labels": [
    "H04L1258",
    "A63F1386",
    "A63F1330",
    "H04L2908",
    "G06F30482"
  ],
  "main_ipcr_label": "H04L1258",
  "summary": "<SOH> BRIEF DESCRIPTION OF THE DRAWINGS <EOH>FIG. 1 is a system block diagram of an electronic processing system with a social network mechanism in an embodiment of the present invention. FIG. 2 is an example of a view displayed in the electronic processing system of FIG. 1 . FIG. 3 is an example of the gallery view. FIG. 4 is a first example of the screenshots of the shared contents. FIG. 5 is a second example of the screenshots of the shared contents. FIG. 6 is an example of a process flow for generation of the gallery view. FIG. 7 is an example of a process flow for generation of the shared contents in the electronic processing system of FIG. 1 . FIG. 8 is a first portion of a detailed process flow of the comment feature of FIG. 2 . FIG. 9 is a second portion of the detailed process flow of the comment feature of FIG. 2 . FIG. 10 is a third portion of the detailed process flow of the comment feature. FIG. 11 is a fourth portion of the detailed process flow of the comment feature of FIG. 2 . FIG. 12 is a fifth portion of the detailed process flow of the comment feature of FIG. 2 . FIG. 13 is a sixth portion of the detailed process flow of the comment feature of FIG. 2 . FIG. 14 is a flow chart of a method of operation of an electronic processing system in a further embodiment of the present invention. detailed-description description=\"Detailed Description\" end=\"lead\"?",
  "patent_number": "None",
  "abstract": "An electronic processing system, and a method of operation thereof, including: an entry module for providing an entry point for utilizing a comment feature in a social gaming network; a presentation module, coupled to the entry module, for generating a gallery view based on the entry point; a control module, coupled to the presentation module, for determining a parental control for the comment feature; and a comment module, coupled to the control module, for entering a comment in the gallery view and for accessing the comment based on the parental control for displaying on a screen.",
  "publication_number": "US20170070458A1-20170309",
  "_processing_info": {
    "original_size": 65806,
    "optimized_size": 2924,
    "reduction_percent": 95.56
  }
}