{
  "date_produced": "20180131",
  "publication_number": "US20180046922A1-20180215",
  "main_ipcr_label": "G06N502",
  "decision": "PENDING",
  "application_number": "15233881",
  "inventor_list": [
    {
      "inventor_name_last": "Tucker",
      "inventor_name_first": "Simon",
      "inventor_city": "Oakland",
      "inventor_state": "CA",
      "inventor_country": "US"
    }
  ],
  "abstract": "A computer-implemented system and method for building context models in real time is provided. A database of models for a user is maintained. Each model represents a contextual situation and includes one or more actions. Contextual data is collected for the user and a contextual situation is identified for that user based on the collected contextual information. Models related to the identified situation are selected and merged. One or more actions from the merged model are then selected.",
  "filing_date": "20160810",
  "patent_number": "None",
  "summary": "<SOH> SUMMARY <EOH>Conventionally, context models are used to represent user routines and provide relevant information to a user based on the associated context. However, in situations for which no context model exists, information is generally less accurate due to commonly being provided to the user randomly or based on a population related to the user. To ensure that information or recommendations provided to a user are contextually relevant to the new situation, a new model can be generated in real time. The new model can be generated by identifying the new situation, identifying models representing situations related to the new situation, and merging the identified models. Subsequently, information or actions can be selected from the merged model and provided to the user as a recommendation that is contextually relevant to the new situation. An embodiment provides a computer-implemented system and method for building context models in real time. A database of models for a user is maintained. Each model represents a contextual situation and includes one or more actions. Contextual data is collected for the user and a contextual situation is identified for that user based on the collected contextual information. Models related to the identified situation are selected and merged. One or more actions from the merged model are then selected. Still other embodiments of the present invention will become readily apparent to those skilled in the art from the following detailed description, wherein is described embodiments of the invention by way of illustrating the best mode contemplated for carrying out the invention. As will be realized, the invention is capable of other and different embodiments and its several details are capable of modifications in various obvious respects, all without departing from the spirit and the scope of the present invention. Accordingly, the drawings and detailed description are to be regarded as illustrative in nature and not as restrictiv...",
  "date_published": "20180215",
  "title": "Computer-Implemented System And Method For Building Context Models In Real Time",
  "ipcr_labels": [
    "G06N502",
    "G06F1730"
  ],
  "_processing_info": {
    "original_size": 31008,
    "optimized_size": 3070,
    "reduction_percent": 90.1
  }
}