{
  "date_produced": "20180207",
  "publication_number": "US20180053094A1-20180222",
  "main_ipcr_label": "G06N502",
  "decision": "PENDING",
  "application_number": "15238841",
  "inventor_list": [
    {
      "inventor_name_last": "Patel",
      "inventor_name_first": "Apurva S.",
      "inventor_city": "Pune",
      "inventor_state": "",
      "inventor_country": "IN"
    },
    {
      "inventor_name_last": "Patil",
      "inventor_name_first": "Rajesh",
      "inventor_city": "Pune",
      "inventor_state": "",
      "inventor_country": "IN"
    },
    {
      "inventor_name_last": "Patil",
      "inventor_name_first": "Sunanda",
      "inventor_city": "Pune",
      "inventor_state": "",
      "inventor_country": "IN"
    },
    {
      "inventor_name_last": "Purandare",
      "inventor_name_first": "Prasad P.",
      "inventor_city": "Pune",
      "inventor_state": "",
      "inventor_country": "IN"
    }
  ],
  "abstract": "A plurality of computing devices, in a set of computing devices, each perform one or more tasks. A program monitors the tasks performed on each of the computing devices and determines a usage pattern. Based on the usage pattern the program determines one or more programs available for one or more of the computing devices. The program outputs a recommendation to install one or more of the available programs on one or more of the computing devices.",
  "filing_date": "20160817",
  "patent_number": "None",
  "summary": "<SOH> SUMMARY <EOH>Aspects of the disclosure provide a method, system, and computer program product reduce the interactions of computing devices included in a set of computing devices. In one embodiment, a processor can perform the method to detect a first computing device in the set of devices performing a first task and a second computing device performing a second task. The processor determines that the second computing device performs the second task in association with the first computing device performing the first task. Based on the second computing device performing the second task in association with the first computing device performing the first task, the processor determines a usage pattern. Based on the usage pattern, the processor identifies one or more programs that are executable by the first computing device and that can enable the first computing device to perform the second task. The processor outputs a recommendation to install the program(s) on the first computing device. In some embodiments, outputting the recommendation results in a notification to a user of the first computing device. Also, in some embodiments, the recommendation includes an identity of the program(s) and a location from which the user can obtain the program(s). The above summary is not intended to describe each illustrated embodiment or every implementation of the present disclosure.",
  "date_published": "20180222",
  "title": "DETERMINING APPLICATIONS BASED ON INTERACTIONS OF DIFFERENT ELECTRONIC DEVICES",
  "ipcr_labels": [
    "G06N502",
    "G06F9445",
    "G06F948"
  ],
  "_processing_info": {
    "original_size": 64202,
    "optimized_size": 2854,
    "reduction_percent": 95.55
  }
}