{
  "date_produced": "20170214",
  "publication_number": "US20170061288A1-20170302",
  "main_ipcr_label": "G06N502",
  "decision": "PENDING",
  "application_number": "15239168",
  "inventor_list": [
    {
      "inventor_name_last": "YANG",
      "inventor_name_first": "LEE-WEI",
      "inventor_city": "HSINCHU",
      "inventor_state": "",
      "inventor_country": "TW"
    },
    {
      "inventor_name_last": "CHENG",
      "inventor_name_first": "JYA-WEI",
      "inventor_city": "HSINCHU",
      "inventor_state": "",
      "inventor_country": "TW"
    },
    {
      "inventor_name_last": "LI",
      "inventor_name_first": "HONG-CHUN",
      "inventor_city": "HSINCHU",
      "inventor_state": "",
      "inventor_country": "TW"
    },
    {
      "inventor_name_last": "TSAI",
      "inventor_name_first": "CHENG-YU",
      "inventor_city": "HSINCHU",
      "inventor_state": "",
      "inventor_country": "TW"
    },
    {
      "inventor_name_last": "YU",
      "inventor_name_first": "HUI-YUAN",
      "inventor_city": "HSINCHU",
      "inventor_state": "",
      "inventor_country": "TW"
    }
  ],
  "abstract": "The present invention provides an evaluating system and the use thereof for the efficacy of antimicrobial peptide, which includes the following steps: (a) constructing a peptide by a first input unit, and load the peptide into an aqueous solution for a first time for equilibration; (b) constructing a lipid bilayer by a second input unit, and load the lipid bilayer into an aqueous solution for a second time for equilibration; (c) Using a first processing unit, simulations are carried out for an aqueous system containing an equilibrated peptide from the first input unit and the equilibrated lipid bilayer from the second input unit; (d) calculating the partition free energy of the peptide by a second processing unit; (e) outputting the prediction by an output unit, wherein the output unit is connected with the first processing unit and the second processing unit.",
  "filing_date": "20160817",
  "patent_number": "None",
  "summary": "<SOH> SUMMARY OF THE INVENTION <EOH>The present invention provides an antimicrobial, hemolytic and salt-resistant polypeptides that are designed by stepwise circular reshuffling (SCR). The approach involves (A) shifting constituent residues collectively along the primary sequence of peptides to create variants of different antimicrobial efficacy, strain specificity and hemolytic activity, and (B) a computational platform to evaluate the efficacy of these AMP variants using molecular dynamics simulations and partition free energy calculations. The present invention provides a new platform based on molecular dynamics (MD) simulations and trajectory analysis to evaluate the antimicrobial and hemolytic activities of AMPs. This specific protocol involves a “sink and surface” simulation to pulled and forced the antimicrobial peptides to go into the biological membrane, which shortens the simulation time, as compared with the free diffusion method, by about 10 fold. The partition free energy, ΔG p , can be calculated from the simulation trajectory and was proven to be a better physical indicator to infer the efficacy of AMPs. Accordingly, the present invention provides an evaluating system for the efficacy of antimicrobial peptide, which includes: (a) a first input unit, wherein the first input unit is for constructing a solvated peptide; (b) a second input unit, wherein the second input unit is for constructing a solvated lipid bilayer; (c) a first processing unit, which is connecting with the first input unit and the second input unit, is to perform molecular dynamics (MD) simulations for the peptide in the first input unit and the lipid bilayer in the second input unit; (d) a second processing unit, connected with the first processing unit, is to calculate <N i > that is the moving average number of heavy atoms of the antimicrobial peptide contacting hydrophobic lipid tails and <N o > that is the moving average number of heavy atoms of the antimicrobial peptide not cont...",
  "date_published": "20170302",
  "title": "EVALUATION SYSTEM FOR THE EFFICACY OF ANTIMICROBIAL PEPTIDES AND THE USE THEREOF",
  "ipcr_labels": [
    "G06N502",
    "G06F1750",
    "C07K708"
  ],
  "_processing_info": {
    "original_size": 40660,
    "optimized_size": 4043,
    "reduction_percent": 90.06
  }
}