{
  "date_produced": "20170201",
  "publication_number": "US20170046627A1-20170216",
  "main_ipcr_label": "G06N9900",
  "decision": "REJECTED",
  "application_number": "15233753",
  "inventor_list": [
    {
      "inventor_name_last": "Flood",
      "inventor_name_first": "Donald E.",
      "inventor_city": "Oakland",
      "inventor_state": "CA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Glass",
      "inventor_name_first": "Russell M.",
      "inventor_city": "Belmont",
      "inventor_state": "CA",
      "inventor_country": "US"
    }
  ],
  "abstract": "A system and method for automatically identifying online entities using machine learning techniques are provided. Entity profile data of a first set of entities is used to train a statistical model and entity profile data of a second set of entities is used, in conjunction with the statistical model, to identify a subset of the second set of entities. Certain electronic content is then transmitted over a computer network to entities in the subset through one or more content delivery channels.",
  "filing_date": "20160810",
  "patent_number": "None",
  "summary": "<SOH> BRIEF DESCRIPTION OF THE DRAWINGS <EOH>In the drawings: FIG. 1 is a block diagram that depicts an example system for targeting content to users, in an embodiment; FIG. 2 is a block diagram that depicts multiple components of a targeted content system, in an embodiment; FIG. 3 is a block diagram that depicts example nurture flows, in an embodiment; FIG. 4 is a flow diagram that depicts an example process for automatically targeting content to a user, in an embodiment; FIG. 5 is a block diagram that depicts a process for generating, training, and using a model for identifying prospects, in an embodiment; FIG. 6 is a block diagram that illustrates a computer system upon which an embodiment of the invention may be implemented. detailed-description description=\"Detailed Description\" end=\"lead\"?",
  "date_published": "20170216",
  "title": "USING MACHINE LEARNING TECHNIQUES TO DETERMINE PROPENSITIES OF ENTITIES IDENTIFIED IN A SOCIAL GRAPH",
  "ipcr_labels": [
    "G06N9900",
    "G06Q3006",
    "G06Q5000"
  ],
  "_processing_info": {
    "original_size": 118785,
    "optimized_size": 2068,
    "reduction_percent": 98.26
  }
}