{
  "date_produced": "20180124",
  "publication_number": "US20180039894A1-20180208",
  "main_ipcr_label": "G06N504",
  "decision": "PENDING",
  "application_number": "15230932",
  "inventor_list": [
    {
      "inventor_name_last": "Farrell",
      "inventor_name_first": "Robert G.",
      "inventor_city": "Cornwall",
      "inventor_state": "NY",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Hassanzadeh",
      "inventor_name_first": "Oktie",
      "inventor_city": "Port Chester",
      "inventor_state": "NY",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Hamedani",
      "inventor_name_first": "Mohammad Sadoghi",
      "inventor_city": "Yorktown Heights",
      "inventor_state": "NY",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Sellmann",
      "inventor_name_first": "Meinolf",
      "inventor_city": "Cortlandt Manor",
      "inventor_state": "NY",
      "inventor_country": "US"
    }
  ],
  "abstract": "Methods, systems, and computer program products for expressive temporal predictions over semantically-driven time windows are provided herein. A computer-implemented method includes identifying, within a knowledge graph pertaining to a given prediction, a subset of the knowledge graph related to one or more predicted training examples, wherein the subset comprises (i) a set of nodes and (ii) one or more relationships among the set of nodes; determining, for the identified subset, one or more snapshots of the knowledge graph relevant to the given prediction; quantifying a validity window for the one or more predicted training examples, wherein the validity window comprises a temporal bound for prediction validity; and computing a validity window for the given prediction based on the quantified validity window for the one or more predicted training examples.",
  "filing_date": "20160808",
  "patent_number": "None",
  "summary": "<SOH> SUMMARY <EOH>In one embodiment of the present invention, techniques for generating expressive temporal predictions over semantically-driven time windows are provided. An exemplary computer-implemented method can include identifying, within a knowledge graph pertaining to a given prediction, a subset of the knowledge graph related to one or more predicted training examples, wherein the subset comprises (i) a set of nodes and (ii) one or more relationships among the set of nodes; determining, for the identified subset, one or more snapshots of the knowledge graph relevant to the given prediction; quantifying a validity window for the one or more predicted training examples, wherein the validity window comprises a temporal bound for prediction validity; and computing a validity window for the given prediction based on the quantified validity window for the one or more predicted training examples. Another embodiment of the invention or elements thereof can be implemented in the form of an article of manufacture tangibly embodying computer readable instructions which, when implemented, cause a computer to carry out a plurality of method steps, as described herein. Furthermore, another embodiment of the invention or elements thereof can be implemented in the form of an apparatus including a memory and at least one processor that is coupled to the memory and configured to perform noted method steps. Yet further, another embodiment of the invention or elements thereof can be implemented in the form of means for carrying out the method steps described herein, or elements thereof; the means can include hardware module(s) or a combination of hardware and software modules, wherein the software modules are stored in a tangible computer-readable storage medium (or multiple such media). These and other objects, features and advantages of the present invention will become apparent from the following detailed description of illustrative embodiments thereof, which is to be read...",
  "date_published": "20180208",
  "title": "Expressive Temporal Predictions Over Semantically Driven Time Windows",
  "ipcr_labels": [
    "G06N504",
    "G06F1730",
    "G06N9900"
  ],
  "_processing_info": {
    "original_size": 56138,
    "optimized_size": 3929,
    "reduction_percent": 93.0
  }
}