{
  "decision": "PENDING",
  "application_number": "15235830",
  "date_published": "20170302",
  "date_produced": "20170214",
  "title": "MOBILE TERMINAL AND METHOD FOR CONTROLLING THE SAME",
  "filing_date": "20160812",
  "inventor_list": [
    {
      "inventor_name_last": "PARK",
      "inventor_name_first": "Hanl",
      "inventor_city": "Seoul",
      "inventor_state": "",
      "inventor_country": "KR"
    },
    {
      "inventor_name_last": "KIM",
      "inventor_name_first": "Hyunjin",
      "inventor_city": "Seoul",
      "inventor_state": "",
      "inventor_country": "KR"
    },
    {
      "inventor_name_last": "SONG",
      "inventor_name_first": "Hyewon",
      "inventor_city": "Seoul",
      "inventor_state": "",
      "inventor_country": "KR"
    },
    {
      "inventor_name_last": "KIM",
      "inventor_name_first": "Boram",
      "inventor_city": "Seoul",
      "inventor_state": "",
      "inventor_country": "KR"
    },
    {
      "inventor_name_last": "HAN",
      "inventor_name_first": "Dongsu",
      "inventor_city": "Seoul",
      "inventor_state": "",
      "inventor_country": "KR"
    },
    {
      "inventor_name_last": "SOHN",
      "inventor_name_first": "Joonsung",
      "inventor_city": "Seoul",
      "inventor_state": "",
      "inventor_country": "KR"
    },
    {
      "inventor_name_last": "KIM",
      "inventor_name_first": "Hoyoung",
      "inventor_city": "Seoul",
      "inventor_state": "",
      "inventor_country": "KR"
    },
    {
      "inventor_name_last": "KIM",
      "inventor_name_first": "Minho",
      "inventor_city": "Seoul",
      "inventor_state": "",
      "inventor_country": "KR"
    },
    {
      "inventor_name_last": "PARK",
      "inventor_name_first": "Woonghee",
      "inventor_city": "Seoul",
      "inventor_state": "",
      "inventor_country": "KR"
    },
    {
      "inventor_name_last": "SIN",
      "inventor_name_first": "Mansoo",
      "inventor_city": "Seoul",
      "inventor_state": "",
      "inventor_country": "KR"
    }
  ],
  "ipcr_labels": [
    "G06Q2004",
    "G06Q1010"
  ],
  "main_ipcr_label": "G06Q2004",
  "summary": "<SOH> SUMMARY OF THE DISCLOSURE <EOH>Accordingly, an object of the present invention is to address the above-noted and other problems. An object of the present invention is to address the above-noted and other problems. Another object of the present invention is to provide a mobile terminal generating notification information on the basis of the information obtained from an electronic receipt and managing the generated notification information in conjunction with a calendar application; and a method for controlling the mobile terminal. The present invention according to one aspect to achieve the above-noted and other objects provides a mobile terminal comprising a wireless communication unit; touch screen; memory; and a controller displaying on the touch screen an electronic receipt received through the wireless communication unit as payment of product is being processed, generating notification information on the basis of payment information obtained from the electronic receipt and service information according to the payment, and storing the notification information in the memory in conjunction with a calendar application. The payment information can include seller information of the product, time of the payment, amount of the payment, and name of the product; and the service information can include at least one of information related to refund, replacement, after-sales service, or warranty of the product. In case at least one of the service information is not obtained from the electronic receipt, the controller can receive the service information not obtained from the electronic receipt through the wireless communication unit on the basis of the seller information. The controller can generate the notification information which includes notification time at which to output the notification information according to a predetermined condition on the basis of the payment information and the service information; and notification contents. If receiving a first input wit...",
  "patent_number": "None",
  "abstract": "A mobile terminal and a method for controlling the mobile terminal are disclosed. A mobile terminal according to the present invention comprises a wireless communication unit; touch screen; memory; and a controller displaying on the touch screen an electronic receipt received through the wireless communication unit as payment of product is being processed, generating notification information on the basis of payment information obtained from the electronic receipt and service information according to the payment, and storing the notification information in the memory in conjunction with a calendar application. According to the present invention, notification information can be generated on the basis of the information obtained from an electronic receipt, and generated notification information can be managed in conjunction with a calendar application.",
  "publication_number": "US20170061395A1-20170302",
  "_processing_info": {
    "original_size": 190631,
    "optimized_size": 4654,
    "reduction_percent": 97.56
  }
}