{
  "date_produced": "20171219",
  "publication_number": "US20180005137A1-20180104",
  "main_ipcr_label": "G06N9900",
  "decision": "PENDING",
  "application_number": "15233940",
  "inventor_list": [
    {
      "inventor_name_last": "Guo",
      "inventor_name_first": "Han-Wen",
      "inventor_city": "New Taipei City",
      "inventor_state": "",
      "inventor_country": "TW"
    },
    {
      "inventor_name_last": "Chien",
      "inventor_name_first": "Jen-Chien",
      "inventor_city": "New Taipei City",
      "inventor_state": "",
      "inventor_country": "TW"
    }
  ],
  "abstract": "An emotion analysis method and an electronic apparatus thereof are provided. The emotion analysis method is adapted to the electronic apparatus having a database or connected to the database in order to analyze an emotion of an examinee. The emotion analysis method includes: obtaining a heart rate signal of the examinee; defining a plurality of candidate emotions from the database; analyzing the heart rate signal to obtain a plurality of target emotion parameters; and analyzing the target emotion parameters to determine one of the candidate emotions corresponding to the heart rate signal by applying an emotion analysis model.",
  "filing_date": "20160810",
  "patent_number": "None",
  "summary": "<SOH> SUMMARY <EOH>Based on the above, the present disclosure proposes an emotion analysis method and an electronic apparatus thereof. After a plurality of different target emotion parameters are obtained by analyzing a heart rate signal through various statistical analysis methods, a comprehensive analysis is then performed on the target emotion parameters correspondingly. With the comprehensive analysis performed on the target emotion parameters obtained from the heart rate signal, an emotion of an examinee may be determined more objectively and accurately. The present disclosure provides an emotion analysis method adapted for an emotion analysis system, which is adapted to an electronic apparatus having a database or connecting to the database in order to analyze an emotion of an examinee. The emotion analysis method includes the following steps. A heart rate signal of the examinee is obtained. A plurality of candidate emotions from the database is defined. The heart rate signal is analyzed to obtain a plurality of target emotion parameters. The target emotion parameters are analyzed to determine one of the candidate emotions corresponding to the heart rate signal by applying an emotion analysis model. The present disclosure provides an electronic apparatus for analyzing an emotion of an examinee. The electronic apparatus includes an information extraction device and a processor. The information extraction device obtains an electrocardiogram signal from the examinee. The processor is coupled to the information extraction device. The processor obtains a heart rate signal of the examinee from the electrocardiogram signal and defines a plurality of candidate emotions from a database. The processor analyzes the heart rate signal to obtain a plurality of target emotion parameters, and analyzes the target emotion parameters to determine one of the candidate emotions corresponding to the heart rate signal by applying an emotion analysis model. In view of the above, with...",
  "date_published": "20180104",
  "title": "EMOTION ANALYSIS METHOD AND ELECTRONIC APPARATUS THEREOF",
  "ipcr_labels": [
    "G06N9900",
    "G06F1900",
    "G06F1730"
  ],
  "_processing_info": {
    "original_size": 32631,
    "optimized_size": 3359,
    "reduction_percent": 89.71
  }
}