{
  "date_produced": "20180131",
  "publication_number": "US20180046911A1-20180215",
  "main_ipcr_label": "G06N308",
  "decision": "PENDING",
  "application_number": "15235017",
  "inventor_list": [
    {
      "inventor_name_last": "LEE",
      "inventor_name_first": "Michael",
      "inventor_city": "Saratoga",
      "inventor_state": "CA",
      "inventor_country": "US"
    }
  ],
  "abstract": "A computer-implemented method for representation of weight values in an artificial neural network using inter-group indexing may include, in an artificial neural network that includes neurons and synaptic connections between the neurons with each of the synaptic connections including a weight, arranging the weights in ascending order. The method may also include dividing the arranged weights into groups based on approximately linear patterns of the weights. The method may further include designating a base group and the other groups as dependent groups. The method may also include storing in memory values of the weights in the base group. The method may further include storing in the memory a group index for each of the dependent groups. The method may also include storing in the memory an index for each of the weights in the dependent groups corresponding to one of the weights in the base group without storing in the memory values of the weights in the dependent groups.",
  "filing_date": "20160811",
  "patent_number": "None",
  "summary": "<SOH> SUMMARY <EOH>According to an aspect of an embodiment, a computer-implemented method for representation of weight values in an artificial neural network using inter-group indexing may include, in an artificial neural network that includes neurons and synaptic connections between the neurons with each of the synaptic connections including a weight, arranging the weights in ascending order. The method may also include dividing the arranged weights into groups based on approximately linear patterns of the weights. The method may further include designating a base group and the other groups as dependent groups. The method may also include storing in memory values of the weights in the base group. The method may further include storing in the memory a group index for each of the dependent groups. The method may also include storing in the memory an index for each of the weights in the dependent groups corresponding to one of the weights in the base group without storing in the memory values of the weights in the dependent groups. The objects and advantages of the embodiments may be realized and achieved at least by the elements, features, and combinations particularly pointed out in the claims. It is to be understood that both the foregoing general description and the following detailed description are given as examples, are explanatory and are not restrictive of the invention, as claimed.",
  "date_published": "20180215",
  "title": "REPRESENTATION OF WEIGHT VALUES IN AN ARTIFICIAL NEURAL NETWORK USING INTER-GROUP INDEXING",
  "ipcr_labels": [
    "G06N308"
  ],
  "_processing_info": {
    "original_size": 39574,
    "optimized_size": 2970,
    "reduction_percent": 92.5
  }
}