{
  "decision": "PENDING",
  "application_number": "15238869",
  "date_published": "20180222",
  "date_produced": "20180207",
  "title": "INTERRUPT SYNCHRONIZATION OF CONTENT BETWEEN CLIENT DEVICE AND CLOUD-BASED STORAGE SERVICE",
  "filing_date": "20160817",
  "inventor_list": [
    {
      "inventor_name_last": "Bailey",
      "inventor_name_first": "Steven",
      "inventor_city": "Bellevue",
      "inventor_state": "WA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Rodrigues",
      "inventor_name_first": "John D.",
      "inventor_city": "Woodinville",
      "inventor_state": "WA",
      "inventor_country": "US"
    }
  ],
  "ipcr_labels": [
    "H04L2908",
    "G06F30484",
    "H04L2906"
  ],
  "main_ipcr_label": "H04L2908",
  "summary": "<SOH> SUMMARY <EOH>This summary is provided to introduce a selection of concepts in a simplified form that are further described below in the Detailed Description. This summary is not intended to exclusively identify key features or essential features of the claimed subject matter, nor is it intended as an aid in determining the scope of the claimed subject matter. Embodiments may be provided to interrupt a synchronization of content between a client device and a cloud-based storage service. A usage pattern associated with a user in conjunction with the content may be identified. A model may be created based on the usage pattern. An operation attempted to be performed on the content by the user may be detected. Then, the attempted operation may be compared to the model to determine whether the attempted operation deviates from the usage pattern. In response to a determination that the attempted operation deviates from the usage pattern, an execution of the attempted operation may be halted and a notification of the attempted operation may be provided to the client device associated with the user for display. In some examples, the user may be allowed to approve the attempted operation upon authorization. These and other features and advantages will be apparent from a reading of the following detailed description and a review of the associated drawings. It is to be understood that both the foregoing general description and the following detailed description are explanatory and do not restrict aspects as claimed.",
  "patent_number": "None",
  "abstract": "Technologies may be provided to interrupt a synchronization of content between a client device and a cloud-based storage service. A usage pattern associated with a user in conjunction with the content may be identified. A model may be created based on the usage pattern. An operation attempted to be performed on the content by the user may be detected. Then, the attempted operation may be compared to the model to determine whether the attempted operation deviates from the usage pattern. In response to a determination that the attempted operation deviates from the usage pattern, an execution of the attempted operation may be halted and a notification of the attempted operation may be provided to a client device associated with the user for display.",
  "publication_number": "US20180054480A1-20180222",
  "_processing_info": {
    "original_size": 88921,
    "optimized_size": 3046,
    "reduction_percent": 96.57
  }
}