{
  "date_produced": "20161109",
  "publication_number": "US20160342907A1-20161124",
  "main_ipcr_label": "G06N9900",
  "decision": "PENDING",
  "application_number": "15230432",
  "inventor_list": [
    {
      "inventor_name_last": "Flinn",
      "inventor_name_first": "Steven Dennis",
      "inventor_city": "Sugar Land",
      "inventor_state": "TX",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Moneypenny",
      "inventor_name_first": "Naomi Felina",
      "inventor_city": "Houston",
      "inventor_state": "TX",
      "inventor_country": "US"
    }
  ],
  "abstract": "A self-assembling learning system and apparatus determines self-assembling actions that are expected to reduce uncertainties that are embodied as probabilities and then updates the probabilities in accordance with information that results from the performing of the self-assembling actions. The updated probabilities inform the determination of subsequent self-assembling actions. Neural networks, simulations of multiple potential self-assembling actions, and expected values of information may be applied in determining the self-assembling actions that are to be performed. Sensors may be applied to receive information that inform the updating of probabilities, and the self-assembling apparatus may be a robotic device. Self-assembling actions may comprise modifications to relationships between elements of a computer-implemented system.",
  "filing_date": "20160807",
  "patent_number": "None",
  "summary": "<SOH> SUMMARY OF INVENTION <EOH>In accordance with the embodiments described herein, a method and system for an adaptive decision process is disclosed. The adaptive decision process, as the process is known herein, addresses the shortcomings of the prior art by enabling an automatic closed loop approach to information gathering decisions and the evaluation of the results of the information gathering. Other features and embodiments will become apparent from the following description, from the drawings, and from the claims.",
  "date_published": "20161124",
  "title": "Self-Assembling Learning System and Apparatus",
  "ipcr_labels": [
    "G06N9900",
    "G06N504",
    "G06N700"
  ],
  "_processing_info": {
    "original_size": 98122,
    "optimized_size": 2086,
    "reduction_percent": 97.87
  }
}