{
  "decision": "PENDING",
  "application_number": "15233634",
  "date_published": "20180125",
  "date_produced": "20180109",
  "title": "Methods and Systems for Thermal Image Display",
  "filing_date": "20160810",
  "inventor_list": [
    {
      "inventor_name_last": "Ruther",
      "inventor_name_first": "Timothy",
      "inventor_city": "Carpentersville",
      "inventor_state": "IL",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Stefanik",
      "inventor_name_first": "Gary",
      "inventor_city": "Elmhurst",
      "inventor_state": "IL",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Covington",
      "inventor_name_first": "Joshua",
      "inventor_city": "San Juan Bautista",
      "inventor_state": "CA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Miskovic",
      "inventor_name_first": "Steven",
      "inventor_city": "Gilberts",
      "inventor_state": "IL",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Neri",
      "inventor_name_first": "Oswaldo",
      "inventor_city": "Los Banos",
      "inventor_state": "CA",
      "inventor_country": "US"
    }
  ],
  "ipcr_labels": [
    "H04N5445",
    "G06T700",
    "G06T1100",
    "H04N533",
    "H04N5232"
  ],
  "main_ipcr_label": "H04N5445",
  "summary": "<SOH> BRIEF DESCRIPTION OF THE DRAWINGS <EOH>Example embodiments are described herein with reference to the following drawings. FIG. 1 is a block diagram of a thermal imaging device and a server computing system. FIG. 2 is a block diagram of a thermal imaging device. FIG. 3 is a rear view of a thermal imaging device. FIG. 4 is a side view of a thermal imaging device. FIG. 5 is a front view of a thermal imaging device. FIG. 6 is a flow chart depicting an example method. FIG. 7 depicts a display of a thermal imaging device. FIG. 8 depicts a display of a thermal imaging device. FIG. 9 depicts a display of a thermal imaging device. FIG. 10 depicts a display of a thermal imaging device. FIG. 11 depicts a display of a thermal imaging device. FIG. 12 depicts a display of a thermal imaging device. FIG. 13 depicts a display of a thermal imaging device. FIG. 14 depicts a display of a thermal imaging device. FIG. 15 is a flow chart depicting an example method. FIG. 16 depicts a display of a thermal imaging device. FIG. 17 depicts a display of a thermal imaging device. FIG. 18 depicts a display of a thermal imaging device. FIG. 19 depicts a display of a thermal imaging device. FIG. 20 is a flow chart depicting an example method. FIG. 21 depicts a display of a thermal imaging device. FIG. 22 depicts a display of a thermal imaging device. FIG. 23 shows example screenshots displayed by a thermal imaging device. FIG. 24 shows example screenshots displayed by a thermal imaging device. FIG. 25 shows example screenshots displayed by a thermal imaging device. FIG. 26 shows example screenshots displayed by a thermal imaging device. FIG. 27 shows example screenshots displayed by a thermal imaging device. FIG. 28 shows example screenshots displayed by a thermal imaging device. FIG. 29 shows example screenshots displayed by a thermal imaging device. FIG. 30 shows example screenshots displayed by a thermal imaging device. FIG. 31 shows example screenshots displayed by a thermal imaging devi...",
  "patent_number": "None",
  "abstract": "An example method is performed by a thermal imaging device. The method includes capturing a thermal image of a vehicle and displaying the thermal image within a first region of a display of the thermal imaging device. The method further includes displaying information related to servicing the vehicle within a second region of the display that is distinct from the first region. Other example methods performed by a thermal imaging device are also disclosed herein.",
  "publication_number": "US20180027205A1-20180125",
  "_processing_info": {
    "original_size": 103246,
    "optimized_size": 3653,
    "reduction_percent": 96.46
  }
}