{
  "decision": "PENDING",
  "application_number": "15239540",
  "date_published": "20170223",
  "date_produced": "20170208",
  "title": "DATA PROCESSING WITH A PLANE COMPUTER",
  "filing_date": "20160817",
  "inventor_list": [
    {
      "inventor_name_last": "Stanley, II",
      "inventor_name_first": "Robert Elliott",
      "inventor_city": "Chico",
      "inventor_state": "CA",
      "inventor_country": "US"
    }
  ],
  "ipcr_labels": [
    "G06F2162",
    "G06F944"
  ],
  "main_ipcr_label": "G06F2162",
  "summary": "<SOH> BRIEF DESCRIPTION OF THE DRAWINGS <EOH>The present invention is illustrated by way of example, and not by way of limitation, in the figures of the accompanying drawings and in which like reference numerals refer to similar elements and in which: FIG. 1 illustrates an exemplary conventional computer processing technique illustrating a general processing direction of code; FIG. 2 illustrates am exemplary computer system, in accordance with an embodiment of the present invention; FIG. 3 , illustrates an exemplary plane of a plane computer, in accordance with an embodiment of the present invention; FIG. 4 , illustrates an exemplary configuration of a multiplicity of planes of a plane computer system, in accordance with an embodiment of the present invention; FIG. 5 , illustrates an exemplary configuration of processors of a plane computer system, in accordance with an embodiment of the present invention; FIG. 6 , illustrates another exemplary configuration of processors of a plane computer system, in accordance with an embodiment of the present invention; FIG. 7 illustrates a software module architecture of an exemplary plane computer system, in accordance with an embodiment of the present invention. detailed-description description=\"Detailed Description\" end=\"lead\"? Unless otherwise indicated illustrations in the figures are not necessarily drawn to scale.",
  "patent_number": "None",
  "abstract": "Lines of code/data may be processed on one or more planes, wherein a predetermined number of processors may process each line of code/data within the one or more planes. Additionally, each line of code may be processed with their own processor on a plane. Furthermore, a multiplicity of planes of processors may be stacked such that within each plane, thousands of lines of code may be processed separately and simultaneously by each one and/or a group of the predetermined number processors to provide great encryption abilities. In addition, each processor may be programmed differently and/or separately because each line of codes are processed separately. Processing of each line of code separately with different processors alleviates hacking of the system because each processor only reads or executes lines of code in it's assigned plane.",
  "publication_number": "US20170053126A1-20170223",
  "_processing_info": {
    "original_size": 105811,
    "optimized_size": 2775,
    "reduction_percent": 97.38
  }
}