{
  "date_produced": "20161116",
  "publication_number": "US20160350654A1-20161201",
  "main_ipcr_label": "G06N308",
  "decision": "PENDING",
  "application_number": "15233106",
  "inventor_list": [
    {
      "inventor_name_last": "LEE",
      "inventor_name_first": "WEN-SUNG",
      "inventor_city": "TAICHUNG CITY",
      "inventor_state": "",
      "inventor_country": "TW"
    }
  ],
  "abstract": "An intelligent home system installed in a house and interacted with appliances in the house comprises an identification device; a locating device; and an artificial neural device; the artificial neural device includes a recording unit, a learning unit, and a decision making unit, the recording unit, the learning unit, and the decision making unit are transmitted signals to one another, the recording unit records and stores the ID information, the coordinate information, and a control information of each appliance which is adjusted by the user, the learning unit reads the ID information, the coordinate information, and the control information so as to automatically learn and integrate to generate an integrated data, and the decision making unit reads the integrated data to adjust the appliances to an operational status which the user is used to.",
  "filing_date": "20160810",
  "patent_number": "None",
  "summary": "<SOH> SUMMARY OF THE INVENTION <EOH>An main objective of the present invention is to provide an intelligent home system and method which are capable for recording, learning, and predicting. The identity of the user in the house may be identified and the appliances in the house may be automatically controlled and adjusted to an operational status which the user is used to so as to achieve the effects of intelligent activation and controlling environment. An intelligent home system which is installed in a house and interacted with appliances arranged in the house may comprise an identification device, identified an identity of an user stayed in the house and outputted an ID information of the user; a locating device, detected a coordinate of the user stayed in the house and outputted a coordinate information; and an artificial neural device, electrically connected with the identification device and the locating device, the artificial neural device includes a recording unit, a learning unit, and a decision making unit, the recording unit, the learning unit, and the decision making unit are transmitted signals to one another, the recording unit records and stores the ID information, the coordinate information, and a control information of each appliance which is adjusted by the user, the learning unit reads the ID information, the coordinate information, and the control information recorded and stored in the recording unit so as to automatically learn and integrate to generate an integrated data, and the decision making unit reads the integrated data to adjust the appliances to an operational status which the user is used to. The intelligent home system may further comprise a time tracker electrically connected with the recording unit, the time tracker continuously records a staying time of the user who stays in the coordinate and then transmit a time information to the recording unit to store. In some embodiment, the artificial neural device further comprises a ranking...",
  "date_published": "20161201",
  "title": "INTELLIGENT HOME SYSTEM AND METHOD",
  "ipcr_labels": [
    "G06N308"
  ],
  "_processing_info": {
    "original_size": 40262,
    "optimized_size": 3380,
    "reduction_percent": 91.6
  }
}