{
  "decision": "PENDING",
  "application_number": "15237159",
  "date_published": "20180215",
  "date_produced": "20180131",
  "title": "Displaying Content Associated With a Previous Visit of a Current Asset",
  "filing_date": "20160815",
  "inventor_list": [
    {
      "inventor_name_last": "Gupta",
      "inventor_name_first": "Karan M.",
      "inventor_city": "Fremont",
      "inventor_state": "CA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Krishna",
      "inventor_name_first": "Ashish",
      "inventor_city": "Hyderabad",
      "inventor_state": "",
      "inventor_country": "IN"
    }
  ],
  "ipcr_labels": [
    "G06F1730"
  ],
  "main_ipcr_label": "G06F1730",
  "summary": "<SOH> SUMMARY <EOH>This Summary is provided to introduce a selection of concepts in a simplified form that are further described below in the Detailed Description. This Summary is not intended to identify key features or essential features of the claimed subject matter, nor is it intended to be used to limit the scope of the claimed subject matter. Various embodiments provide a context-based proactive search that can automatically, in a seamless manner, display or otherwise make available content associated with a previous visit of a current asset. An “asset” can be considered as any online or electronic resource from which content can be saved. An asset can include, by way of example and not limitation, a webpage or other web-based resource. Various embodiments utilize a depository to save information associated with content that has been saved by a user or content in which the user has an implied interest. When the user returns to a particular asset, the depository is automatically searched for content associated with the particular asset that has been saved. A user interface instrumentality is presented and automatically displays the saved content, or indicia of the saved content—termed a “reminder”—from the previous visit. In this manner, the user does not have to physically search for saved content from a previously-visited asset. Rather, the saved content or indicia thereof is automatically presented in a user interface instrumentality that enables the user to select the reminder to quickly and conveniently retrieve saved content.",
  "patent_number": "None",
  "abstract": "Various embodiments provide a context-based proactive search that can automatically, in a seamless manner, display or otherwise make available content associated with a previous visit of a current asset. Various embodiments utilize a depository to save information associated with content that has been saved by a user or content in which the user has an implied interest. When the user returns to a particular asset, the depository is automatically searched for content associated with the particular asset that has been saved. A user interface instrumentality is presented and automatically displays the saved content, or indicia of the saved content—termed a “reminder”—from the previous visit. In this manner, the user does not have to physically search for saved content from a previously-visited asset. Rather, the saved content or indicia thereof is automatically presented in a user interface instrumentality that enables the user to select the reminder to quickly and conveniently retrieve s...",
  "publication_number": "US20180046719A1-20180215",
  "_processing_info": {
    "original_size": 53300,
    "optimized_size": 3318,
    "reduction_percent": 93.77
  }
}