{
  "date_produced": "20180131",
  "publication_number": "US20180046920A1-20180215",
  "main_ipcr_label": "G06N308",
  "decision": "PENDING",
  "application_number": "15233083",
  "inventor_list": [
    {
      "inventor_name_last": "Yang",
      "inventor_name_first": "Yaqin",
      "inventor_city": "San Jose",
      "inventor_state": "CA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Kurniadi",
      "inventor_name_first": "Fransisco",
      "inventor_city": "Dublin",
      "inventor_state": "CA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Lu",
      "inventor_name_first": "Lingyi",
      "inventor_city": "San Jose",
      "inventor_state": "CA",
      "inventor_country": "US"
    }
  ],
  "abstract": "Various systems, mediums, and methods may perform operations, such as collecting various types of data from one or more data sources. Further, the operations may include learning user behaviors based on iterations of the collected historical data with a recurrent neural network (RNN) with long short term memory (LSTM). Yet further, the operations may include determining one or more feature vectors that represents the learned user behaviors. In addition, the operations may include generating one or more models associated with the learned user behaviors based on the one or more determined vectors.",
  "filing_date": "20160810",
  "patent_number": "None",
  "summary": "<SOH> BRIEF DESCRIPTION OF THE DRAWINGS <EOH>FIG. 1 is a block diagram of an exemplary system, according to an embodiment; FIG. 2A illustrates an exemplary neural network, according to an embodiment; FIG. 2B illustrates exemplary network nodes, according to an embodiment; FIG. 3A illustrates an exemplary neural network, according to an embodiment; FIG. 3B illustrates an exemplary neural network with a hidden-layer transfer, according to an embodiment; FIG. 3C illustrates an exemplary neural network with a second hidden-layer transfer, according to an embodiment; FIG. 3D illustrates an exemplary neural network with a third hidden-layer transfer, according to an embodiment; FIG. 3E illustrates exemplary network nodes, according to an embodiment; FIG. 4 illustrates an exemplary method, according to an embodiment; FIG. 5 is a block diagram of an exemplary system, according to an embodiment; FIG. 6A illustrates an exemplary system configured to support a set of trays, according to an embodiment; FIG. 6B illustrates an exemplary tray configured to support one or more components, according to an embodiment; and FIG. 7 illustrates an exemplary system with a client device, according to an embodiment. detailed-description description=\"Detailed Description\" end=\"lead\"? Embodiments of the present disclosure and their advantages may be understood by referring to the detailed description herein. It should be appreciated that reference numerals may be used to illustrate various elements and features provided in the figures. The figures may illustrate various examples for purposes of illustration and explanation related to the embodiments of the present disclosure and not for purposes of any limitation.",
  "date_published": "20180215",
  "title": "User Data Learning Based on Recurrent Neural Networks with Long Short Term Memory",
  "ipcr_labels": [
    "G06N308",
    "G06N304"
  ],
  "_processing_info": {
    "original_size": 80401,
    "optimized_size": 3187,
    "reduction_percent": 96.04
  }
}