{
  "date_produced": "20170119",
  "publication_number": "US20170032259A1-20170202",
  "main_ipcr_label": "G06N504",
  "decision": "PENDING",
  "application_number": "15231400",
  "inventor_list": [
    {
      "inventor_name_last": "Goranson",
      "inventor_name_first": "Harold T.",
      "inventor_city": "Virginia Beach",
      "inventor_state": "VA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Cardier",
      "inventor_name_first": "Beth",
      "inventor_city": "Virginia Beach",
      "inventor_state": "VA",
      "inventor_country": "US"
    }
  ],
  "abstract": "Method and system for modeling of complex systems using a two-sorted reasoning system. Information is received by Distributed Feature Extraction Processors. A first level of reasoning is performed on the information by Distributed Regular Reasoning Processors. A second reasoning process is performed on the information by Distributed Situation Reasoning Processors, which use a Functional Fabric configured to analyze the information received and use functions to modify previous inferences. Client applications allow for viewing and manipulating both reasoning systems and their associated information.",
  "filing_date": "20160808",
  "patent_number": "None",
  "summary": "<SOH> BRIEF DESCRIPTION OF THE DRAWINGS <EOH>FIG. 1 a illustrates an embodiment of the system architecture; FIG. 1 b illustrates a computer network according to embodiments described herein; FIG. 2 illustrates a related system architecture according to an embodiment described in U.S. Pat. No. 8,751,918; FIG. 3 illustrates a related system architecture according to an embodiment described in U.S. Pat. No. 9,117,167; FIG. 4 illustrates a related system architecture according to an embodiment described in application Ser. No. 13/919,751; FIG. 5 illustrates a related system architecture according to an embodiment described in application Ser. No. 14/740,528; FIG. 6 illustrates steps for specifying futures; FIG. 7 illustrates an example of a user interface for specifying futures; FIG. 8 illustrates examples of steps for modifying Ontology Graphs; FIG. 9 illustrates an example of a user interface for modifying Ontology Graphs; FIG. 10 illustrates examples of steps for relating ontologies; FIG. 11 illustrates an example of a user interface for relating ontologies; FIG. 12 illustrates examples of topology and functor operations; FIG. 13 illustrates examples of overlapping Ontology Graphs; FIG. 14 illustrates an example of a categoric cell; FIG. 15 illustrates an example of modifying the Concept Lattice; FIG. 16 illustrates an example of composition on a Space-Time view; FIG. 17 illustrates examples of layers of a Space-Time view; FIG. 18 illustrates an example of infon nesting; FIG. 19 illustrates an example of a Concept Lattice and its Half-Dual; FIG. 20 illustrates an example of a Concept Lattice on a Space-Time view; FIG. 21 illustrates an example of an annotated Space-Time view; FIG. 22 illustrates an example of an Ontology Graph on a Narrative Model; FIG. 23 illustrates an example of a text outline; FIG. 24 illustrates an example of an infon outline; FIG. 25 illustrates examples of Concept Lattice nodes; FIG. 26 illustrates an example of a Concept Lattice; FIG. 27 illu...",
  "date_published": "20170202",
  "title": "SYSTEM AND METHOD FOR MODELING COMPLEX LAYERED SYSTEMS",
  "ipcr_labels": [
    "G06N504",
    "G06N9900"
  ],
  "_processing_info": {
    "original_size": 112376,
    "optimized_size": 3320,
    "reduction_percent": 97.05
  }
}