{
  "date_produced": "20180131",
  "publication_number": "US20180046910A1-20180215",
  "main_ipcr_label": "G06N308",
  "decision": "PENDING",
  "application_number": "15233414",
  "inventor_list": [
    {
      "inventor_name_last": "Greene",
      "inventor_name_first": "Michael",
      "inventor_city": "San Francisco",
      "inventor_state": "CA",
      "inventor_country": "US"
    }
  ],
  "abstract": "The present disclosure provides systems and methods that use machine-learned models, such as deep neural networks, to predict and prevent adverse conditions at structural assets. One example method includes obtaining data descriptive of a plurality of images that depict at least a portion of a geographic area that contains a first structural asset. The plurality of images include at least a first image captured at a first time and a second image captured at a second time that is different than the first time. The method includes inputting data descriptive of at least the first image, the first time, the second image, and the second time into a condition prediction model. The method includes receiving, as an output of the condition prediction model, at least one prediction regarding the occurrence of an adverse condition at the first structural asset during one or more future time periods.",
  "filing_date": "20160810",
  "patent_number": "None",
  "summary": "<SOH> SUMMARY <EOH>Aspects and advantages of embodiments of the present disclosure will be set forth in part in the following description, or can be learned from the description, or can be learned through practice of the embodiments. One example aspect of the present disclosure is directed to a computing system to predict and prevent instances of vegetative overgrowth on utility infrastructure. The computing system includes at least one processor and at least one tangible, non-transitory computer-readable medium that stores instructions that, when executed by the at least one processor, cause the computing system to perform operations. Execution of the instructions causes the computing system to obtain data descriptive of a plurality of images that depict at least a portion of a geographic area that contains a first utility asset, the plurality of images includes at least a first image and a second image, the first image and the second image being different from each other in at least one of the following attributes: time of capture, location of capture, angle of capture, data type, and resolution. Execution of the instructions causes the computing system to input data descriptive of at least the first image and the second image into a machine-learned vegetation overgrowth prediction model that includes at least one neural network. Execution of the instructions causes the computing system to receive, as an output of the vegetative overgrowth prediction model, at least one prediction regarding the occurrence of a vegetative overgrowth condition at the first utility asset during one or more future time periods. Another example aspect of the present disclosure is directed to a computer-implemented method to predict and prevent adverse conditions at structural assets. The method includes obtaining, by one or more computing devices, data descriptive of a plurality of images that depict at least a portion of a geographic area that contains a first structural asset. The pl...",
  "date_published": "20180215",
  "title": "Deep Machine Learning to Predict and Prevent Adverse Conditions at Structural Assets",
  "ipcr_labels": [
    "G06N308",
    "G06N502"
  ],
  "_processing_info": {
    "original_size": 108244,
    "optimized_size": 3490,
    "reduction_percent": 96.78
  }
}