{
  "date_produced": "20180131",
  "publication_number": "US20180046912A1-20180215",
  "main_ipcr_label": "G06N308",
  "decision": "PENDING",
  "application_number": "15236197",
  "inventor_list": [
    {
      "inventor_name_last": "Kurata",
      "inventor_name_first": "Gakuto",
      "inventor_city": "Tokyo",
      "inventor_state": "",
      "inventor_country": "JP"
    }
  ],
  "abstract": "Methods and a system are provided for generating labeled data. A method includes encoding, by a processor-based encoder, a first labeled data into an encoded representation of the first labeled data. The method further includes modifying the encoded representation into a modified representation by adding a perturbation to the encoded representation. The method additionally includes decoding, by a processor-based decoder, the modified representation into a second labeled data.",
  "filing_date": "20160812",
  "patent_number": "None",
  "summary": "<SOH> SUMMARY <EOH>According to an aspect of the present principles, a method is provided for generating labeled data. The method includes encoding, by a processor-based encoder, a first labeled data into an encoded representation of the first labeled data. The method further includes modifying the encoded representation into a modified representation by adding a perturbation to the encoded representation. The method additionally includes decoding, by a processor-based decoder, the modified representation into a second labeled data. According to another aspect of the present principles, a computer program product is provided for generating labeled data. The computer program product includes a non-transitory computer readable storage medium having program instructions embodied therewith. The program instructions executable by a computer to cause the computer to perform a method. The method includes encoding, by a processor-based encoder, a first labeled data into an encoded representation of the first labeled data. The method further includes modifying the encoded representation into a modified representation by adding a perturbation to the encoded representation. The method also includes decoding, by a processor-based decoder, the modified representation into a second labeled data. According to yet another aspect of the present principles, a system is provided for generating labeled data. The system includes a processor and a memory, configured to encode a first labeled data into an encoded representation of the first labeled data. The processor and the memory are further configured to modify the encoded representation into a modified representation by adding a perturbation to the encoded representation. The processor and the memory are also configured to decode the modified representation into a second labeled data. According to still another aspect of the present principles, a method is provided for generating labeled data. The method includes encoding, by a long ...",
  "date_published": "20180215",
  "title": "GENERATING LABELED DATA BY SEQUENCE-TO-SEQUENCE MODELING WITH ADDED PERTURBATIONS TO ENCODED INFORMATION",
  "ipcr_labels": [
    "G06N308",
    "G06N3063"
  ],
  "_processing_info": {
    "original_size": 58097,
    "optimized_size": 3079,
    "reduction_percent": 94.7
  }
}