{
  "decision": "PENDING",
  "application_number": "15233264",
  "date_published": "20170518",
  "date_produced": "20170503",
  "title": "METHOD FOR EXECUTING FUNCTION OF ELECTRONIC DEVICE USING BIO-SIGNAL AND ELECTRONIC DEVICE THEREFOR",
  "filing_date": "20160810",
  "inventor_list": [
    {
      "inventor_name_last": "JEONG",
      "inventor_name_first": "Dae-Ung",
      "inventor_city": "Gyeongsangbuk-do",
      "inventor_state": "",
      "inventor_country": "KR"
    },
    {
      "inventor_name_last": "KWON",
      "inventor_name_first": "Hyou-Joo",
      "inventor_city": "Gyeonggi-do",
      "inventor_state": "",
      "inventor_country": "KR"
    },
    {
      "inventor_name_last": "LEE",
      "inventor_name_first": "Tae-Han",
      "inventor_city": "Seoul",
      "inventor_state": "",
      "inventor_country": "KR"
    },
    {
      "inventor_name_last": "CHOI",
      "inventor_name_first": "Won-Suk",
      "inventor_city": "Seoul",
      "inventor_state": "",
      "inventor_country": "KR"
    }
  ],
  "ipcr_labels": [
    "H04M1725",
    "G06F301",
    "G09G530",
    "H04W422"
  ],
  "main_ipcr_label": "H04M1725",
  "summary": "<SOH> SUMMARY <EOH>An aspect of the present disclosure is to provide an electronic device that can automatically switch from a receiver mode to a speaker mod or a video mode during a call or automatically switch from the speaker mode or the video mode to the receiver mode, using a value measured by a biometric or other sensors mounted in the electronic device, and an operation method thereof. In accordance with an aspect of the present disclosure, a method by an electronic device may include detecting a bio-signal related to a user of the electronic device from at least one biometric sensor of the electronic device, and switching a mode or controlling a volume of a communication session between the electronic device and another electronic device based on at least part of the bio-signal. In accordance with another aspect of the present disclosure, an electronic device may include at least one biometric sensor and a processor. The processor may be configured to detect a bio-signal related to a user of the electronic device using the at least one biometric sensor, and switch a mode or control a volume of a communication session between the electronic device and another electronic device based on at least in part of the bio-signal. In accordance with further another aspect of the present disclosure, there is provided a storage medium storing instructions executed by at least one processor. The instructions may be set to allow the at least one processor to perform at least one operation including: detecting a bio-signal related to a user of an electronic device using at least one biometric sensor of the electronic device, and switching a mode or control a volume of a communication session between the electronic device and another electronic device based on at least part of the bio-signal. Other aspects, advantages, and salient features of the disclosure will become apparent to those skilled in the art from the following detailed description, which, taken in conjunction w...",
  "patent_number": "None",
  "abstract": "A method by an electronic device may include detecting a bio-signal related to a user of the electronic device from at least one biometric sensor of the electronic device, and switching a mode or controlling a volume of a communication session between the electronic device and another electronic device based on at least part of the bio-signal. Other embodiments are also possible.",
  "publication_number": "US20170142244A1-20170518",
  "_processing_info": {
    "original_size": 113420,
    "optimized_size": 3435,
    "reduction_percent": 96.97
  }
}