{
  "decision": "ACCEPTED",
  "application_number": "15235099",
  "date_published": "20161201",
  "date_produced": "20161116",
  "title": "INTRA-PREMISES CONTENT AND EQUIPMENT MANAGEMENT IN A FEMTOCELL NETWORK",
  "filing_date": "20160811",
  "inventor_list": [
    {
      "inventor_name_last": "Huber",
      "inventor_name_first": "Kurt Donald",
      "inventor_city": "Kennesaw",
      "inventor_state": "GA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Mansfield",
      "inventor_name_first": "William Gordon",
      "inventor_city": "Sugar Hill",
      "inventor_state": "GA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Flynn",
      "inventor_name_first": "Judson John",
      "inventor_city": "Decatur",
      "inventor_state": "GA",
      "inventor_country": "US"
    }
  ],
  "ipcr_labels": [
    "H04W4002",
    "H04W1206",
    "G06F1900",
    "H04W1208",
    "H04L2906"
  ],
  "main_ipcr_label": "H04W4002",
  "summary": "<SOH> BRIEF DESCRIPTION OF THE DRAWINGS <EOH>FIG. 1 illustrates a diagram of an example enterprise femto network in accordance with aspects of the subject specification. FIGS. 2A-2C illustrate, respectively, a block diagram of an example multi-coverage-area femto mesh network and a block diagram of an example femto mesh network in which routing in a multi-loci environment is decentralized, and an example femto mesh network wherein various routing platforms related to various enterprise deployments are multiplexed in accordance with aspects described herein. FIG. 3 displays a block diagram of an example embodiment of a routing platform that is part of an enterprise femto network architecture in accordance with aspects disclosed herein. FIG. 4 illustrates an example embodiment of a femto access point that can be deployed in a femto enterprise network in accordance with aspects described herein. FIG. 5 illustrates a diagram of an example embodiment of a femto enterprise network architecture that enables collection of location data in accordance with aspects of the subject embodiments. FIG. 6 illustrates a block diagram of an example embodiment of a routing platform that is part of an enterprise femto network architecture in accordance with aspects disclosed herein. FIGS. 7A and 7B illustrates diagrams of example embodiments of a femto enterprise network architecture that enables collection of location data of a mobile in accordance with aspects of the subject embodiments. FIG. 8 illustrates an example embodiment of a routing platform that can be part of an enterprise femto network architecture in accordance with aspects of the disclosure. FIG. 9 represents an example system that enables customized item navigation at least in part through an example enterprise femto network in accordance with aspects described herein. FIG. 10 illustrates an example embodiment of a routing platform that can operate within an enterprise femto network in accordance with aspects described h...",
  "patent_number": "9775037",
  "abstract": "Traffic and signaling is routed between a set of networked femto access points (APs) and devices served there from, and content and equipment that is part of a network functionally coupled to the set of networked femto APs is managed. Networked equipment spans a network deployed within the coverage area spanned by the set of femto APs. A routing platform functionally couples the networked equipment and the femto AP to enable content manipulation amongst a mobile device and the equipment. Routing platform also affords remote control of the networked equipment. Delivery of advertisement and monetary incentive(s) can be provided through the routing platform to the equipment. Routing platform further provides security features related to operation of specific equipment and wireless services supplied via the routing platform.",
  "publication_number": "US20160353351A1-20161201",
  "_processing_info": {
    "original_size": 221371,
    "optimized_size": 3756,
    "reduction_percent": 98.3
  }
}