{
  "decision": "PENDING",
  "application_number": "15234237",
  "date_published": "20180215",
  "date_produced": "20180131",
  "title": "DETERMINING A NON-OPTIMIZED INVENTORY SYSTEM",
  "filing_date": "20160811",
  "inventor_list": [
    {
      "inventor_name_last": "Helander",
      "inventor_name_first": "Mary E.",
      "inventor_city": "North White Plains",
      "inventor_state": "NY",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Hurst",
      "inventor_name_first": "Jared R.",
      "inventor_city": "Marysville",
      "inventor_state": "OH",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Narayanan",
      "inventor_name_first": "Magesh A.",
      "inventor_city": "New Albany",
      "inventor_state": "OH",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Raman",
      "inventor_name_first": "Priya",
      "inventor_city": "New Albany",
      "inventor_state": "OH",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Wells, IV",
      "inventor_name_first": "Harry J.",
      "inventor_city": "Columbus",
      "inventor_state": "OH",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Williams-Ward",
      "inventor_name_first": "Britney N.",
      "inventor_city": "Reynoldsburg",
      "inventor_state": "OH",
      "inventor_country": "US"
    }
  ],
  "ipcr_labels": [
    "G06Q1008"
  ],
  "main_ipcr_label": "G06Q1008",
  "summary": "<SOH> SUMMARY <EOH>Aspects of an embodiment of the present invention disclose a method, a computer system, and a computer program product for determining a non-optimal inventory system. The method includes retrieving, by one or more computer processors, a plurality of data related to a supply chain, wherein the plurality of data related to the supply chain includes transactional sales and purchase order data for one or more products on hand at each a plurality of locations in the supply chain. The method includes determining, by the one or more computer processors, an inventory history for the supply chain. The method includes creating, by the one or more computer processors, a set of linear difference equations based, at least in part, the plurality of data related to the supply chain, wherein the set of linear difference equations represent a plurality of changes of an inventory level for the one or more products on hand at each of the plurality of locations in the supply chain. The method includes determining, by the one or more computer processors, a plurality of supply chain performance measurements of interest. The method includes determining, by the one or more computer processors, one or more non-optimal inventory management practices, wherein determining includes determining a quantification correction to an inventory level of a product at each of a plurality of points in a time interval through utilizing a reconstructed inventory history, wherein the quantification correction to the inventory level of the product is a value to increase or decrease an actual inventory on hand in order to align the actual inventory on hand to an optimal inventory on hand.",
  "patent_number": "None",
  "abstract": "A tool for determining a non-optimized inventory system is provided. The tool retrieves a plurality of data related to a supply chain. The tool determines an inventory history for the supply chain. The tool creates a set of linear difference equations based, at least in part, the plurality of data related to the supply chain. The tool determines a plurality of supply chain performance measurements of interest. The tool determines one or more non-optimal inventory management practices.",
  "publication_number": "US20180046971A1-20180215",
  "_processing_info": {
    "original_size": 56842,
    "optimized_size": 3485,
    "reduction_percent": 93.87
  }
}