{
  "decision": "PENDING",
  "application_number": "15233233",
  "date_published": "20170216",
  "date_produced": "20170201",
  "title": "METHOD FOR PROVIDING PHYSIOLOGICAL STATE INFORMATION AND ELECTRONIC DEVICE FOR SUPPORTING THE SAME",
  "filing_date": "20160810",
  "inventor_list": [
    {
      "inventor_name_last": "LEE",
      "inventor_name_first": "Eun Hye",
      "inventor_city": "Seoul",
      "inventor_state": "",
      "inventor_country": "KR"
    },
    {
      "inventor_name_last": "AHN",
      "inventor_name_first": "Eun Ji",
      "inventor_city": "Seoul",
      "inventor_state": "",
      "inventor_country": "KR"
    },
    {
      "inventor_name_last": "LIM",
      "inventor_name_first": "Dok Shin",
      "inventor_city": "Gwacheon-si",
      "inventor_state": "",
      "inventor_country": "KR"
    },
    {
      "inventor_name_last": "LIM",
      "inventor_name_first": "Tae Kyeung",
      "inventor_city": "Seoul",
      "inventor_state": "",
      "inventor_country": "KR"
    },
    {
      "inventor_name_last": "OK",
      "inventor_name_first": "Joon Ho",
      "inventor_city": "Seoul",
      "inventor_state": "",
      "inventor_country": "KR"
    }
  ],
  "ipcr_labels": [
    "G06F30484",
    "G06F30346",
    "A63B2400",
    "G06F30488",
    "A63B7106",
    "G06F116",
    "G06F301"
  ],
  "main_ipcr_label": "G06F30484",
  "summary": "<SOH> SUMMARY <EOH>Aspects of the present disclosure are to address at least the above-mentioned problems and/or disadvantages and to provide at least the advantages described below. Accordingly, an aspect of the present disclosure is to provide a method for providing physiological state information to provide a user interface (UI) including a display object corresponding to physiological state information and to change the UI or a display object included in the UI based on a change of the physiological state and an electronic device for supporting the same. In accordance with an aspect of the present disclosure, a wearable electronic device is provided. The wearable electronic device includes a sensor module configured to measure motion of the wearable electronic device, a display configured to provide a UI including a plurality of movable particles, and a processor configured to reduce the number of the plurality of movable particles based on the measured motion of the wearable device. In accordance with another aspect of the present disclosure, a wearable electronic device is provided. The wearable electronic device includes a sensor module configured to obtain physiological state information, a display configured to provide a UI including a plurality of display objects corresponding to the physiological state information, and a processor configured to change a display state of at least one of the plurality of display objects in response to a change in the physiological state information. Other aspects, advantages, and salient features of the disclosure will become apparent to those skilled in the art from the following detailed description, which, taken in conjunction with the annexed drawings, discloses various embodiments of the present disclosure.",
  "patent_number": "None",
  "abstract": "An apparatus and method for providing physiological state information are provided. The apparatus includes a wearable electronic device. The wearable electronic device includes a sensor module configured to measure motion of the wearable electronic device, a display configured to provide a user interface (UI) including movable particles displayed on the display, and a processor configured to reduce the number of the displayed movable particles based on the measured motion of the wearable device.",
  "publication_number": "US20170046052A1-20170216",
  "_processing_info": {
    "original_size": 121397,
    "optimized_size": 3500,
    "reduction_percent": 97.12
  }
}