{
  "decision": "PENDING",
  "application_number": "15233008",
  "date_published": "20170216",
  "date_produced": "20170201",
  "title": "METHODS AND SYSTEMS FOR BLOCKING MALWARE ATTACKS",
  "filing_date": "20160810",
  "inventor_list": [
    {
      "inventor_name_last": "HAMID",
      "inventor_name_first": "LAURENCE",
      "inventor_city": "OTTAWA",
      "inventor_state": "",
      "inventor_country": "CA"
    }
  ],
  "ipcr_labels": [
    "H04L2906",
    "G06K714"
  ],
  "main_ipcr_label": "H04L2906",
  "summary": "<SOH> SUMMARY OF THE INVENTION <EOH>It is an object of the present invention to address limitations within the prior art relating to malware blocking and more particularly to automated, lightweight, and strongly authenticated methods of providing user credentials as part of user activities on workstations that prevent malware access to these user credentials. In accordance with an embodiment of the invention there is provided a method of verifying a transaction to be performed by a software application in execution upon an electronic device by establishing an encrypted mutually authenticated secure channel between the software application and a portable electronic device associated with a user establishing the transaction. In accordance with an embodiment of the invention there is provided a method of verifying a transaction to be performed by a software application in execution upon an electronic device in dependence upon communications between the software application, a phone relay service, and a device associated with a user at least one of initiating and authorizing the transaction, wherein the initiator of the application is one of the user and the software application. In accordance with an embodiment of the invention there is provided a method of verifying a transaction to be performed by a software application in execution upon an electronic device in dependence upon communications between the software application and a device associated with a user at least one of initiating and authorizing the transaction. In accordance with an embodiment of the invention there is provided a method of verifying a transaction to be performed by a software application in execution upon an electronic device in dependence upon communications between the software application, a authentication server, and a device associated with a user at least one of initiating and authorizing the transaction, wherein the software application and device each only communicate with the authenti...",
  "patent_number": "None",
  "abstract": "User identities, password, etc. represent the barrier between a user's confidential data and any other third party seeking to access this data. As multiple software applications, web applications, web services, etc. embody this confidential data it is a tradeoff between easy recollection of said identities, passwords, etc. and data security. However, malware by intercepting user credentials provides third parties access to even complex passwords, user credentials, security keys etc. even where these are changed/updated regularly. Within the prior art substantial work has gone into addressing malware. However, in many instances the user is at or very near the computer with a software application executing a transaction requiring credentials/authorisation with a portable electronic device or another device. Accordingly, it would be beneficial to provide users with an out-of-band communications channel for exchanging credentials and/or keys etc.",
  "publication_number": "US20170048257A1-20170216",
  "_processing_info": {
    "original_size": 101318,
    "optimized_size": 3502,
    "reduction_percent": 96.54
  }
}