{
  "decision": "PENDING",
  "application_number": "15244924",
  "date_published": "20170302",
  "date_produced": "20170214",
  "title": "AUTOMATED CONVERSION TOOL FOR FACILITATING MIGRATION BETWEEN DATA INTEGRATION PRODUCTS",
  "filing_date": "20160823",
  "inventor_list": [
    {
      "inventor_name_last": "Dudhani",
      "inventor_name_first": "Vijaykumar",
      "inventor_city": "Fremont",
      "inventor_state": "CA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Paramasivam",
      "inventor_name_first": "Ashok",
      "inventor_city": "Madurai",
      "inventor_state": "",
      "inventor_country": "IN"
    },
    {
      "inventor_name_last": "Merchant",
      "inventor_name_first": "Husain",
      "inventor_city": "Pune",
      "inventor_state": "",
      "inventor_country": "IN"
    },
    {
      "inventor_name_last": "Raj",
      "inventor_name_first": "Amit",
      "inventor_city": "San Jose",
      "inventor_state": "CA",
      "inventor_country": "US"
    }
  ],
  "ipcr_labels": [
    "G06F1730",
    "G06F30482"
  ],
  "main_ipcr_label": "G06F1730",
  "summary": "<SOH> SUMMARY <EOH>Techniques for automatically converting data integration (DI) metadata between two different types of DI products are provided. According to one embodiment, a computer system can execute one or more pre-conversion tasks with respect to first DI metadata used by a first DI product, where the one or more pre-conversion tasks including exporting the first DI metadata into an intermediate format. The computer system can then convert, in an automated or semi-automated manner, the first DI metadata from the intermediate format into second DI metadata usable by a second DI product. The following detailed description and accompanying drawings provide a better understanding of the nature and advantages of particular embodiments.",
  "patent_number": "None",
  "abstract": "Techniques for automatically converting data integration (DI) metadata between two different types of DI products are provided. According to one embodiment, a computer system can execute one or more pre-conversion tasks with respect to first DI metadata used by a first DI product, where the one or more pre-conversion tasks including exporting the first DI metadata into an intermediate format. The computer system can then convert, in an automated or semi-automated manner, the first DI metadata from the intermediate format into second DI metadata usable by a second DI product.",
  "publication_number": "US20170060974A1-20170302",
  "_processing_info": {
    "original_size": 61885,
    "optimized_size": 2349,
    "reduction_percent": 96.2
  }
}