{
  "date_produced": "20170603",
  "publication_number": "US20170169349A1-20170615",
  "main_ipcr_label": "G06N504",
  "decision": "REJECTED",
  "application_number": "15248497",
  "inventor_list": [
    {
      "inventor_name_last": "Qi",
      "inventor_name_first": "Li",
      "inventor_city": "Beijing",
      "inventor_state": "",
      "inventor_country": "CN"
    }
  ],
  "abstract": "The embodiment of the present disclosure discloses a recommending method and a recommending device. The recommending method specifically includes the following steps: generating at least one piece of recommended content according to ecological historical behavior data of a user, wherein the ecological historical behavior data of the user include at least one of the following historical behavior data: historical behavior data of the user in at least two applications installed on at least one terminal, and historical behavior data of the user in at least one application installed on at least two terminals; recommending the recommended content to the user.",
  "filing_date": "20160826",
  "patent_number": "None",
  "summary": "<SOH> SUMMARY <EOH>The embodiment of the present disclosure discloses a recommending method and a recommending device, aims to solve the defect that the accuracy in recommending music to a user by using a conventional music recommending scheme is relatively low, and aims to improve the accuracy of recommended content. An embodiment of the present disclosure discloses a recommending method, including: generating at least one piece of recommended content according to ecological historical behavior data of a user, wherein the ecological historical behavior data of the user comprise at least one of the following historical behavior data: historical behavior data of the user on at least two applications installed on at least one terminal, and historical behavior data of the user in at least one application installed on at least two terminals; recommending the recommended content to the user. An embodiment of the present disclosure discloses an electronic device, including: at least one processor; and a memory communicably connected with the at least one processor for storing instructions executable by the at least one processor, wherein execution of the instructions by the at least one processor causes the at least one processor to: generate at least one piece of recommended content according to ecological historical behavior data of a user, wherein the ecological historical behavior data of the user comprise at least one of the following historical behavior data: historical behavior data of the user in at least two applications installed on at least one terminal, and historical behavior data of the user in at least one application installed on at least two terminals; recommend the recommended content to the user. An embodiment of the present disclosure discloses a computer program, which includes computer readable codes for enabling an intelligent terminal to execute the recommending method above when the computer readable codes are operated on the intelligent terminal....",
  "date_published": "20170615",
  "title": "RECOMMENDING METHOD AND ELECTRONIC DEVICE",
  "ipcr_labels": [
    "G06N504",
    "G06N9900"
  ],
  "_processing_info": {
    "original_size": 63652,
    "optimized_size": 3192,
    "reduction_percent": 94.99
  }
}