{
  "decision": "REJECTED",
  "application_number": "15247125",
  "date_published": "20170928",
  "date_produced": "20170915",
  "title": "METHOD AND ELECTRONIC DEVICE FOR CREATING TITLE BACKGROUND IN VIDEO FRAME",
  "filing_date": "20160825",
  "inventor_list": [
    {
      "inventor_name_last": "AN",
      "inventor_name_first": "Fengyang",
      "inventor_city": "Beijing",
      "inventor_state": "",
      "inventor_country": "CN"
    }
  ],
  "ipcr_labels": [
    "G06T1160",
    "G06T740",
    "G06T340",
    "G06T1100",
    "G06T700",
    "G06T760"
  ],
  "main_ipcr_label": "G06T1160",
  "summary": "<SOH> SUMMARY <EOH>A method for creating a title background in a video frame is provided in an embodiment of the present disclosure. The method includes: at an electronic device, acquiring image information of the video frame to which a title needs to be added; converting the image information into a bitmap format; determining a region that is used as the title background in the video frame; capturing a picture corresponding to the region of the title background from the video frame converted into the bitmap format; blurring the captured picture; and overlaying the blurred picture as the title background onto the region of the tide background in the video frame. An electronic device includes at least one processor and a storage device. The storage device is communicably connected with the at least one processor for storing instructions executable by the at least one processor. Wherein execution of the instructions by the at least one processor causes the at least one processor to: acquire image information of the video frame to which a title needs to be added by the video frame processing terminal; convert the image information into a bitmap format; determine a region that is used as the title background in the video frame; capture a picture corresponding to the region of the title background from the video frame converted into the bitmap format; blur the captured picture; and overlay the blurred picture as the title background onto the region of the title background in the video frame. A non-transitory computed readable storage medium stores executable instructions. Wherein when the executable instructions are executed by at least one processor causes the at least one processor to: acquire image information of the video frame to which a title needs to be added by the video frame processing terminal; convert the image information into a bitmap format; determine a region that is used as the title background in the video frame; capture a picture corresponding to the r...",
  "patent_number": "None",
  "abstract": "A method for creating a title background in a video frame is disclosed in the present disclosure. The method includes: acquiring image information of the video frame to which a title needs to be added by the video frame processing terminal; converting the image information into a bitmap format; determining a region that is used as the title background in the video frame; capturing a picture corresponding to the region of the title background from the video frame converted into the bitmap format; blurring the captured picture; and overlaying the blurred picture as the title background onto the region of the title background in the video frame.",
  "publication_number": "US20170278286A1-20170928",
  "_processing_info": {
    "original_size": 39310,
    "optimized_size": 3265,
    "reduction_percent": 91.69
  }
}