{
  "decision": "PENDING",
  "application_number": "15245374",
  "date_published": "20170302",
  "date_produced": "20170214",
  "title": "HARD-COATING LAYER, METHOD OF FABRICATING THE SAME AND DISPLAY DEVICE INCLUDING THE SAME",
  "filing_date": "20160824",
  "inventor_list": [
    {
      "inventor_name_last": "PARK",
      "inventor_name_first": "Jae-Hyun",
      "inventor_city": "Seoul",
      "inventor_state": "",
      "inventor_country": "KR"
    },
    {
      "inventor_name_last": "KIM",
      "inventor_name_first": "Wy-Yong",
      "inventor_city": "Seoul",
      "inventor_state": "",
      "inventor_country": "KR"
    },
    {
      "inventor_name_last": "CHUN",
      "inventor_name_first": "Chang-Woo",
      "inventor_city": "Cheonan-si",
      "inventor_state": "",
      "inventor_country": "KR"
    }
  ],
  "ipcr_labels": [
    "C09D400",
    "G06F3041"
  ],
  "main_ipcr_label": "C09D400",
  "summary": "<SOH> SUMMARY <EOH>Exemplary embodiments of the present invention are directed to a hard-coating layer, a method of fabricating the hard-coating layer and a display device including the hard-coating layer that substantially obviates one or more of the problems due to limitations and disadvantages of the related art. An exemplary embodiment is a hard-coating layer, comprising: a binder; and a silicon compound dispersed in the binder, wherein the silicon compound comprises a disulfide group, which connects adjacent siloxane groups. Another exemplary embodiment is a hard-coating layer, wherein the siloxane group is a silsesquioxane derivative. Another exemplary embodiment is a hard-coating layer, wherein the silicon compound is represented by following Formula 1, wherein SSQ is the silsesquioxane derivative, and R is an aromatic group or where R 2 is a C1-C20 alkyl; and Formula 1 is Another exemplary embodiment is a display device, comprising: a hard-coating layer including a binder and a silicon compound dispersed in the binder, wherein the silicon compound comprises a disulfide group connecting adjacent siloxane groups; and a display device on a side of the hard-coating layer. Another exemplary embodiment is a display device, wherein the display panel includes a polarization plate, and the hard-coating layer is in contact with the polarization plate. Another exemplary embodiment is a display device, further comprising: a touch panel positioned between the hard-coating layer and the display panel. Another exemplary embodiment is a display device, wherein the hard-coating layer has a self-healing characteristic. Another exemplary embodiment is method of fabricating a hard-coating layer, comprising: coating a mixture including a silicon compound, a photo-reactive compound, a photo-initiator and a solvent on a base, wherein the silicon compound includes a disulfide group connecting adjacent siloxane groups; and irradiating the coated mixture with UV radiation to form the...",
  "patent_number": "None",
  "abstract": "Described herewith is a hard-coating layer comprising a binder; and a silicon compound dispersed in the binder and including a disulfide group conncecting adjacent siloxane groups, a method of manufacturing the hard-coating layer, and a display device included the same.",
  "publication_number": "US20170058129A1-20170302",
  "_processing_info": {
    "original_size": 35656,
    "optimized_size": 3139,
    "reduction_percent": 91.2
  }
}