{
  "date_produced": "20180213",
  "publication_number": "US20180060749A1-20180301",
  "main_ipcr_label": "G06N700",
  "decision": "PENDING",
  "application_number": "15247075",
  "inventor_list": [
    {
      "inventor_name_last": "Yan",
      "inventor_name_first": "Jinyun",
      "inventor_city": "Sunnyvale",
      "inventor_state": "CA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Tseng",
      "inventor_name_first": "Hsiao-Ping",
      "inventor_city": "Fremont",
      "inventor_state": "CA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Chen",
      "inventor_name_first": "Xiaoyu",
      "inventor_city": "Sunnyvale",
      "inventor_state": "CA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Gupta",
      "inventor_name_first": "Rupesh",
      "inventor_city": "Sunnyvale",
      "inventor_state": "CA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Rosales",
      "inventor_name_first": "Romer E.",
      "inventor_city": "Burlingame",
      "inventor_state": "CA",
      "inventor_country": "US"
    }
  ],
  "abstract": "A system and method for content generation and targeting using machine learning are provided. In example embodiments, a probability that a user will visit a webpage based on historical data is calculated. A probability that the user will engage with a particular content category based on past user engagement is calculated. In response to the probability of the user engaging with the particular content category being equal to or greater than a first threshold, the content is generated. Further, in response to the probability of the user not visiting a webpage meeting or exceeding a second threshold, the generated content is sent to the user.",
  "filing_date": "20160825",
  "patent_number": "None",
  "summary": "<SOH> BRIEF DESCRIPTION OF THE DRAWINGS <EOH>Various ones of the appended drawings merely illustrate example embodiments of the present disclosure and cannot be considered as limiting its scope. FIG. 1 is a network diagram depicting a client-server system within which various example embodiments may be deployed. FIG. 2 is a block diagram illustrating a content generation system from FIG. 1 , according to an example embodiment. FIG. 3 is a flow diagram illustrating a method for generating specific content targeted to identified users with low predicted user engagement, according to an example embodiment. FIG. 4 is a flow diagram illustrating a method for calculating a probability that a user will visit a webpage based on historical data, according to an example embodiment. FIG. 5 is a flow diagram illustrating a method for determining a communication channel to interact with a user, according to some example embodiments. FIG. 6 illustrates a user interface that includes a generated content for the identified user, according to an example embodiment. FIG. 7 illustrates a diagrammatic representation of a machine in the form of a computer system within which a set of instructions may be executed for causing the machine to perform any one or more of the methodologies discussed herein, according to an example embodiment. detailed-description description=\"Detailed Description\" end=\"lead\"?",
  "date_published": "20180301",
  "title": "CONTENT GENERATION AND TARGETING USING MACHINE LEARNING",
  "ipcr_labels": [
    "G06N700",
    "G06N9900",
    "G06F1730",
    "G06F30482"
  ],
  "_processing_info": {
    "original_size": 69416,
    "optimized_size": 3221,
    "reduction_percent": 95.36
  }
}