{
  "date_produced": "20170214",
  "publication_number": "US20170061289A1-20170302",
  "main_ipcr_label": "G06N502",
  "decision": "PENDING",
  "application_number": "15245534",
  "inventor_list": [
    {
      "inventor_name_last": "Proctor",
      "inventor_name_first": "Mark",
      "inventor_city": "London",
      "inventor_state": "",
      "inventor_country": "GB"
    },
    {
      "inventor_name_last": "Fusco",
      "inventor_name_first": "Mario",
      "inventor_city": "Milan",
      "inventor_state": "",
      "inventor_country": "IT"
    }
  ],
  "abstract": "Systems and methods for allowing pluggable knowledge types to be discovered, registered, and added to a rule engine are disclosed. An example method may include retrieving, by a processing device executing a rule engine, a list of pluggable services associated with a specified knowledge type; identifying a first pluggable service on the list of pluggable services; identifying one or more knowledge types that the first pluggable service is configured to process, wherein the one or more knowledge types comprise the specified knowledge type; and indexing, by the processing device, the first pluggable knowledge in the service registry by information identifying the one or more knowledge types.",
  "filing_date": "20160824",
  "patent_number": "None",
  "summary": "<SOH> BRIEF DESCRIPTION OF THE DRAWINGS <EOH>The disclosure is illustrated by way of examples, and not by way of limitation, and may be more fully understood with references to the following detailed description when considered in connection with the figures, in which: FIG. 1A depicts a high-level diagram of an example system architecture for a pluggable rule engine operating in accordance with one or more aspects of the disclosure; FIG. 1B depicts a block diagram of an example system operating in accordance with one or more aspects of the present disclosure; FIGS. 2A-2G depict flow diagrams relating to example methods for registering pluggable services with a service registry, in accordance with one or more aspects of the disclosure; FIGS. 3A-3B depict flow diagrams relating to example methods for delegating compilation of a resource to a pluggable assembler service, in accordance with one or more aspects of the disclosure; FIG. 4 depicts a flow diagram of an example method for adding a resource package to a knowledge package, in accordance with one or more aspects of the disclosure; FIG. 5 depicts a flow diagram of an example method for delegating creation of a runtime instance to a pluggable runtime service, in accordance with one or more aspects of the disclosure; and FIG. 6 depicts a block diagram of an illustrative computing device operating in accordance with the examples of the disclosure. detailed-description description=\"Detailed Description\" end=\"lead\"?",
  "date_published": "20170302",
  "title": "PLUGGABLE KNOWLEDGE TYPES IN A RULE ENGINE",
  "ipcr_labels": [
    "G06N502"
  ],
  "_processing_info": {
    "original_size": 52722,
    "optimized_size": 2851,
    "reduction_percent": 94.59
  }
}