{
  "date_produced": "20180213",
  "publication_number": "US20180060740A1-20180301",
  "main_ipcr_label": "G06N502",
  "decision": "PENDING",
  "application_number": "15244214",
  "inventor_list": [
    {
      "inventor_name_last": "Bradley",
      "inventor_name_first": "Lisa Wood",
      "inventor_city": "Cary",
      "inventor_state": "NC",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Quirk",
      "inventor_name_first": "Aaron J.",
      "inventor_city": "Cary",
      "inventor_state": "NC",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Sun",
      "inventor_name_first": "Lin",
      "inventor_city": "Cary",
      "inventor_state": "NC",
      "inventor_country": "US"
    }
  ],
  "abstract": "T-shirt size recommendation for a first user based on crowd sourcing. A recommendation for t-shirt size may be made by defining a first image of a container based on historical data related to container instantiation; receiving, by the computer, from a first user, a request to deploy a first instantiation of a container corresponding to the first image, with the request including input data including information indicative of a planned context of the first instantiation; applying a plurality of machine logic based rules to the input data to determine a first a first recommended T-shirt size associated with the first image; and communicating, by the computer, the first recommended T-shirt size to the first user for use with the first instantiation of the container corresponding to the first image.",
  "filing_date": "20160823",
  "patent_number": "None",
  "summary": "<SOH> SUMMARY <EOH>According to one embodiment of the present invention a method is disclosed. The method comprising: a computer defining a first image of a container based on historical data related to container instantiation; the computer receiving from a first user, a request to deploy a first instantiation of a container corresponding to the first image, with the request including input data including information indicative of a planned context of the first instantiation; the computer applying a plurality of machine logic based rules to the input data to determine a first a first recommended T-shirt size associated with the first image; and the computer communicating the first recommended T-shirt size to the first user for use with the first instantiation of the container corresponding to the first image. According to another embodiment of the present invention, a computer program product is disclosed. The computer program product comprising a computer comprising at least one processor, one or more memories, one or more computer readable storage media, the computer program product comprising a computer readable storage medium having program instructions embodied therewith. The program instructions executable by the computer to perform a method comprising: defining, by the computer, a first image of a container based on historical data related to container instantiation; receiving, by the computer, from a first user, a request to deploy a first instantiation of a container corresponding to the first image, with the request including input data including information indicative of a planned context of the first instantiation; applying, by the computer, a plurality of machine logic based rules to the input data to determine a first a first recommended T-shirt size associated with the first image; and communicating, by the computer, the first recommended T-shirt size to the first user for use with the first instantiation of the container corresponding to the first im...",
  "date_published": "20180301",
  "title": "VIRTUAL RESOURCE T-SHIRT SIZE GENERATION AND RECOMMENDATION BASED ON CROWD SOURCING",
  "ipcr_labels": [
    "G06N502",
    "G06F950",
    "G06F9445"
  ],
  "_processing_info": {
    "original_size": 47136,
    "optimized_size": 3680,
    "reduction_percent": 92.19
  }
}