{
  "decision": "REJECTED",
  "application_number": "15243424",
  "date_published": "20170608",
  "date_produced": "20170524",
  "title": "METHOD AND ELECTRONIC DEVICE FOR PHOTO SHOOTING IN BACKLIGHTING SCENE",
  "filing_date": "20160822",
  "inventor_list": [
    {
      "inventor_name_last": "Zhao",
      "inventor_name_first": "Xuefeng",
      "inventor_city": "Beijing",
      "inventor_state": "",
      "inventor_country": "CN"
    },
    {
      "inventor_name_last": "Li",
      "inventor_name_first": "Li",
      "inventor_city": "Beijing",
      "inventor_state": "",
      "inventor_country": "CN"
    }
  ],
  "ipcr_labels": [
    "H04N5232",
    "H04N5235",
    "G06K900",
    "G06K962"
  ],
  "main_ipcr_label": "H04N5232",
  "summary": "<SOH> SUMMARY <EOH>In view of this, embodiments of the present disclosure are to propose a method and an electronic device for photo shooting in backlighting scene, which can simplify the startup process of auxiliary processing for backlighting scene, enhancing the accuracy for scene judgment. In a first aspect, embodiments of the present disclosure provide a method for photo shooting in backlighting scene, the method includes: detecting real-time environmental parameters for photo shooting; performing backlighting scene identification according to the real-time environmental parameters; and performing auxiliary processing of shooting for backlighting scene according to the identification result. In a second aspect, embodiments of the present disclosure also provide an electronic device for photo shooting in backlighting scene, the electronic device includes: at least one processor; and a memory communicably connected with the at least one processor for storing instructions executable by the at least one processor, wherein execution of the instructions by the at least one processor causes the at least one processor to: detect real-time environmental parameters for photo shooting; perform backlighting scene identification according to the real-time environmental parameters; and perform auxiliary processing of shooting for backlighting scene according to the identification result. In a third aspect, embodiments of the present disclosure provide a non-transitory computer-readable storage medium storing executable instructions that, when executed by an electronic device, cause the electronic device to: detect real-time environmental parameters for photo shooting; perform backlighting scene identification according to the real-time environmental parameters; and perform auxiliary processing of shooting for backlighting scene according to the identification result.",
  "patent_number": "None",
  "abstract": "Embodiments of the present disclosure disclose a method and electronic device for photo shooting in backlighting scene. The method includes: detecting real-time environmental parameters for photo shooting; performing backlighting scene identification according to the real-time environmental parameters; performing auxiliary processing of shooting for backlighting scene according to the identification result. The photo shooting method and electronic device for backlighting scene provided in embodiments of the present disclosure simplify the startup process of the auxiliary processing for backlighting scene.",
  "publication_number": "US20170163877A1-20170608",
  "_processing_info": {
    "original_size": 49056,
    "optimized_size": 3224,
    "reduction_percent": 93.43
  }
}