{
  "date_produced": "20180131",
  "publication_number": "US20180046939A1-20180215",
  "main_ipcr_label": "G06N9900",
  "decision": "PENDING",
  "application_number": "15249790",
  "inventor_list": [
    {
      "inventor_name_last": "Meron",
      "inventor_name_first": "Avishay",
      "inventor_city": "Gush-Dan",
      "inventor_state": "",
      "inventor_country": "IL"
    },
    {
      "inventor_name_last": "Ramanathan",
      "inventor_name_first": "Venkatesh",
      "inventor_city": "San Jose",
      "inventor_state": "CA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Valler",
      "inventor_name_first": "Roy",
      "inventor_city": "Tel-Aviv",
      "inventor_state": "",
      "inventor_country": "IL"
    }
  ],
  "abstract": "Systems and methods for machine learning feature processing are disclosed. An example method includes: selecting a predefined number of machine-based transactions; identifying a first set of features based on the predefined number of machine-based transactions; and applying a machine learning feature selection algorithm to identify a second set of features. The second set of features is smaller than the first set of features, and the second set of features includes no more than a predefined number of features. The method also includes constructing a decision tree based on the second set of features, wherein the decision tree has a depth that is less than a predefined depth. The method optionally includes limiting the total number of features in the second set to no greater than the predefined number of features.",
  "filing_date": "20160829",
  "patent_number": "None",
  "summary": "<SOH> BRIEF DESCRIPTION OF THE FIGURES <EOH>FIG. 1 is a schematic view illustrating an embodiment of a system for selecting machine learning features and constructing rules based on the selected features. FIG. 2A is a schematic view illustrating an embodiment of a process for selecting machine learning features and constructing rules based on the selected features. FIG. 2B is a schematic view illustrating an embodiment of a decision tree constructed using a selected set of features. FIG. 3 is a flow chart illustrating an embodiment of a method for selecting machine learning features and constructing rules based on the selected features. FIG. 4 is a schematic view illustrating an embodiment of a user device. FIG. 5 is a schematic view illustrating an embodiment of a computing system. detailed-description description=\"Detailed Description\" end=\"lead\"? Embodiments of the present disclosure and their advantages are best understood by referring to the detailed description that follows. It should be appreciated that like reference numerals are used to identify like elements illustrated in one or more of the figures, wherein showings therein are for purposes of illustrating embodiments of the present disclosure and not for purposes of limiting the same.",
  "date_published": "20180215",
  "title": "Automated Machine Learning Feature Processing",
  "ipcr_labels": [
    "G06N9900"
  ],
  "_processing_info": {
    "original_size": 57840,
    "optimized_size": 2917,
    "reduction_percent": 94.96
  }
}