{
  "date_produced": "20161130",
  "publication_number": "US20160364651A1-20161215",
  "main_ipcr_label": "G06N504",
  "decision": "PENDING",
  "application_number": "15249359",
  "inventor_list": [
    {
      "inventor_name_last": "Flinn",
      "inventor_name_first": "Steven Dennis",
      "inventor_city": "Sugar Land",
      "inventor_state": "TX",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Moneypenny",
      "inventor_name_first": "Naomi Felina",
      "inventor_city": "Houston",
      "inventor_state": "TX",
      "inventor_country": "US"
    }
  ],
  "abstract": "A method and system of inferential-based communications applies two sets of values, whereby the first set of values are determined from inferences of the relevancy of textual elements with respect to text-based content and the second set of values are determined from behavioral-based inferences with respect to topics, so as to select appropriate words to be included in communications that are generated for delivery to a user. The inferences that are with respect to text-based content may be determined by applying analytic methods such as Bayesian or statistical learning-based methods. The values that are determined from behavioral-based inferences with respect to topics may correspond to inferences of interest and/or expertise. Words in the communications may be selected and/or arranged in accordance with syntactical rules and may reference elements of the text-based content and/or behavioral inferences.",
  "filing_date": "20160827",
  "patent_number": "None",
  "summary": "<SOH> SUMMARY OF THE INVENTION <EOH>In accordance with the embodiments described herein, a system and method for generating personalized recommendations based, at least in part, on combining behavioral-based indexing and contents-based indexing is disclosed. The interest levels and/or expertise levels of users may be inferred from behavioral information during the behavioral-based indexing of one or more computer-implemented systems. The contents of objects of one or more computer-implemented systems may be indexed, by, for example, a search engine, into vectors of object informational elements and associated relevancy values. Topical areas of interest and/or expertise associated with users are mapped to object information elements. An evaluation of interest and/or expertise levels for the mapped topics versus the relevancy values of the informational elements of objects provides a basis for selecting the objects to be delivered to the user. Other features and embodiments will become apparent from the following description, from the drawings, and from the claims.",
  "date_published": "20161215",
  "title": "Inferential-based Communications Method and System",
  "ipcr_labels": [
    "G06N504",
    "G06F1730",
    "H04L1258"
  ],
  "_processing_info": {
    "original_size": 212856,
    "optimized_size": 2718,
    "reduction_percent": 98.72
  }
}