{
  "decision": "PENDING",
  "application_number": "15249341",
  "date_published": "20171019",
  "date_produced": "20171004",
  "title": "SYSTEMS, APPARATUS, AND METHODS FOR EFFICIENT SPACE TO TIME CONVERSION OF OTU MULTIPLEXED SIGNAL",
  "filing_date": "20160826",
  "inventor_list": [
    {
      "inventor_name_last": "NARIPPATTA",
      "inventor_name_first": "Vinod",
      "inventor_city": "Bangalore",
      "inventor_state": "",
      "inventor_country": "IN"
    },
    {
      "inventor_name_last": "V",
      "inventor_name_first": "Unnikrishnan C.",
      "inventor_city": "Sunnyvale",
      "inventor_state": "CA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "KAMAT",
      "inventor_name_first": "Sanjay",
      "inventor_city": "Bangalore",
      "inventor_state": "",
      "inventor_country": "IN"
    },
    {
      "inventor_name_last": "JAIN",
      "inventor_name_first": "Ashok",
      "inventor_city": "Bangalore",
      "inventor_state": "",
      "inventor_country": "IN"
    },
    {
      "inventor_name_last": "TATINENI",
      "inventor_name_first": "Ashok",
      "inventor_city": "Bangalore",
      "inventor_state": "",
      "inventor_country": "IN"
    },
    {
      "inventor_name_last": "PARAMASIVAM",
      "inventor_name_first": "Vishwanathan",
      "inventor_city": "Bangalore",
      "inventor_state": "",
      "inventor_country": "IN"
    }
  ],
  "ipcr_labels": [
    "G06F1340",
    "G06F1202",
    "G06F1316",
    "G11C710"
  ],
  "main_ipcr_label": "G06F1340",
  "summary": "<SOH> SUMMARY <EOH>The following presents a simplified summary relating to one or more aspects and/or examples associated with the apparatus and methods disclosed herein. As such, the following summary should not be considered an extensive overview relating to all contemplated aspects and/or examples, nor should the following summary be regarded to identify key or critical elements relating to all contemplated aspects and/or examples or to delineate the scope associated with any particular aspect and/or example. Accordingly, the following summary has the sole purpose to present certain concepts relating to one or more aspects and/or examples relating to the apparatus and methods disclosed herein in a simplified form to precede the detailed description presented below. An apparatus for data transformation includes a first memory, a second memory, a cross-bar switch communicatively coupled between the first memory and the second memory, and a lookup table that specifies one or more memory addresses of the first memory to read out to the cross-bar switch, one or more memory addresses of the second memory to which to write data from the cross-bar switch, and a configuration of the cross-bar switch. A method for data transformation includes determining, based on a lookup table, one or more memory addresses of a first memory to read out to a cross-bar switch, determining, based on the lookup table, one or more memory addresses of a second memory to which to write data from the cross-bar switch, and determining, based on the lookup table, a configuration of the cross-bar switch, wherein the cross-bar switch is communicatively coupled between the first memory and the second memory. A non-transitory computer-readable medium for data transformation includes a lookup table configured to: store one or more memory addresses of a first memory to read out to a cross-bar switch, store one or more memory addresses of a second memory to which to write data from the cross-bar switch, ...",
  "patent_number": "None",
  "abstract": "Methods and apparatuses for data transformation are disclosed. An exemplary apparatus includes a first memory, a second memory, a cross-bar switch communicatively coupled between the first memory and the second memory, and a lookup table that specifies one or more memory addresses of the first memory to read out to the cross-bar switch, one or more memory addresses of the second memory to which to write data from the cross-bar switch, and a configuration of the cross-bar switch. An exemplary method includes determining, based on a lookup table, one or more memory addresses of a first memory to read out to a cross-bar switch, determining, based on the lookup table, one or more memory addresses of a second memory to which to write data from the cross-bar switch, and determining, based on the lookup table, a configuration of the cross-bar switch.",
  "publication_number": "US20170300443A1-20171019",
  "_processing_info": {
    "original_size": 81720,
    "optimized_size": 4217,
    "reduction_percent": 94.84
  }
}