{
  "date_produced": "20170603",
  "publication_number": "US20170169330A1-20170615",
  "main_ipcr_label": "G06N308",
  "decision": "PENDING",
  "application_number": "15247116",
  "inventor_list": [
    {
      "inventor_name_last": "Cui",
      "inventor_name_first": "Jianyong",
      "inventor_city": "Tianjin",
      "inventor_state": "",
      "inventor_country": "CN"
    }
  ],
  "abstract": "Disclosed are a method and electronic device for displaying play content on a smart television, which relates to the field of television service technology and solves the technical problems in the prior art that the amount of operation of a user in searching a film is large and the view experience of the user is thus influenced because there is no intelligent film recommendation function on a television terminal. Wherein, the method includes the following steps: receiving view data of a user in watching transmitted by a television terminal; predicting, according to the view data, recommended film having high correlation with the view data; and, feeding back the predicted recommended film to the television terminal so as to recommend the recommended film to the user.",
  "filing_date": "20160825",
  "patent_number": "None",
  "summary": "<SOH> SUMMARY <EOH>Embodiments of the present disclosure provide a method and electronic device for displaying play content on a smart television, in order to solve the technical problems in the prior art that the amount of operation of a user in searching a film is large and the view experience of the user is thus influenced because there is no intelligent film recommendation function on a television terminal. In one aspect, an embodiment of the present disclosure provides a method for displaying play content on a smart television, the method being applicable to a server and mainly including the following steps: receiving view data of a user in watching transmitted by a television terminal; predicting, according to the view data, a recommended film having high correlation with the view data; and feeding back the predicted recommended film to the television terminal so as to recommend the recommended film to the user. In another aspect, an embodiment of the present disclosure provides an electronic device, including: at least one processor; and a memory communicably connected with the at least one processor for storing instructions executable by the at least one processor, wherein execution of the instructions by the at least one processor causes the at least one processor to: receive view data of a user in watching transmitted by a television terminal; predict, according to the view data, a recommended film having high correlation with the view data; and feedback the predicted recommended film to the television terminal so as to recommend the recommended film to the user. In another aspect, an embodiment of the present disclosure provides a non-transitory computer-readable storage medium storing executable instructions that, when executed by an electronic device, cause the electronic device to: receive view data of a user in watching transmitted by a television terminal; predict, according to the view data, a recommended film having high correlation with the view d...",
  "date_published": "20170615",
  "title": "Method and Electronic Device for Displaying Play Content in Smart Television",
  "ipcr_labels": [
    "G06N308",
    "H04N2125"
  ],
  "_processing_info": {
    "original_size": 49562,
    "optimized_size": 3348,
    "reduction_percent": 93.24
  }
}