{
  "date_produced": "20171213",
  "publication_number": "US20170372226A1-20171228",
  "main_ipcr_label": "G06N9900",
  "decision": "PENDING",
  "application_number": "15245141",
  "inventor_list": [
    {
      "inventor_name_last": "Costa",
      "inventor_name_first": "Manuel Silverio da Silva",
      "inventor_city": "Cambridge",
      "inventor_state": "",
      "inventor_country": "GB"
    },
    {
      "inventor_name_last": "Fournet",
      "inventor_name_first": "Cédric Alain Marie Christophe",
      "inventor_city": "Cambridge",
      "inventor_state": "",
      "inventor_country": "GB"
    },
    {
      "inventor_name_last": "Mehta",
      "inventor_name_first": "Aastha",
      "inventor_city": "Saarbruecken",
      "inventor_state": "",
      "inventor_country": "DE"
    },
    {
      "inventor_name_last": "Nowozin",
      "inventor_name_first": "Sebastian",
      "inventor_city": "Cambridge",
      "inventor_state": "",
      "inventor_country": "GB"
    },
    {
      "inventor_name_last": "Ohrimenko",
      "inventor_name_first": "Olga",
      "inventor_city": "Cambridge",
      "inventor_state": "",
      "inventor_country": "GB"
    },
    {
      "inventor_name_last": "Schuster",
      "inventor_name_first": "Felix",
      "inventor_city": "Cambridge",
      "inventor_state": "",
      "inventor_country": "GB"
    },
    {
      "inventor_name_last": "Vaswani",
      "inventor_name_first": "Kapil",
      "inventor_city": "Cambridge",
      "inventor_state": "",
      "inventor_country": "GB"
    }
  ],
  "abstract": "A multi-party privacy-preserving machine learning system is described which has a trusted execution environment comprising at least one protected memory region. An code loader at the system loads machine learning code, received from at least one of the parties, into the protected memory region. A data uploader uploads confidential data, received from at least one of the parties, to the protected memory region. The trusted execution environment executes the machine learning code using at least one data-oblivious procedure to process the confidential data and returns the result to at least one of the parties, where a data-oblivious procedure is a process where any patterns of memory accesses, patterns of disk accesses and patterns of network accesses are such that the confidential data cannot be predicted from the patterns.",
  "filing_date": "20160823",
  "patent_number": "None",
  "summary": "<SOH> SUMMARY <EOH>The following presents a simplified summary of the disclosure in order to provide a basic understanding to the reader. This summary is not intended to identify key features or essential features of the claimed subject matter nor is it intended to be used to limit the scope of the claimed subject matter. Its sole purpose is to present a selection of concepts disclosed herein in a simplified form as a prelude to the more detailed description that is presented later. A multi-party privacy-preserving machine learning system is described which has a trusted execution environment comprising at least one protected memory region. A code loader at the system loads machine learning code, received from at least one of the parties, into the protected memory region. A data uploader uploads confidential data, received from at least one of the parties, to the protected memory region. The trusted execution environment executes the machine learning code using at least one data-oblivious procedure to process the confidential data and returns the result to at least one of the parties, where a data-oblivious procedure is a process where any patterns of memory accesses, patterns of disk accesses and patterns of network accesses are such that the confidential data cannot be predicted from the patterns. Many of the attendant features will be more readily appreciated as the same becomes better understood by reference to the following detailed description considered in connection with the accompanying drawings.",
  "date_published": "20171228",
  "title": "PRIVACY-PRESERVING MACHINE LEARNING",
  "ipcr_labels": [
    "G06N9900",
    "G06N312",
    "G06F2162"
  ],
  "_processing_info": {
    "original_size": 100567,
    "optimized_size": 3831,
    "reduction_percent": 96.19
  }
}