{
  "date_produced": "20180207",
  "publication_number": "US20180053088A1-20180222",
  "main_ipcr_label": "G06N308",
  "decision": "PENDING",
  "application_number": "15242021",
  "inventor_list": [
    {
      "inventor_name_last": "Chakraborty",
      "inventor_name_first": "Supriyo",
      "inventor_city": "White Plains",
      "inventor_state": "NY",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Tripp",
      "inventor_name_first": "Omer",
      "inventor_city": "Bronx",
      "inventor_state": "NY",
      "inventor_country": "US"
    }
  ],
  "abstract": "Techniques for synthesizing security exploits via self-amplifying deep learning are provided. In one example, a computer-implemented method can comprise generating, by a system operatively coupled to a processor, a probabilistic model based on an evaluation of one or more first payloads included in a first group of payloads. The computer implemented method can also comprise determining, by the system, based on the probabilistic model, that at least one first payload from the first group of payloads is invalid. Additionally, the computer implemented method can comprise, generating, by the system, a second group of payloads based on removing the at least one invalid first payload from the first group of payloads.",
  "filing_date": "20160819",
  "patent_number": "None",
  "summary": "<SOH> SUMMARY <EOH>The following presents a summary to provide a basic understanding of one or more embodiments of the invention. This summary is not intended to identify key or critical elements, or delineate any scope of the particular embodiments or any scope of the claims. Its sole purpose is to present concepts in a simplified form as a prelude to the more detailed description that is presented later. In one or more embodiments described herein, systems, computer-implemented methods, apparatus and/or computer program products that facilitate synthesizing security exploits via self-amplifying deep learning are described. According to an embodiment, a computer-implemented method can comprise generating, by a system operatively coupled to a processor, a probabilistic model based on an evaluation of one or more first payloads included in a first group of payloads. The computer implemented method can also comprise determining, by the system, based on the probabilistic model, that at least one first payload from the first group of payloads is invalid. Further, the computer implemented method can also comprise generating, by the system, a second group of payloads based on removing at least one invalid first payload from the first group of payloads. According to another embodiment, a computer program product for synthesizing security exploits via self-amplifying deep learning, is provided. The computer program product can comprise a computer readable storage medium having program instructions embodied therewith, wherein the program instructions are executable by a processing component to cause the processing component to determine that a payload generates a valid result. The program instructions when executed by the processing component further cause the processing component to atomize the payload into one or more atomic elements. Further, the programming instructions when executed by the processing component also cause the processing component to map the one or more a...",
  "date_published": "20180222",
  "title": "SYNTHESIS OF SECURITY EXPLOITS VIA SELF-AMPLIFYING DEEP LEARNING",
  "ipcr_labels": [
    "G06N308",
    "G06N700"
  ],
  "_processing_info": {
    "original_size": 104490,
    "optimized_size": 3433,
    "reduction_percent": 96.71
  }
}