{
  "decision": "ACCEPTED",
  "application_number": "15248792",
  "date_published": "20161215",
  "date_produced": "20161130",
  "title": "DIGITAL PHASE LOCKED LOOP FOR LOW JITTER APPLICATIONS",
  "filing_date": "20160826",
  "inventor_list": [
    {
      "inventor_name_last": "DENG",
      "inventor_name_first": "Jingdong",
      "inventor_city": "Essex Junction",
      "inventor_state": "VT",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "HO",
      "inventor_name_first": "Chung S.",
      "inventor_city": "Essex Junction",
      "inventor_state": "VT",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "FLYE",
      "inventor_name_first": "David S.",
      "inventor_city": "Milton",
      "inventor_state": "VT",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "JIN",
      "inventor_name_first": "Zhenrong",
      "inventor_city": "Essex Juntion",
      "inventor_state": "VT",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "MALLADI",
      "inventor_name_first": "Ramana M.",
      "inventor_city": "Williston",
      "inventor_state": "VT",
      "inventor_country": "US"
    }
  ],
  "ipcr_labels": [
    "H03L7087",
    "G06F1750",
    "H03L7099"
  ],
  "main_ipcr_label": "H03L7087",
  "summary": "<SOH> SUMMARY <EOH>In an aspect of the invention, there is a phase locked loop circuit including a ring oscillator. The phase locked loop circuit also includes a digital path including a digital phase detector. The phase locked loop circuit further includes an analog path including a linear phase detector. Additionally, the phase locked loop circuit includes a feedback path connecting an output of the ring oscillator to the digital path and to the analog path. The digital path and the analog path are parallel paths. The digital path provides a digital tuning signal to the ring oscillator that digitally controls a frequency of the ring oscillator. The analog path provides an analog tuning signal to the ring oscillator that continuously controls the frequency of the ring oscillator. In further aspects of the invention, there is ring oscillator including oscillator elements. The ring oscillator also includes a digitally-controlled portion configured to change frequency based on a digital input. The ring oscillator further includes a proportionally-controlled portion configured to change frequency based on an analog input. The digital input and analog input are parallel inputs of the ring oscillator. In further aspects, there is a method in a computer-aided design system for generating a functional design model of a ring oscillator. The method includes generating a functional representation of an array of oscillator elements. The method also includes generating a functional representation of a digitally-controlled device connected to the array and configured to selectively activate a plurality of the oscillator elements based on a digital tuning signal. The method further includes generating a functional representation of one or more proportionally-controlled devices connected to the array and configured to change frequency continuously based on an analog tuning input. In another aspect of the invention, a design structure tangibly embodied in a machine readable storage...",
  "patent_number": "9917591",
  "abstract": "A phase locked loop circuit is disclosed. The phase locked loop circuit includes a ring oscillator. The phase locked loop circuit also includes a digital path including a digital phase detector. The phase locked loop circuit further includes an analog path including a linear phase detector. Additionally, the phase locked loop circuit includes a feedback path connecting an output of the ring oscillator to an input of the digital path and an input of the analog path. The digital path and the analog path are parallel paths. The digital path provides a digital tuning signal the ring oscillator that digitally controls a frequency of the ring oscillator. The analog path provides an analog tuning signal the ring oscillator that continuously controls the frequency of the ring oscillator.",
  "publication_number": "US20160365861A1-20161215",
  "_processing_info": {
    "original_size": 67349,
    "optimized_size": 3962,
    "reduction_percent": 94.12
  }
}