{
  "decision": "PENDING",
  "application_number": "15244973",
  "date_published": "20170302",
  "date_produced": "20170214",
  "title": "Gesture Based Control System Based Upon Device Orientation System and Method",
  "filing_date": "20160823",
  "inventor_list": [
    {
      "inventor_name_last": "Förstner",
      "inventor_name_first": "Friedrich Christian",
      "inventor_city": "Munchen",
      "inventor_state": "",
      "inventor_country": "DE"
    },
    {
      "inventor_name_last": "Hirsch",
      "inventor_name_first": "Eric Christian",
      "inventor_city": "Munchen",
      "inventor_state": "",
      "inventor_country": "DE"
    },
    {
      "inventor_name_last": "Hviid",
      "inventor_name_first": "Nikolaj",
      "inventor_city": "Munchen",
      "inventor_state": "",
      "inventor_country": "DE"
    }
  ],
  "ipcr_labels": [
    "G06F30346",
    "G06F30488",
    "G06F116"
  ],
  "main_ipcr_label": "G06F30346",
  "summary": "<SOH> SUMMARY <EOH>Therefore, it is a primary object, feature, or advantage to improve over the state of the art. It is a further object, feature, or advantage to a more accurate control system which allows a wide array of control functions in a device with a limited amount of physical space for control inputs. A still further object, feature, or advantage of the present invention is to provide freedom from physical buttons or joysticks that have limited functionality. Another object, feature, or advantage of the present invention is to provide freedom from the deleterious effects of exposure of physical buttons to the caustic byproducts of the human body, such as sweat, cerumen, body oils etc. Yet another object, feature, or advantage of the present invention is the ability to create a whole suite of actions that are able to be rapidly interpreted by the device. A further object, feature, or advantage of the present invention is to provide a user based operating system that does not require the use of any other input device such as a touchscreen. A still further object, feature, or advantage of the present invention is to create new human device interactions using the same platform such as new gestures, taps or holds to enact new features or functions. Yet another object, feature, or advantage of the present invention is to create an intimate control system that is both rapid in response and pleasant for the user. Another object, feature, or advantage of the present invention is to integrate with other onboard systems for enhanced feedback and operational control such as the use of an onboard camera or optical sensor, ultrasound sensor, heat sensor, radar sensor among others. Yet another object, feature, or advantage of the present invention is to reconfigure application controls based upon other sensor inputs. For example, use of the device underwater would allow a reconfiguration of control input parameters. A further object, feature, or advantage of the present ...",
  "patent_number": "None",
  "abstract": "An earpiece includes an earpiece housing, a processor disposed within the earpiece housing, a gesture based interface operatively connected to the processor and configured to detect changes in an energy field associated with user gestures, and at least one sensor operatively connected to the processor for determining positioning of the ear piece. The processor is configured to interpret the changes in the energy field to determine the user gestures. The processor is configured to activate the ear piece based on the positioning of the ear piece.",
  "publication_number": "US20170060269A1-20170302",
  "_processing_info": {
    "original_size": 38891,
    "optimized_size": 3453,
    "reduction_percent": 91.12
  }
}