{
  "decision": "PENDING",
  "application_number": "15247522",
  "date_published": "20170302",
  "date_produced": "20170214",
  "title": "WEB-BASED TRADE COMPLIANCE ASSESSMENT TOOL",
  "filing_date": "20160825",
  "inventor_list": [
    {
      "inventor_name_last": "Ridgley",
      "inventor_name_first": "Craig Thomas",
      "inventor_city": "Redington Shores",
      "inventor_state": "FL",
      "inventor_country": "US"
    }
  ],
  "ipcr_labels": [
    "G06Q4004"
  ],
  "main_ipcr_label": "G06Q4004",
  "summary": "<SOH> SUMMARY OF THE INVENTION <EOH>The present system and method for trade compliance assessment, also referred to as TCAT method, includes a web-based tool for performing a simple yet indicative assessment of a user's trade compliance program. In certain embodiments, the system and method determine compliance with applicable laws and rules of a trade (or other) compliance program for an entity, using a web-based, and native web-based, system and method for measuring risk of possible violations of export laws and rules for an entity's trade compliance program. For the purposes of this specification, “native web-based” refers to a set of object code that can be delivered to or downloaded by a customer for installation within the company's intranet and/or behind said company's firewall.",
  "patent_number": "None",
  "abstract": "A method and system for determining of compliance with trade regulations, or any other federal regulations, includes a web based system for access by a user. The user provides information and answers relating to risk factors or exposure factors of the trading entity. The exposure factors are each assigned a weighting factor. Weighted exposure factor answers are totaled and used to calculate an exposure value. Risk factor answers are assigned values and are compared to possible maximum values. Risk factor answers may be identified as imposing a greater or lesser risk as indicated by color codes. A total of the risk answer values is compared to a total of maximum values to obtain a risk value. The risk value and exposure value are plotted on a matrix. The matrix may be color coded for different levels of risk/exposure. The user may determine from the method and system if consultation relating to trade compliance is warranted.",
  "publication_number": "US20170061538A1-20170302",
  "_processing_info": {
    "original_size": 57945,
    "optimized_size": 2287,
    "reduction_percent": 96.05
  }
}