{
  "date_produced": "20170603",
  "publication_number": "US20170169341A1-20170615",
  "main_ipcr_label": "G06N504",
  "decision": "REJECTED",
  "application_number": "15246498",
  "inventor_list": [
    {
      "inventor_name_last": "TANG",
      "inventor_name_first": "Xue",
      "inventor_city": "Beijing",
      "inventor_state": "",
      "inventor_country": "CN"
    }
  ],
  "abstract": "A method is provided for intelligent recommendation. While detecting any terminal updates user data, the updated user data and user identification information are obtained. A recommended result according to the updated user data is generated, and the recommended result and the user identification information are correspondingly saved in the server.",
  "filing_date": "20160824",
  "patent_number": "None",
  "summary": "<SOH> SUMMARY <EOH>The present disclosure provides a method and server for displaying intelligent recommendation for solving problems that the recommendations provided by the traditional intelligent recommendation system are not consistent at different terminals. One embodiment of the present disclosure provides a method for displaying intelligent recommendation. The method includes: obtaining updated user data and user identification information while any terminal detects the updated user data; obtaining a recommended result according to the updated user data, and saving the recommended result and the user identification information correspondingly into a server; obtaining the user identification information while any terminal requests for the recommended information, reading the recommended result corresponding to the user identification information from the server, pulling respective recommended information from the recommended result, pulling respective recommendation information from the recommended result, and displaying the recommended information on the respective terminal. One embodiment of the present disclosure provides a non-volatile computer storage medium capable of storing computer-executable instruction. The said computer-executable instruction is used for performing any one of the step in above. The present disclosure provides a server including at least one processor and a data storage. The data storage stores at least one process which may be performed by the processor. The computer-executable instruction is performed by the at least one processor so that the at least one processor may perform any one of the step as discussed in above. The method and server of the present disclosure, user's behavior obtained via each terminal is used to build user interest model, and recommended results are saved into the same server according to the interest models. When different terminals provide recommended results to the same user, data is pulled from the sam...",
  "date_published": "20170615",
  "title": "METHOD FOR INTELLIGENT RECOMMENDATION",
  "ipcr_labels": [
    "G06N504"
  ],
  "_processing_info": {
    "original_size": 50106,
    "optimized_size": 2868,
    "reduction_percent": 94.28
  }
}