{
  "decision": "PENDING",
  "application_number": "15240875",
  "date_published": "20161208",
  "date_produced": "20161122",
  "title": "POLICY-BASED COMPUTATION AND STORAGE OF CLOUD-BASED COLLABORATION OBJECTS",
  "filing_date": "20160818",
  "inventor_list": [
    {
      "inventor_name_last": "Rizqi",
      "inventor_name_first": "Muhammad Ashar",
      "inventor_city": "San Jose",
      "inventor_state": "CA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Queisser",
      "inventor_name_first": "Jeffrey R.",
      "inventor_city": "San Francisco",
      "inventor_state": "CA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Smith",
      "inventor_name_first": "Benjamin C.",
      "inventor_city": "Mountain View",
      "inventor_state": "CA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Greenan",
      "inventor_name_first": "Kevin M.",
      "inventor_city": "Santa Cruz",
      "inventor_state": "CA",
      "inventor_country": "US"
    }
  ],
  "ipcr_labels": [
    "H04L1224",
    "G06F306"
  ],
  "main_ipcr_label": "H04L1224",
  "summary": "<SOH> SUMMARY <EOH>The present disclosure provides systems, methods, and computer program products suited to address the aforementioned issues with legacy approaches. More specifically, the present disclosure provides a detailed description of techniques used in systems, methods, and in computer program products for performing policy-based decisions that determine the types and locations of computation and storage when dealing with cloud-based collaboration objects across diverse regimes. Certain embodiments are directed to technological solutions for dynamically determining operations to be performed at a selected collection of cloud-based content management resource sites using a policy management layer to apply storage policies based in part on source attributes, which embodiments advance the relevant technical fields, as well as advancing peripheral technical fields. The disclosed embodiments modify and improve over legacy approaches. In particular, the herein-disclosed techniques provide technical solutions that address the technical problems attendant to using various cloud-based content management resources with resource-agnostic and source-aware commands and policies, and such technical solutions serve to reduce use of computer memory, reduce demand for computer processing power, and reduce communication overhead that is needed. Some embodiments disclosed herein use techniques to improve the functioning of multiple systems within the disclosed environments, and some embodiments advance peripheral technical fields as well. As one specific example, use of the disclosed techniques and devices within the shown environments as depicted in the figures provide advances in the technical field of high-performance computing as well as advances in the technical fields of distributed storage. Some embodiments commence upon deploying a server in a cloud-based environment such that the server is configured to interface with one or more storage facilities that are accessib...",
  "patent_number": "None",
  "abstract": "One or more servers are deployed in a cloud-based environment such that the cloud-based servers are configured to interface with one or more object processing target sites. In response to an object processing command, various combinations of feasible activities to perform at feasible target sites (e.g., object processing sites) are considered so as to generate object processing scenarios capable of executing object processing commands while observing constraints that may derive from the nature of, and/or attributes pertaining to the object processing sites. A scenario including a determination of one or more target sites is selected from the considered object processing scenarios. The selected one or more target sites are used to activate the object processing commands (e.g., for computation and/or for storage activities). A target site may be a country or state or other jurisdiction that inures benefits (e.g., tax benefits) and/or limitations (e.g., import/export limitations) pertaini...",
  "publication_number": "US20160359684A1-20161208",
  "_processing_info": {
    "original_size": 131063,
    "optimized_size": 4047,
    "reduction_percent": 96.91
  }
}