{
  "date_produced": "20180207",
  "publication_number": "US20180053089A1-20180222",
  "main_ipcr_label": "G06N308",
  "decision": "PENDING",
  "application_number": "15242691",
  "inventor_list": [
    {
      "inventor_name_last": "Gokmen",
      "inventor_name_first": "Tayfun",
      "inventor_city": "Briarcliff Manor",
      "inventor_state": "NY",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Kim",
      "inventor_name_first": "Seyoung",
      "inventor_city": "White Plains",
      "inventor_state": "NY",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Newns",
      "inventor_name_first": "Dennis M.",
      "inventor_city": "Yorktown Heights",
      "inventor_state": "NY",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Vlasov",
      "inventor_name_first": "Yurii A.",
      "inventor_city": "Champaign",
      "inventor_state": "IL",
      "inventor_country": "US"
    }
  ],
  "abstract": "A resistive processing unit (RPU) that includes a pair of transistors connected in series providing an update function for a weight of a training methodology to the RPU, and a read transistor for reading the weight of the training methodology. In some embodiments, the resistive processing unit (RPU) further includes a capacitor connecting a gate of the read transistor to the air of transistors providing the update function for the resistive processing unit (RPU). The capacitor stores said weight of training methodology for the RPU.",
  "filing_date": "20160822",
  "patent_number": "None",
  "summary": "<SOH> SUMMARY <EOH>In one aspect, a resistive processing unit (RPU) composed of three field effect transistor (FET) semiconductor devices and a capacitor that are provided using complementary metal oxide semiconductor (CMOS) technology that operates in a subthreshold regime. In one embodiment, the resistive processing unit (RPU) includes a pair of transistors connected in series providing an update function for a weight of a training methodology to the RPU, and a read transistor for reading the weight of the training methodology. The RPU may further include a capacitor connecting a gate of the read transistor to the pair of transistors providing the update function for the RPU. The capacitor stores the weight of training methodology for the RPU. In another embodiment, a resistive processing unit is provided that includes four FET semiconductor devices and a capacitor that are provided using complementary metal oxide semiconductor (CMOS) technology that operates in the subthreshold regime. In some embodiments, the resistive processing unit (RPU) includes a first pair of transistors connected in series providing an update function for a weight of a training methodology to the RPU, and a second pair of transistors for reading the weight of the training methodology by differential weight reading. The RPU may further include a capacitor connecting at least one gate of the second pair of read transistor to the first pair of transistors providing the update function for the RPU. The capacitor stores the weight of training methodology for the RPU. In another aspect, a method of storing the weight of training in resistive processing unit of artificial neural network is provided. In some embodiments, the method may include providing capacitor for storing the weight of training for resistive crosspoint circuit elements for an artificial neural network. A first pair of transistors is connected to the capacitor for updating the weight of training stored on the capacitor. At leas...",
  "date_published": "20180222",
  "title": "AREA AND POWER EFFICIENT IMPLEMENTATION OF RESISTIVE PROCESSING UNITS USING COMPLEMENTARY METAL OXIDE SEMICONDUCTOR TECHNOLOGY",
  "ipcr_labels": [
    "G06N308",
    "G06N3063",
    "G06N304"
  ],
  "_processing_info": {
    "original_size": 55497,
    "optimized_size": 3635,
    "reduction_percent": 93.45
  }
}