{
  "decision": "ACCEPTED",
  "application_number": "15246276",
  "date_published": "20161215",
  "date_produced": "20161130",
  "title": "INTERNET RADIO AND BROADCAST APPARATUS AND SYSTEM WITH MUSIC INFORMATION AND PURCHASING",
  "filing_date": "20160824",
  "inventor_list": [
    {
      "inventor_name_last": "BOULTER",
      "inventor_name_first": "Jeffrey R.",
      "inventor_city": "Los Angeles",
      "inventor_state": "CA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "BEAUPRE",
      "inventor_name_first": "Todd M.",
      "inventor_city": "Los Angeles",
      "inventor_state": "CA",
      "inventor_country": "US"
    }
  ],
  "ipcr_labels": [
    "G06Q3006",
    "G06F1730",
    "H04N21431",
    "G06Q3002"
  ],
  "main_ipcr_label": "G06Q3006",
  "summary": "<SOH> BRIEF DESCRIPTION OF THE DRAWINGS <EOH>FIG. 1A is a schematic view of the system architecture used to achieve one embodiment of the present invention. FIG. 1B is a screen shot showing a computer desktop with the audio player and user homepage in accordance with an embodiment of the present invention. FIG. 1C is a screen shot showing a computer desktop with the video player and user homepage in accordance with an embodiment of the present invention. FIG. 2 shows an initial desktop with two browser windows arising from an embodiment of the present invention. FIG. 3 is a continuation of a larger window in FIG. 2 in accordance with an embodiment of the present invention. FIG. 4 shows the smaller player window and the larger data window used in an embodiment of the present invention. FIG. 5 is the smaller player window of FIGS. 2-4 with the artist highlighted. FIG. 6 is the player window with the album highlighted in accordance with an embodiment of the present invention. FIG. 7 shows the player window with the song highlighted and the tool tip indicating “Skip for now” in accordance with an embodiment of the present invention. FIG. 8 is the player window with the tool tip indicating the reason why the song is being played in accordance with an embodiment of the present invention. FIG. 9 is the player window showing to the viewer that it is “Updating” its broadcast in accordance with an embodiment of the present invention. FIG. 10 is a close up view of the initial LAUNCHcast window of FIG. 2 . FIG. 11 shows the bottom half of a second and different initial LAUNCHcast screen similar to that in FIG. 10 in accordance with an embodiment of the present invention. FIG. 12 shows the player window with its “RECENT SONGS” tool tip, as well as the data window displayed in response to selecting the recent song's hyperlink in accordance with an embodiment of the present invention. FIG. 13 shows a Windows 98 desktop with the smaller player and larger data windows. The “BUY” too...",
  "patent_number": "9741067",
  "abstract": "Data streams are generally selected according to user preferences and transmitted to the user in general alignment with expressed preferences of the user. Such data streams may be music, including music videos. Users may indicate their general or specific preferences with regards to song, artists, or albums. Any other aspects or factors that might affect the user's preferences can be taken into account. A playlist is created that combines all of these factors. The playlist then serves as the basis for feeding the data streams to the user. Each user is able to express his or her own preferences and receive music corresponding to those preferences on an on-going basis.",
  "publication_number": "US20160364782A1-20161215",
  "_processing_info": {
    "original_size": 120429,
    "optimized_size": 3492,
    "reduction_percent": 97.1
  }
}