{
  "decision": "PENDING",
  "application_number": "15248511",
  "date_published": "20170302",
  "date_produced": "20170214",
  "title": "METHOD OF IMPROVING MEDICATION ADHERENCE",
  "filing_date": "20160826",
  "inventor_list": [
    {
      "inventor_name_last": "Movva",
      "inventor_name_first": "Arvind",
      "inventor_city": "Moline",
      "inventor_state": "IL",
      "inventor_country": "US"
    }
  ],
  "ipcr_labels": [
    "G06F1900"
  ],
  "main_ipcr_label": "G06F1900",
  "summary": "<SOH> SUMMARY OF THE INVENTION <EOH>The present invention is method and systems for improving medication adherence of patients or populations of patients including: 1) constructing a list of medications for each patient; 2) notifying the patient to take a particular medication in a particular dosage amount at a particular time, 3) recording a response or non-response by the patient to the notification; 4) calculating a medication adherence rate based on the cumulative responses of a patient over time. The method may further include displaying the calculated medication adherence rate to the patient (including caregivers) and/or medical professionals. Additional embodiments include providing the medications to the patients in dosing packets. Yet another embodiment includes identifying a patient population and applying the disclosed medication adherence improvement methods to the population to improve a health outcome for the population.",
  "patent_number": "None",
  "abstract": "The present invention includes methods and system for improving a medication adherence rate of a patients including constructing a medication list for the patient and notifying the patient of each dosing event. A response or non-response of the patient to the notification is recorded and a medication adherence rate for each patient is calculated and displayed to the patient and/or medical professional.",
  "publication_number": "US20170061094A1-20170302",
  "_processing_info": {
    "original_size": 44187,
    "optimized_size": 1877,
    "reduction_percent": 95.75
  }
}