{
  "decision": "PENDING",
  "application_number": "15241730",
  "date_published": "20161208",
  "date_produced": "20161122",
  "title": "Advertisements for Applications on an Online Social Network",
  "filing_date": "20160819",
  "inventor_list": [
    {
      "inventor_name_last": "Schultz",
      "inventor_name_first": "Alexander Paul",
      "inventor_city": "San Francisco",
      "inventor_state": "CA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Alison",
      "inventor_name_first": "Thomas",
      "inventor_city": "Palo Alto",
      "inventor_state": "CA",
      "inventor_country": "US"
    }
  ],
  "ipcr_labels": [
    "G06Q3002",
    "H04L2908"
  ],
  "main_ipcr_label": "G06Q3002",
  "summary": "<SOH> BRIEF DESCRIPTION OF THE DRAWINGS <EOH>FIG. 1 illustrates an example network environment of an example social-networking system. FIG. 2 illustrates an example social graph. FIGS. 3A-3B illustrate example webpages associated with concept nodes. FIG. 4 illustrates example advertisements. FIG. 5 illustrates an example method. FIG. 6 illustrates an example computer system. FIG. 7 illustrates an example network environment. detailed-description description=\"Detailed Description\" end=\"lead\"?",
  "patent_number": "None",
  "abstract": "In one embodiment, a social-networking system accesses a social graph, receives a request to generate an advertisement of a third-party application, identifies a set of objects associated with the third-party application, wherein each identified object has been interacted with by one or more first users of an online social network, one or more second users of the online social network, wherein each second user is connected on the online social network with at least one of the first users, and sends to one or more client devices of one or more of the second users, respectively, an advertisement of the third-party application, wherein for each second user the advertisement contains a reference to at least one of the identified objects that has been interacted with by at least one of the first users.",
  "publication_number": "US20160358212A1-20161208",
  "_processing_info": {
    "original_size": 90756,
    "optimized_size": 2027,
    "reduction_percent": 97.77
  }
}