{
  "decision": "ACCEPTED",
  "application_number": "15244420",
  "date_published": "20161208",
  "date_produced": "20161122",
  "title": "SMART NFC ANTENNA MATCHING NETWORK SYSTEM HAVING MULTIPLE ANTENNAS AND USER DEVICE INCLUDING THE SAME",
  "filing_date": "20160823",
  "inventor_list": [
    {
      "inventor_name_last": "JANG",
      "inventor_name_first": "Yohan",
      "inventor_city": "Seoul",
      "inventor_state": "",
      "inventor_country": "KR"
    },
    {
      "inventor_name_last": "SONG",
      "inventor_name_first": "Iljong",
      "inventor_city": "Suwon-si",
      "inventor_state": "",
      "inventor_country": "KR"
    },
    {
      "inventor_name_last": "ROH",
      "inventor_name_first": "Hyounghwan",
      "inventor_city": "Seoul",
      "inventor_state": "",
      "inventor_country": "KR"
    },
    {
      "inventor_name_last": "LEE",
      "inventor_name_first": "Youngki",
      "inventor_city": "Incheon",
      "inventor_state": "",
      "inventor_country": "KR"
    }
  ],
  "ipcr_labels": [
    "H04B500",
    "G06Q2032"
  ],
  "main_ipcr_label": "H04B500",
  "summary": "<SOH> SUMMARY <EOH>One aspect of embodiments of the inventive concept is directed to provide a near field communication (hereinafter, referred to as “NFC”) antenna matching network system connected to an NFC transceiver, comprising a matching circuit connected to first and second antenna terminals and to the NFC transceiver; and a plurality of NFC antennas connected in parallel and physically with the first and second antenna terminals, wherein each of the NFC antennas comprises a source coil connected between the first antenna terminal and the second antenna terminal; and a resonance coil physically separated from the source coil. In exemplary embodiments, the matching circuit comprises a first capacitor connected between the first antenna terminal and the NFC transceiver; and a second capacitor connected between the second antenna terminal and the NFC transceiver. In exemplary embodiments, the matching circuit comprises at least one of a first resistor and a first inductor connected between the first capacitor and the first antenna terminal; and at least one of a second resistor and a second inductor connected between the second capacitor and the second antenna terminal. In exemplary embodiments, each of the NFC antennas further comprises a third capacitor connected in parallel with the resonance coil. In exemplary embodiments, at least one of a third resistor and a third inductor is connected in series between the resonance coil and the third capacitor. In exemplary embodiments, the resonance coil and the third capacitor form a parallel resonator, the source coil of each of the NFC antennas and the first and second capacitors form a serial resonator, and the parallel resonator of each of the NFC antennas is physically separated from the source coil of each of the NFC antennas. In exemplary embodiments, the source coil of each of the NFC antennas is formed of a first conductive line having a single-loop shape or a multi-loop shape, and the resonance coil of each o...",
  "patent_number": "9800295",
  "abstract": "A near field communication (hereinafter, referred to as “NFC”) antenna matching network system connected to an NFC transceiver is provided. The NFC antenna matching network system includes a matching circuit connected to first and second antenna terminals and to the NFC transceiver; and a plurality of NFC antennas connected in parallel and physically with the first and second antenna terminals, wherein each of the NFC antennas comprises a source coil connected between the first antenna terminal and the second antenna terminal; and a resonance coil physically separated from the source coil.",
  "publication_number": "US20160359527A1-20161208",
  "_processing_info": {
    "original_size": 83822,
    "optimized_size": 3638,
    "reduction_percent": 95.66
  }
}