{
  "date_produced": "20161122",
  "publication_number": "US20160358093A1-20161208",
  "main_ipcr_label": "G06N700",
  "decision": "PENDING",
  "application_number": "15243802",
  "inventor_list": [
    {
      "inventor_name_last": "Jackson",
      "inventor_name_first": "Bryan L.",
      "inventor_city": "Fremont",
      "inventor_state": "CA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Modha",
      "inventor_name_first": "Dharmendra S.",
      "inventor_city": "San Jose",
      "inventor_state": "CA",
      "inventor_country": "US"
    }
  ],
  "abstract": "Embodiments of the invention relate to implementing a probabilistic graphical model (PGM) using magnetic tunnel junctions (MTJs). One embodiment comprises a memory array of magnetic tunnel junctions and a driver unit for programming the memory array to represent a probabilistic graphical model. The magnetic tunnel junctions are organized into multiple subsets of magnetic tunnel junctions. The driver unit selectively applies an electrical pulse to a subset of magnetic tunnel junctions to program information representing a probabilistic belief state in said subset of magnetic tunnel junctions.",
  "filing_date": "20160822",
  "patent_number": "None",
  "summary": "<SOH> BRIEF SUMMARY <EOH>Embodiments of the invention relate to implementing a probabilistic graphical model (PGM) using magnetic tunnel junctions (MTJs). One embodiment comprises a memory array of magnetic tunnel junctions and a driver unit for programming the memory array to represent a probabilistic graphical model. The magnetic tunnel junctions are organized into multiple subsets of magnetic tunnel junctions. The driver unit selectively applies an electrical pulse to a subset of magnetic tunnel junctions to program information representing a probabilistic belief state in said subset of magnetic tunnel junctions. Another embodiment comprises organizing magnetic tunnel junctions of a memory array into multiple subsets of magnetic tunnel junctions, and programming the memory array to represent a probabilistic graphical model. An electrical pulse is selectively applied to at least one subset of magnetic tunnel junctions, such that information representing a probabilistic belief state is programmed in said at least one subset of magnetic tunnel junctions. These and other features, aspects and advantages of the present invention will become understood with reference to the following description, appended claims and accompanying figures.",
  "date_published": "20161208",
  "title": "IMPLEMENTING STOCHASTIC NETWORKS USING MAGNETIC TUNNEL JUNCTIONS",
  "ipcr_labels": [
    "G06N700",
    "G06N502"
  ],
  "_processing_info": {
    "original_size": 35583,
    "optimized_size": 2566,
    "reduction_percent": 92.79
  }
}