{
  "date_produced": "20170419",
  "publication_number": "US20170124460A1-20170504",
  "main_ipcr_label": "G06N502",
  "decision": "PENDING",
  "application_number": "15242302",
  "inventor_list": [
    {
      "inventor_name_last": "Jerram",
      "inventor_name_first": "Andrew Peter Nelson",
      "inventor_city": "Windsor",
      "inventor_state": "",
      "inventor_country": "GB"
    },
    {
      "inventor_name_last": "McMahon",
      "inventor_name_first": "Frederick Francis",
      "inventor_city": "Maldon",
      "inventor_state": "",
      "inventor_country": "GB"
    }
  ],
  "abstract": "The APPARATUSES, METHODS AND SYSTEMS FOR A DIGITAL CONVERSATION MANAGEMENT PLATFORM (“DCM-Platform”) transforms digital dialogue from consumers, client demands and, Internet search inputs via DCM-Platform components into tradable digital assets, and client needs based artificial intelligence campaign plan outputs. In one implementation, The DCM-Platform may capture and examine conversations between individuals and artificial intelligence conversation agents. These agents may be viewed as assets. One can measure the value and performance of these agents by assessing their performance and ability to generate revenue from prolonging conversations and/or ability to effect sales through conversations with individuals.",
  "filing_date": "20160819",
  "patent_number": "None",
  "summary": "<SOH> SUMMARY <EOH>The APPARATUSES, METHODS AND SYSTEMS FOR A DIGITAL CONVERSATION MANAGEMENT PLATFORM (“DCM-Platform”) transforms digital dialogue from consumers, client demands and, Internet search inputs via DCM-Platform components into tradable digital assets, and client needs based artificial intelligence campaign plan outputs. In one embodiment, a method is disclosed, comprising: receiving information indicating a demand for a digital conversation asset; determining a type of the demanded digital conversation asset; initializing an exchange procedure for the determined type of the demanded digital conversation asset; obtaining information required by the exchange procedure for the determined type of the demanded digital conversation asset; and determining an index of the demanded digital conversation asset at least based on the obtained information for the determined type of the demanded digital conversation asset. In one embodiment, a method is disclosed, comprising: instantiating a conversational artificial-intelligence agent; identifying an individual target for conversation; initiating a conversation with the individual target by the artificial-intelligence agent by providing a first portion of a conversational dialogue to the individual target; recording a response from the individual target to the first portion of the conversational dialogue; and responding to the response from the individual target with a next contextual portion of the conversational dialogue.",
  "date_published": "20170504",
  "title": "APPARATUSES, METHODS AND SYSTEMS FOR A DIGITAL CONVERSATION MANAGEMENT PLATFORM",
  "ipcr_labels": [
    "G06N502",
    "G06Q3002",
    "G10L2548",
    "G10L1304",
    "G10L1508"
  ],
  "_processing_info": {
    "original_size": 390136,
    "optimized_size": 3015,
    "reduction_percent": 99.23
  }
}