{
  "date_produced": "20161208",
  "publication_number": "US20160371592A1-20161222",
  "main_ipcr_label": "G06N504",
  "decision": "PENDING",
  "application_number": "15243740",
  "inventor_list": [
    {
      "inventor_name_last": "Hohimer",
      "inventor_name_first": "Ryan E.",
      "inventor_city": "West Richland",
      "inventor_state": "WA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Greitzer",
      "inventor_name_first": "Frank L.",
      "inventor_city": "Richland",
      "inventor_state": "WA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Hampton",
      "inventor_name_first": "Shawn D.",
      "inventor_city": "Kennewick",
      "inventor_state": "WA",
      "inventor_country": "US"
    }
  ],
  "abstract": "Information processing systems, reasoning modules, and reasoning system design methods are described. According to one aspect, an information processing system includes working memory comprising a semantic graph which comprises a plurality of abstractions, wherein the abstractions individually include an individual which is defined according to an ontology and a reasoning system comprising a plurality of reasoning modules which are configured to process different abstractions of the semantic graph, wherein a first of the reasoning modules is configured to process a plurality of abstractions which include individuals of a first classification type of the ontology and a second of the reasoning modules is configured to process a plurality of abstractions which include individuals of a second classification type of the ontology, wherein the first and second classification types are different.",
  "filing_date": "20160822",
  "patent_number": "None",
  "summary": "<SOH> BRIEF DESCRIPTION OF THE DRAWINGS <EOH>Exemplary embodiments of the disclosure are described below with reference to the following accompanying drawings. FIG. 1 is a functional block diagram of an information processing system according to one embodiment. FIG. 2 is a functional block diagram of a computing system according to one embodiment. FIG. 3 is a functional block diagram of a reasoning module according to one embodiment. FIG. 4 is a functional block diagram of a plurality of reasoning modules and working memory according to one embodiment. FIG. 5 is a functional block diagram of a reasoning region according to one embodiment. FIG. 6 is a functional block diagram of a plurality of reasoning regions according to one embodiment. FIGS. 7 a and 7 b are semantic graphs depicting subsumption processing according to one embodiment. FIGS. 8 a and 8 b are semantic graphs depicting composition processing according to one embodiment. detailed-description description=\"Detailed Description\" end=\"lead\"?",
  "date_published": "20161222",
  "title": "Information Processing Systems, Reasoning Modules, and Reasoning System Design Methods",
  "ipcr_labels": [
    "G06N504",
    "G06N502"
  ],
  "_processing_info": {
    "original_size": 64776,
    "optimized_size": 2810,
    "reduction_percent": 95.66
  }
}