{
  "date_produced": "20170503",
  "publication_number": "US20170140293A1-20170518",
  "main_ipcr_label": "G06N700",
  "decision": "PENDING",
  "application_number": "15241586",
  "inventor_list": [
    {
      "inventor_name_last": "VIJ",
      "inventor_name_first": "Abhinav",
      "inventor_city": "Gurgaon",
      "inventor_state": "",
      "inventor_country": "IN"
    },
    {
      "inventor_name_last": "PREMSUNDAR",
      "inventor_name_first": "Anand",
      "inventor_city": "Chennai",
      "inventor_state": "",
      "inventor_country": "IN"
    },
    {
      "inventor_name_last": "RAPBERGER",
      "inventor_name_first": "Werner",
      "inventor_city": "Zurich",
      "inventor_state": "",
      "inventor_country": "CH"
    },
    {
      "inventor_name_last": "JHA",
      "inventor_name_first": "Chinmay",
      "inventor_city": "Gurgaon",
      "inventor_state": "",
      "inventor_country": "IN"
    },
    {
      "inventor_name_last": "BAZARI",
      "inventor_name_first": "Purvika",
      "inventor_city": "Kota",
      "inventor_state": "",
      "inventor_country": "IN"
    },
    {
      "inventor_name_last": "BANSAL",
      "inventor_name_first": "Aditi",
      "inventor_city": "Lucknow",
      "inventor_state": "",
      "inventor_country": "IN"
    }
  ],
  "abstract": "A device may determine a set of trip attributes, associated with a driving trip, based on at least two of: location data associated with the driving trip, geospatial data associated with the driving trip, or weather data associated with the driving trip. The device may derive a set of driving style variables, associated with a manner in which the vehicle is driven during the driving trip, based on at least two of: the location data, the geospatial data, the weather data, acceleration data associated with the driving trip, or a location-based variable derived from the location data. The device may generate a trip risk score, associated with the driving trip and based on the set of trip attributes and the set of driving style variables, that includes a metric indicating a level of risk associated with the driving trip. The device may provide information associated with the trip risk score.",
  "filing_date": "20160819",
  "patent_number": "None",
  "summary": "<SOH> SUMMARY <EOH>According to some possible implementations, a method may include: determining, by a device, a set of trip attributes associated with a driving trip of a vehicle, where the set of trip attributes may be determined based on at least two of: location data associated with the driving trip, geospatial data determined based on the location data associated with the driving trip, or weather data associated with the driving trip; deriving, by the device, a set of driving style variables associated with a manner in which the vehicle is driven during the driving trip, where the set of driving style variables may be determined based on at least two of: the location data, the geospatial data, the weather data, acceleration data associated with the driving trip, or a location-based variable derived from the location data; generating, by the device, a trip risk score, associated with the driving trip, based on the set of trip attributes and the set of driving style variables, where the trip risk score may include a metric that indicates a level of risk associated with the driving trip; and providing, by the device, information associated with the trip risk score. According to some possible implementations, a method may include determining, by a device, a set of trip risk scores, corresponding to a driver, for a set of driving trips, where a trip risk score, of the set of trip risk scores, may include a first metric that indicates a level of risk associated with a corresponding driving trip of the set of driving trip; deriving, by the device, a set of driver variables, associated with the driver, that includes a set of variables associated with a manner in which a vehicle is driven by the driver during the set of driving trips, where the set of driver variables may be derived based on at least two of: driver data associated with the driver, the set of trip risk scores, location data associated with the set of driving trips, geospatial data determined based on the...",
  "date_published": "20170518",
  "title": "ANALYTICS PLATFORM USING TELEMATICS DATA",
  "ipcr_labels": [
    "G06N700",
    "G06Q4008",
    "G06F1730",
    "G06N9900"
  ],
  "_processing_info": {
    "original_size": 110217,
    "optimized_size": 4174,
    "reduction_percent": 96.21
  }
}