{
  "date_produced": "20170427",
  "publication_number": "US20170132529A1-20170511",
  "main_ipcr_label": "G06N9900",
  "decision": "PENDING",
  "application_number": "15244965",
  "inventor_list": [
    {
      "inventor_name_last": "Zhang",
      "inventor_name_first": "Yimin",
      "inventor_city": "Beijing",
      "inventor_state": "",
      "inventor_country": "CN"
    },
    {
      "inventor_name_last": "Zhou",
      "inventor_name_first": "Joe F.",
      "inventor_city": "Beijing",
      "inventor_state": "",
      "inventor_country": "CN"
    }
  ],
  "abstract": "According to one embodiment of the invention, a method includes generating a person-name Information Gain (IG)-Tree and a relation IG-Tree from annotated data. The method also includes tagging and partial parsing of an input document. The names of the persons are extracted within the input document using the person-name IG-tree. Additionally, names of organizations are extracted within the input document. The method also includes extracting entity names that are not names of persons and organizations within the input document. Further, the relations between the identified entity names are extracted using the relation-IG-tree.",
  "filing_date": "20160823",
  "patent_number": "None",
  "summary": "<SOH> BRIEF DESCRIPTION OF THE DRAWINGS <EOH>Embodiments of the invention may be best understood by referring to the following description and accompanying drawings which illustrate such embodiments. In the drawings: FIG. 1 illustrates a computer that provides for entity name extractions and relations, according to embodiments of the present invention; FIG. 2 is a flowchart illustrating a method of training for subsequent extraction of entity names and determination of relations of such entity names, according to embodiments of the present invention; and FIG. 3 is a flowchart illustrating a method for the extraction of entity names and relations there between based on the training data generated by learning unit 110 , according to embodiments of the present invention. detailed-description description=\"Detailed Description\" end=\"lead\"?",
  "date_published": "20170511",
  "title": "Method and Apparatus for  Extracting Entity Names and Their Relations",
  "ipcr_labels": [
    "G06N9900",
    "G06F1730"
  ],
  "_processing_info": {
    "original_size": 36213,
    "optimized_size": 2187,
    "reduction_percent": 93.96
  }
}