{
  "decision": "REJECTED",
  "application_number": "15243561",
  "date_published": "20170629",
  "date_produced": "20170614",
  "title": "AD DOWNLOAD METHOD, THE CLIENT AND THE SERVER",
  "filing_date": "20160822",
  "inventor_list": [
    {
      "inventor_name_last": "AO",
      "inventor_name_first": "Weibo",
      "inventor_city": "Beijing",
      "inventor_state": "",
      "inventor_country": "CN"
    }
  ],
  "ipcr_labels": [
    "H04L2908",
    "G06Q3002"
  ],
  "main_ipcr_label": "H04L2908",
  "summary": "<SOH> SUMMARY <EOH>This disclosure provides an advertisement-downloading method, and an electronic device, which can quickly request for and download a third-party advertisement file, so as to ensure smooth play of the advertisement. According to the first aspect, an embodiment of this disclosure provides an advertisement-downloading method, where the method includes: in response to an operation, of sending an advertisement request that includes a link address of a third-party advertisement, of a client, searching whether the third-party advertisement downloaded from the link address of the third-party advertisement is pre-stored in a local CDN file address; and when the third-party advertisement downloaded from the link address of the third-party advertisement is pre-stored in the local CDN file address, redirecting the advertisement request to the local CDN file address in which the third-party advertisement is stored, such that the client performs advertisement downloading. According to the second aspect, there is provided with a non-transitory computer-readable storage medium storing executable instructions that, when executed by an electronic apparatus, cause the electronic apparatus to perform any one of above disclosed advertisement-downloading method. According to the third aspect, there is provided with an electronic apparatus. The electronic apparatus includes: at least one processor; and a memory communicably connected with the at least one processor for storing instructions executable by the at least one processor, wherein execution of the instructions by the at least one processor causes the at least one processor to perform any one of above disclosed advertisement-downloading method.",
  "patent_number": "None",
  "abstract": "Embodiments of this disclosure provide an advertisement-downloading method, and an electronic device, wherein the method includes: in response to an operation, of sending an advertisement request that includes a link address of a third-party advertisement, of a client, searching whether the third-party advertisement downloaded from the link address of the third-party advertisement is pre-stored in a local CDN file address; and when the third-party advertisement downloaded from the link address of the third-party advertisement is pre-stored in the local CDN file address, redirect the advertisement request to the local CDN file address in which the third-party advertisement is stored, such that the client performs advertisement downloading.",
  "publication_number": "US20170187837A1-20170629",
  "_processing_info": {
    "original_size": 46325,
    "optimized_size": 3011,
    "reduction_percent": 93.5
  }
}