{
  "date_produced": "20171213",
  "publication_number": "US20170372227A1-20171228",
  "main_ipcr_label": "G06N9900",
  "decision": "PENDING",
  "application_number": "15246247",
  "inventor_list": [
    {
      "inventor_name_last": "HOSABETTU",
      "inventor_name_first": "Raghavendra",
      "inventor_city": "Bangalore",
      "inventor_state": "",
      "inventor_country": "IN"
    },
    {
      "inventor_name_last": "RAMANNA",
      "inventor_name_first": "Ramprasad Kanakatte",
      "inventor_city": "Bangalore",
      "inventor_state": "",
      "inventor_country": "IN"
    },
    {
      "inventor_name_last": "MANNOPANTAR",
      "inventor_name_first": "Raghottam",
      "inventor_city": "Bangalore",
      "inventor_state": "",
      "inventor_country": "IN"
    }
  ],
  "abstract": "This disclosure relates to system and method for dynamically training bots in response to change in process environment. In one embodiment, the method comprises detecting the one or more changes in the process environment, and determining a need for training the one or more BOTs based on the one or more changes in the process environment. In response to the need, the method further comprises recording the one or more changes in the process environment until a conformation of the process environment to a pre-existing process environment with respect to the one or more BOTs, and dynamically training the one or more BOTs based on the recording of the one or more changes.",
  "filing_date": "20160824",
  "patent_number": "None",
  "summary": "<SOH> SUMMARY <EOH>In one embodiment, a method for dynamically training one or more BOTs in response to one or more changes in a process environment is disclosed. In one example, the method comprises detecting the one or more changes in the process environment. The method further comprises determining a need for training the one or more BOTs based on the one or more changes in the process environment. In response to the need, the method further comprises recording the one or more changes in the process environment until a conformation of the process environment to a pre-existing process environment with respect to the one or more BOTs, and dynamically training the one or more BOTs based on the recording of the one or more changes. In one embodiment, a system for dynamically training one or more BOTs in response to one or more changes in a process environment is disclosed. In one example, the system comprises at least one processor and a memory communicatively coupled to the at least one processor. The memory stores processor-executable instructions, which, on execution, cause the processor to detect the one or more changes in the process environment. The processor-executable instructions, on execution, further cause the processor to determine a need for training the one or more BOTs based on the one or more changes in the process environment. In response to the need, the processor-executable instructions, on execution, further cause the processor to record the one or more changes in the process environment until a conformation of the process environment to a pre-existing process environment with respect to the one or more BOTs, and to dynamically train the one or more BOTs based on the recording of the one or more changes. In one embodiment, a non-transitory computer-readable medium storing computer-executable instructions for dynamically training one or more BOTs in response to one or more changes in a process environment is disclosed. In one example, the stored in...",
  "date_published": "20171228",
  "title": "System and Method for Dynamically Training BOTs in Response to Change in Process Environment",
  "ipcr_labels": [
    "G06N9900"
  ],
  "_processing_info": {
    "original_size": 60568,
    "optimized_size": 3577,
    "reduction_percent": 94.09
  }
}