{
  "date_produced": "20170208",
  "publication_number": "US20170053206A1-20170223",
  "main_ipcr_label": "G06N502",
  "decision": "PENDING",
  "application_number": "15241889",
  "inventor_list": [
    {
      "inventor_name_last": "Kala",
      "inventor_name_first": "Kiran",
      "inventor_city": "Jacksonville",
      "inventor_state": "FL",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Suryaprakash",
      "inventor_name_first": "Jonnavithula",
      "inventor_city": "Hyderabad",
      "inventor_state": "",
      "inventor_country": "IN"
    },
    {
      "inventor_name_last": "Dakshina Murthy",
      "inventor_name_first": "Kolluru Venkata",
      "inventor_city": "Hyderabad",
      "inventor_state": "",
      "inventor_country": "IN"
    }
  ],
  "abstract": "A method and system for identifying and prioritizing business useful insights from hidden patterns. This invention relates to data mining techniques and more particularly to identify and prioritize insights from a plurality of insights present in a large set of data. Insight exploration is a method and system that enables the user to generate actionable insights, prioritize them for a given data. This falls broadly within the field of data mining. The primary achievement of this invention is to take a rule in if-then format and then systematically process them to identify actionable information from them. In that process, the system automatically prioritizes the rules, generates other rules and analyzes the path that leads to desired behavioral changes.",
  "filing_date": "20160819",
  "patent_number": "None",
  "summary": "<SOH> BRIEF DESCRIPTION OF FIGURES <EOH>This invention is illustrated in the accompanying drawings, throughout which like reference letters indicate corresponding parts in the various figures. The embodiments herein will be better understood from the following description with reference to the drawings, in which: FIG. 1 depicts system for analyzing data, according to embodiments as disclosed herein; FIG. 2 depicts a scatter plot, where x-axis is support of the insights, y-axis is the confidence of the insights and size of each insight represents the lift of the insight, according to embodiments as disclosed herein; FIG. 3 depicts an example graph of average score comparisons of top 20 insights for 5 different business cases, according to embodiments as disclosed herein; FIG. 4 is a consolidated flow chart for Insight Explorer module, according to embodiments as disclosed herein; FIG. 5 depicts a flow chart for generating generalized insight from a given rule, according to embodiments as disclosed herein; FIG. 6 depicts a flow chart for generating specialized insight from a given rule, according to embodiments as disclosed herein; FIG. 7 depicts a flowchart for generating customized insight for a given rule according to embodiments as disclosed herein; FIG. 8 depicts a flow chart for generating what-if insights for a selected class level for a given rule, according to embodiments as disclosed herein; and FIG. 9 illustrates a plurality of components of a device for extracting statistically significant patterns describing a specific behavior from a provided set of data, enabling modifications of the existing rules and providing recommendations that will enable decision making, according to embodiments as disclosed herein. detailed-description description=\"Detailed Description\" end=\"lead\"?",
  "date_published": "20170223",
  "title": "Methods and systems for identifying and prioritizing insights from hidden patterns",
  "ipcr_labels": [
    "G06N502"
  ],
  "_processing_info": {
    "original_size": 49059,
    "optimized_size": 3471,
    "reduction_percent": 92.92
  }
}