{
  "date_produced": "20161208",
  "publication_number": "US20160371605A1-20161222",
  "main_ipcr_label": "G06N9900",
  "decision": "PENDING",
  "application_number": "15243536",
  "inventor_list": [
    {
      "inventor_name_last": "Agrawal",
      "inventor_name_first": "Ritesh Jitendra",
      "inventor_city": "Fremont",
      "inventor_state": "CA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Shanahan",
      "inventor_name_first": "James G.",
      "inventor_city": "San Francisco",
      "inventor_state": "CA",
      "inventor_country": "US"
    }
  ],
  "abstract": "Systems and methods use machine learning techniques to resolve location ambiguity in search queries. In one aspect, a dataset generator generates a training dataset using query logs of a search engine. A training engine applies a machine learning technique to the training dataset to generate a location disambiguation model. A location disambiguation engine uses the location disambiguation model to resolve location ambiguity in subsequent search queries.",
  "filing_date": "20160822",
  "patent_number": "None",
  "summary": "<SOH> BRIEF DESCRIPTION OF THE DRAWINGS <EOH>The embodiments are illustrated by way of example and not limitation in the figures of the accompanying drawings in which like references indicate similar elements. FIG. 1 shows a system to provide local searches according to one embodiment. FIG. 2 shows a method and system to generate a location model according to one embodiment. FIG. 3 illustrates training features for a location model according to one embodiment. FIG. 4 shows a method and system to generate target values of a training dataset for a location model according to one embodiment. FIG. 5 shows a method to resolve location ambiguity according to one embodiment. FIG. 6 shows a data processing system to implement components and systems according to various embodiments. detailed-description description=\"Detailed Description\" end=\"lead\"?",
  "date_published": "20161222",
  "title": "Systems and Methods to Facilitate Local Searches Via Location Disambiguation",
  "ipcr_labels": [
    "G06N9900",
    "G06F1730"
  ],
  "_processing_info": {
    "original_size": 59856,
    "optimized_size": 2052,
    "reduction_percent": 96.57
  }
}