{
  "date_produced": "20171219",
  "publication_number": "US20180005112A1-20180104",
  "main_ipcr_label": "G06N308",
  "decision": "PENDING",
  "application_number": "15245934",
  "inventor_list": [
    {
      "inventor_name_last": "ISO-SIPILA",
      "inventor_name_first": "Juha",
      "inventor_city": "London",
      "inventor_state": "",
      "inventor_country": "GB"
    },
    {
      "inventor_name_last": "WILLSON",
      "inventor_name_first": "Matthew James",
      "inventor_city": "London",
      "inventor_state": "",
      "inventor_country": "GB"
    }
  ],
  "abstract": "The present invention relates to an improved artificial neural network for predicting one or more next items in a sequence of items based on an input sequence item. The artificial neural network is implemented on an electronic device comprising a processor, and at least one input interface configured to receive one or more input sequence items, wherein the processor is configured to implement the artificial neural network and generate one or more predicted next items in a sequence of items using the artificial neural network by providing an input sequence item received at the at least one input interface and a side input as inputs to the artificial neural network, wherein the side input is configured to maintain a record of input sequence items received at the input interface.",
  "filing_date": "20160824",
  "patent_number": "None",
  "summary": "<SOH> SUMMARY <EOH>In a first aspect of the invention, an electronic device is provided, the electronic device comprising a processor, and at least one input interface configured to receive one or more input sequence items. The processor is configured to implement an artificial neural network and generate one or more predicted next items in a sequence of items using the artificial neural network by providing an input sequence item received at the at least one input interface and a side input as inputs to the artificial neural network, wherein the side input is configured to maintain a record of input sequence items received at the input interface. The processor of the electronic device may be configured to generate the one or more predicted next items in the sequence of items by providing the input sequence item and the side input as inputs to an input layer of the artificial neural network. The processor may be configured to generate one or more subsequent predicted items in the sequence. The one or more subsequent predicted items may be generated by providing a second input sequence item and the side input as inputs to an input layer of the artificial neural network. The second input sequence item may be the previously predicted next item in the sequence output by the artificial neural network. In some embodiments of the invention, the artificial neural network may be a fixed context neural network. In the first embodiment, the processor may be configured to generate the one or more predicted next items in a sequence of items by further providing one or more additional input sequence items as input to the artificial neural network. The input sequence item and one or more additional sequence items may be consecutive previous sequence items. In this way, short-term historical context may be provided to the artificial neural network, improving the accuracy of the output predicted next items in the sequence. The input sequence items and the side input may be concatena...",
  "date_published": "20180104",
  "title": "ARTIFICIAL NEURAL NETWORK WITH SIDE INPUT FOR LANGUAGE MODELLING AND PREDICTION",
  "ipcr_labels": [
    "G06N308",
    "G06N304"
  ],
  "_processing_info": {
    "original_size": 68930,
    "optimized_size": 3513,
    "reduction_percent": 94.9
  }
}