{
  "decision": "PENDING",
  "application_number": "15249300",
  "date_published": "20171116",
  "date_produced": "20171103",
  "title": "SYSTEMS AND METHODS FOR INCREMENTAL ANALYSIS OF SOFTWARE",
  "filing_date": "20160826",
  "inventor_list": [
    {
      "inventor_name_last": "Li",
      "inventor_name_first": "Guodong",
      "inventor_city": "San Jose",
      "inventor_state": "CA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Steven",
      "inventor_name_first": "John",
      "inventor_city": "Boston",
      "inventor_state": "MA",
      "inventor_country": "US"
    }
  ],
  "ipcr_labels": [
    "G06F1136"
  ],
  "main_ipcr_label": "G06F1136",
  "summary": "<SOH> SUMMARY <EOH>In accordance with some embodiments, a method is provided for performing static analysis of software to detect security vulnerabilities, comprising acts of: generating a first application architecture model for a software application, wherein: the first application architecture model is generated based on a first version of source code of the software application; and the first application architecture model comprises a plurality of component models; comparing a second version of source code against the first version of source code to determine at least one difference; identifying, based on the at least one difference, at least one affected component model of the first application architecture model; and generating, based on the second version of source code, a second application architecture model, wherein generating the second application architecture model comprises generating an updated version of the at least one affected component model. In accordance with some embodiments, a system is provided, comprising at least one processor and at least one computer-readable storage medium having stored thereon instructions which, when executed, program the at least one processor to perform the above method. In accordance with some embodiments, at least one computer-readable storage medium is provided, having stored thereon instructions which, when executed, program at least one processor to perform the above method.",
  "patent_number": "None",
  "abstract": "Systems and methods for software verification. In some embodiments, a first application architecture model is generated for a software application, wherein: the first application architecture model is generated based on a first version of source code of the software application; and the first application architecture model comprises a plurality of component models. A second version of source code may be compared against the first version of source code to determine at least one difference. At least one affected component model of the first application architecture model may be identified based on the at least one difference. A second application architecture model may be generated based on the second version of source code, wherein generating the second application architecture model comprises generating an updated version of the at least one affected component model.",
  "publication_number": "US20170329693A1-20171116",
  "_processing_info": {
    "original_size": 131016,
    "optimized_size": 3015,
    "reduction_percent": 97.7
  }
}