{
  "date_produced": "20180207",
  "publication_number": "US20180053095A1-20180222",
  "main_ipcr_label": "G06N502",
  "decision": "PENDING",
  "application_number": "15241565",
  "inventor_list": [
    {
      "inventor_name_last": "Farrell",
      "inventor_name_first": "Robert G.",
      "inventor_city": "Cornwall",
      "inventor_state": "NY",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Hassanzadeh",
      "inventor_name_first": "Oktie",
      "inventor_city": "Port Chester",
      "inventor_state": "NY",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Hamedani",
      "inventor_name_first": "Mohammad Sadoghi",
      "inventor_city": "Chappaqua",
      "inventor_state": "NY",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Sellmann",
      "inventor_name_first": "Meinolf",
      "inventor_city": "Cortlandt Manor",
      "inventor_state": "NY",
      "inventor_country": "US"
    }
  ],
  "abstract": "Methods, systems, and computer program products for iterative and targeted feature selection are provided herein. A computer-implemented method includes generating a first prediction value for a variable attribute of a set of objects by executing a predictive model that comprises a set of features for the set of objects; evaluating the prediction error of the predictive model based on said first prediction value; generating additional features upon a determination that the prediction error exceeds a threshold; incorporating the additional features into the predictive model, generating an updated predictive model; generating a second prediction value for the variable attribute by executing the updated predictive model; evaluating the prediction error of the updated predictive model based on said second prediction value; and outputting the second prediction value to a user upon a determination that the prediction error of the updated predictive model is below the threshold.",
  "filing_date": "20160819",
  "patent_number": "None",
  "summary": "<SOH> SUMMARY <EOH>In one embodiment of the present invention, techniques for iterative and targeted feature selection are provided. An exemplary computer-implemented method can include generating a first prediction value for a variable attribute of a set of one or more objects by executing a predictive model, wherein the predictive model comprises a set of features for the set of objects. Such a method can also include evaluating the prediction error of the predictive model based on said first generated prediction value, and generating one or more additional features, from a set of unstructured data associated with the set of objects, upon a determination that the prediction error exceeds a predetermined threshold. Further, such a method can include incorporating the one or more additional features into the predictive model, thereby generating an updated predictive model, and generating a second prediction value for the variable attribute of the set of objects by executing the updated predictive model. Such a method can additionally include evaluating the prediction error of the updated predictive model based on said second generated prediction value, and outputting the second generated prediction value to at least one user upon a determination that the prediction error of the updated predictive model is below the predetermined threshold. Another embodiment of the invention or elements thereof can be implemented in the form of an article of manufacture tangibly embodying computer readable instructions which, when implemented, cause a computer to carry out a plurality of method steps, as described herein. Furthermore, another embodiment of the invention or elements thereof can be implemented in the form of an apparatus including a memory and at least one processor that is coupled to the memory and configured to perform noted method steps. Yet further, another embodiment of the invention or elements thereof can be implemented in the form of means for carrying out the...",
  "date_published": "20180222",
  "title": "Iterative and Targeted Feature Selection",
  "ipcr_labels": [
    "G06N502",
    "G06N700"
  ],
  "_processing_info": {
    "original_size": 67926,
    "optimized_size": 3998,
    "reduction_percent": 94.11
  }
}