{
  "decision": "ACCEPTED",
  "application_number": "15242235",
  "date_published": "20170216",
  "date_produced": "20170201",
  "title": "SYSTEM FOR COLLECTING, ANALYZING, AND TRANSMITTING INFORMATION RELEVANT TO TRANSPORT NETWORKS",
  "filing_date": "20160819",
  "inventor_list": [
    {
      "inventor_name_last": "Herz",
      "inventor_name_first": "Frederick S. M.",
      "inventor_city": "Warrington",
      "inventor_state": "PA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Lemaire",
      "inventor_name_first": "Pierre",
      "inventor_city": "Philadelphia",
      "inventor_state": "PA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Lemaire",
      "inventor_name_first": "Jean H.",
      "inventor_city": "Marlton",
      "inventor_state": "NJ",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Labys",
      "inventor_name_first": "Walter Paul",
      "inventor_city": "Logan",
      "inventor_state": "UT",
      "inventor_country": "US"
    }
  ],
  "ipcr_labels": [
    "H04W402",
    "G06Q4008",
    "G06Q3002",
    "G06Q1010",
    "H04L2908",
    "G01C2136"
  ],
  "main_ipcr_label": "H04W402",
  "summary": "<SOH> BRIEF SUMMARY OF THE INVENTION <EOH>It is our contention that such information is even more valuable when it is gathered and stored centrally. This allows for the application of advanced data analysis techniques that can detect patterns and form connections across the data sets, which may be of great value both to the original traveler as well as to interested third parties. For example, it may be that the congestion of the harbor (i.e. ship traffic) has a significant impact on the travel times of the commuter boat. Our system would detect this connection by correlating the ferry's arrival and departure times with the harbor radar data. Using this information, a real-time navigational application could then allow the ferry operator to make precise predictions for the estimated time of arrival, given the current state of the harbor traffic. As outlined in a previous patent, LEIA (Location Enhanced Information Architecture) provides a framework for the collection, analysis, and retransmission of relevant data. This is a very general architecture which can be broken down into, the following steps ( FIG. 1 provides a schematic of this process); 1. Sensors Acquire Signals from an Individual User These signals include everything that can be used to identify and geographically locate an individual, be they from Active Badges, cellular phones, motion detectors, EZ-Pass toll-booth devices, interactions with a computer workstation, etc. Such signals may be actively or passively generated. 2. Sensors Emit Location Identifiers (LID) Having detected an individual, sensors transmit special codes, called LIDs, to a central server. LIDS include location, time stamp, and signal information. 3. Secure System translates LIDs to User Identifiers (UID) Content of LID used to infer user's identity; the UID that is chosen may be pseudonymous (to protect privacy at this stage). At this point the system has both locational/behavioral information (contained in the LIDs) as well as info...",
  "patent_number": "9832610",
  "abstract": "When individual persons or vehicles move through a transportation network, they are likely to be both actively and passively creating information that reflects their location and current behavior. In this patent, we propose a system that makes complete use of this information. First, through a broad web of sensors, our system collects and stores the full range of information generated by travelers. Next, through the use of previously-stored data and active computational analysis, our system deduces the identity of individual travelers. Finally; using advanced data-mining technology, our system selects useful information and transmits it back to the individual, as well as to third-party users; in short, it forms the backbone for a variety of useful location-related end-user applications.",
  "publication_number": "US20170048672A1-20170216",
  "_processing_info": {
    "original_size": 82917,
    "optimized_size": 3896,
    "reduction_percent": 95.3
  }
}