{
  "date_produced": "20180207",
  "publication_number": "US20180053096A1-20180222",
  "main_ipcr_label": "G06N502",
  "decision": "PENDING",
  "application_number": "15242821",
  "inventor_list": [
    {
      "inventor_name_last": "Farrell",
      "inventor_name_first": "Robert G.",
      "inventor_city": "Cornwall",
      "inventor_state": "NY",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Fokoue-Nkoutche",
      "inventor_name_first": "Achille",
      "inventor_city": "White Plains",
      "inventor_state": "NY",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Hassanzadeh",
      "inventor_name_first": "Oktie",
      "inventor_city": "Port Chester",
      "inventor_state": "NY",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Hamedani",
      "inventor_name_first": "Mohammad Sadoghi",
      "inventor_city": "Chappaqua",
      "inventor_state": "NY",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Sellmann",
      "inventor_name_first": "Meinolf",
      "inventor_city": "Cortlandt Manor",
      "inventor_state": "NY",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Zhang",
      "inventor_name_first": "Ping",
      "inventor_city": "White Plains",
      "inventor_state": "NY",
      "inventor_country": "US"
    }
  ],
  "abstract": "Methods, systems, and computer program products for linkage prediction through similarity analysis are provided herein. A computer-implemented method includes extracting multiple features from (i) one or more attributes of a set of source nodes within a knowledge graph and (ii) one or more attributes of a set of target nodes within the knowledge graph, wherein at least one extracted feature satisfies a designated complexity level; performing a similarity analysis across the at least one extracted feature by applying one or more similarity measures to the at least one extracted feature; predicting one or more sets of links between the source nodes and the target nodes based on the similarity analysis, wherein one or more sets of predicted links satisfy a pre-determined accuracy threshold; and outputting the one or more sets of predicted links to a user.",
  "filing_date": "20160822",
  "patent_number": "None",
  "summary": "<SOH> SUMMARY <EOH>In one embodiment of the present invention, techniques for linkage prediction through similarity analysis are provided. An exemplary computer-implemented method can include extracting multiple features from (i) one or more attributes of a set of source nodes within a knowledge graph and (ii) one or more attributes of a set of target nodes within the knowledge graph, wherein at least one extracted feature satisfies a designated complexity level. Such a method can also include performing a similarity analysis across the at least one extracted feature by applying one or more similarity measures to the at least one extracted feature. Further, such a method can include predicting one or more sets of links between the source nodes and the target nodes based on the similarity analysis, wherein one or more sets of predicted links satisfy a pre-determined accuracy threshold, and outputting the one or more sets of predicted links to a user. Another embodiment of the invention or elements thereof can be implemented in the form of a computer program product tangibly embodying computer readable instructions which, when implemented, cause a computer to carry out a plurality of method steps, as described herein. Furthermore, another embodiment of the invention or elements thereof can be implemented in the form of a system including a memory and at least one processor that is coupled to the memory and configured to perform noted method steps. These and other objects, features and advantages of the present invention will become apparent from the following detailed description of illustrative embodiments thereof, which is to be read in connection with the accompanying drawings.",
  "date_published": "20180222",
  "title": "Linkage Prediction Through Similarity Analysis",
  "ipcr_labels": [
    "G06N502",
    "G06F1730"
  ],
  "_processing_info": {
    "original_size": 51733,
    "optimized_size": 3894,
    "reduction_percent": 92.47
  }
}