{
  "date_produced": "20180207",
  "publication_number": "US20180053104A1-20180222",
  "main_ipcr_label": "G06N504",
  "decision": "PENDING",
  "application_number": "15243661",
  "inventor_list": [
    {
      "inventor_name_last": "Teplinsky",
      "inventor_name_first": "Shaul",
      "inventor_city": "San Francisco",
      "inventor_state": "CA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Phillips",
      "inventor_name_first": "Bruce Alan",
      "inventor_city": "Jerusalem",
      "inventor_state": "",
      "inventor_country": "IL"
    },
    {
      "inventor_name_last": "Schuldenfrei",
      "inventor_name_first": "Michael",
      "inventor_city": "Petach Tikwa",
      "inventor_state": "",
      "inventor_country": "IL"
    },
    {
      "inventor_name_last": "Sebban",
      "inventor_name_first": "Dan",
      "inventor_city": "Rishon LeZion",
      "inventor_state": "",
      "inventor_country": "IL"
    }
  ],
  "abstract": "Embodiments describe a method of manufacture including receiving a product attribute identifying a product, and receiving a first component attribute and a second component attribute, the first component attribute identifying a first component included in the product and the second component attribute identifying a second component included in the product. The method further includes receiving first manufacturing data associated with the first component and second manufacturing data associated with the second component, applying a set of compatibility rules to the first manufacturing data and the second manufacturing data, determining pairing data from the application of the set of compatibility rules to the first manufacturing data and the second manufacturing data, applying a set of pairing rules to the pairing data, determining one or more actions from the application of the set of pairing rules to the pairing data, and performing the one or more actions.",
  "filing_date": "20160822",
  "patent_number": "None",
  "summary": "<SOH> SUMMARY OF THE INVENTION <EOH>Embodiments of the present invention provide a method, as well as an apparatus and a system configured to perform a method of smart pairing for manufacturing high quality products. The method uses manufacturing data associated with each component to adapt and guide the manufacturing process to manufacture high quality products. In some embodiments, a method of manufacture includes receiving a product attribute identifying a product; receiving a first component attribute and a second component attribute, the first component attribute identifying a first component included in the product and the second component attribute identifying a second component included in the product; receiving first manufacturing data and second manufacturing data, the first manufacturing data including manufacturing data associated with the first component and the second manufacturing data including manufacturing data associated with the second component; applying a set of compatibility rules to the first manufacturing data and the second manufacturing data; determining pairing data from the application of the set of compatibility rules to the first manufacturing data and the second manufacturing data; applying a set of pairing rules to the pairing data; determining one or more actions from the application of the set of pairing rules to the pairing data; and performing the one or more actions. The pairing data may include data indicating a measure of compatibility between the first and second components. The pairing data may be determined based at least in part on a relationship between product performance and the measure of compatibility between the first and second components. In some embodiments, a type of the first manufacturing data and a type of the second manufacturing data is defined by a compatibility model, where the compatibility model includes a set of compatibility rules that is configured to determine the pairing data from the set of compati...",
  "date_published": "20180222",
  "title": "METHODS OF SMART PAIRING",
  "ipcr_labels": [
    "G06N504"
  ],
  "_processing_info": {
    "original_size": 97579,
    "optimized_size": 3943,
    "reduction_percent": 95.96
  }
}