{
  "decision": "PENDING",
  "application_number": "15247575",
  "date_published": "20171109",
  "date_produced": "20171025",
  "title": "DIGITAL AUTHENTICATION USING AUGMENTED  REALITY",
  "filing_date": "20160825",
  "inventor_list": [
    {
      "inventor_name_last": "ALLEAUME",
      "inventor_name_first": "Vincent",
      "inventor_city": "Pace",
      "inventor_state": "",
      "inventor_country": "FR"
    },
    {
      "inventor_name_last": "BELLOT",
      "inventor_name_first": "Maximilien",
      "inventor_city": "Le Relecq-Kerhuon",
      "inventor_state": "",
      "inventor_country": "FR"
    },
    {
      "inventor_name_last": "LAURENT",
      "inventor_name_first": "Anthony",
      "inventor_city": "Vignoc",
      "inventor_state": "",
      "inventor_country": "FR"
    }
  ],
  "ipcr_labels": [
    "H04L2906",
    "G06Q2010",
    "G06F316",
    "G06F30482",
    "G06F30488",
    "G06T1160",
    "G02B2701",
    "G02B2701",
    "G02B2701"
  ],
  "main_ipcr_label": "H04L2906",
  "summary": "<SOH> SUMMARY <EOH>An augmented reality (AR) interactive system and method is provided. In one embodiment the AR interactive system comprises a user interface configured to receive user input and a processor configured to manage data based user input. A camera and a display are also provided that are in processing communication with one another and the user interface via the processor. The processor is operative to initiate a user session and to display graphical images and textual information in overlying registration using the camera and display so that the images and textual information appear as part of a plurality of computer keys of a computer keyboard. The processor is configured to display the computer keys in random order each time the keys are displayed. In a different embodiment, a method of providing authentication using an augmented reality interactive system is provided. The method comprises initiating via a processor communication to authenticate a user session. It also comprises displaying via the processor graphical images and textual information in overlying registration with imagery from a camera to a user, such that the images and textual information appear as part of a computer key from a computer keyboard on a rendering surface of a head mounted user device. The method further comprises registering via the processor user key selection through user movements or voice captured by a motion sensor and/or microphone. The motion sensor and microphone is in processing communication with the processor. The processor authenticates the user session In another embodiment, an augmented reality (AR) interactive system is provided that comprises a head mounted user interface configured to receive user input. The head mounted user interface has a motion sensor, a microphone and a touch interaction area for capturing user input in form of voice, movement or touch. A display is also provided that is in processing communication with one another and the user inte...",
  "patent_number": "None",
  "abstract": "An augmented reality (AR) interactive system and method is provided. In one embodiment the systems comprises a user interface configured to receive user input, a processor configured to manage user input data, and a display in processing communication with one another and said user interface via said processor. The processor is operative to perform the following functions: initiate communication with at least one third party computer to start a user session; and display graphical images and textual information in overlying registration using the display so that the images and textual information appear as part of a plurality of computer keys of a computer keyboard, wherein the processor is configured to display computer keys in random order each time the keys are displayed.",
  "publication_number": "US20170324726A1-20171109",
  "_processing_info": {
    "original_size": 47028,
    "optimized_size": 3716,
    "reduction_percent": 92.1
  }
}