{
  "decision": "ACCEPTED",
  "application_number": "15245289",
  "date_published": "20180301",
  "date_produced": "20180213",
  "title": "AUTOMATED TRANSLATION OF SCREEN IMAGES FOR SOFTWARE DOCUMENTATION",
  "filing_date": "20160824",
  "inventor_list": [
    {
      "inventor_name_last": "He",
      "inventor_name_first": "Jenny J.",
      "inventor_city": "HURSLEY PARK",
      "inventor_state": "",
      "inventor_country": "GB"
    },
    {
      "inventor_name_last": "Kyte",
      "inventor_name_first": "Adrian P.",
      "inventor_city": "Winchester",
      "inventor_state": "",
      "inventor_country": "GB"
    },
    {
      "inventor_name_last": "Liu",
      "inventor_name_first": "Guan Jun",
      "inventor_city": "BEIJING",
      "inventor_state": "",
      "inventor_country": "CN"
    },
    {
      "inventor_name_last": "Winchester",
      "inventor_name_first": "Joseph R.",
      "inventor_city": "HURSLEY",
      "inventor_state": "",
      "inventor_country": "GB"
    },
    {
      "inventor_name_last": "Zhou",
      "inventor_name_first": "Bei Chun",
      "inventor_city": "BEIJING",
      "inventor_state": "",
      "inventor_country": "CN"
    }
  ],
  "ipcr_labels": [
    "G06F1728",
    "G06F1727",
    "G06F1721",
    "G06F1722"
  ],
  "main_ipcr_label": "G06F1728",
  "summary": "<SOH> SUMMARY <EOH>Embodiments include a method, system, and computer program product for automated translation of screen images for software documentation. A method includes receiving a description of a display screen generated by a software program executed in a first mode to interact with a user in first language. The description is in a serialized format that includes screen capture parameters and an offset location in a first dictionary corresponding to a screen element in the display screen. The first dictionary includes screen elements utilized by the software program when executing in the first mode to generate the display screen. A target language is identified, and a second dictionary of screen elements utilized by a deserialization program in the target language is accessed. The screen element is located at the offset location in the second dictionary. The description of the display screen is combined with the second dictionary, and the display screen is recreated in the target language based on the combining. Additional features and advantages are realized through the techniques of the present invention. Other embodiments and aspects of the invention are described in detail herein and are considered a part of the claimed invention. For a better understanding of the invention with the advantages and the features, refer to the description and to the drawings.",
  "patent_number": "9953030",
  "abstract": "An aspect includes receiving a description of a display screen generated by a software program executed in a first mode to interact with a user in first language. The description is in a serialized format that includes screen capture parameters and an offset location in a first dictionary corresponding to a screen element in the display screen. The first dictionary includes screen elements utilized by the software program when executing in the first mode to generate the display screen. A target language is identified, and a second dictionary of screen elements utilized by a deserialization program in the target language is accessed. The screen element is located at the offset location in the second dictionary. The description of the display screen is combined with the second dictionary, and the display screen is recreated in the target language based on the combining.",
  "publication_number": "US20180060309A1-20180301",
  "_processing_info": {
    "original_size": 61971,
    "optimized_size": 3445,
    "reduction_percent": 94.44
  }
}