{
  "decision": "PENDING",
  "application_number": "15257467",
  "date_published": "20161222",
  "date_produced": "20161208",
  "title": "SYSTEMS AND METHODS TO FACILITATE TRANSACTIONS",
  "filing_date": "20160906",
  "inventor_list": [
    {
      "inventor_name_last": "Poon",
      "inventor_name_first": "Alex Dai-Shun",
      "inventor_city": "Los Altos Hills",
      "inventor_state": "CA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Leahy",
      "inventor_name_first": "Scott",
      "inventor_city": "San Jose",
      "inventor_state": "CA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Wilson",
      "inventor_name_first": "Michael K.",
      "inventor_city": "San Jose",
      "inventor_state": "CA",
      "inventor_country": "US"
    }
  ],
  "ipcr_labels": [
    "G06Q3006",
    "G06F1730",
    "G06Q3008"
  ],
  "main_ipcr_label": "G06Q3006",
  "summary": "<SOH> SUMMARY OF THE INVENTION <EOH>The present invention discloses methods and apparatuses for facilitating a programmatic access to a network-based commerce facility via a network. In one exemplary embodiment, the method includes receiving a request from a third party application via the network at the network based commerce facility. The request performs an action pertaining to electronic commerce and being one of a plurality of requests recognized by the network-based commerce facility. In responsive to the request, the method performs the action pertaining to the electronic commerce and communicates from a result of the action from the network-based commerce facility to the third party application in a programmatically accessible format.",
  "patent_number": "None",
  "abstract": "Systems and methods to facilitate programmatic access to a network-based commerce facility via a network are described. A request is received from a third-party application via a programmatic access application, the request identifying a call function that performs, at least in part, an indirect transaction between a network-based commerce facility and a user via a third-party application. Each call function specifies an allowable amount of information to be transferred from the network-based commerce facility. An action corresponding to the call function is performed in response to the request.",
  "publication_number": "US20160371758A1-20161222",
  "_processing_info": {
    "original_size": 80454,
    "optimized_size": 2217,
    "reduction_percent": 97.24
  }
}