{
  "decision": "PENDING",
  "application_number": "15256919",
  "date_published": "20161222",
  "date_produced": "20161208",
  "title": "Affiliate-Driven Benefits Matching System and Methods",
  "filing_date": "20160906",
  "inventor_list": [
    {
      "inventor_name_last": "Baker, III",
      "inventor_name_first": "Bernard R.",
      "inventor_city": "West Palm Beach",
      "inventor_state": "FL",
      "inventor_country": "US"
    }
  ],
  "ipcr_labels": [
    "G06Q3002",
    "G06Q5000"
  ],
  "main_ipcr_label": "G06Q3002",
  "summary": "<SOH> SUMMARY <EOH>The increased use of “social media” and other electronic means of communication among consumers will make it possible for consumers to pool information about benefits in one place, thereby reducing or eliminating the above drawbacks. As discussed herein, the present inventive embodiments overcome the above drawbacks to thereby increase the usefulness and efficiency of benefit programs. An embodiment is a computer-implemented method for matching a consumer to a benefit. The method may include receiving, from an affiliate of one of multiple enabling organizations, benefit information pertaining to at least one benefit the affiliate knows is offered by that enabling organization. An affiliate is an entity that has an affiliation with an enabling organization that renders the entity capable of receiving a benefit from the enabling organization. For example, an affiliate may be a member of an enabling organization, although affiliation is broader than membership (an affiliate need not be a member). The method may also include providing a software application to a consumer. Enabling organization information and consumer identification information may be received from the consumer via the software application. The enabling organization pertains to an enabling organization to which the consumer is affiliated. The consumer identification information identifies the consumer. In a memory of a computer system, the enabling organization information and benefit information may be stored. A search query including consumer interest data from the consumer may be received at a search engine. One or more query results may be generated with the search engine responsive to said search query. The enabling organization information, benefit information, and information related to the search query may be analyzed automatically in the computer system to determine whether any enabling organization to which the consumer is affiliated is offering a benefit for that consumer t...",
  "patent_number": "None",
  "abstract": "Methods and systems for matching a consumer to benefits offered by enabling organizations provide flexibility and utility to consumers in the marketplace for various products. Information about benefits and enabling organizations are provided and stored in a memory of a computer system. A search query including consumer interest data of a consumer, or results of such a search query, are received. The enabling organization information, benefit information, and search query or information related to the search query results are analyzed automatically in the computer system to provide analysis results, to determine whether any enabling organization to which the consumer is affiliated is offering a benefit for the consumer that is applicable to the said consumer interest data. A message is sent to the consumer including the analysis results based on the query or query results, to inform the consumer of an available benefit applicable to the consumer interest data.",
  "publication_number": "US20160371727A1-20161222",
  "_processing_info": {
    "original_size": 82674,
    "optimized_size": 3554,
    "reduction_percent": 95.7
  }
}