{
  "decision": "PENDING",
  "application_number": "15254070",
  "date_published": "20180301",
  "date_produced": "20180213",
  "title": "HYPERVISOR NETWORK PROFILES TO FACILITATE VPN TUNNEL",
  "filing_date": "20160901",
  "inventor_list": [
    {
      "inventor_name_last": "Hardy",
      "inventor_name_first": "Adam Michael",
      "inventor_city": "Alpharetta",
      "inventor_state": "GA",
      "inventor_country": "US"
    }
  ],
  "ipcr_labels": [
    "H04L2906",
    "H04L1246",
    "G06F9455"
  ],
  "main_ipcr_label": "H04L2906",
  "summary": "<SOH> BRIEF DESCRIPTION OF THE DRAWINGS <EOH>Many aspects of the present disclosure can be better understood with reference to the following drawings. The components in the drawings are not necessarily to scale, with emphasis instead being placed upon clearly illustrating the principles of the disclosure. Moreover, in the drawings, like reference numerals designate corresponding parts throughout the several views. FIG. 1 is a drawing of an example of a networked environment. FIG. 2 shows a sequence diagram illustrating an example of component interaction. FIG. 3 shows a sequence diagram illustrating an example of component interaction. FIG. 4 shows a flowchart illustrating an example of functionality implemented by a hypervisor management component. FIG. 5 shows a flowchart illustrating an example of functionality implemented by hypervisor executed on a host device. detailed-description description=\"Detailed Description\" end=\"lead\"?",
  "patent_number": "None",
  "abstract": "A system can include a host device that execute a virtual machine execution environment. A hypervisor network profile can be associated with the hypervisor of the virtual machine execution environment. The hypervisor network profile can include virtual private network (VPN) configuration profiles that can instruct the hypervisor to route network traffic from a virtual machine to a VPN tunnel server according to the VPN configuration parameters.",
  "publication_number": "US20180063088A1-20180301",
  "_processing_info": {
    "original_size": 75411,
    "optimized_size": 1968,
    "reduction_percent": 97.39
  }
}