{
  "decision": "PENDING",
  "application_number": "15253218",
  "date_published": "20170803",
  "date_produced": "20170719",
  "title": "MOBILE TERMINAL AND OPERATING METHOD THEREOF",
  "filing_date": "20160831",
  "inventor_list": [
    {
      "inventor_name_last": "OH",
      "inventor_name_first": "Hyojung",
      "inventor_city": "Seoul",
      "inventor_state": "",
      "inventor_country": "KR"
    },
    {
      "inventor_name_last": "LEE",
      "inventor_name_first": "Seunghun",
      "inventor_city": "Seoul",
      "inventor_state": "",
      "inventor_country": "KR"
    }
  ],
  "ipcr_labels": [
    "G06F314",
    "H04N2141",
    "G06F30484"
  ],
  "main_ipcr_label": "G06F314",
  "summary": "<SOH> SUMMARY <EOH>Embodiments provide a mobile terminal for controlling a screen mirroring function based on the type of a screen displayed on a display unit of the mobile terminal and an operating method thereto. Embodiments also provide a mobile terminal for allowing a user's view by screen-mirroring only information that the user wants and an operating method thereof. In one embodiment, a mobile terminal includes: a display unit configured to display information; a short-range communication module configured to transmit information on a screen of the display unit to a display device in order to perform a screen mirroring function; and a control unit configured to control the display unit and the short-range communication module, wherein the control unit controls the screen mirroring function based on a type of a screen that the mobile terminal displays. If a mirroring mode of the mobile terminal is set to a private mirroring mode and a screen displayed on the display unit is a media content playback screen that plays a media content, the control unit may transmit the media content to the display device. If the media content playback screen is not displayed on the display unit, the control unit may not transmit the media content to the display device. If a home screen of the mobile terminal or an execution screen of an application that does not play the media content is displayed on the display unit, the control unit may not transmit the information on the screen to the display device. The media content playback screen may be a screen that plays the media content on an entire screen of the display unit. If a mirroring mode of the mobile terminal is set to a full mirroring mode, the control unit may transmit the information on the screen to the display device regardless of a type of the screen. The control unit may transmit the media content to the display device based on a type of a media content displayed on a screen of the display unit. Based on an application ...",
  "patent_number": "None",
  "abstract": "A mobile terminal includes: a display unit configured to display information; a short-range communication module configured to transmit information on a screen of the display unit to a display device in order to perform a screen mirroring function; and a control unit configured to control the display unit and the short-range communication module, wherein the control unit controls the screen mirroring function based on a type of a screen that the mobile terminal displays.",
  "publication_number": "US20170220311A1-20170803",
  "_processing_info": {
    "original_size": 104938,
    "optimized_size": 3164,
    "reduction_percent": 96.98
  }
}