{
  "decision": "PENDING",
  "application_number": "15257826",
  "date_published": "20161222",
  "date_produced": "20161208",
  "title": "DISPLAY REGION ALLOCATION USING CATEGORY-BASED CONTEXTUAL TECHNIQUES",
  "filing_date": "20160906",
  "inventor_list": [
    {
      "inventor_name_last": "van Dijk",
      "inventor_name_first": "Bob",
      "inventor_city": "Amsterdam",
      "inventor_state": "",
      "inventor_country": "NL"
    },
    {
      "inventor_name_last": "Haak",
      "inventor_name_first": "Wouter",
      "inventor_city": "Amsterdam",
      "inventor_state": "",
      "inventor_country": "NL"
    },
    {
      "inventor_name_last": "Lettinga",
      "inventor_name_first": "Roelof",
      "inventor_city": "Amsterdam",
      "inventor_state": "",
      "inventor_country": "NL"
    }
  ],
  "ipcr_labels": [
    "G06Q3002"
  ],
  "main_ipcr_label": "G06Q3002",
  "summary": "<SOH> BRIEF DESCRIPTION OF THE DRAWINGS <EOH>Embodiments illustrated by way of example and not limitation in the figures of the accompanying drawings, in which: FIG. 1 illustrates an example embodiment in which an example of a host site web page is shown. FIG. 2 illustrates an example embodiment in which a visitor/user is viewing the example host site web page, which includes a first display region and a second display region. FIG. 3 illustrates an example of part of the view item page, with which the visitor/user can be offered one of several options to purchase/lease/bid on or otherwise initiate a transaction associated with a selected item. FIG. 4 illustrates an example of multiple host site web pages. FIG. 5 illustrates an example of a gallery view (i.e. a picture view) of a categorized list of product ads in an example embodiment. FIG. 6 illustrates an example embodiment showing a rotation of fixed price ads among the positions allocated to fixed price ads in the first display region in multiple pages. FIG. 7 illustrates an initial user interface screen in the creation of a fixed price ad in an example embodiment. FIG. 8 illustrates an example user interface screen displayed in the creation of a fixed price ad in an example embodiment. FIG. 9 illustrates three user interface screens in the creation of a variable revenue ad in an example embodiment. FIGS. 10 and 11 illustrate detailed results reports in a particular embodiment that enable a merchant/advertiser to view a set of metrics related to each advertisement (variable revenue or fixed price) the advertiser has created in the system of a particular embodiment. FIG. 12 is a processing flow diagram that illustrates the processing flow in an example embodiment. FIG. 13 is a block diagram of a network system on which an embodiment may operate. FIGS. 14 and 15 are block diagrams of a computer system on which an embodiment may operate. FIG. 16 illustrates an example embodiment in which an example of a host site w...",
  "patent_number": "None",
  "abstract": "A computer-implemented system and method for category-based contextual advertisement generation and management are disclosed. The system in an example embodiment includes an advertisement processor to allocate a first display region for displaying a combination of variable revenue ads and fixed price ads, the variable revenue ads and the fixed price ads being category-based, sort the variable revenue ads based in part on a user entered variable revenue value, and sort the fixed price ads based on a rotation.",
  "publication_number": "US20160371743A1-20161222",
  "_processing_info": {
    "original_size": 57285,
    "optimized_size": 3359,
    "reduction_percent": 94.14
  }
}