{
  "decision": "PENDING",
  "application_number": "15250463",
  "date_published": "20180301",
  "date_produced": "20180213",
  "title": "CODE LOADING HARDENING BY HYPERVISOR PAGE TABLE SWITCHING",
  "filing_date": "20160829",
  "inventor_list": [
    {
      "inventor_name_last": "Tsirkin",
      "inventor_name_first": "Michael",
      "inventor_city": "Ra'anana",
      "inventor_state": "",
      "inventor_country": "IL"
    }
  ],
  "ipcr_labels": [
    "G06F1214",
    "G06F121009",
    "H04L932",
    "G06F9445",
    "G06F9455"
  ],
  "main_ipcr_label": "G06F1214",
  "summary": "<SOH> BRIEF SUMMARY <EOH>Methods, systems, and techniques for modifying one or more guest memory permissions stored in a hypervisor page table are provided. An example method of modifying one or more guest memory permissions stored in a hypervisor page table includes receiving, by a hypervisor, a request to modify a memory permission of a guest running on a virtual machine. The virtual machine and hypervisor run on a host machine. The guest includes a kernel that includes loading code and kernel code. The method also includes determining, by the hypervisor, whether the request was sent from the loading code. The loading code corresponds to a first set of hypervisor page tables and is stored at a first range of memory addresses. The kernel code corresponds to a second set of hypervisor page tables. The first range of memory addresses is in an executable mode in the first set of hypervisor page tables. The method further includes in response to a determination that the request was sent from the loading code, modifying, by the hypervisor, the guest's memory permission in the second set of hypervisor page tables in accordance with the request. An example system for modifying one or more guest memory permissions stored in a hypervisor page table includes a guest memory storing loading code and kernel code. The loading code is stored at a first range of memory addresses in the guest memory. The system includes a hypervisor memory storing first and second sets of hypervisor page tables. The loading code corresponds to the first set of hypervisor page tables. The kernel code corresponds to the second set of hypervisor page tables. The first range of memory addresses is in an executable mode in the first set of hypervisor page tables. The system also includes a guest that runs on a virtual machine and sends a request to modify a memory permission of the guest. The guest includes a kernel that includes the loading code and kernel code. The system further includes a hypervisor...",
  "patent_number": "None",
  "abstract": "Systems and methods are provided for modifying one or more guest memory permissions. An example method includes receiving a request to modify a memory permission of a guest running on a virtual machine. The guest includes a kernel that includes loading code and kernel code. The method also includes determining whether the request was sent from the loading code. The loading code corresponds to a first set of hypervisor page tables and is stored at a first range of memory addresses, and the kernel code corresponds to a second set of hypervisor page tables. The first range of memory addresses is in an executable mode in the first set of hypervisor page tables. The method further includes in response to a determination that the request was sent from the loading code, modifying the guest's memory permission in the second set of hypervisor page tables in accordance with the request.",
  "publication_number": "US20180060249A1-20180301",
  "_processing_info": {
    "original_size": 80336,
    "optimized_size": 3485,
    "reduction_percent": 95.66
  }
}