{
  "decision": "PENDING",
  "application_number": "15253473",
  "date_published": "20180301",
  "date_produced": "20180213",
  "title": "SYSTEMS AND METHODS FOR SYNCHRONIZING DELIVERY OF RELATED PARCELS VIA A COMPUTERIZED LOCKER BANK",
  "filing_date": "20160831",
  "inventor_list": [
    {
      "inventor_name_last": "Robinson",
      "inventor_name_first": "Kalin",
      "inventor_city": "John's Creek",
      "inventor_state": "GA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Gillen",
      "inventor_name_first": "Robert J.",
      "inventor_city": "Alpharetta",
      "inventor_state": "GA",
      "inventor_country": "US"
    }
  ],
  "ipcr_labels": [
    "G06Q1008",
    "G06Q1010",
    "G06Q4002",
    "G07C900",
    "G01C2134"
  ],
  "main_ipcr_label": "G06Q1008",
  "summary": "<SOH> SUMMARY OF THE VARIOUS EMBODIMENTS <EOH>A direct-to-locker bank delivery system, in various embodiments, comprises a computerized locker bank and one or more remote logistics servers comprising one or more processors and memory. In particular embodiments, the computerized locker bank comprises a plurality of selectively securable locker compartments, each of the plurality of selectively securable locker compartments comprising one or more doors and one or more locking mechanisms; and one or more locker bank computers comprising one or more processors and memory. In some embodiments, the memory stores: (1) first package level detail information for a first parcel, the first package level detail information comprising data associated with a first consignee; and (2) one or more pieces of package level detail information for one or more parcels currently stored at the computerized locker bank, wherein the one or more pieces of package level detail information comprise, for each respective parcel of the plurality of parcels, consignee information for the respective parcel. In particular embodiments, the one or more processors are configured to: (1) receive an indication that the first parcel is scheduled for delivery at a primary delivery location; (2) determine whether the one or more parcels currently stored at the computerized locker bank comprise one or more second parcels associated with the first parcel based on the one or more pieces of package level detail information for the one or more parcels currently stored at the computerized locker bank and the first package level detail information; (3) in response to determining that the one or more parcels currently stored at the computerized locker bank comprise the one or more second parcels, route the first parcel to the computerized locker bank without attempting delivery of the first parcel at the primary delivery location; (4) receive a request to deliver the first parcel to the computerized locker bank; and...",
  "patent_number": "None",
  "abstract": "A synchronized delivery system for delivering parcels directly to an alternate delivery location such as a locker bank in lieu of making any delivery attempt at a primary delivery location such as a home or office. The system may deliver parcels directly to the alternate delivery location when a related parcel is currently stored at the alternate delivery location awaiting pickup. A related parcel may include a parcel addressed to the same consignee, to a related consignee (e.g., such as a neighbor, roommate, or spouse), or to another authorized to pick up parcels on behalf of the consignee. When delivering parcels to alternate deliver locations, the system may facilitate a grouping of related parcels in a single locker.",
  "publication_number": "US20180060812A1-20180301",
  "_processing_info": {
    "original_size": 123568,
    "optimized_size": 3519,
    "reduction_percent": 97.15
  }
}