{
  "decision": "PENDING",
  "application_number": "15259479",
  "date_published": "20180308",
  "date_produced": "20180222",
  "title": "EMBEDDED ORIENTATION MARKERS FOR IMAGING SENSORS",
  "filing_date": "20160908",
  "inventor_list": [
    {
      "inventor_name_last": "Lund",
      "inventor_name_first": "Joshua",
      "inventor_city": "Dallas",
      "inventor_state": "TX",
      "inventor_country": "US"
    }
  ],
  "ipcr_labels": [
    "H01L27146",
    "H04N5369",
    "G06T100",
    "H04N132"
  ],
  "main_ipcr_label": "H01L27146",
  "summary": "<SOH> SUMMARY OF THE INVENTION <EOH>An imaging sensor includes an imaging array with a plurality of pixels. A sub-set of the pixels are marker pixels configured to each provide a constant respective output value to embed an orientation and alignment marker in images produced with the imaging array. The constant respective output level is either lower than the lowest level output from an active pixel or higher than the highest level output from an active pixel The sub-set of pixels can be arranged in a pre-determined pattern. The predetermined pattern can be asymmetrical about at least one axis across the imaging array. The predetermined pattern can be asymmetrical about each of two orthogonal axes across the imaging array. The predetermined pattern can be rotationally asymmetrical. The predetermined pattern can include marker pixels spanning four corners of the imaging array. The predetermined pattern can include marker pixels proximate four edges of the imaging array between corners of the imaging array. The predetermined pattern can include marker pixels in a central region of the imaging sensor spaced apart from corners and edges of the imaging sensor. The marker pixels can be sparsely distributed across the imaging array. The marker pixels can be spaced apart from one another so no two marker pixels are adjacent to one another in the imaging array. Each of the marker pixels can be spaced apart by several pixel pitches from any other marker pixels. The marker pixels can include a plurality of black marker pixels that are set to output a 0% signal. The marker pixels can include a plurality of dark pixels that are set to output a 0%-50% signal, inclusive. The marker pixels can include a plurality of white pixels that are set to output a 100% signal. The marker pixels can include a plurality of light pixels that are set to output a 50%-100% signal, inclusive. It is also contemplated that the marker pixels can output a value that is below the 0% signal level or above...",
  "patent_number": "None",
  "abstract": "An imaging sensor includes an imaging array with a plurality of pixels. A sub-set of the pixels are marker pixels configured to each provide a constant respective output value to embed an orientation and alignment marker in images produced with the imaging array. The marker pixels can be sparsely distributed across the imaging array.",
  "publication_number": "US20180069042A1-20180308",
  "_processing_info": {
    "original_size": 23339,
    "optimized_size": 2905,
    "reduction_percent": 87.55
  }
}