{
  "date_produced": "20180222",
  "publication_number": "US20180068217A1-20180308",
  "main_ipcr_label": "G06N3063",
  "decision": "PENDING",
  "application_number": "15258328",
  "inventor_list": [
    {
      "inventor_name_last": "Eleftheriou",
      "inventor_name_first": "Evangelos S.",
      "inventor_city": "Rueschlikon",
      "inventor_state": "",
      "inventor_country": "CH"
    },
    {
      "inventor_name_last": "Kull",
      "inventor_name_first": "Lukas",
      "inventor_city": "Zurich",
      "inventor_state": "",
      "inventor_country": "CH"
    },
    {
      "inventor_name_last": "Le Gallo-Bourdeau",
      "inventor_name_first": "Manuel",
      "inventor_city": "Zurich",
      "inventor_state": "",
      "inventor_country": "CH"
    },
    {
      "inventor_name_last": "Pantazi",
      "inventor_name_first": "Angeliki",
      "inventor_city": "Thalwil",
      "inventor_state": "",
      "inventor_country": "CH"
    },
    {
      "inventor_name_last": "Sebastian",
      "inventor_name_first": "Abu",
      "inventor_city": "Adliswil",
      "inventor_state": "",
      "inventor_country": "CH"
    },
    {
      "inventor_name_last": "Tuma",
      "inventor_name_first": "Tomas",
      "inventor_city": "Adliswil",
      "inventor_state": "",
      "inventor_country": "CH"
    }
  ],
  "abstract": "Artificial neuron apparatus includes first and second resistive memory cells. The first resistive memory cell is connected in first circuitry having a first input and output. The second resistive memory cell is connected in second circuitry having a second input and output. The first and second circuitry are operable in alternating read and write phases to apply a programming current to their respective memory cells on receipt of excitatory and inhibitory neuron input signals, respectively. During the write phase, resistance of the respective cells is changed in response to successive excitatory and inhibitory neuron input signals. During the read phase, a read current is applied to their respective cells to produce first and second measurement signals, respectively. An output circuit connected to the first and second outputs produces a neuron output signal at a neuron output when a difference between the first and second measurement signals traverses a threshold.",
  "filing_date": "20160907",
  "patent_number": "None",
  "summary": "<SOH> SUMMARY <EOH>According to at least one embodiment of the present invention there is provided artificial neuron apparatus comprising first and second resistive memory cells. The first resistive memory cell is connected in first circuitry having a first neuron input, for receiving excitatory neuron input signals, and a first output. The second resistive memory cell is connected in second circuitry having a second neuron input, for receiving inhibitory neuron input signals, and a second output. The first and second circuitry are operable in alternating read and write phases to apply a programming current, for programming cell resistance, to their respective memory cells on receipt of an excitatory and an inhibitory neuron input signal respectively during said write phase, whereby resistance of the respective cells is progressively changed in response to successive excitatory and inhibitory neuron input signals respectively, and, during said read phase, to apply a read current to their respective cells to produce first and second measurement signals respectively, dependent on resistance of the respective cells, at the first and second outputs respectively. The apparatus includes an output circuit connected to the first and second outputs and operable to produce a neuron output signal at a neuron output if a difference between the first and second measurement signals traverses a threshold. Embodiments of the invention offer efficient neuron realizations which can accommodate both excitatory and inhibitory neuron input signals. The neuron membrane potential is effectively represented by the difference between the first and second measurement signals. These signals depend in turn on resistance of the first and second memory cells, one of which changes with excitatory inputs and the other with inhibitory inputs. Hence, the membrane potential can both increase and decrease, and the neuron fires, generating a neuron output signal, if the difference between the measureme...",
  "date_published": "20180308",
  "title": "ARTIFICIAL NEURON APPARATUS",
  "ipcr_labels": [
    "G06N3063",
    "G06N308"
  ],
  "_processing_info": {
    "original_size": 64155,
    "optimized_size": 4241,
    "reduction_percent": 93.39
  }
}