{
  "date_produced": "20170223",
  "publication_number": "US20170068895A1-20170309",
  "main_ipcr_label": "G06N502",
  "decision": "PENDING",
  "application_number": "15256546",
  "inventor_list": [
    {
      "inventor_name_last": "Kil",
      "inventor_name_first": "David",
      "inventor_city": "Austin",
      "inventor_state": "TX",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Woo",
      "inventor_name_first": "Edwin",
      "inventor_city": "Austin",
      "inventor_state": "TX",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Gallaway",
      "inventor_name_first": "Clayton",
      "inventor_city": "Cedar Park",
      "inventor_state": "TX",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Rios",
      "inventor_name_first": "Jacob",
      "inventor_city": "Austin",
      "inventor_state": "TX",
      "inventor_country": "US"
    }
  ],
  "abstract": "A flexible persistence modeling system and method for building flexible persistence models for education institutions using a Markov model based on units of academic progress of a non-traditional learning program of an education institution. The Markov model is used to quantify transitions of students between the states as parameters of state transitions so that features from the Markov model with the parameters of state transitions can be extracted that are related to the non-traditional learning program of the education institution using defined flexible persistence. The extracted features can then be used to build at least one flexible persistence model for different segments of the students.",
  "filing_date": "20160903",
  "patent_number": "None",
  "summary": "<SOH> SUMMARY OF THE INVENTION <EOH>A flexible persistence modeling system and method for building flexible persistence models for education institutions using a Markov model based on units of academic progress of a non-traditional learning program of an education institution. The Markov model is used to quantify transitions of students between the states as parameters of state transitions so that features from the Markov model with the parameters of state transitions can be extracted that are related to the non-traditional learning program of the education institution using defined flexible persistence. The extracted features can then be used to build at least one flexible persistence model for different segments of the students. A method for building flexible persistence models for education institutions in accordance with an embodiment of the invention comprises translating units of academic progress of a non-traditional learning program of an education institution into states of a Markov model, instantiating the Markov model to quantify transitions of students between the states as parameters of state transitions, defining flexible persistence in terms of state-transitional characteristics of the students using the Markov model with the parameters of state transitions, wherein the flexible persistence indicates student enrollment from one collection of academic progress units to another collection of academic progress units, extracting features from the Markov model with the parameters of state transitions that are related to the non-traditional learning program of the education institution using the defined flexible persistence, and building at least one flexible persistence model using the extracted features for different segments of the students. In some embodiments, the steps of this method are performed when program instructions contained in a computer-readable storage medium are executed by one or more processors. A flexible persistence modeling system in ...",
  "date_published": "20170309",
  "title": "FLEXIBLE, PERSONALIZED STUDENT SUCCESS MODELING FOR INSTITUTIONS WITH COMPLEX TERM STRUCTURES AND COMPETENCY-BASED EDUCATION",
  "ipcr_labels": [
    "G06N502",
    "G09B512"
  ],
  "_processing_info": {
    "original_size": 58516,
    "optimized_size": 3753,
    "reduction_percent": 93.59
  }
}