{
  "date_produced": "20170323",
  "publication_number": "US20170098160A1-20170406",
  "main_ipcr_label": "G06N502",
  "decision": "PENDING",
  "application_number": "15259930",
  "inventor_list": [
    {
      "inventor_name_last": "CHAUDHURI",
      "inventor_name_first": "Subhrojyoti Roy",
      "inventor_city": "Pune",
      "inventor_state": "",
      "inventor_country": "IN"
    },
    {
      "inventor_name_last": "NATARAJAN",
      "inventor_name_first": "Swaminathan",
      "inventor_city": "Pune",
      "inventor_state": "",
      "inventor_country": "IN"
    },
    {
      "inventor_name_last": "VIN",
      "inventor_name_first": "Harrick Mayank",
      "inventor_city": "Pune",
      "inventor_state": "",
      "inventor_country": "IN"
    },
    {
      "inventor_name_last": "KRISHNA",
      "inventor_name_first": "Goldsmith Murali",
      "inventor_city": "Pune",
      "inventor_state": "",
      "inventor_country": "IN"
    },
    {
      "inventor_name_last": "PATWARI",
      "inventor_name_first": "Puneet",
      "inventor_city": "Pune",
      "inventor_state": "",
      "inventor_country": "IN"
    },
    {
      "inventor_name_last": "KELKAR",
      "inventor_name_first": "Rahul Ramesh",
      "inventor_city": "Pune",
      "inventor_state": "",
      "inventor_country": "IN"
    },
    {
      "inventor_name_last": "PATHAK",
      "inventor_name_first": "Amrish Shashikant",
      "inventor_city": "Pune",
      "inventor_state": "",
      "inventor_country": "IN"
    },
    {
      "inventor_name_last": "INAMDAR",
      "inventor_name_first": "Adwalt",
      "inventor_city": "Pune",
      "inventor_state": "",
      "inventor_country": "IN"
    }
  ],
  "abstract": "A method and system is provided for building domain intelligent solution. The present application provides a method and system for building a domain intelligent solution, comprises of utilizing a language existing as a generic model for capturing intrinsic knowledge pertaining to a technical domain; creating a domain intelligent solution for said technical domain using said language or vocabulary; translating the domain intelligent solution into required wrappers for them to be integrated with a third party technology or tool; and integrating said created domain intelligent solution with the third party technology or tool for providing system engineering capabilities to make them domain intelligent.",
  "filing_date": "20160908",
  "patent_number": "None",
  "summary": "<SOH> SUMMARY <EOH>Before the present methods, systems, and hardware enablement are described, it is to be understood that this invention is not limited to the particular systems, and methodologies described, as there can be multiple possible embodiments of the present invention which are not expressly illustrated in the present disclosure. It is also to be understood that the terminology used in the description is for the purpose of describing the particular versions or embodiments only, and is not intended to limit the scope of the present invention which will be limited only by the appended claims. The present application provides a method and system for building domain intelligent solution. The present application provides a computer implemented method for building a domain intelligent solution comprising processor implemented steps of utilizing a language existing as a generic model for capturing intrinsic knowledge pertaining to a technical domain; creating a domain intelligent solution for said technical domain using said language or vocabulary; translating the domain intelligent solution into required wrappers for them to be integrated with a third party technology or tool; and integrating said created domain intelligent solution with the third party technology or tool for providing system engineering capabilities to make them domain intelligent. The present application provides a system for building a domain intelligent solution. The system ( 200 ) comprising a processor ( 202 ); a computer-usable medium embodying computer code, said computer-usable medium being coupled to said processor ( 202 ), said computer program code comprising instructions executable by said processor ( 202 ) and configured to operate a language utilization module ( 204 ); a domain intelligent solution creation module ( 206 ); a compiler and translation module ( 208 ); a domain intelligent solution integration module ( 210 ); and a repository ( 212 ).",
  "date_published": "20170406",
  "title": "METHOD AND SYSTEM FOR BUILDING DOMAIN INTELLIGENT SOLUTION",
  "ipcr_labels": [
    "G06N502"
  ],
  "_processing_info": {
    "original_size": 61528,
    "optimized_size": 4247,
    "reduction_percent": 93.1
  }
}