{
  "decision": "PENDING",
  "application_number": "15254089",
  "date_published": "20170316",
  "date_produced": "20170301",
  "title": "IMAGE CAPTURE APPARATUS AND METHOD OF CONTROLLING THE SAME",
  "filing_date": "20160901",
  "inventor_list": [
    {
      "inventor_name_last": "Sato",
      "inventor_name_first": "Akihiko",
      "inventor_city": "Yamato-shi",
      "inventor_state": "",
      "inventor_country": "JP"
    },
    {
      "inventor_name_last": "Sato",
      "inventor_name_first": "Yoshinobu",
      "inventor_city": "Yokohama-shi",
      "inventor_state": "",
      "inventor_country": "JP"
    }
  ],
  "ipcr_labels": [
    "H04N5232",
    "G06K900",
    "H04N5265"
  ],
  "main_ipcr_label": "H04N5232",
  "summary": "<SOH> SUMMARY OF THE INVENTION <EOH>The present invention was made in consideration of such problems in the conventional technology, and provides a shooting assist function appropriate for circumstances, in an image capture apparatus capable of obtaining light-field data and a method of controlling the image capture apparatus. According to an aspect of the present invention, there is provided an image capture apparatus, comprising: an image capture unit configured to obtain light-field data; and a control unit configured to successively display a moving image obtained by the image capture unit in a display apparatus; wherein the control unit displays an assistance display indicating information related to light-field data to be obtained with present shooting parameters together with the moving image in the display apparatus, and the control unit controls the assistance display such that during moving image recording is being performed, visibility of the moving image is not degraded by the assistance display in comparison to a case where moving image recording is not being performed. According to another aspect of the present invention, there is provided a method of controlling an image capture apparatus, comprising: during successively displaying a moving image in a display apparatus, the moving image being obtained by an image capture unit configured to obtain light-field data, displaying an assistance display indicating information related to light-field data to be obtained with present shooting parameters together with the moving image in the display apparatus; and controlling the assistance display such that during moving image recording is being performed, visibility of the moving image is not degraded by the assistance display in comparison to a case where moving image recording is not being performed. Further features of the present invention will become apparent from the following description of exemplary embodiments with reference to the attached drawings.",
  "patent_number": "None",
  "abstract": "A moving image, obtained by an image capture unit for obtaining light-field data, is successively displayed. When displaying an assistance display indicating information related to light-field data to be obtained with present shooting parameters together with the moving image, the assistance display is controlled such that during moving image recording is being performed, visibility of the moving image is not degraded by the assistance display in comparison to a case where moving image recording is not being performed.",
  "publication_number": "US20170078578A1-20170316",
  "_processing_info": {
    "original_size": 60353,
    "optimized_size": 3239,
    "reduction_percent": 94.63
  }
}