{
  "decision": "ACCEPTED",
  "application_number": "15256276",
  "date_published": "20161222",
  "date_produced": "20161208",
  "title": "Contact Mechanic Tests using Stylus Alignment to Probe Material Properties",
  "filing_date": "20160902",
  "inventor_list": [
    {
      "inventor_name_last": "Bellemare",
      "inventor_name_first": "Simon C.",
      "inventor_city": "Weston",
      "inventor_state": "MA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Palkovic",
      "inventor_name_first": "Steven D.",
      "inventor_city": "Somerville",
      "inventor_state": "MA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Soucy",
      "inventor_name_first": "Phillip A.",
      "inventor_city": "Chelmsford",
      "inventor_state": "MA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Tarkanian",
      "inventor_name_first": "Michael J.",
      "inventor_city": "West Roxbury",
      "inventor_state": "MA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Willey",
      "inventor_name_first": "Brendon M.",
      "inventor_city": "Dedham",
      "inventor_state": "MA",
      "inventor_country": "US"
    }
  ],
  "ipcr_labels": [
    "G01N346",
    "G06F1750"
  ],
  "main_ipcr_label": "G01N346",
  "summary": "<SOH> SUMMARY OF THE EMBODIMENTS <EOH>In one embodiment of the invention, an apparatus for performing a contact mechanics test on a substrate, the apparatus comprising (i) a stylus having a principal axis and shaped to deform the substrate at a stylus contact location, (ii) a core, in which the stylus is hosted, configured to engage the stylus against the substrate, (iii) a stylus engagement mechanism, coupled to the core or the stylus, configured to induce a contact load or a penetration depth to the stylus, (iv) a core engagement mechanism, coupled to the core, configured to maintain contact of the core and to move the core along the substrate surface, (v) a frame, in which the core engagement mechanism is hosted, configured to be fixed with respect to the apparatus or to be moved together with the core engagement mechanism as an assembly, (vi) a frame engagement mechanism configured to engage the frame with the substrate surface, and (vii) a substrate monitoring device configured to measure characteristics of substrate contact response, collect material machined from the substrate, or both. In this embodiment, the core, the core engagement mechanism or the frame engagement mechanism includes an alignment mechanism configured to provide a desired local angular orientation of the principal axis of the stylus relative to the substrate surface at the stylus contact location. In another embodiment of the invention, a method for performing a contact mechanics test on a substrate surface using one or more styluses, each stylus having a principal axis and shaped to deform the substrate surface, the method comprising (i) maintaining the principal axis of the stylus at a desired local angular orientation with respect to the substrate surface, (ii) causing the stylus to engage and deform the substrate surface, (iii) re-aligning the stylus as or after the stylus engages the substrate surface, and (iv) measuring a substrate contact response. In another embodiment of the inven...",
  "patent_number": "9933346",
  "abstract": "An apparatus for performing a contact mechanics test on a substrate includes a stylus, a core configured to engage the stylus against the substrate, a stylus engagement mechanism configured to induce a contact load or a penetration depth to the stylus, a core engagement mechanism configured to maintain contact of the core and to move the core along the substrate surface, a frame configured to be fixed with respect to the apparatus or to be moved together with the core engagement mechanism as an assembly, a frame engagement mechanism configured to engage the frame with the substrate surface; and a substrate monitoring device configured to measure characteristics of substrate contact response and/or collect material machined from the substrate. Methods of performing a contact mechanics test are also provided.",
  "publication_number": "US20160370272A1-20161222",
  "_processing_info": {
    "original_size": 174379,
    "optimized_size": 4008,
    "reduction_percent": 97.7
  }
}