{
  "date_produced": "20180222",
  "publication_number": "US20180068223A1-20180308",
  "main_ipcr_label": "G06N502",
  "decision": "PENDING",
  "application_number": "15259223",
  "inventor_list": [
    {
      "inventor_name_last": "Balan",
      "inventor_name_first": "Bimal Mankara",
      "inventor_city": "Piscataway",
      "inventor_state": "NJ",
      "inventor_country": "US"
    }
  ],
  "abstract": "Systems and methods that enable an end user to resolve an image related query by performing an image based search. It provides an easier method to resolve the image based queries by carrying out searches in a knowledgebase using an ITSM tool. It further provides a method in which the knowledgebase relates and compares an image/screen-shot of a query uploaded on the knowledgebase, with the existing knowledgebase-record(s) and conducts searches to find the matching knowledgebase records/details in terms of relevance. It further illustrates ways to build a knowledgebase by creating and adding to the knowledgebase-records. The end users thus get an accurate solution set with regard to the query faced.",
  "filing_date": "20160908",
  "patent_number": "None",
  "summary": "<SOH> SUMMARY OF THE INVENTION <EOH>It is therefore, an object of the present invention to provide a method, which enables an End User to resolve a query by performing image based searches. It is a further object of the present invention to provide an image-based information retrieval tool (ITSM tool) to enable an easy and effective method to store and search the related information with the help of an image-search feature, in a knowledgebase of image-based information. It is a further object of the present invention to provide a method to update a knowledgebase with subsequent creation of knowledgebase records related to a particular subject. The composition of the present invention, the methods and the embodiments therein are described herein below which are illustrative only and should not be construed to limit the scope of the present invention in any manner. Unless stated to the contrary, any use of the words such as “including,” “containing,” “comprising,” “having” and the like, means “including without limitation” and should not be construed to limit any general statement that it follows to the specific or similar items or matters immediately following it. Embodiments of the invention are not mutually exclusive, but may be implemented in various combinations. According to the present invention herein below: “Knowledgebase” as used herein is a predefined repository/centralized database of information related to a particular subject. The knowledgebase is a relational database built on a particular subject by creating, collating and categorizing knowledgebase records related to and based on various problems relevant to the particular subject. These repositories are then open for use by the service organizations and the End user(s). End users can access this knowledgebase using various tools for instance, an ITSM tool. “ITSM tool” (Information Technology Service Management tool) as used herein is interchangeable with HTML based user interface tool, used by the or...",
  "date_published": "20180308",
  "title": "COGNITIVE KNOWLEDGEBASE FOR PROVIDING IMAGE-MATCHING SEARCHES",
  "ipcr_labels": [
    "G06N502",
    "G06F1730"
  ],
  "_processing_info": {
    "original_size": 35184,
    "optimized_size": 3345,
    "reduction_percent": 90.49
  }
}