{
  "decision": "PENDING",
  "application_number": "15258842",
  "date_published": "20180308",
  "date_produced": "20180222",
  "title": "MIXED-PRECISION MEMCOMPUTING SYSTEM",
  "filing_date": "20160907",
  "inventor_list": [
    {
      "inventor_name_last": "Bekas",
      "inventor_name_first": "Konstantinos",
      "inventor_city": "Horgen",
      "inventor_state": "",
      "inventor_country": "CH"
    },
    {
      "inventor_name_last": "Curioni",
      "inventor_name_first": "Alessandro",
      "inventor_city": "Gattikon",
      "inventor_state": "",
      "inventor_country": "CH"
    },
    {
      "inventor_name_last": "Eleftheriou",
      "inventor_name_first": "Evangelos S.",
      "inventor_city": "Rueschlikon",
      "inventor_state": "",
      "inventor_country": "CH"
    },
    {
      "inventor_name_last": "Le Gallo-Bourdeau",
      "inventor_name_first": "Manuel",
      "inventor_city": "Zurich",
      "inventor_state": "",
      "inventor_country": "CH"
    },
    {
      "inventor_name_last": "Sebastian",
      "inventor_name_first": "Abu",
      "inventor_city": "Adliswil",
      "inventor_state": "",
      "inventor_country": "CH"
    },
    {
      "inventor_name_last": "Tuma",
      "inventor_name_first": "Tomas",
      "inventor_city": "Adliswil",
      "inventor_state": "",
      "inventor_country": "CH"
    }
  ],
  "ipcr_labels": [
    "G06F7483",
    "G06F1716"
  ],
  "main_ipcr_label": "G06F7483",
  "summary": "<SOH> SUMMARY <EOH>Embodiments of the present invention may provide the capability to perform computations using memcomputing that may provide improved precision over conventional memcomputing techniques. For example, in an embodiment, a processing apparatus may be capable of executing mixed-precision calculations using different execution units. The various execution units may each be capable of executing calculations at different precision levels. A low-precision memcomputing hardware component may be used in conjunction with highly a precise computing hardware component. Power savings and speed improvements may be achieved by a combination of different precision levels for floating point arithmetic. In an embodiment of the present invention a computing system may comprise computational memory configured to perform computations at a prescribed precision and digital combinational circuitry coupled with the computational memory and configured to increase the precision of the computations performed by the computational memory. The computational memory and the digital combinational circuitry may be configured to iteratively perform a computation to a predefined precision. The computational memory may comprise circuitry adapted to perform analog computation using values stored in the computational memory and the digital combinational circuitry may comprise at least one of a central processing unit, a graphics processing unit, and application specific circuitry. The computational memory and the digital combinational circuitry may, in one or more embodiments, be implemented as discrete interconnected components. The computational memory and the digital combinational circuitry may, in one or more other embodiments, be integrated into a single chip. The computational memory may comprise an array of resistive memory elements having resistance or conductance values stored therein, the respective resistance or conductance values being programmable. The computational memory ma...",
  "patent_number": "None",
  "abstract": "A computing system includes computational memory and digital combinational circuitry operatively coupled with the computational memory. The computational memory is configured to perform computations at a prescribed precision. The digital combinational circuitry is configured to increase the precision of the computations performed by the computational memory. The computational memory and the digital combinational circuitry may be configured to iteratively perform a computation to a predefined precision. The computational memory may include circuitry configured to perform analog computation using values stored in the computational memory, and the digital combinational circuitry may include a central processing unit, a graphics processing unit and/or application specific circuitry. The computational memory may include an array of resistive memory elements having resistance or conductance values stored therein, the respective resistance or conductance values being programmable.",
  "publication_number": "US20180067720A1-20180308",
  "_processing_info": {
    "original_size": 57702,
    "optimized_size": 4271,
    "reduction_percent": 92.6
  }
}