{
  "date_produced": "20170316",
  "publication_number": "US20170091625A1-20170330",
  "main_ipcr_label": "G06N502",
  "decision": "PENDING",
  "application_number": "15255143",
  "inventor_list": [
    {
      "inventor_name_last": "Hettenkofer",
      "inventor_name_first": "Manfred",
      "inventor_city": "San Francisco",
      "inventor_state": "CA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "des Roziers",
      "inventor_name_first": "Eric Burin",
      "inventor_city": "Montepellier",
      "inventor_state": "",
      "inventor_country": "FR"
    },
    {
      "inventor_name_last": "Soni",
      "inventor_name_first": "Ketan",
      "inventor_city": "Sunnyvale",
      "inventor_state": "CA",
      "inventor_country": "US"
    }
  ],
  "abstract": "Various implementations for assigning rules and creating rules using templates are described herein. In one example implementation, a model is determined, one or more components of the model are determined, a rule from a set of one or more predefined rules is determined, and the rule is assigned to the model. The rule has one or more parameters matching the one or more components of the model.",
  "filing_date": "20160902",
  "patent_number": "None",
  "summary": "<SOH> SUMMARY <EOH>According to one innovative aspect of the subject matter described in this disclosure, a system includes one or more processors and a modeling engine. The modeling engine is executable by the one or more processors to perform various acts. For instance, the modeling engine determines a model, determines one or more components of the model, determines a rule from a set of one or more predefined rules, and assigns the rule to the model. The rule has one or more parameters matching the one or more components of the model. In general, another innovative aspect of the subject matter described in this disclosure may be embodied in methods that include determining a model; determining one or more components of the model; determining a rule from a set of one or more predefined rules, the rule having one or more parameters matching the one or more components of the model; and assigning the rule to the model. Other implementations of one or more of these aspects include corresponding systems, apparatus, and computer programs, configured to perform the actions of the methods, encoded on computer storage devices. These and other implementations may each optionally include one or more of the following features. For instance, the operations may further include matching the one or more components of the model to one or more attributes, option groups, and products; determining the rule based on the matching; overriding the rule that is assigned to the model by assigning the rule differently to the model or assigning another rule to the model; providing a rule definition interface including the assignment of the rule to the model for presentation to a user; receiving an input from the user to override the assignment of the rule; that determining the rule from the set of one or more predefined rules includes automatically determining the rule based on a common attribute between the rule and the model; determining an option group associated with the model; determini...",
  "date_published": "20170330",
  "title": "Rule Assignments and Templating",
  "ipcr_labels": [
    "G06N502"
  ],
  "_processing_info": {
    "original_size": 98699,
    "optimized_size": 3227,
    "reduction_percent": 96.73
  }
}