{
  "date_produced": "20170316",
  "publication_number": "US20170091623A1-20170330",
  "main_ipcr_label": "G06N502",
  "decision": "PENDING",
  "application_number": "15250008",
  "inventor_list": [
    {
      "inventor_name_last": "Kato",
      "inventor_name_first": "Yoshiharu",
      "inventor_city": "Suginami",
      "inventor_state": "",
      "inventor_country": "JP"
    },
    {
      "inventor_name_last": "Yano",
      "inventor_name_first": "Masafumi",
      "inventor_city": "Kawasaki",
      "inventor_state": "",
      "inventor_country": "JP"
    }
  ],
  "abstract": "A creativity support server extracts a node that is generated by a user from a tree diagram that is generated according to nodes each representing an opinion created by each user to derive a solution to a problem dealt with in a discussion and links each representing relevance between the nodes. The creativity support server classifies the extracted node according to dependency between the extracted node and other nodes included in the tree diagram. The creativity support server specifies a character of the user according to result of the classifying.",
  "filing_date": "20160829",
  "patent_number": "None",
  "summary": "<SOH> SUMMARY <EOH>According to an aspect of an embodiment, a non-transitory computer-readable recording medium stores therein a program that causes a computer to execute a process. The process includes extracting a node that is generated by a user from a tree diagram that is generated according to nodes each representing an opinion created by each user to derive a solution to a problem dealt with in a discussion and links each representing relevance between the nodes; classifying the extracted node according to dependency between the extracted node and other nodes included in the tree diagram; and specifying a character of the user according to result of the classifying. The object and advantages of the invention will be realized and attained by means of the elements and combinations particularly pointed out in the claims. It is to be understood that both the foregoing general description and the following detailed description are exemplary and explanatory and are not restrictive of the invention.",
  "date_published": "20170330",
  "title": "COMPUTER READABLE RECORDING MEDIUM, SPECIFYING METHOD, SPECIFYING APPARATUS, AND METHOD OF ANALYZING PROVIDED INFORMATION",
  "ipcr_labels": [
    "G06N502"
  ],
  "_processing_info": {
    "original_size": 83174,
    "optimized_size": 2319,
    "reduction_percent": 97.21
  }
}