{
  "date_produced": "20170214",
  "publication_number": "US20170061302A1-20170302",
  "main_ipcr_label": "G06N504",
  "decision": "PENDING",
  "application_number": "15254780",
  "inventor_list": [
    {
      "inventor_name_last": "SUBASI",
      "inventor_name_first": "Ahmet",
      "inventor_city": "SHARJAH",
      "inventor_state": "",
      "inventor_country": "AE"
    }
  ],
  "abstract": "Curiosity-adaptive ambient semantic intelligence systems and methods provide an ontology-driven graph database comprising machine-processable semantic representations of intellectual resources in the form of Curiosity Attracting Pointers (CAPs). The system also utilizes formal semantics that enable the system to automatically add new CAPs through reasoners. The users score their CAP entries based on various parameters. Curiosity traits are derived through the analysis of selectivity patterns of the users. User-scoring and curiosity value of resources are used by a calculation module to assign an overall Curiosity Satisfaction Value, which enables the personalization of output graphs generated by the system for a given user.",
  "filing_date": "20160901",
  "patent_number": "None",
  "summary": "<SOH> SUMMARY OF THE INVENTION <EOH>The present technology provides curiosity-adaptive ambient semantic intelligence systems and methods for scientific collaboration. Ambient systems are highly adaptive, personalized and context-aware systems, whereas semantic intelligence has the capabilities of formally representing information, interoperability and rule-based reasoning. The present technology provides an ontology-driven graph database populated through user input with machine-processable semantic representations of intellectual resources in the form of Curiosity Attracting Pointers (CAPs). CAPs are like landmarks of an intellectual domain such as names of significant concepts, articles, books, contributors related to that domain rather than full descriptions of their content such as in online encyclopedias. They are like road signs for the drives of curiosity that lead us to satisfaction. The formal semantics of the system also enables the system to automatically add new resources into itself through reasoners. Users of the system score their CAP entries based on various parameters popularity, popular score given to CAP, the score given to CAP by a prestige group and the network centrality of the CAP. The weight of each parameter is defined by the user and the system also personalizes the weights by analyzing the user's selectivity patterns. Curiosity traits are also derived by the system through a theory based analysis of selectivity patterns of each user. User-scoring and curiosity value of resources are used by the system to determine an overall satisfaction value for each CAP, which enables the system to generate a personalized output graph. The system may also provide an interactive, context-aware, real-time and omnichannel online platform in the form of web pages, social media interfaces and word processor add-ons. In one aspect, a curiosity-adaptive ambient semantic intelligence system for scientific collaboration is provided herein that includes a process...",
  "date_published": "20170302",
  "title": "CURIOSITY ADAPTIVE AMBIENT SEMANTIC INTELLIGENCE SYSTEM AND METHOD FOR SCIENTIFIC COLLABORATION",
  "ipcr_labels": [
    "G06N504",
    "G06F1730"
  ],
  "_processing_info": {
    "original_size": 61924,
    "optimized_size": 3324,
    "reduction_percent": 94.63
  }
}