{
  "date_produced": "20180222",
  "publication_number": "US20180068224A1-20180308",
  "main_ipcr_label": "G06N502",
  "decision": "PENDING",
  "application_number": "15259866",
  "inventor_list": [
    {
      "inventor_name_last": "Chen",
      "inventor_name_first": "Boliang",
      "inventor_city": "Shanghai",
      "inventor_state": "",
      "inventor_country": "CN"
    },
    {
      "inventor_name_last": "Chu",
      "inventor_name_first": "Stephen Mingyu",
      "inventor_city": "Beabercreek",
      "inventor_state": "OH",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Huang",
      "inventor_name_first": "Jing Chang",
      "inventor_city": "Shanghai",
      "inventor_state": "",
      "inventor_country": "CN"
    },
    {
      "inventor_name_last": "Li",
      "inventor_name_first": "Dong Sheng",
      "inventor_city": "Shanghai",
      "inventor_state": "",
      "inventor_country": "CN"
    },
    {
      "inventor_name_last": "Yan",
      "inventor_name_first": "Junchi",
      "inventor_city": "Shanghai",
      "inventor_state": "",
      "inventor_country": "CN"
    },
    {
      "inventor_name_last": "Zhang",
      "inventor_name_first": "Weipeng",
      "inventor_city": "Shanghai",
      "inventor_state": "",
      "inventor_country": "CN"
    }
  ],
  "abstract": "Techniques for model based data processing are proposed. In one example, a computer-implemented method is as follows. A first model is determined from a first category of data processing models and a second model is determined from a second category of data processing models. The second category can be different from the first category in some instances. Performance of a first combined model of the first and second models can be compared with performance of the first model. A target model for processing data can be selected from the first combined model and the first model based on the comparing.",
  "filing_date": "20160908",
  "patent_number": "None",
  "summary": "<SOH> SUMMARY <EOH>The following presents a summary to provide a basic understanding of one or more embodiments of the invention. This summary is not intended to identify key or critical elements, or delineate any scope of the particular embodiments or any scope of the claims. Its sole purpose is to present concepts in a simplified form as a prelude to the more detailed description that is presented later. In one or more embodiments described herein, devices, systems, computer-implemented methods, apparatus and/or computer program products that facilitate model based data processing are described. In one aspect, a computer-implemented method is proposed. The computer-implemented method can comprise determining, by an electronic device operatively coupled to a processor, a first model from a first category of data processing models. The computer-implemented method can also comprise determining, by the electronic device, a second model from a second category of data processing models, the second category being different from the first category. The computer-implemented method can also comprise comparing, by the electronic device, performance of a first combined model of the first and second models with performance of the first model. The computer-implemented method can also comprise selecting, by the electronic device, a target model for processing data from the first combined model and the first model based on the comparing. In another aspect, an electronic device is proposed. The electronic device can comprise: a processing unit; and a memory operatively coupled to the processing unit and that stores computer executable instructions that, based on execution by the processing unit, facilitate performance of acts. The acts can comprise determining a first model from a first category of data processing models. The acts can also comprise determining a second model from a second category of data processing models, the second category being different from the first catego...",
  "date_published": "20180308",
  "title": "MODEL BASED DATA PROCESSING",
  "ipcr_labels": [
    "G06N502",
    "G06N9900"
  ],
  "_processing_info": {
    "original_size": 52062,
    "optimized_size": 3857,
    "reduction_percent": 92.59
  }
}