{
  "decision": "ACCEPTED",
  "application_number": "15254924",
  "date_published": "20170706",
  "date_produced": "20170621",
  "title": "TOUCH-INTEGRATED DISPLAY PANEL AND DISPLAY DEVICE HAVING THE SAME",
  "filing_date": "20160901",
  "inventor_list": [
    {
      "inventor_name_last": "PARK",
      "inventor_name_first": "SunJa",
      "inventor_city": "Chilgok-gun",
      "inventor_state": "",
      "inventor_country": "KR"
    },
    {
      "inventor_name_last": "SEO",
      "inventor_name_first": "Dongmin",
      "inventor_city": "Chilgok-gun",
      "inventor_state": "",
      "inventor_country": "KR"
    },
    {
      "inventor_name_last": "KIM",
      "inventor_name_first": "Inseop",
      "inventor_city": "Busan",
      "inventor_state": "",
      "inventor_country": "KR"
    }
  ],
  "ipcr_labels": [
    "G06F3041",
    "G02F11343",
    "G02F11362",
    "G06F3044",
    "G02F11333"
  ],
  "main_ipcr_label": "G06F3041",
  "summary": "<SOH> SUMMARY <EOH>Various aspects of the present disclosure are intended to overcome the problem in which a touch-integrated display device erroneously detects a touch. The present disclosure is also intended to reduce or prevent the introduction of noise to touch electrodes. According to an aspect of the present disclosure, a touch-integrated display panel may include: a substrate, a plurality of first and second pixels, a touch electrode, and a shield electrode. The substrate has an active area and a non-active area outside of the active area. The plurality of first pixels are disposed in the active area, and the plurality of second pixels are disposed in the non-active area. The touch electrode is formed by electrically connecting the common voltage electrodes of a group of first pixels among the plurality of first pixels. The shield electrode is formed by electrically connecting the common voltage electrodes of the plurality of second pixels. The shield electrode is disposed to surround the active area. According to another aspect of the present disclosure, a touch-integrated display device may include a display panel and a touch driving circuit. The display panel includes a plurality of first pixels disposed in an active area, a plurality of second pixels disposed in a non-active area, a touch electrode formed by electrically connecting common voltage electrodes of a group of first pixels among the plurality of first pixels, and a shield electrode formed by electrically connecting common voltage electrodes of the plurality of second pixels, the shield electrode being disposed to surround the active area. According to the present disclosure as set forth above, it is possible to overcome the problem in which the touch-integrated display device erroneously detects a touch. In addition, it is possible to reduce or prevent the introduction of noise to touch electrodes.",
  "patent_number": "10001859",
  "abstract": "A touch-integrated display panel includes a substrate, a plurality of first and second pixels, a touch electrode, and a shield electrode. The substrate has an active area and a non-active area outside of the active area. The plurality of first pixels are disposed in the active area, and the plurality of second pixels are disposed in the non-active area. The touch electrode is formed by electrically connecting the common voltage electrodes of a group of first pixels among the plurality of first pixels. The shield electrode is formed by electrically connecting the common voltage electrodes of the plurality of second pixels. The shield electrode is disposed to surround the active area.",
  "publication_number": "US20170192610A1-20170706",
  "_processing_info": {
    "original_size": 44130,
    "optimized_size": 3482,
    "reduction_percent": 92.11
  }
}