{
  "decision": "ACCEPTED",
  "application_number": "15258950",
  "date_published": "20170105",
  "date_produced": "20161220",
  "title": "WIRELESS AUGMENTED REALITY COMMUNICATION SYSTEM",
  "filing_date": "20160907",
  "inventor_list": [
    {
      "inventor_name_last": "DEVEREAUX",
      "inventor_name_first": "Ann",
      "inventor_city": "Tujunga",
      "inventor_state": "CA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "JEDREY",
      "inventor_name_first": "Thomas",
      "inventor_city": "Pasadena",
      "inventor_state": "CA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "AGAN",
      "inventor_name_first": "Martin",
      "inventor_city": "Pasadena",
      "inventor_state": "CA",
      "inventor_country": "US"
    }
  ],
  "ipcr_labels": [
    "H04N714",
    "H04W7602",
    "H04L2906",
    "G06T1900"
  ],
  "main_ipcr_label": "H04N714",
  "summary": "<SOH> SUMMARY <EOH>The needs of the prior art are met by a portable unit, methods of software for video communication to select a user name in a user name network. In one embodiment, a transceiver wirelessly accesses a communication network through a wireless connection to a general purpose node coupled to the communication network. A user interface can receive user input to log on to a user name network through the communication network. The user name network has a plurality of user names, at least one of the plurality of user names being associated with a remote portable unit, logged on to the user name network and available for video communication. In some embodiments, the user interface comprises a touchpad configured to receive user inputs. A display on the portable unit displays one or more of the plurality of user names. In an embodiment, the user interface further receives a selection of a user name from the plurality of user names. The display displays video communication received by the portable unit from the remote portable unit. The video communication is associated with the selected user name.",
  "patent_number": "9641797",
  "abstract": "A portable unit is for video communication to select a user name in a user name network. A transceiver wirelessly accesses a communication network through a wireless connection to a general purpose node coupled to the communication network. A user interface can receive user input to log on to a user name network through the communication network. The user name network has a plurality of user names, at least one of the plurality of user names is associated with a remote portable unit, logged on to the user name network and available for video communication.",
  "publication_number": "US20170006259A1-20170105",
  "_processing_info": {
    "original_size": 34816,
    "optimized_size": 2546,
    "reduction_percent": 92.69
  }
}