{
  "decision": "PENDING",
  "application_number": "15257963",
  "date_published": "20180308",
  "date_produced": "20180222",
  "title": "METHOD AND APPARATUS FOR CLOCK SKEW CONTROL WITH LOW JITTER IN AN INTEGRATED CIRCUIT",
  "filing_date": "20160907",
  "inventor_list": [
    {
      "inventor_name_last": "Arp",
      "inventor_name_first": "Andreas",
      "inventor_city": "Nufringen",
      "inventor_state": "",
      "inventor_country": "DE"
    },
    {
      "inventor_name_last": "Cilek",
      "inventor_name_first": "Fatih",
      "inventor_city": "Boeblingen",
      "inventor_state": "",
      "inventor_country": "DE"
    },
    {
      "inventor_name_last": "Hertwig",
      "inventor_name_first": "Andre",
      "inventor_city": "Waldenbuch",
      "inventor_state": "",
      "inventor_country": "DE"
    },
    {
      "inventor_name_last": "Koch",
      "inventor_name_first": "Michael",
      "inventor_city": "Ehningen",
      "inventor_state": "",
      "inventor_country": "DE"
    },
    {
      "inventor_name_last": "Ringe",
      "inventor_name_first": "Matthias",
      "inventor_city": "Tuebingen",
      "inventor_state": "",
      "inventor_country": "DE"
    }
  ],
  "ipcr_labels": [
    "H03K505",
    "G06F110"
  ],
  "main_ipcr_label": "H03K505",
  "summary": "<SOH> SUMMARY <EOH>In one aspect, there is provided an apparatus of performing a clock skew adjustment between at least first and second clock signals. The apparatus includes a first skew sensor, a second skew sensor, and a clock skew controller. The first skew sensor is configured to receive a third clock signal obtained by delaying the first clock signal by a first delay and a fourth clock signal obtained by delaying the second clock signal by a second delay, and to generate first information based on the third and fourth clock signals. The first information varies depending on a clock skew between the first and second clock signals. The second skew sensor is configured to receive a fifth clock signal obtained by delaying the first clock signal by a third delay and a sixth clock signal obtained by delaying the second clock signal by a fourth delay, and to generate second information based on the fifth and sixth clock signals. The second information varies depending on the clock skew between the first and second clock signals. The clock skew controller is configured to perform the clock skew adjustment based on the first and second information. In another aspect, there is provided a method for adjusting a clock skew between at least first and second clock signals. The method includes receiving, by a first skew sensor, third and fourth clock signals, receiving, by a second skew sensor, fifth and sixth clock signals. The third clock signal is obtained by delaying the first clock signal by a first delay. The fourth clock signal is obtained by delaying the second clock signal by a second delay. The fifth clock signal is obtained by delaying the first clock signal by a third delay. The sixth clock signal is obtained by delaying the second clock signal by a fourth delay. The method further includes generating, by the first skew sensor, first information based on the third and fourth clock signals, generating, by the second skew sensor, second information based on the fif...",
  "patent_number": "None",
  "abstract": "An apparatus of performing a clock skew adjustment between at least first and second clock signals includes first and second skew sensors and a skew controller. The first skew sensor receives a third clock signal obtained by delaying the first clock signal by a first delay and a fourth clock signal obtained by delaying the second clock signal by a second delay, and generates first information based on the third and fourth clock signals. The second skew sensor receives a fifth clock signal obtained by delaying the first clock signal by a third delay and a sixth clock signal obtained by delaying the second clock signal by a fourth delay, and generates second information based on the fifth and sixth clock signals. Each of the first and second information varies depending on the clock skew. The skew controller performs the clock skew adjustment based on the first and second information.",
  "publication_number": "US20180069540A1-20180308",
  "_processing_info": {
    "original_size": 75750,
    "optimized_size": 4054,
    "reduction_percent": 94.65
  }
}