{
  "decision": "PENDING",
  "application_number": "15263641",
  "date_published": "20170105",
  "date_produced": "20161220",
  "title": "ADJUSTING THE LEVEL OF ACOUSTIC AND HAPTIC OUTPUT IN HAPTIC DEVICES",
  "filing_date": "20160913",
  "inventor_list": [
    {
      "inventor_name_last": "Bard",
      "inventor_name_first": "Benjamin A.",
      "inventor_city": "Cupertino",
      "inventor_state": "CA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Wiederhold",
      "inventor_name_first": "Curtis P.",
      "inventor_city": "Cupertino",
      "inventor_state": "CA",
      "inventor_country": "US"
    }
  ],
  "ipcr_labels": [
    "G06F301",
    "G06F316"
  ],
  "main_ipcr_label": "G06F301",
  "summary": "<SOH> SUMMARY <EOH>Embodiments described herein permit the haptic and acoustic output of a haptic device to be changed. In one aspect, an electronic device can include a feedback surface and one or more actuators operably connected to the feedback surface. In some embodiments, a connection member may be operably connected between the feedback surface and each actuator. At least one actuator produces an attracting and/or repelling force that moves the connection member and the feedback surface. The movement can produce a haptic and acoustic output in the haptic device. An output adjustment mechanism may adjust the haptic and acoustic output of the haptic device. In one example, the output adjustment mechanism can be the positioning of at least one actuator so that the attracting and/or repelling force produced by the at least one actuator produces an out of plane movement in the feedback surface. The attracting and/or repelling force can also produce an in-plane movement. In another example, the output adjustment mechanism may be a material that is attached to at least a portion of an exterior surface of the connection member to change a cross-sectional area of the connection member. In yet another example, the output adjustment mechanism can be a connection member that has a different cross-sectional area in at least a portion of the connection member. In another example, the output adjustment mechanism may be one or more biasing supports that are adapted to change dynamically to adjust a haptic and acoustic output of the haptic device. For example, the one or more biasing supports can be made of a piezoelectric material that changes shape based on an input signal. These examples can be used in a haptic device individually or in various combinations. In another aspect, one or more different haptic input signals can be received by at least one actuator to adjust the attracting and/or repelling force produced by the at least one actuator to change the haptic and acous...",
  "patent_number": "None",
  "abstract": "A haptic device in an electronic device includes a feedback surface, one or more actuators, and a connection member connected between the feedback surface and each actuator. At least one actuator produces an attracting or repelling force that creates movement in the connection member and the feedback surface. An acoustic and a haptic output of the haptic device can be adjusted at least in part by producing an out of plane movement in the feedback surface, by changing a cross-sectional area of at least a portion of the connection member, by changing dynamically one or more biasing supports disposed below the feedback surface, and/or by changing at least one waveform characteristic of a haptic input signal received by at least one actuator.",
  "publication_number": "US20170003744A1-20170105",
  "_processing_info": {
    "original_size": 49939,
    "optimized_size": 3472,
    "reduction_percent": 93.05
  }
}