{
  "date_produced": "20180228",
  "publication_number": "US20180075335A1-20180315",
  "main_ipcr_label": "G06N300",
  "decision": "PENDING",
  "application_number": "15265615",
  "inventor_list": [
    {
      "inventor_name_last": "Braz",
      "inventor_name_first": "ALAN",
      "inventor_city": "Campinas",
      "inventor_state": "",
      "inventor_country": "BR"
    },
    {
      "inventor_name_last": "Cavalin",
      "inventor_name_first": "Paulo Rodrigo",
      "inventor_city": "Reo De Janeiro",
      "inventor_state": "",
      "inventor_country": "BR"
    },
    {
      "inventor_name_last": "Diniz de Figueiredo",
      "inventor_name_first": "Flavio Vinicius",
      "inventor_city": "Reo De Janeiro",
      "inventor_state": "",
      "inventor_country": "BR"
    },
    {
      "inventor_name_last": "Gatti De Bayser",
      "inventor_name_first": "Maira",
      "inventor_city": "Reo De Janeiro",
      "inventor_state": "",
      "inventor_country": "BR"
    },
    {
      "inventor_name_last": "Santos Souza",
      "inventor_name_first": "Renan Francisco",
      "inventor_city": "Reo De Janeiro",
      "inventor_state": "",
      "inventor_country": "BR"
    }
  ],
  "abstract": "A method for answering a natural-language user query includes receiving a query from a user by a central agent, parsing the query, and determining if an answer is known to the central agent as being within a local database. If the answer is known, the query is answered with a known natural-language answer using the local database. If not, artificial conversational entity (ACE) invocation is performed. The ACE invocation includes determining a topical field for the query, determining an ACE, of a plurality of ACEs, to send the query to, based on the topical field, and sending the query to the ACE. If the ACE is capable of answering, a natural-language answer is received from the ACE and presented to the user. If not, a natural-language answer is created using social knowledge and presented to the user. Social knowledge includes data crawled from subscriber-provided content of social media services.",
  "filing_date": "20160914",
  "patent_number": "None",
  "summary": "<SOH> SUMMARY <EOH>According to an exemplary embodiment of the inventive concept, a method for answering a natural-language user query includes receiving a natural-language user query from a user by a central agent, parsing the natural-language user query, and determining if an answer to the parsed natural-language user query is known to the central agent as being within a local database. When it is determined that the answer to the parsed natural-language user query is known to the central agent as being within the local database, the parsed natural-language user query is answered in the form of a known natural-language answer, using the local database. When it is determined that the answer to the parsed natural-language user query is not known to the central agent as being within the local database, artificial conversational entity (ACE) invocation is performed. The ACE invocation includes determining a topical field for the parsed natural-language query, determining an ACE, of a plurality of available ACEs, to send the parsed natural-language query to, based on the determined topical field, and sending the parsed natural-language query to the determined ACE. When the determined ACE is capable of answering the parsed natural-language query, a natural-language answer to the parsed natural-language query is received from the determined ACE and presented to the user. When the determined ACE is not capable of answering the parsed natural-language query, a natural-language answer to the parsed natural-language query is created using social knowledge, and presented to the user. Social knowledge includes data that is crawled from subscriber-provided content of social media services. According to an exemplary embodiment of the inventive concept, a system for answering a natural-language user query includes a central agent, a local database, a plurality of artificial conversational entities (ACE), and a messaging service, application, or artificial intelligence user assist...",
  "date_published": "20180315",
  "title": "SYSTEM AND METHOD FOR MANAGING ARTIFICIAL CONVERSATIONAL ENTITIES ENHANCED BY SOCIAL KNOWLEDGE",
  "ipcr_labels": [
    "G06N300",
    "G06F1730",
    "G06F1727"
  ],
  "_processing_info": {
    "original_size": 69467,
    "optimized_size": 4163,
    "reduction_percent": 94.01
  }
}