{
  "date_produced": "20180228",
  "publication_number": "US20180075337A1-20180315",
  "main_ipcr_label": "G06N304",
  "decision": "PENDING",
  "application_number": "15264768",
  "inventor_list": [
    {
      "inventor_name_last": "BUCHANAN",
      "inventor_name_first": "BRENT",
      "inventor_city": "PALO ALTO",
      "inventor_state": "CA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "LAM",
      "inventor_name_first": "SITY",
      "inventor_city": "PALO ALTO",
      "inventor_state": "CA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "ZHENG",
      "inventor_name_first": "LE",
      "inventor_city": "PALO ALTO",
      "inventor_state": "CA",
      "inventor_country": "US"
    }
  ],
  "abstract": "Examples disclosed herein relate to neuron circuits and methods for generating neuron circuit outputs. In some of the disclosed examples, a neuron circuit includes a memristor and first and second current mirrors. The first current mirror may source a first current through the memristor and the second current mirror may sink a second current through the memristor. The memristor may generate a voltage output as a function of the sourced first current and the sunk second current through the memristor.",
  "filing_date": "20160914",
  "patent_number": "None",
  "summary": "<SOH> BRIEF DESCRIPTION OF THE DRAWINGS <EOH>The following detailed description references the drawings, wherein: FIG. 1 is a block diagram of an example neuron circuit; FIG. 2 is a depiction of a graphical representation of a voltage output of the example neuron circuit of FIG. 1 ; FIG. 3 is a block diagram of an example neuron circuit; FIG. 4 is a block diagram of an example neuron circuit; FIG. 5 is a depiction of a graphical representation of a voltage output of the example neuron circuit of FIG. 4 ; FIG. 6 is a block diagram of an example neuron circuit; FIG. 7 is a flowchart of an example method for generating an output of a neuron circuit; and FIG. 8 is a flowchart of an example method for generating an output of a neuron circuit. detailed-description description=\"Detailed Description\" end=\"lead\"?",
  "date_published": "20180315",
  "title": "NEURON CIRCUITS",
  "ipcr_labels": [
    "G06N304",
    "G06N308"
  ],
  "_processing_info": {
    "original_size": 30679,
    "optimized_size": 2120,
    "reduction_percent": 93.09
  }
}