{
  "decision": "PENDING",
  "application_number": "15261152",
  "date_published": "20170420",
  "date_produced": "20170405",
  "title": "COMPUTERIZED SYSTEMS AND METHODS FOR OFFLINE SOCIAL RECOMMENDATIONS",
  "filing_date": "20160909",
  "inventor_list": [
    {
      "inventor_name_last": "Wu",
      "inventor_name_first": "Steven",
      "inventor_city": "Hong Kong",
      "inventor_state": "",
      "inventor_country": "HK"
    },
    {
      "inventor_name_last": "Rosche",
      "inventor_name_first": "Tyler",
      "inventor_city": "Westport",
      "inventor_state": "CT",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Wong",
      "inventor_name_first": "Man Yung",
      "inventor_city": "Hong Kong",
      "inventor_state": "",
      "inventor_country": "HK"
    },
    {
      "inventor_name_last": "Smith, JR.",
      "inventor_name_first": "Theodore Root",
      "inventor_city": "Seattle",
      "inventor_state": "WA",
      "inventor_country": "US"
    }
  ],
  "ipcr_labels": [
    "G06F1730",
    "G06F702"
  ],
  "main_ipcr_label": "G06F1730",
  "summary": "<SOH> BRIEF DESCRIPTION OF THE DRAWINGS <EOH>The foregoing aspects and many of the attendant advantages of this disclosure may become more readily appreciated and better understood by reference to the following detailed description in conjunction with the accompanying drawings, wherein: FIG. 1 is a block diagram depicting an illustrative embodiment of a computing environment implementing an interpersonal networking and recommendation system; FIG. 2 is a block diagram depicting an illustrative embodiment of a computing environment implementing aspects of an interpersonal networking and recommendation system; FIG. 3 is a block diagram depicting an illustrative embodiment of a computing environment implementing aspects of an interpersonal networking and recommendation system; FIG. 4 is a block diagram depicting an illustrative embodiment of a computing environment implementing aspects of an interpersonal networking and recommendation system; FIG. 5 is a flow diagram depicting an illustrative routine for determining Recommendations for a user or Networking Activity Attendee; FIG. 6 is a data diagram depicting an illustrative example of Interest attractiveness and validity weights associated with an illustrative interpersonal networking and recommendation system user. FIG. 7 is a data diagram depicting an illustrative example of Characteristic attractiveness and validity weights associated with an illustrative interpersonal networking and recommendation system user. FIG. 8 is a flow diagram depicting an illustrative routine for determining Characteristics and Interests for a user or Networking Activity Attendee; FIG. 9 is a flow diagram depicting an illustrative routine for gathering information associated with a user or Networking Activity Attendee; FIG. 10 is a device diagram depicting an illustrative embodiment of a tablet computing device; FIG. 11 is a device diagram depicting an illustrative embodiment of a user data entry interface of an illustrative interpersonal ...",
  "patent_number": "None",
  "abstract": "Offline social recommendation systems, interactions, interfaces, and methods are disclosed for utilizing user interests and characteristics in the generation and selection of recommendations for offline social networking. An interpersonal network manager maintains data on user characteristics and interests, and updates this data based on direct feedback and inferences drawn from various kinds of user-associated information. The interpersonal network manager generates characteristics or other matching scores associated with a set of interpersonal interactions, such as offline networking activities, and selects interpersonal interactions to recommend to a user based on relationships between the matching scores associated with each interpersonal interaction and any characteristics and interests associated with the user.",
  "publication_number": "US20170109446A1-20170420",
  "_processing_info": {
    "original_size": 287578,
    "optimized_size": 3837,
    "reduction_percent": 98.67
  }
}