{
  "decision": "PENDING",
  "application_number": "15260939",
  "date_published": "20170316",
  "date_produced": "20170301",
  "title": "INTERACTIVE GENERATION OF CUSTOMIZED ORDERABLE ARTICLES APPARATUS, METHODS, ARTICLES AND TOOLS",
  "filing_date": "20160909",
  "inventor_list": [
    {
      "inventor_name_last": "Jennings",
      "inventor_name_first": "Laura",
      "inventor_city": "Seattle",
      "inventor_state": "WA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Savage",
      "inventor_name_first": "Tammy",
      "inventor_city": "Seattle",
      "inventor_state": "WA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Kelly",
      "inventor_name_first": "Jason",
      "inventor_city": "Kirkland",
      "inventor_state": "WA",
      "inventor_country": "US"
    }
  ],
  "ipcr_labels": [
    "G06Q3006",
    "G06F1730"
  ],
  "main_ipcr_label": "G06Q3006",
  "summary": "<SOH> BRIEF SUMMARY <EOH>Often an individual (i.e., buyer, sender) would like to purchase and send a gift to another individual (i.e., intended recipients). The buyer or sender can use an existing online Website to purchase and have a retail item delivered to the intended recipient. Often the Website will provide the ability to enclose a “personalized message” for delivery along with the item, in the form of a note or card. Yet, such a gift, even with a “personalized message” is often considered too impersonal. Various implementations described herein allow a user to create a customized article. For example, the user personally selects a decorative container for the article, and a customized set of items that fit in the decorative container (e.g., re-useable glass jar or vessel). The user can select and/or customize a tag, customize a product label and/or portions of a customized storybook as part of the article or package. The customized article typically takes the form of a gift, which the user is personally creating to for an intended recipient. The user can then order the customized article, which a fulfillment entity or company assembles, places in disposable shipping packaging (e.g., cardboard box), and ships to the intended recipient. Various implementations described herein allow a user to create an article from scratch, providing a maker stage and tools to select the container, the set of items to fit in the container, and to create the tag and storybook. Various implementations described herein allow a user select from a variety of previously created articles, to serve as a base or template which the user can modify to customize the article, or alternatively to order without modification. Existing online retail options also fail to allow effective collaboration by two or more users or individuals. Various implementations described herein provide a shared maker stage and tools that facilitate collaboration between two or more users in custom creating an art...",
  "patent_number": "None",
  "abstract": "Articles (e.g., gift) can be created by one or more creators or participants using system supplied base or template articles, which define a container and a set of items to be held by the container. The articles, containers, and items are selectable from sets or pallets of such, which can be represented as tiles of a user interface, with user selectable icons or hyperlinks. The article can include customized tags, customized product label, and customized storybooks, including standard content and customized user specified content. Two or more creators can collaboration on an article, using various system supplied tools. Articles can be assembled and caused to be delivered to intend recipients via various fulfillment mechanisms.",
  "publication_number": "US20170076347A1-20170316",
  "_processing_info": {
    "original_size": 215035,
    "optimized_size": 3641,
    "reduction_percent": 98.31
  }
}