{
  "decision": "PENDING",
  "application_number": "15266785",
  "date_published": "20180315",
  "date_produced": "20180228",
  "title": "VISUALIZATION OF TRAFFIC FLOWING THROUGH A HOST",
  "filing_date": "20160915",
  "inventor_list": [
    {
      "inventor_name_last": "Fields",
      "inventor_name_first": "Joshua M.",
      "inventor_city": "Ypsilanti",
      "inventor_state": "MI",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Cassell",
      "inventor_name_first": "Christopher C.",
      "inventor_city": "Ann Arbor",
      "inventor_state": "MI",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Doppke",
      "inventor_name_first": "Jeffrey",
      "inventor_city": "Canton",
      "inventor_state": "MI",
      "inventor_country": "US"
    }
  ],
  "ipcr_labels": [
    "H04L2906",
    "H04L1226",
    "H04L1224",
    "G06T1120"
  ],
  "main_ipcr_label": "H04L2906",
  "summary": "<SOH> SUMMARY OF THE INVENTION <EOH>The purpose and advantages of the invention will be set forth in and apparent from the description that follows. Additional advantages of the invention will be realized and attained by the devices, systems and methods particularly pointed out in the written description and claims hereof, as well as from the appended drawings. To achieve these and other advantages and in accordance with the purpose of the invention, as embodied, the invention includes, a system, method and computer readable storage medium in which an aspect of the invention includes intercepting data communications occuring between one or more hosts and a preselected target host in a protected network. The intercepted data communication includes a plurality of data packets. The intercepted data communications are analyzed to determine volumetric incoming and outgoing traffic flows for the received data packets. The determined volumetric incoming traffic flow for the received packets is graphically represented by a first region. The determined volumetric outgoing traffic flow for the received packets is graphically represented by a second region. The graphical representation includes a plurality of nodes interconnected by a plurality of links. The plurality of nodes represents the hosts. The plurality of links indicate operational relationship between the preselected target host, the one or more hosts, communication ports and communication services used in the data communications.",
  "patent_number": "None",
  "abstract": "A system, method and computer readable storage medium that analyzes network traffic intercepts data communications occurring between one or more hosts and a preselected target host in a protected network. The intercepted data communication includes a plurality of data packets. The intercepted data communications are analyzed to determine volumetric incoming and outgoing traffic flows for the received data packets. The determined volumetric incoming traffic flow for the received packets is graphically represented by a first region. The determined volumetric outgoing traffic flow for the received packets is graphically represented by a second region. The graphical representation includes a plurality of nodes interconnected by a plurality of links. The plurality of nodes represents the hosts. The plurality of links indicate operational relationship between the preselected target host, the one or more hosts, communication ports and communication services used in the data communications.",
  "publication_number": "US20180077119A1-20180315",
  "_processing_info": {
    "original_size": 56905,
    "optimized_size": 3377,
    "reduction_percent": 94.07
  }
}