{
  "decision": "PENDING",
  "application_number": "15261502",
  "date_published": "20170511",
  "date_produced": "20170427",
  "title": "METHOD, ELECTRONIC DEVICE, AND COMPUTER-READABLE MEDIUM FOR TRAVEL PLANNING",
  "filing_date": "20160909",
  "inventor_list": [
    {
      "inventor_name_last": "Yang",
      "inventor_name_first": "Tsung-Han",
      "inventor_city": "New Taipei City",
      "inventor_state": "",
      "inventor_country": "TW"
    },
    {
      "inventor_name_last": "Wu",
      "inventor_name_first": "Yu-Chun",
      "inventor_city": "New Taipei City",
      "inventor_state": "",
      "inventor_country": "TW"
    },
    {
      "inventor_name_last": "Shen",
      "inventor_name_first": "Eugene Yi-Cheng",
      "inventor_city": "New Taipei City",
      "inventor_state": "",
      "inventor_country": "TW"
    },
    {
      "inventor_name_last": "Lin",
      "inventor_name_first": "Chien-Hung",
      "inventor_city": "New Taipei City",
      "inventor_state": "",
      "inventor_country": "TW"
    }
  ],
  "ipcr_labels": [
    "G06Q1002",
    "G06F1724",
    "G06F30482"
  ],
  "main_ipcr_label": "G06Q1002",
  "summary": "<SOH> SUMMARY OF THE DISCLOSURE <EOH>Accordingly, the disclosure is directed to a method, an electronic device, and a computer-readable medium for travel planning, which provides an approach to conveniently organize collected data for travel planning. According to one of the embodiments, the disclosure is directed to a method for travel planning. The method is adapted to an electronic device and includes the following steps. First, a travel planning document including collected data is obtained, where each piece of the collected data includes at least one data category, and each of the data categories has at least one data format. Next, each piece of the collected data is converted into a data card, where each of the data cards includes converted collected data. A designating operation performed on each of the data cards is detected so as to group the data cards into multiple itineraries accordingly. The itineraries are sorted and integrated to generate a travel planning schedule. According to one of the embodiments, the disclosure is directed to an electronic device including a screen, an input device, a communication circuit, a memory and a processor, where the processor is coupled to the screen, the input device, the communication circuit, and the memory. The screen is configured to display a display frame. The communication circuit is configured to transmit data. The input device is configured to detect operations performed thereon. The memory is configured to record modules. The processor is configured to access and execute the modules recorded in the memory. The modules include a document obtaining module, a card managing module, and an itinerary managing module. The document obtaining module is configured to obtain a travel planning document, where the travel planning document includes a plurality pieces of collected data, each piece of the collected data comprises at least one data category, and each of the at least one data category has at least one data fo...",
  "patent_number": "None",
  "abstract": "A method, an electronic device, and a computer program product for travel planning are provided, where the method is adapted to an electronic device and includes the following steps. First, a travel planning document including collected data is obtained, where each piece of the collected data includes at least one data category, and each of the data categories has at least one data format. Next, each piece of the collected data is converted to a data card, where each of the data cards includes converted collected data. A designating operation performed on each of the data cards is detected so as to group the data cards into multiple itineraries accordingly. Next, the itineraries are sorted and integrated to generate a travel planning schedule.",
  "publication_number": "US20170132535A1-20170511",
  "_processing_info": {
    "original_size": 60983,
    "optimized_size": 3807,
    "reduction_percent": 93.76
  }
}