{
  "date_produced": "20170309",
  "publication_number": "US20170083811A1-20170323",
  "main_ipcr_label": "G06N304",
  "decision": "ACCEPTED",
  "application_number": "15267600",
  "inventor_list": [
    {
      "inventor_name_last": "CHO",
      "inventor_name_first": "SEONGHO",
      "inventor_city": "Gwacheon-si",
      "inventor_state": "",
      "inventor_country": "KR"
    },
    {
      "inventor_name_last": "YOO",
      "inventor_name_first": "lnkyeong",
      "inventor_city": "Yongin-si",
      "inventor_state": "",
      "inventor_country": "KR"
    },
    {
      "inventor_name_last": "KIM",
      "inventor_name_first": "Hojung",
      "inventor_city": "Suwon-si",
      "inventor_state": "",
      "inventor_country": "KR"
    }
  ],
  "abstract": "Provided are a weighting device that may be driven at a low voltage and is capable of embodying multi-level weights, a neural network, and a method of operating the weighting device. The weighting device includes a switching layer that may switch between a high resistance state and a low resistance state based on a voltage applied thereto and a charge trap material layer that traps or discharges charges according to a resistance state of the switching layer. The weighting device may be used for controlling a weight in a neural network.",
  "filing_date": "20160916",
  "patent_number": "9767407",
  "summary": "<SOH> SUMMARY <EOH>Provided are a weighting device that may be driven at a low voltage and is capable of embodying multi-level weights, a neural network, and a method of operating the weighting device. According to at least some example embodiments, a weighting device includes a substrate; a first transistor including, a source region and a shared region spaced apart from each other on the substrate; a source electrode electrically connected to the source region; a first channel region between the source region and the shared region; a first gate insulation layer arranged on the first channel region; a charge trap material layer arranged on the first gate insulation layer; a switching layer arranged on the charge trap material layer and configured to switch between a low resistance state and a high resistance state; and a first gate electrode arranged on the switching layer; and a second transistor including, a drain region spaced apart from the shared region on the substrate; a drain electrode electrically connected to the drain region; a second channel region between the shared region and the drain region; a second gate insulation layer arranged on the second channel region; and a second gate electrode arranged on the second gate insulation layer, wherein the charge trap material layer faces a portion of the shared region across the first gate insulation layer. The first transistor may further include an anti-leakage region on the substrate, the anti-leakage region may constitute a PN diode structure together with the source region, and the source electrode may contact the anti-leakage region. Except a surface of the anti-leakage region contacting the source electrode, the anti-leakage region may be surrounded by the source region. The first channel region and the second channel region may have conductive types opposite each other. The first transistor may further include a well, the well may surround the source region, the first channel region, and the shared reg...",
  "date_published": "20170323",
  "title": "WEIGHTING DEVICE, NEURAL NETWORK, AND OPERATING METHOD OF THE WEIGHTING DEVICE",
  "ipcr_labels": [
    "G06N304",
    "H01L29423",
    "H01L29788",
    "G11C1626",
    "G11C1604",
    "G11C1612",
    "G11C1614",
    "H01L29792",
    "H01L2910"
  ],
  "_processing_info": {
    "original_size": 100830,
    "optimized_size": 3494,
    "reduction_percent": 96.53
  }
}