{
  "date_produced": "20170316",
  "publication_number": "US20170091631A1-20170330",
  "main_ipcr_label": "G06N504",
  "decision": "PENDING",
  "application_number": "15266380",
  "inventor_list": [
    {
      "inventor_name_last": "Ripberger",
      "inventor_name_first": "Kenneth George",
      "inventor_city": "Metairie",
      "inventor_state": "LA",
      "inventor_country": "US"
    }
  ],
  "abstract": "A new method for selection of Heating-Ventilation-and Air-Conditioning (HVAC) equipment, and the airflow settings of same, to comply with industry established limits of sizing of HVAC equipment for the residential housing construction and renovation industry. The current method utilized by mechanical contractors in the United States (and elsewhere), are guidelines set forth in the Air Conditioning Contractor's of America's “Manual S” current edition. The new method was solely developed by the inventor and is referred to, and has been sold for less than one year under the name of,",
  "filing_date": "20160915",
  "patent_number": "None",
  "summary": "<SOH> BRIEF SUMMARY OF THE INVENTION <EOH>The ACCA Manual S method of Residential Equipment Selection is a lengthy process of repeated selection of “trial and error” attempts, to find a match of a suitable model of HVAC equipment which will satisfy the sensible and latent heat removal needs of the structure, for the outdoor and indoor conditions it will be subject to. This is done by searching the manufacturer Charts, to determine which will be the appropriate match for the target structure. The inventor created a new method, and named the method and resulting software product Off-The-Charts (OTC) for marketing purposes, which is comprised of four steps. In their first, and subsequent editions of Manual S, ACCA proposed a potential universal set of formulas to convert the AHRI rating of unitary HVAC residential equipment under standard conditions, to a performance capacity under other conditions. In those same manuals, ACCA stated that such a universal formula could never be created with any useful accuracy. But ACCA has never proposed using a universal formula, for the purpose of converting required capacity of a structure to an AHRI rating first. Therefore the OTC method starts out with this as a new method in its first step. The formulas will naturally change with time as they are adjusted and improved, and they are not of themselves the uniqueness or claim of the new method. The first step of the new method requires input of the heat loss values of the structure (total and sensible), and various values of the indoor and outdoor conditions of air which it will be subject to. The mathematical formulas embedded into the method and software then projects the AHRI capacity(s) that would be required for any proposed HVAC equipment to satisfy the sensible and latent needs of that structure under those conditions which were inputted. These entries are seen on the two accompanying appendices, “StartTabOffTheChartsMulti5v158532.pdf” and “System1OffTheChartsMulti5v158532.p...",
  "date_published": "20170330",
  "title": "Residential HVAC System Equipment Selection Method",
  "ipcr_labels": [
    "G06N504"
  ],
  "_processing_info": {
    "original_size": 13942,
    "optimized_size": 3170,
    "reduction_percent": 77.26
  }
}