{
  "decision": "ACCEPTED",
  "application_number": "15263250",
  "date_published": "20161229",
  "date_produced": "20161214",
  "title": "Camera Testing Using Virtual Images",
  "filing_date": "20160912",
  "inventor_list": [
    {
      "inventor_name_last": "Shen",
      "inventor_name_first": "Shizhe",
      "inventor_city": "San Mateo",
      "inventor_state": "CA",
      "inventor_country": "US"
    }
  ],
  "ipcr_labels": [
    "H04N1700",
    "G03B1503",
    "H04N5225",
    "G06T700"
  ],
  "main_ipcr_label": "H04N1700",
  "summary": "<SOH> SUMMARY <EOH>Accordingly, there is a need for methods, systems, and apparatuses with faster, more efficient methods and interfaces for testing image capture devices. Such methods and interfaces optionally complement or replace conventional methods for testing image capture devices. In accordance with some embodiments, a method is performed at a system with a virtual image generation device. The method includes: receiving an image capture device; generating, using the virtual image generation device, a plurality of test images in accordance with a test sequence, where each test image corresponds to a respective focal distance with respect to the image capture device; obtaining test data corresponding to respective captures of the test images by the image capture device; and providing the test data In accordance with some embodiments, a system includes a virtual image generation device, one or more processors, memory, and one or more programs; the one or more programs are stored in the memory and configured to be executed by the one or more processors and the one or more programs include instructions for performing the operations of any of the methods described above. In accordance with some embodiments, a computer readable storage medium has stored therein instructions which, when executed by a system with a virtual image generation device and one or more processors, cause the device to perform the operations of any of the methods described above. In accordance with some embodiments, an apparatus includes a virtual image generation device, a receptacle for an image capture device, and a light booth. The virtual image generation device is configured to generate a plurality of test images within the light booth in accordance with a test sequence. The receptacle is configured to enable detection of the test images by the image capture device. Thus, testing systems and apparatus are provided with faster, more efficient methods for testing image capture devices, the...",
  "patent_number": "9843796",
  "abstract": "An apparatus includes a virtual image generation device, a receptacle for a digital camera, and a light booth. The virtual image generation device is configured to generate a plurality of test images within the light booth in accordance with a test sequence. The receptacle is configured to enable detection of the test images by the digital camera.",
  "publication_number": "US20160381355A1-20161229",
  "_processing_info": {
    "original_size": 57027,
    "optimized_size": 2912,
    "reduction_percent": 94.89
  }
}