{
  "date_produced": "20171129",
  "publication_number": "US20170357904A1-20171214",
  "main_ipcr_label": "G06N504",
  "decision": "PENDING",
  "application_number": "15268952",
  "inventor_list": [
    {
      "inventor_name_last": "Adler",
      "inventor_name_first": "Scott",
      "inventor_city": "Saratoga",
      "inventor_state": "CA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Gross",
      "inventor_name_first": "Daniel C.",
      "inventor_city": "San Francisco",
      "inventor_state": "CA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Cao",
      "inventor_name_first": "Lili",
      "inventor_city": "Sunnyvale",
      "inventor_state": "CA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Cates",
      "inventor_name_first": "Samuel C.",
      "inventor_city": "Los Gatos",
      "inventor_state": "CA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Shin",
      "inventor_name_first": "Hyo Jeong",
      "inventor_city": "Santa Clara",
      "inventor_state": "CA",
      "inventor_country": "US"
    }
  ],
  "abstract": "In an example method, a mobile device receives a first calendar item associated with a first event. The first calendar item includes a first text string. The mobile device determines a correlation between the first text string and one or more locations associated with one or more second events. The mobile device determines a suggested location for the first event based on the correlation.",
  "filing_date": "20160919",
  "patent_number": "None",
  "summary": "<SOH> SUMMARY <EOH>Systems, methods, devices and non-transitory, computer-readable mediums are disclosed for managing data with respect to an electronic calendar. In general, in an aspect, a computer-implemented method includes receiving, at a mobile device, a first calendar item associated with a first event. The first calendar item includes a first text string. The method also includes determining, at the mobile device, a correlation between the first text string and one or more locations associated with one or more second events. The method also includes determining, at the mobile device, a suggested location for the first event based on the correlation. Implementations of this aspect can include one or more of the following features. In some implementations, the text string can be a title of the calendar item. In some implementations, the text string can be a colloquial name of a location. In some implementations, the correlation can be determined by receiving, at the mobile device, one or more second calendar items associated with the one or more second events, wherein the second calendar items each comprise the first text string, determining one or more significant locations associated with the second events, and determining the correlation based on the second events and the significant locations. In some implementations, the method can further include generating a histogram indicating a frequency in which the first text string is associated with each of the significant locations. In some implementations, determining the suggested location can include selecting the suggested location from among the significant locations. The suggested location can be a most frequently occurring significant location with respect to the first text string. In some implementations, the method can further include displaying, to a user of the mobile device, the suggested location, receiving, at the mobile device, an instruction from the user to modify the suggested location, and res...",
  "date_published": "20171214",
  "title": "SUGGESTED LOCATIONS FOR CALENDAR EVENTS",
  "ipcr_labels": [
    "G06N504",
    "G06Q1010",
    "G06N700",
    "G06F1730"
  ],
  "_processing_info": {
    "original_size": 100106,
    "optimized_size": 3545,
    "reduction_percent": 96.46
  }
}