{
  "decision": "ACCEPTED",
  "application_number": "15268518",
  "date_published": "20170105",
  "date_produced": "20161220",
  "title": "KEYCAPS WITH REDUCED THICKNESS",
  "filing_date": "20160916",
  "inventor_list": [
    {
      "inventor_name_last": "Kwan",
      "inventor_name_first": "Hilbert T.",
      "inventor_city": "Cupertino",
      "inventor_state": "CA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Yen",
      "inventor_name_first": "Jeffrey L.",
      "inventor_city": "Cupertino",
      "inventor_state": "CA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Leong",
      "inventor_name_first": "Craig C.",
      "inventor_city": "Cupertino",
      "inventor_state": "CA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Niu",
      "inventor_name_first": "James J.",
      "inventor_city": "Cupertino",
      "inventor_state": "CA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Hendren",
      "inventor_name_first": "Keith J.",
      "inventor_city": "Cupertino",
      "inventor_state": "CA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Yuan",
      "inventor_name_first": "Yanyang",
      "inventor_city": "Cupertino",
      "inventor_state": "CA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Zhao",
      "inventor_name_first": "Feng",
      "inventor_city": "Cupertino",
      "inventor_state": "CA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Li",
      "inventor_name_first": "Wanshan",
      "inventor_city": "Cupertino",
      "inventor_state": "CA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Jue",
      "inventor_name_first": "Derrick T.",
      "inventor_city": "Cupertino",
      "inventor_state": "CA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Hong",
      "inventor_name_first": "Ze",
      "inventor_city": "Cupertino",
      "inventor_state": "CA",
      "inventor_country": "US"
    }
  ],
  "ipcr_labels": [
    "H01H1383",
    "G06F302",
    "B23K2638",
    "H01H312",
    "H01H1388"
  ],
  "main_ipcr_label": "H01H1383",
  "summary": "<SOH> SUMMARY <EOH>Embodiments described herein may relate to or take the form of an illuminated input apparatus such as a keyboard for use with a computing device. The keyboard may include a plurality of keys, each including a metal keycap. The metal keycap may be aluminum, anodized or otherwise finished. The metal keycap may have a top surface including a legend aperture, a legend diffuser material within the legend aperture, a compressible scissor mechanism configured to activate electrical switch circuitry, a light source such as a light emitting diode (“LED”) having an on state and an off state, the light source oriented to transmit light through the legend aperture. In one example, the on state may include a legend illumination mode in which the light source transmits light through legend diffuser material and through the legend aperture. In another example, on state may include a keycap perimeter illumination mode in which the light source may emit light proximate perimeter of the metal keycap. In certain embodiments, the legend aperture may be opened in the metal keycap by a laser cutting, a laser ablation process, or a combination thereof. In certain embodiments, the perimeter of the legend aperture may be defined in part by at least one bridge portion connecting to an island portion, with at least one bridge portion having a thickness less than that of the metal keycap. In some example embodiments, a portion of the finished or cured legend diffuser material may be coplanar with the top surface of the metal keycap. Other embodiments described herein may relate to or take the form of a method for manufacturing a light transmissive keycap for illuminating a keyboard, including forming at least a portion of a legend aperture within the metal keycap, depositing a translucent legend diffuser material over the legend aperture, placing the metal keycap and deposited legend diffuser material in a curing condition, smoothing residual legend diffuser material so that...",
  "patent_number": "10002727",
  "abstract": "An illuminated metal keycap having a legend diffuser material that may diffuse light through a legend opened in a background layer. The background layer may be opaque and the legend may be transparent. The metal keycap is adhered to a scissor mechanism positioned above electrical switch circuitry. Included within, below, or adjacent to the scissor mechanism may be one or more light sources positioned to emit light through the metal keycap, around the perimeter of the metal keycap, and/or through the background layer.",
  "publication_number": "US20170004939A1-20170105",
  "_processing_info": {
    "original_size": 65269,
    "optimized_size": 4420,
    "reduction_percent": 93.23
  }
}