{
  "date_produced": "20180222",
  "publication_number": "US20180068228A1-20180308",
  "main_ipcr_label": "G06N700",
  "decision": "PENDING",
  "application_number": "15260089",
  "inventor_list": [
    {
      "inventor_name_last": "Rawlings",
      "inventor_name_first": "Todd R.",
      "inventor_city": "Bellevue",
      "inventor_state": "WA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Mann",
      "inventor_name_first": "Rajvinder P.",
      "inventor_city": "Woodinville",
      "inventor_state": "WA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Commons",
      "inventor_name_first": "Daniel P.",
      "inventor_city": "Woodinville",
      "inventor_state": "WA",
      "inventor_country": "US"
    }
  ],
  "abstract": "Systems and methods are described for facilitating operation of a plurality of computing devices. Data indicative of enumerated resources of a computing device is collected. The data is collected without dependency on write permissions to a file system of the one computing device. A condition of the computing device is determined based on historical data associated with enumerated resources of other computing devices. The identified condition can be updated as updated historical data becomes available. A communication to the computing device may be sent based on the identified condition.",
  "filing_date": "20160908",
  "patent_number": "None",
  "summary": "<SOH> SUMMARY <EOH>Disclosed herein are methods and systems for facilitating operation of a plurality of computing devices. Embodiments may include receiving data indicative of enumerated resources of a computing device. The data may be collected without dependency on write permissions to a file system of the computing device. Historical data associated with attributes of enumerated resources of other computing devices may be accessed. The historical data may be selected based on attributes of the other computing devices. The predicted probability of an event may be calculated based on the historical data. The predicted probability may be updated as updated historical data becomes available. A communication to the computing device may be sent when it is determined that the event is likely to occur. It should be appreciated that the above-described subject matter may be implemented as a computer-controlled apparatus, a computer process, a computing system, or as an article of manufacture such as one or more computer-readable storage media. These and various other features will be apparent from a reading of the following Detailed Description and a review of the associated drawings. This Summary is provided to introduce a selection of concepts in a simplified form that are further described below in the Detailed Description. This Summary is not intended to identify key features or essential features of the claimed subject matter, nor is it intended to be used as an aid in determining the scope of the claimed subject matter. Furthermore, the claimed subject matter is not limited to implementations that solve any or all disadvantages noted in any part of this disclosure.",
  "date_published": "20180308",
  "title": "CONFIGURATION ASSESSMENT BASED ON INVENTORY",
  "ipcr_labels": [
    "G06N700",
    "G06F954"
  ],
  "_processing_info": {
    "original_size": 87318,
    "optimized_size": 3136,
    "reduction_percent": 96.41
  }
}