{
  "decision": "PENDING",
  "application_number": "15268373",
  "date_published": "20170323",
  "date_produced": "20170309",
  "title": "PROCESS FOR PROTECTING AN ELECTRONIC DEVICE BY SELECTIVE DEPOSITION OF POLYMER COATINGS",
  "filing_date": "20160916",
  "inventor_list": [
    {
      "inventor_name_last": "Ahmad",
      "inventor_name_first": "Syed Taymur",
      "inventor_city": "Chicago",
      "inventor_state": "IL",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Acton",
      "inventor_name_first": "Bruce",
      "inventor_city": "Bettendorf",
      "inventor_state": "IA",
      "inventor_country": "US"
    }
  ],
  "ipcr_labels": [
    "H05K500",
    "G06F116",
    "H04B13888",
    "H05K328"
  ],
  "main_ipcr_label": "H05K500",
  "summary": "<SOH> SUMMARY <EOH>In view of the foregoing, there is disclosed a method for protecting an electronic device by applying different polymeric materials on specified components of the device. In one embodiment, the disclosed method generally comprises treating, in any order, the backside and front side of the printed circuit board. In one embodiment, treating the backside of the circuit board comprises: applying an electrically insulating polymer to the surface of at least one component located on the backside of the circuit board. Non-limiting examples of the components that can be treated with the insulating polymer include at least one component and/or connector chosen from a printed circuit board, such as a flexible printed circuit connector, an LCD, a battery connector, a speaker connector, a camera connector, a light connector, and combinations thereof. The method next comprises curing the insulating polymer, followed by applying a polymer capable of conducting a charge to at least one different component than the component containing the insulating polymer. Non-limiting examples of the components on which the polymer capable of conducting a charge is applied include at least one component and/or connector chosen from a power switch, a volume switch, RAM Chips, ROM Chips, USB charging port, MEMS, Microphone, SIM card housings, headphone jack, and combinations thereof. The method of treating the front side of the printed circuit board comprises: applying an insulating polymer to the surface of at least component located on the front side of the circuit board. The previously mentioned components that are covered with the insulating polymer on the back side of the PCB are the same as on the front side, e.g., at least one component and/or connector chosen from an FPC connector, an LCD, a battery connector, a speaker connector, a camera connector, a light connector, and combinations thereof. The method also comprises curing the insulating polymer, and applying a poly...",
  "patent_number": "None",
  "abstract": "Methods for protecting an electronic device from contaminants by applying different polymeric materials to different vital components of a device are disclosed. In one embodiment, the method comprises applying an electrically insulating polymer, such as an acrylic-based polymer, to one or more connectors and components located on the printed circuit board of the device. The method further comprises applying a polymer capable of carrying a charge, such as a silicone-based polymer, to different connectors and components on the printed circuit board. The method leads to different components being coated with a different polymers. Electronic devices that are protected by such polymeric, hydrophobic coatings are also disclosed, such as smart phones, computers, and gaming devices.",
  "publication_number": "US20170086312A1-20170323",
  "_processing_info": {
    "original_size": 43486,
    "optimized_size": 3544,
    "reduction_percent": 91.85
  }
}