{
  "date_produced": "20180228",
  "publication_number": "US20180075367A1-20180315",
  "main_ipcr_label": "G06N9900",
  "decision": "PENDING",
  "application_number": "15261746",
  "inventor_list": [
    {
      "inventor_name_last": "Yates",
      "inventor_name_first": "Andrew Donald",
      "inventor_city": "San Francisco",
      "inventor_state": "CA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Runke",
      "inventor_name_first": "Kurt Dodge",
      "inventor_city": "Los Altos",
      "inventor_state": "CA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Singh",
      "inventor_name_first": "Gunjit",
      "inventor_city": "San Francisco",
      "inventor_state": "CA",
      "inventor_country": "US"
    }
  ],
  "abstract": "An online system, such as a social networking system, generates shared models for one or more clusters of categories. A shared model for a cluster is common to the categories assigned to the cluster. In this manner, the shared models are specific to the group of categories (e.g., selected content providers) in each cluster while requiring a reasonable computational complexity for the online system. The categories are clustered based on the performance of a model specific to a category on data for other categories.",
  "filing_date": "20160909",
  "patent_number": "None",
  "summary": "<SOH> SUMMARY <EOH>An online system, such as a social networking system, generates shared models for one or more clusters of categories. A shared model for a cluster is common to the categories assigned to the cluster. In this manner, the shared models are specific to the group of categories (e.g., selected content providers) in each cluster and provide good prediction accuracy while requiring a reasonable computational complexity for the online system. The online system also generates a general model for all selected categories in case the shared models cannot be used, or if a prediction needs to be generated for a category that is not assigned to any cluster. The online system initially constructs models for each selected category. The categories are then clustered based on the performance of each model on data of other categories. The online system trains shared models for the categories assigned to each cluster. In one instance, the online system identifies an optimal number of shared models that minimizes a loss dependent on average prediction accuracy and/or required computational complexity of the models. Predictions for an instance associated with a category can be generated by applying the shared model for the cluster to which the category is assigned.",
  "date_published": "20180315",
  "title": "SHARED PER CONTENT PROVIDER PREDICTION MODELS",
  "ipcr_labels": [
    "G06N9900",
    "G06F1730"
  ],
  "_processing_info": {
    "original_size": 63820,
    "optimized_size": 2655,
    "reduction_percent": 95.84
  }
}