{
  "decision": "PENDING",
  "application_number": "15265845",
  "date_published": "20170316",
  "date_produced": "20170301",
  "title": "SYSTEM AND METHOD FOR VERIFYING A LOAD PLACED IN ONE OR MORE TRUCKS",
  "filing_date": "20160914",
  "inventor_list": [
    {
      "inventor_name_last": "Pommerening",
      "inventor_name_first": "Brent Robert",
      "inventor_city": "ShoreWood",
      "inventor_state": "IL",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Dunbar",
      "inventor_name_first": "Patrick Alan",
      "inventor_city": "Downers Grove",
      "inventor_state": "IL",
      "inventor_country": "US"
    }
  ],
  "ipcr_labels": [
    "G06Q1008",
    "G06K710",
    "G06K714"
  ],
  "main_ipcr_label": "G06Q1008",
  "summary": "<SOH> BRIEF SUMMARY OF THE PRESENT INVENTION <EOH>The present invention generally relates to a system and method for verifying a load. More specifically, the present invention relates to a system and method for verifying a load prior to any batch constituents being discharged into one or more trucks. Major plant operations related to these fields include weighing, metering and discharging of various raw materials and other constituents of varying proportions commonly known as mixes, in volumetric intervals onto specialized trucks for eventual delivery to an end user. A particular mix when weighed by targeted volume is commonly known as a batch or a load. Each truck receives its own batch or load and no individual batch or load may be shared between any trucks. The present invention is a system for verifying a load prior to any batch constituents being discharged into trucks that includes a plant having a fleet area and a loading area, one or more trucks, a discharge point, a output ID reader included in each of the one or more trucks, an output identifier, one or more output ID readers, a server system having one or more databases, a material load verification non-transitory storage media that resides on the one or more databases and a load matrix interface. It is an object of the present invention to provide a system and method for verifying that a load to be discharged into a truck at a plant includes verification and assurance that the correct truck will be loaded with the correct batch at the discharge point of a plant before, during or after the discharge sequence being initiated but prior to any batch constituents being discharged into the trucks on an ongoing load to load basis. It is also an object of the present invention to provide a system and method for verifying that a load to be discharged into a truck at a plant includes a computer readable truck output ID, a non-transitory storage media and one or more computer databases to provide verification and a...",
  "patent_number": "None",
  "abstract": "A system for verifying a load placed in one or more trucks that include a plant, a mixer, a discharge point, the one or more trucks, an output ID, an output ID reader and a material load verification non-transitory storage media. The system may also include a third-party cloud platform or an output ID reader that display data from the output ID reader that may be read, relayed and utilized for a configuration decision that would be made by a plant manager on comparing a truck file database with the load matrix interface.",
  "publication_number": "US20170076250A1-20170316",
  "_processing_info": {
    "original_size": 42120,
    "optimized_size": 3274,
    "reduction_percent": 92.23
  }
}