{
  "decision": "ACCEPTED",
  "application_number": "15262284",
  "date_published": "20170112",
  "date_produced": "20161228",
  "title": "TEXT TRANSCRIPT GENERATION FROM A COMMUNICATION SESSION",
  "filing_date": "20160912",
  "inventor_list": [
    {
      "inventor_name_last": "GAUCI",
      "inventor_name_first": "Jason John",
      "inventor_city": "Mountain View",
      "inventor_state": "CA",
      "inventor_country": "US"
    }
  ],
  "ipcr_labels": [
    "G10L1508",
    "G06F1722",
    "G06Q3002",
    "G06F1724"
  ],
  "main_ipcr_label": "G10L1508",
  "summary": "<SOH> SUMMARY <EOH>In one example, the disclosure is directed to a method for transcribing speech from a real-time communication session, the method including receiving, by one or more processors, a combined media stream comprising a plurality of media sub-streams each associated with one of a plurality of end user devices, wherein each of the plurality of media sub-streams comprises a respective video component and a respective audio component, separating, by the one or more processors, each of the media sub-streams from the combined media stream, for each of the media sub-streams, separating, by the one or more processors, the respective audio component from the respective video component, for each audio component of the respective media sub-streams, transcribing, by the one or more processors, speech from the audio component to text for the respective media sub-stream, and for each of the media sub-streams, associating, by the one or more processors, one or more time tags with respective portions of the text, wherein each of the one or more time tags indicate when respective portions of the text occurred within the real-time communication session. The method may also include combining, by the one or more processors, the text for each of the respective media sub-streams into a combined transcription based on the time tags associated with each respective portion of the text, wherein the respective portions of the text are arranged substantially chronologically within the combined transcription according to the time tags. In another example, the disclosure is directed to a method that includes receiving, by one or more processors, a combined media stream comprising a plurality of media sub-streams each associated with one of a plurality of end user devices, wherein each of the plurality of media sub-streams comprises a respective video component and a respective audio component, for each of the media-sub-streams, separating, by the one or more processors, the respec...",
  "patent_number": "10019989",
  "abstract": "Techniques, systems, and devices for managing streaming media among end user devices in a video conferencing system are described. For example, a transcript may be automatically generated for a video conference. In one example, a method may include receiving a combined media stream comprising a plurality of media sub-streams each associated with one of a plurality of end user devices, wherein each of the plurality of media sub-streams comprises a respective video component and a respective audio component. The method may also include, for each of the media-sub-streams, separating the audio component from the respective video component, for each audio component of the respective media sub-streams, transcribing speech from the audio component to text for the respective media sub-stream, and combining the text for each of the respective media sub-streams into a combined transcription. In some examples, the combined transcription may also be translated into a user selected language.",
  "publication_number": "US20170011740A1-20170112",
  "_processing_info": {
    "original_size": 75160,
    "optimized_size": 3587,
    "reduction_percent": 95.23
  }
}