{
  "decision": "PENDING",
  "application_number": "15264079",
  "date_published": "20180315",
  "date_produced": "20180228",
  "title": "VISUAL FEEDBACK FOR BROKEN TEXT SELECTION",
  "filing_date": "20160913",
  "inventor_list": [
    {
      "inventor_name_last": "Dhawan",
      "inventor_name_first": "Harish",
      "inventor_city": "Hyderabad",
      "inventor_state": "",
      "inventor_country": "IN"
    },
    {
      "inventor_name_last": "Dhaundiyal",
      "inventor_name_first": "Rahul",
      "inventor_city": "Hyderabad",
      "inventor_state": "",
      "inventor_country": "IN"
    },
    {
      "inventor_name_last": "Kumar",
      "inventor_name_first": "Jitendra",
      "inventor_city": "Hyderabad",
      "inventor_state": "",
      "inventor_country": "IN"
    }
  ],
  "ipcr_labels": [
    "G06F1721",
    "G06F1727",
    "G06F954"
  ],
  "main_ipcr_label": "G06F1721",
  "summary": "<SOH> SUMMARY <EOH>This summary is provided to introduce a selection of concepts in a simplified form that are further described below in the Detailed Description. This summary is not intended to exclusively identify key features or essential features of the claimed subject matter, nor is it intended as an aid in determining the scope of the claimed subject matter. Embodiments are directed to provision of visual feedback for a broken text selection. Bi-directional text may be detected within a document, where the bi-directional text includes right-to-left text and left-to-right text that meet at a boundary. In response to a selection within the document that spans the boundary such that the selection includes a portion of the right-to-left text and a portion of the left-to-right text, the selection may be determined to be logically broken. An amount of additional text to be selected within the document in order to make the selection logically continuous may be determined, and a visual indicator may be provided to identify the additional text to be selected within the document in order to make the selection logically continuous based on the determination. These and other features and advantages will be apparent from a reading of the following detailed description and a review of the associated drawings. It is to be understood that both the foregoing general description and the following detailed description are explanatory and do not restrict aspects as claimed.",
  "patent_number": "None",
  "abstract": "Bi-directional text contains text in both directionalities, right to-left and left-to-right. When a document includes bi-directional text a user selection of the text may visually appear continuous, but it may be logically broken. Embodiments are directed to provision of visual feedback for such a broken text selection. For example, bi-directional text may be detected within a document, where the bi-directional text includes right-to-left text and left-to-right text that meet at a boundary. In response to a selection within the document that spans the boundary such that the selection includes a portion of the right-to-left text and a portion of the left-to-right text, the selection may be determined to be logically broken. An amount of additional text to be selected within the document in order to make the selection logically continuous may be determined, and a visual indicator may be provided to identify the additional text to be selected.",
  "publication_number": "US20180074998A1-20180315",
  "_processing_info": {
    "original_size": 69112,
    "optimized_size": 3283,
    "reduction_percent": 95.25
  }
}