{
  "date_produced": "20161220",
  "publication_number": "US20170004407A1-20170105",
  "main_ipcr_label": "G06N504",
  "decision": "PENDING",
  "application_number": "15265551",
  "inventor_list": [
    {
      "inventor_name_last": "Benson",
      "inventor_name_first": "Greg",
      "inventor_city": "Rancho Santa Fe",
      "inventor_state": "CA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Fistonich",
      "inventor_name_first": "Matthew Anthony",
      "inventor_city": "San Diego",
      "inventor_state": "CA",
      "inventor_country": "US"
    }
  ],
  "abstract": "Methods and apparatus for providing a comprehensive decision support system to include predictions, recommendations with consequences and optimal follow-up actions in specific situations are described. Data is obtained from multiple disparate data sources, depending on the information deemed necessary for the situation being modeled. The decision support system provides a prediction or predictions and a recommendation or a choice of recommendations based on the correlative analysis and/or other analyses. Also described are methods and apparatus for developing application specific decision support models. The decision support model development process may include identifying multiple disparate data sources for retrieval of related information, selection of classification variables to be retrieved from the data sources, assignment of weights to each classification variable, selecting and/or defining rules, and selecting and/or defining analysis functions.",
  "filing_date": "20160914",
  "patent_number": "None",
  "summary": "<SOH> SUMMARY OF THE INVENTION <EOH>The system, method, and devices of the invention each have several aspects, no single one of which is solely responsible for its desirable attributes. Without limiting the scope of this invention, its more prominent features will now be discussed briefly. After considering this discussion, and particularly after reading the section entitled “Detailed Description of Certain Embodiments” one will understand how the features of this invention provide advantages over other error management solutions. One embodiment is a system comprising an electronic device configured to select a data set for an application area, to assign weighted scores to the data in the data set, to correlate the weighted data set with one or more previously correlated weighted data sets, and to determine, based upon the correlation, a recommended action as a response to an event related to the data set. One embodiment is a system comprising a sensor network, a database comprising data from the sensor network, and a electronic device configured to select a data set from the database for an application area, to assign weighted scores to the data in the data set, to correlate the weighted data set with one or more previously correlated weighted data sets, and to determine, based upon the correlation, a recommended action as a response to an event related to the data set. One embodiment is a system comprising an electronic device configured to select a data set for an application area, the electronic device further configured to analyze the data set according to fuzzy logic instructions so as to generate a recommended action and outcome information for the recommended action. One embodiment is a system comprising an electronic device configured to select a data set for an application area, the electronic device further configured to analyze the data set according to statistical analysis instructions so as to generate a recommended action and outcome information for ...",
  "date_published": "20170105",
  "title": "TRUSTED DECISION SUPPORT SYSTEM AND METHOD",
  "ipcr_labels": [
    "G06N504",
    "G06N700"
  ],
  "_processing_info": {
    "original_size": 99424,
    "optimized_size": 3682,
    "reduction_percent": 96.3
  }
}