{
  "decision": "PENDING",
  "application_number": "15264700",
  "date_published": "20180315",
  "date_produced": "20180228",
  "title": "SYSTEM AND METHOD FOR DYNAMIC ADJUSTMENT OF LOGGING",
  "filing_date": "20160914",
  "inventor_list": [
    {
      "inventor_name_last": "Avery",
      "inventor_name_first": "Kenytt D.",
      "inventor_city": "Newport Beach",
      "inventor_state": "CA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Bader",
      "inventor_name_first": "Edward L.",
      "inventor_city": "Los Angeles",
      "inventor_state": "CA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Costecalde",
      "inventor_name_first": "Jean-Marc",
      "inventor_city": "Irvine",
      "inventor_state": "CA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Gatewood",
      "inventor_name_first": "Patricia V.",
      "inventor_city": "Costa Mesa",
      "inventor_state": "CA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Trinh",
      "inventor_name_first": "Kevin N.",
      "inventor_city": "Garden Grove",
      "inventor_state": "CA",
      "inventor_country": "US"
    }
  ],
  "ipcr_labels": [
    "G06F1130",
    "G06F1134"
  ],
  "main_ipcr_label": "G06F1130",
  "summary": "<SOH> BRIEF SUMMARY OF DISCLOSURE <EOH>In one example implementation, a method, performed by one or more computing devices, may include but is not limited to identifying, by a computing device, a current amount of resources used by the computing device. A future amount of resources may be estimated for executing a trace for a subsystem of the computing device. One or more rules may be identified for executing the trace for the subsystem of the computing device, wherein the one or more rules may be based upon, at least in part, at least one of the current amount of resources used by the computing device and the future amount of resources for executing the trace for the subsystem of the computing device. It may be determined whether to execute the trace for the subsystem of the computing device based upon, at least in part, the one or more rules. One or more of the following example features may be included. It may be determined whether the current amount of resources used by the computing device combined with the future amount of resources for executing the trace for the subsystem of the computing device would exceed a threshold amount of resources used by the computing device. At least one rule of the one or more rules may include executing the trace for the subsystem of the computing device if the current amount of resources used by the computing device combined with the future amount of resources for executing the trace for the subsystem of the computing device would not exceed the threshold amount of resources used by the computing device. At least one rule of the one or more rules may include preventing execution of the trace for the subsystem of the computing device if the current amount of resources used by the computing device combined with the future amount of resources for executing the trace for the subsystem of the computing device would exceed the threshold amount of resources used by the computing device. The subsystem of the computing device may includ...",
  "patent_number": "None",
  "abstract": "A method, computer program product, and computer system for identifying a current amount of resources used by a computing device. A future amount of resources may be estimated for executing a trace for a subsystem of the computing device. One or more rules may be identified for executing the trace for the subsystem of the computing device, wherein the one or more rules may be based upon, at least in part, at least one of the current amount of resources used by the computing device and the future amount of resources for executing the trace for the subsystem of the computing device. It may be determined whether to execute the trace for the subsystem of the computing device based upon, at least in part, the one or more rules.",
  "publication_number": "US20180074930A1-20180315",
  "_processing_info": {
    "original_size": 78865,
    "optimized_size": 3900,
    "reduction_percent": 95.05
  }
}