{
  "decision": "PENDING",
  "application_number": "15265957",
  "date_published": "20171123",
  "date_produced": "20171108",
  "title": "METHOD AND SYSTEM FOR MANAGING CONSTRAINT-BASED VIOLATIONS IN A PRODUCT DATA MANAGEMENT ENVIRONMENT",
  "filing_date": "20160915",
  "inventor_list": [
    {
      "inventor_name_last": "Moeller",
      "inventor_name_first": "Thomas F.",
      "inventor_city": "Weilerswist",
      "inventor_state": "",
      "inventor_country": "DE"
    },
    {
      "inventor_name_last": "Akkarbote",
      "inventor_name_first": "Jinendra Bansilal",
      "inventor_city": "Pune",
      "inventor_state": "",
      "inventor_country": "IN"
    },
    {
      "inventor_name_last": "Singh",
      "inventor_name_first": "Santosh Kumar",
      "inventor_city": "Pune",
      "inventor_state": "",
      "inventor_country": "IN"
    }
  ],
  "ipcr_labels": [
    "G06Q3006"
  ],
  "main_ipcr_label": "G06Q3006",
  "summary": "<SOH> SUMMARY <EOH>A method and system for managing constraint-based violations in a Product Data Management (PDM) environment is disclosed. In one aspect, a method for managing constraint-based violations associated with a product in a PDM system includes obtaining a set of constraints defined for the product from a product database. The method also includes determining constraints from the set of constraints that are conflicting with requirement data associated with the product, and grouping the constraints into a plurality of logical groups. Each of the logical groups is associated with an independent violation. The method may also include outputting a multi-dimensional representation of violations on a graphical user interface of the PDM system. The method may also include computing one or more solutions corresponding to each independent violation based on the logical groups, and automatically resolving conflicts between the constraints and the requirement data corresponding to each independent violation based on the one or more solutions. In another aspect, a PDM system includes a processor, and an accessible memory coupled to the processor. The memory includes a PDM module configured for obtaining a set of constraints defined for a product, determining constraints from the set of constraints that are conflicting with requirement data associated with the product, and grouping the constraints into a plurality of logical groups. Each of the logical groups is associated with an independent violation. The PDM module may be configured for outputting a multi-dimensional representation of violations on a display unit. Additionally, the PDM module may be configured for computing one or more solutions corresponding to each independent violation based on the logical groups, and automatically resolving conflicts between the constraints and requirement data corresponding to each independent violation based on the one or more solutions. In yet another aspect, a non-transito...",
  "patent_number": "None",
  "abstract": "Managing of constraint-based violations in a Product Data Management (PDM) environment is provided. A method for managing constraint-based violations associated with a product in a PDM system includes obtaining a set of constraints defined for a product from a product database. Constraints that are conflicting with requirement data associated with the product are determined from the set of constraints, and the constraints are grouped into a plurality of logical groups. Each of the logical groups is associated with an independent violation. One or more solutions corresponding to each independent violation are computed based on the logical groups, and conflicts between the constraints and the requirement data corresponding to each independent violation based on the corresponding one or more solutions are resolved.",
  "publication_number": "US20170337603A1-20171123",
  "_processing_info": {
    "original_size": 68350,
    "optimized_size": 3717,
    "reduction_percent": 94.56
  }
}