{
  "decision": "PENDING",
  "application_number": "15261447",
  "date_published": "20180315",
  "date_produced": "20180228",
  "title": "Compensated Haptic Rendering for Flexible Electronic Devices",
  "filing_date": "20160909",
  "inventor_list": [
    {
      "inventor_name_last": "Levesque",
      "inventor_name_first": "Vincent",
      "inventor_city": "San Jose",
      "inventor_state": "CA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Modarres",
      "inventor_name_first": "Ali",
      "inventor_city": "San Jose",
      "inventor_state": "CA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Rihn",
      "inventor_name_first": "William S.",
      "inventor_city": "San Jose",
      "inventor_state": "CA",
      "inventor_country": "US"
    }
  ],
  "ipcr_labels": [
    "G06F301",
    "G06F3041"
  ],
  "main_ipcr_label": "G06F301",
  "summary": "<SOH> SUMMARY <EOH>This patent document relates to compensated haptic rendering for flexible electronic devices. In one aspect, this patent document is directed to a device comprising a housing, a sensor, a controller and an actuator. The sensor is configured to detect a contact force exerted on the housing. The controller is communicatively coupled to the sensor and is configured to determine a change in a haptic effect caused by the contact force. The controller is additionally configured to generate an output instruction to deliver the haptic effect in a compensated form that is operable to correct the change. The actuator is configured to receive the output instruction and deliver the compensated haptic effect at the housing. In another aspect, this patent document is directed to a device comprising a housing, a first sensor, a second sensor, a controller and an actuator. The first sensor is configured to detect a contact force exerted on the housing. The second sensor is configured to detect a deformation force created by deformation of the housing. The controller is communicatively coupled to the first and second sensors, and is configured to determine a change in a haptic effect caused by both the contact force and the deformation force. The controller is additionally configured to generate an output instruction to deliver the haptic effect in a compensated form that is operable to correct the change. The actuator is configured to receive the output instruction and deliver the compensated haptic effect at the housing. In still another aspect, this patent document is directed to a method for compensating haptic effects including: (a) detecting a contact force exerted on a housing; (b) determining a change in a haptic effect to be delivered at the housing caused by the contact force; (c) determining a compensation for the haptic effect, the compensation operable to correct the change; (d) applying the compensation to the haptic effect; and (e) delivering the co...",
  "patent_number": "None",
  "abstract": "A device comprises a housing, a sensor, a controller and an actuator. The sensor is configured to detect a contact force exerted on the housing. The controller is communicatively coupled to the sensor and is configured to determine a change in a haptic effect caused by the contact force. The controller is additionally configured to generate an output instruction to deliver the haptic effect in a compensated form that is operable to correct the change. The actuator is configured to receive the output instruction and deliver the compensated haptic effect at the housing.",
  "publication_number": "US20180074585A1-20180315",
  "_processing_info": {
    "original_size": 51326,
    "optimized_size": 3430,
    "reduction_percent": 93.32
  }
}