{
  "date_produced": "20180228",
  "publication_number": "US20180075354A1-20180315",
  "main_ipcr_label": "G06N502",
  "decision": "PENDING",
  "application_number": "15265214",
  "inventor_list": [
    {
      "inventor_name_last": "Averboch",
      "inventor_name_first": "Guillermo",
      "inventor_city": "New York",
      "inventor_state": "NY",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Caskey",
      "inventor_name_first": "Sasha",
      "inventor_city": "New York",
      "inventor_state": "NY",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Ma",
      "inventor_name_first": "Yi",
      "inventor_city": "New York",
      "inventor_state": "NY",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Pammi",
      "inventor_name_first": "Sathish",
      "inventor_city": "East Newark",
      "inventor_state": "NJ",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Stewart",
      "inventor_name_first": "Robert",
      "inventor_city": "Huntington",
      "inventor_state": "NY",
      "inventor_country": "US"
    }
  ],
  "abstract": "A method for model management includes receiving data on which to base a model, evaluating the received data against a plurality of existing models and data associated with each of the plurality of existing models, determining whether any of the plurality of existing models can be used as the model or as a basis to develop the model for the received data, and providing a user with the existing models that can be used as the model or as a basis to develop the model for the received data.",
  "filing_date": "20160914",
  "patent_number": "None",
  "summary": "<SOH> SUMMARY <EOH>According to an exemplary embodiment of the present invention, a method for model management comprises receiving data on which to base a model, evaluating the received data against a plurality of existing models and data associated with each of the plurality of existing models, determining whether any of the plurality of existing models can be used as the model or as a basis to develop the model for the received data, and providing a user with the existing models that can be used as the model or as a basis to develop the model for the received data. According to an exemplary embodiment of the present invention, a system for model management comprises one or more processing devices operatively connected via a communications network, an input/output module, implemented by the one or more processing devices, wherein the input/output module is configured to receive data on which to base a model, and a model controller, implemented by the one or more processing devices and operatively connected to the input/output module. The model controller is configured to receive the data on which to base the model from the input/output module, evaluate the received data against a plurality of existing models and data associated with each of the plurality of existing models, and determine whether any of the plurality of existing models can be used as the model or as a basis to develop the model for the received data. The plurality of existing models and data associated with each of the plurality of existing models are stored in a database operatively connected to and accessible by the model controller. The model controller is further configured to provide a user, via the input/output module, with the existing models that can be used as the model or as a basis to develop the model for the received data. According to an exemplary embodiment of the present invention, an article of manufacture comprises a processor-readable storage medium having encoded therein executa...",
  "date_published": "20180315",
  "title": "METHOD AND SYSTEM FOR USING EXISTING MODELS IN CONNECTION WITH NEW MODEL DEVELOPMENT",
  "ipcr_labels": [
    "G06N502",
    "G06N700",
    "G06N9900"
  ],
  "_processing_info": {
    "original_size": 60388,
    "optimized_size": 3672,
    "reduction_percent": 93.92
  }
}