{
  "date_produced": "20161214",
  "publication_number": "US20160379140A1-20161229",
  "main_ipcr_label": "G06N9900",
  "decision": "REJECTED",
  "application_number": "15261390",
  "inventor_list": [
    {
      "inventor_name_last": "ABU-MOSTAFA",
      "inventor_name_first": "YASER SAID",
      "inventor_city": "PASADENA",
      "inventor_state": "CA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "GONZALEZ",
      "inventor_name_first": "CARLOS ROBERTO",
      "inventor_city": "PASADENA",
      "inventor_state": "CA",
      "inventor_country": "US"
    }
  ],
  "abstract": "Technologies are generally described for methods and systems effective to determine a weight benefit associated with application of weights to training data in a machine learning environment. In an example, a device may determine a first function based on the training data, where the training data includes training inputs and training labels. The device may determine a second function based on weighted training data, which is based on application of weights to the training data. The device may determine a third function based on target data, where the target data is generated based on a target function. The target data may include target labels different from the training labels. The device may determine a fourth function based on weighted target data, which is a result of application of weights to the target data. The device may determine the weight benefit based on the first, second, third, and fourth functions.",
  "filing_date": "20160909",
  "patent_number": "None",
  "summary": "<SOH> SUMMARY <EOH>In some examples, methods to determine a weight benefit associated with training data in a machine learning environment are generally described. The methods may include determining, by a device, a first function based on the training data, wherein the training data may include training inputs and training labels. The methods may also include applying, by the device, a set of weights to the training data to generate weighted training data. The methods may also include determining, by the device, a second function based on the weighted training data. The methods may also include generating, by the device, target data based on a target function. The target data may include target labels different from the training labels. The methods may also include determining, by the device, a third function based on the target data. The methods may also include applying, by the device, the set of weights to the target data to generate weighted target data. The methods may also include determining, by the device, a fourth function based on weighted target data. The methods may also include determining, by the device, the weight benefit based on the first, second, third, and fourth functions. The weight benefit may be associated with a benefit to apply the set of weights to the training data. In some examples, systems effective to determine a weight benefit associated with training data in a machine learning environment are generally described. The systems may include a memory. The memory may be configured to store the training data. The training data may include training inputs and training labels. The memory may also be configured to store a set of weights. The systems may also include a target function generation module configured to be in communication with the memory. The target function generation module may be configured to generate target data based on a target function. The target data may include target labels different from the training labels. The targe...",
  "date_published": "20161229",
  "title": "WEIGHT BENEFIT EVALUATOR FOR TRAINING DATA",
  "ipcr_labels": [
    "G06N9900"
  ],
  "_processing_info": {
    "original_size": 74433,
    "optimized_size": 3625,
    "reduction_percent": 95.13
  }
}