{
  "decision": "PENDING",
  "application_number": "15260893",
  "date_published": "20180315",
  "date_produced": "20180228",
  "title": "DEFINING VIRTUALIZED PAGE ATTRIBUTES BASED ON GUEST PAGE ATTRIBUTES",
  "filing_date": "20160909",
  "inventor_list": [
    {
      "inventor_name_last": "Neiger",
      "inventor_name_first": "Gilbert",
      "inventor_city": "Hillsboro",
      "inventor_state": "OR",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Patel",
      "inventor_name_first": "Baiju V.",
      "inventor_city": "Portland",
      "inventor_state": "OR",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Hildesheim",
      "inventor_name_first": "Gur",
      "inventor_city": "Haifa",
      "inventor_state": "",
      "inventor_country": "IL"
    },
    {
      "inventor_name_last": "Rais",
      "inventor_name_first": "Ron",
      "inventor_city": "Hadera",
      "inventor_state": "",
      "inventor_country": "IL"
    },
    {
      "inventor_name_last": "Anderson",
      "inventor_name_first": "Andrew V.",
      "inventor_city": "Forest Grove",
      "inventor_state": "OR",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Brandt",
      "inventor_name_first": "Jason W.",
      "inventor_city": "Austin",
      "inventor_state": "TX",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Durham",
      "inventor_name_first": "David M.",
      "inventor_city": "Beaverton",
      "inventor_state": "OR",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Huntley",
      "inventor_name_first": "Barry E.",
      "inventor_city": "Hillsboro",
      "inventor_state": "OR",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Sade",
      "inventor_name_first": "Raanan",
      "inventor_city": "Ha",
      "inventor_state": "",
      "inventor_country": "IL"
    },
    {
      "inventor_name_last": "Sahita",
      "inventor_name_first": "Ravi L.",
      "inventor_city": "Beaverton",
      "inventor_state": "OR",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Shanbhogue",
      "inventor_name_first": "Vedvyas",
      "inventor_city": "Austin",
      "inventor_state": "TX",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Thiyagarajah",
      "inventor_name_first": "Arumugam",
      "inventor_city": "Folsom",
      "inventor_state": "CA",
      "inventor_country": "US"
    }
  ],
  "ipcr_labels": [
    "G06F121009",
    "G06F1214",
    "G06F9455"
  ],
  "main_ipcr_label": "G06F121009",
  "summary": "<SOH> BRIEF DESCRIPTION OF THE DRAWINGS <EOH>The disclosure will be understood more fully from the detailed description given below and from the accompanying drawings of various embodiments of the disclosure. The drawings, however, should not be taken to limit the disclosure to the specific embodiments, but are for explanation and understanding only. FIG. 1 illustrates a processing system to protect the memory according an embodiment of the present disclosure. FIG. 2 illustrates a flowchart to show the process of memory address translation according to an embodiment of the present disclosure. FIG. 3 illustrates an extended page table according to an embodiment of the present disclosure. FIG. 4 is a block diagram of a method to perform memory address mapping according to an embodiment of the present disclosure. FIG. 5A is a block diagram illustrating a micro-architecture for a processor including heterogeneous core in which one embodiment of the disclosure may be used. FIG. 5B is a block diagram illustrating an in-order pipeline and a register renaming stage, out-of-order issue/execution pipeline implemented according to at least one embodiment of the disclosure. FIG. 6 illustrates a block diagram of the micro-architecture for a processor that includes logic in accordance with one embodiment of the disclosure. FIG. 7 is a block diagram illustrating a system in which an embodiment of the disclosure may be used. FIG. 8 is a block diagram of a system in which an embodiment of the disclosure may operate. FIG. 9 is a block diagram of a system in which an embodiment of the disclosure may operate. FIG. 10 is a block diagram of a System-on-a-Chip (SoC) in accordance with an embodiment of the present disclosure FIG. 11 is a block diagram of an embodiment of an SoC design in accordance with the present disclosure. FIG. 12 illustrates a block diagram of one embodiment of a computer system. detailed-description description=\"Detailed Description\" end=\"lead\"?",
  "patent_number": "None",
  "abstract": "A processing system includes a processing core to execute a virtual machine (VM) comprising a guest operating system (OS) and a memory management unit, communicatively coupled to the processing core, comprising a storage device to store an extended page table entry (EPTE) comprising a mapping from a guest physical address (GPA) associated with the guest OS to an identifier of a memory frame, a first plurality of access right flags associated with accessing the memory frame in a first page mode referenced by an attribute of a memory page identified by the GPA, and a second plurality of access right flags associated with accessing the memory frame in a second page mode referenced by the attribute of the memory page identified by the GPA.",
  "publication_number": "US20180074969A1-20180315",
  "_processing_info": {
    "original_size": 97633,
    "optimized_size": 4922,
    "reduction_percent": 94.96
  }
}