{
  "date_produced": "20170726",
  "publication_number": "US20170228648A1-20170810",
  "main_ipcr_label": "G06N502",
  "decision": "PENDING",
  "application_number": "15269469",
  "inventor_list": [
    {
      "inventor_name_last": "Ellis",
      "inventor_name_first": "Leonard H.",
      "inventor_city": "New York",
      "inventor_state": "NY",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Ellis",
      "inventor_name_first": "Andrew D.",
      "inventor_city": "West Orange",
      "inventor_state": "NJ",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Angantyr",
      "inventor_name_first": "Mans K.",
      "inventor_city": "Brooklyn",
      "inventor_state": "NY",
      "inventor_country": "US"
    }
  ],
  "abstract": "A prediction processing system, method, and method for doing business is disclosed. The prediction processing system can collect, process and publish event-outcome information. The prediction processing system can dynamically filter participants into groupings and iteratively optimize odds calculations over time. A proposal framework consisting of a various abstract proposal types can model and settle propositions. Game propositions can be automatically generated based on event categorization relationships. The prediction processing system can provide game players or others with access to collective intelligence, including prediction information and information derived from prediction information. The prediction processing system can create groupings of better-performing predictors and provide them with additional information not generally available. Better-performing predictors can be provided with additional stakes to increase the weight of their predictions in odds calculations. The...",
  "filing_date": "20160919",
  "patent_number": "None",
  "summary": "<SOH> BRIEF SUMMARY OF SOME ASPECTS OF THE DISCLOSURE <EOH>The applicants believe that they have discovered at least one or more of the problems and issues with prior art systems noted above as well as one or more advantages provided by differing embodiments of the system disclosed in this specification. Briefly and in general terms, the present invention provides for novel prediction gathering, publishing and/or processing systems, methods of use of such systems, and methods of doing business with such systems. In some embodiments, the system is implemented as a game where at least some of the game players provide predictions about future events. The system can collect, process, and/or publish prediction data, and/or derivation data based on predictions made by participants; and in some embodiments participants can receive certain rewards based on their performance or for other reasons, such as non-performance-based awards to incentivize participation for example. In certain embodiments, an automated prediction gathering, publishing and/or processing system allows third parties to create their own prediction games. Access to these third party games can be limited to a subset of users, players and/or observers. In certain of these embodiments, these private games can be used to generate odds based solely on the players participating in the private game. In some applications, private and public games that share races, runners and proposition in common can be rolled up into a general odds statistic. Some systems can provide an easy mechanism for creating and joining private games can promote membership generally and increase motivation to participate based on visibility within a familiar group of participants. In some applications, a fee can be assessed for the privilege to exclude private game data from publication and/or global odds calculations. In some instances, various competitive formats are enabled, such as, for example, equalizing player resources and/or requ...",
  "date_published": "20170810",
  "title": "PREDICTION PROCESSING SYSTEM AND METHOD OF USE AND METHOD OF DOING BUSINESS",
  "ipcr_labels": [
    "G06N502",
    "G06N700"
  ],
  "_processing_info": {
    "original_size": 157282,
    "optimized_size": 3880,
    "reduction_percent": 97.53
  }
}