{
  "decision": "PENDING",
  "application_number": "15268236",
  "date_published": "20180322",
  "date_produced": "20180308",
  "title": "Portable Entertainment System",
  "filing_date": "20160916",
  "inventor_list": [
    {
      "inventor_name_last": "Maldonado",
      "inventor_name_first": "Franklin",
      "inventor_city": "Fiskdale",
      "inventor_state": "MA",
      "inventor_country": "US"
    }
  ],
  "ipcr_labels": [
    "A63F1324",
    "G06F116",
    "A63F1392",
    "A63F13235",
    "A63F1325"
  ],
  "main_ipcr_label": "A63F1324",
  "summary": "<SOH> BRIEF DESCRIPTION OF THE DRAWINGS <EOH>FIG. 1 is a perspective view showing a base unit of the present invention. FIG. 2 is a top plan view thereof. FIG. 3 is a bottom plan view thereof. FIG. 4 is a rear elevational view thereof, showing a charging port that receives a male connector and a lighting connection array around the base that illuminates the components of the present invention. FIG. 5 is a front elevational view thereof. FIG. 6 is a right-side elevational view thereof. FIG. 7 is a left-side elevational view thereof. FIG. 8 is a diagram showing electrical and electronic connections of the base unit. FIG. 9 is a perspective view showing a handheld controller of the present invention. FIG. 10 is a bottom rear perspective view thereof. FIG. 11 is a top plan view thereof. FIG. 12 is a front elevational view thereof. FIG. 13 is a magnified view showing a remote smart device docked with the handheld controller of the present invention. FIG. 14 is a magnified view showing a remote smart device receptacle of the handheld controller of the present invention. FIG. 15 is a diagram showing electrical and electronic connections of the handheld controller and the remote smart device of the present invention. FIG. 16 is a perspective view showing the remote smart device of the present invention. FIG. 17 is a front elevational view thereof. FIG. 18 is left-side elevational view thereof. FIG. 19 is a right side elevational view thereof. detailed-description description=\"Detailed Description\" end=\"lead\"?",
  "patent_number": "None",
  "abstract": "A portable entertainment system is created from a base unit, a handheld controller, and a remote computing device. The base unit includes a universal docking system to receive the remote computing device and a controller dock to receive the handheld controller. Several electronic systems allow for multimedia inputs and outputs to be obtained through the base unit. The base unit also acts as an access point, thanks to Ethernet and wireless capabilities. The handheld controller has several ergonomic improvements, including finger grooves along a bottom portion and elliptical shaped rests that are better adapted to the natural contours of a person's finger. Improved triggers are also provided; a reverse trigger system allows users to easily slide their fingers along a lower trigger to an adjacent upper trigger.",
  "publication_number": "US20180078852A1-20180322",
  "_processing_info": {
    "original_size": 42658,
    "optimized_size": 2918,
    "reduction_percent": 93.16
  }
}