{
  "date_produced": "20170316",
  "publication_number": "US20170091613A1-20170330",
  "main_ipcr_label": "G06N302",
  "decision": "PENDING",
  "application_number": "15260210",
  "inventor_list": [
    {
      "inventor_name_last": "ITO",
      "inventor_name_first": "Satoshi",
      "inventor_city": "Kawasaki Kanagawa",
      "inventor_state": "",
      "inventor_country": "JP"
    },
    {
      "inventor_name_last": "WATANABE",
      "inventor_name_first": "Tomoki",
      "inventor_city": "Inagi Tokyo",
      "inventor_state": "",
      "inventor_country": "JP"
    }
  ],
  "abstract": "According to an embodiment, a computational device includes a memory and a processor. The processor receives an input of tensor data. The processor locates a first area on the tensor data. The processor maps the coordinates within the first area on the tensor data and to acquire a second area including corresponding coordinates which the coordinates within the first area on the tensor data are mapped to. The processor calculates a higher-order statistic between the first area and the second area. The processor outputs the higher-order statistic.",
  "filing_date": "20160908",
  "patent_number": "None",
  "summary": "<SOH> BRIEF DESCRIPTION OF THE DRAWINGS <EOH>FIG. 1 is a flowchart illustrating an exemplary process performed in a neural network; FIG. 2 is a schematic for explaining an example of a function f i ( ); FIG. 3 is a schematic illustrating a configuration of a computational device according to an embodiment; FIG. 4 is a flowchart illustrating an exemplary process according to the embodiment; FIG. 5 is a schematic illustrating an example of a vehicle according to an application example; FIG. 6 is a schematic illustrating an exemplary configuration of the vehicle according to the application example; FIG. 7 is a schematic illustrating an example of a configuration of a recognizing unit according to the application example in detail; FIG. 8 is a schematic illustrating an example of an input image according to the application example; and FIG. 9 is a schematic illustrating an example of an output image according to the application example. detailed-description description=\"Detailed Description\" end=\"lead\"?",
  "date_published": "20170330",
  "title": "COMPUTATIONAL DEVICE, COMPUTATIONAL METHOD, AND COMPUTER PROGRAM PRODUCT",
  "ipcr_labels": [
    "G06N302",
    "G06N504"
  ],
  "_processing_info": {
    "original_size": 32348,
    "optimized_size": 2292,
    "reduction_percent": 92.91
  }
}