{
  "date_produced": "20170309",
  "publication_number": "US20170083818A1-20170323",
  "main_ipcr_label": "G06N504",
  "decision": "PENDING",
  "application_number": "15268026",
  "inventor_list": [
    {
      "inventor_name_last": "GOTO",
      "inventor_name_first": "Yoshiyuki",
      "inventor_city": "Tokyo",
      "inventor_state": "",
      "inventor_country": "JP"
    }
  ],
  "abstract": "An information processing apparatus for determining an appropriate processing parameter of a predetermined process and obtaining processing time of the predetermined process, in a shorter period of time is provided. A learning support apparatus 500 includes an input unit 540 and an identifying unit 550. The input unit 540 receives input of new learning data. The identifying unit 550 identifies and outputs at least one of a value of a processing parameter and a value of processing performance of a learning process for the new learning data using history of processing performance of the learning process performed for learning data.",
  "filing_date": "20160916",
  "patent_number": "None",
  "summary": "<SOH> SUMMARY <EOH>An object of the present invention is to provide an information processing apparatus, an information processing method, and a storage medium which can determine an appropriate processing parameter of a predetermined process and can obtain a processing time of the predetermined process, in a shorter period of time. An information processing apparatus according to an exemplary aspect of the invention includes: an input unit that receives input of first data; and an identifying unit that identifies and outputs at least one of a value of a processing parameter and a value of processing performance of a predetermined process for the first data using history of processing performance of the predetermined process performed for second data. An information processing method according to an exemplary aspect of the invention includes: receiving input of first data; and identifying and outputting at least one of a value of a processing parameter and a value of processing performance of a predetermined process for the first data using history of processing performance of the predetermined process performed for second data. An non-transitory computer readable storage medium according to an exemplary aspect of the invention records thereon a program, causing a computer to perform a method including: receiving input of first data; and identifying and outputting at least one of a value of a processing parameter and a value of processing performance of a predetermined process for the first data using history of processing performance of the predetermined process performed for second data.",
  "date_published": "20170323",
  "title": "INFORMATION PROCESSING APPARATUS, INFORMATION PROCESSING METHOD AND STORAGE MEDIUM",
  "ipcr_labels": [
    "G06N504",
    "G06N9900"
  ],
  "_processing_info": {
    "original_size": 53680,
    "optimized_size": 2828,
    "reduction_percent": 94.73
  }
}