{
  "decision": "PENDING",
  "application_number": "15260256",
  "date_published": "20170323",
  "date_produced": "20170309",
  "title": "System and Methods for Integration of an Application Runtime Environment Into a User Computing Environment",
  "filing_date": "20160908",
  "inventor_list": [
    {
      "inventor_name_last": "Meredith",
      "inventor_name_first": "Matt",
      "inventor_city": "Santa Monica",
      "inventor_state": "CA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Robinson",
      "inventor_name_first": "Aaron",
      "inventor_city": "San Diego",
      "inventor_state": "CA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Machado",
      "inventor_name_first": "Blake",
      "inventor_city": "San Diego",
      "inventor_state": "CA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Chavarria",
      "inventor_name_first": "Damien",
      "inventor_city": "Bedarieux",
      "inventor_state": "",
      "inventor_country": "FR"
    },
    {
      "inventor_name_last": "Bourke",
      "inventor_name_first": "Adrian",
      "inventor_city": "San Diego",
      "inventor_state": "CA",
      "inventor_country": "US"
    }
  ],
  "ipcr_labels": [
    "G06F9445",
    "H04L2908"
  ],
  "main_ipcr_label": "G06F9445",
  "summary": "<SOH> SUMMARY OF THE INVENTION <EOH>Users typically do not care about where data, content, and applications are resident. Instead, users are more concerned with completing specific tasks. Therefore, systems and methods in accordance with embodiments of the invention create an application runtime environment or application environment that can be downloaded and integrated into the computing environment of a computing device, where the application environment enables users to access, manage, and discover cross-platform applications that are integrated within the computing environment of the computing device, but execute within the application environment. In this way, the application environment provides a common development platform for developers similar to the manner in which browser applications and associated standard web technologies such as HTML5, JavaScript, and CSS provide a common platform for web applications. The application environment, however, enables the cross-platform applications to extend beyond a specific web browser application, enabling the cross-platform applications executing within the application environment to integrate into the computing environment of the device in a similar way to the manner in which natively implemented desktop applications can integrate with the computing environment provided by the device's operating system. In this way, an application environment in accordance with embodiments of the invention can simplify the development of cross-platform applications for deployment on multiple operating systems and computing devices in a way that also facilitates user task completion within the user's computing environment. In addition to providing developers with a common development platform, the application environment provides users with a common platform to access, manage, and discover applications across a range of computing devices. Once installed, application environments in accordance with many embodiments of the invention ...",
  "patent_number": "None",
  "abstract": "Systems and methods for creating application runtime environments or application environments that can be downloaded and integrated into the computing environment of a computing device are disclosed. One embodiment of the invention includes a computing device on which an operating system is installed that creates a computing environment, an Application Platform application, where the Application Platform application is at least partially natively implemented and creates an application runtime environment when executed by the computing device, and a cross-platform application, where the cross-platform application is configured to be executed within the application runtime environment and is not natively executable by the computing device. In addition, the Application Platform application is configured to integrate the cross-platform application into the computing environment of the computing device by providing at least one launch point for the cross-platform application within the comp...",
  "publication_number": "US20170083303A1-20170323",
  "_processing_info": {
    "original_size": 135833,
    "optimized_size": 4205,
    "reduction_percent": 96.9
  }
}