{
  "date_produced": "20180228",
  "publication_number": "US20180075346A1-20180315",
  "main_ipcr_label": "G06N308",
  "decision": "PENDING",
  "application_number": "15264081",
  "inventor_list": [
    {
      "inventor_name_last": "Pantazi",
      "inventor_name_first": "Angeliki",
      "inventor_city": "Thalwill",
      "inventor_state": "",
      "inventor_country": "CH"
    },
    {
      "inventor_name_last": "Wozniak",
      "inventor_name_first": "Stanislaw Andrzej",
      "inventor_city": "Adliswill",
      "inventor_state": "",
      "inventor_country": "CH"
    }
  ],
  "abstract": "Embodiments relate to a neuromorphic architecture for unsupervised feature learning using memristive synapses realized using phase-change devices. A spiking neural network architecture for unsupervised pattern learning and a spike-based learning algorithm compatible with phase-change synapses is described, and a feature-learning algorithm capable of performing a sequence of set operations on input patterns is provided. A learning rule for the extraction of certain features of the input that is compatible with spiking neurons and synapses with spike-based plasticity is also provided. The system enables enhanced pattern- and feature-extraction capabilities in neuromorphic systems.",
  "filing_date": "20160913",
  "patent_number": "None",
  "summary": "<SOH> BRIEF SUMMARY <EOH>This summary is provided with the understanding that it will not be used to limit the scope or meaning of the claims. According to an embodiment, an apparatus for computation is provided comprising: a first neuronal module comprising a first plurality of neurons, wherein each neuron in the first plurality of neurons operates with a different learning mechanism selected from a first set of learning mechanisms; a second neuronal module comprising a second plurality of neurons, wherein each neuron in the second plurality of neurons operates with a different learning mechanism selected from a second set of learning mechanisms; and an arbitration mechanism operatively connected to the first neuronal module and the second neuronal module. According to another embodiment, a method is provided for pattern detection and feature learning, the method comprising: training a first neuronal module, wherein the first neuronal module comprises a first neuron having a first learning mechanism; training a second neuronal module, wherein the second neuronal module comprises a second neuron having a second learning mechanism; providing an arbitration mechanism connected to the first neuronal module and the second neuronal module; and applying an input to the first neuronal module and the second neuronal module. According to another embodiment, an apparatus for computation is provided, the apparatus comprising: a first neuronal module comprising a first level tuned neuron, wherein the first level tuned neuron has a first learning mechanism; a second neuronal module comprising a second level tuned neuron, wherein the second level tuned neuron has a second learning mechanism; and an arbitration mechanism operatively connected to the first neuronal module and the second neuronal module and comprising a third neuron that provides a level output that modifies the behavior of the first neuronal module and second neuronal module. These and other features, aspects, and ...",
  "date_published": "20180315",
  "title": "NEUROMORPHIC ARCHITECTURE FOR UNSUPERVISED PATTERN DETECTION AND FEATURE LEARNING",
  "ipcr_labels": [
    "G06N308",
    "G06N304"
  ],
  "_processing_info": {
    "original_size": 40956,
    "optimized_size": 3425,
    "reduction_percent": 91.64
  }
}