{
  "decision": "PENDING",
  "application_number": "15263246",
  "date_published": "20170316",
  "date_produced": "20170301",
  "title": "METHOD AND SYSTEM FOR MASKING OF CHEQUE IMAGE BASED ON USER ACCESS PRIVILEGES",
  "filing_date": "20160912",
  "inventor_list": [
    {
      "inventor_name_last": "Rai",
      "inventor_name_first": "Harikrishna Gandhinagara Narayana",
      "inventor_city": "Bangalore",
      "inventor_state": "",
      "inventor_country": "IN"
    },
    {
      "inventor_name_last": "Thangam",
      "inventor_name_first": "Sivaram Vargheese",
      "inventor_city": "Kappukadu",
      "inventor_state": "",
      "inventor_country": "IN"
    },
    {
      "inventor_name_last": "Deepak",
      "inventor_name_first": "Krishnamurthy Sai",
      "inventor_city": "Vinoba Nagar",
      "inventor_state": "",
      "inventor_country": "IN"
    },
    {
      "inventor_name_last": "Pisipati",
      "inventor_name_first": "Radha Krishna",
      "inventor_city": "Hyderabad",
      "inventor_state": "",
      "inventor_country": "IN"
    }
  ],
  "ipcr_labels": [
    "G06F2162",
    "G07D720",
    "G06Q2004"
  ],
  "main_ipcr_label": "G06F2162",
  "summary": "<SOH> SUMMARY <EOH>Disclosed are a method and system for masking of a cheque image based on user access privileges. In one aspect, a computer implemented method for masking of a cheque image based on one or more access privileges assigned to a user is disclosed. The method involves receiving at a cheque masking engine, a cheque image for masking. A cheque template from one or more cheque templates is selected based on a metadata associated with the cheque image. The one or more cheque templates may be stored in a non-transitory computer readable storage medium associated with the cheque masking engine over a computer network. One or more zones of sensitive information associated with the cheque image is identified based on the one or more access privileges assigned to the user and a comparison with the selected cheque template. One or more characters are extracted from the one or more zones of sensitive information, through a character recognition technique. The character recognition technique may be, but not limited to an optical character recognition and/or an intelligent character recognition. An OCR technique may be used for extracting typed text from an image. An ICR technique may be used for extracting hand-written or hand-printed text from an image. The extracted one or more characters from the one or more zones of sensitive information is aliased based on one or more aliasing rules. The one or more aliasing rules may be a modified bijective function. Another cheque image is generated by overlaying the one or more zones of sensitive information with the aliased one or more characters. In another aspect, a system for masking of a cheque image based on one or more access privileges assigned to a user is disclosed. The system comprises a receiver, a selection engine, an identifier, an extractor, an aliasing engine and an image generator. The receiver is configured to receive at a cheque masking engine, a cheque image. The selection engine is configured to select...",
  "patent_number": "None",
  "abstract": "A method and system masks sensitive fields on a cheque image based one or more access privileges assigned to a user. The method involves receiving a cheque image at a cheque masking engine. A cheque template from one or more cheque templates is selected based on metadata associated with the cheque image. One or more zones of sensitive information associated with the cheque image are identified based on the one or more access privileges assigned to the user and a comparison with the selected cheque template. One or more characters are extracted from the one or more zones of sensitive information. The extracted one or more characters are aliased based on an aliasing rule. Another cheque image is generated by overlaying the one or more zones of sensitive information with the aliased one or more characters.",
  "publication_number": "US20170076114A1-20170316",
  "_processing_info": {
    "original_size": 66993,
    "optimized_size": 3897,
    "reduction_percent": 94.18
  }
}