{
  "date_produced": "20180308",
  "publication_number": "US20180082184A1-20180322",
  "main_ipcr_label": "G06N502",
  "decision": "PENDING",
  "application_number": "15269551",
  "inventor_list": [
    {
      "inventor_name_last": "GUO",
      "inventor_name_first": "LIFAN",
      "inventor_city": "San Jose",
      "inventor_state": "CA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "WANG",
      "inventor_name_first": "HAOHONG",
      "inventor_city": "San Jose",
      "inventor_state": "CA",
      "inventor_country": "US"
    }
  ],
  "abstract": "A context-aware chatbot method and system are provided. The context-aware chatbot method comprises receiving a user's voice; converting the user's voice to a question to be answered; determining a question type of the question to be answered; generating at least one answer to the question based on a context-aware neural conversation model; validating the answer generated by the context-aware neural conversation model; and delivering the answer validated to the user. The context-aware neural conversation model takes contextual information of the question into consideration, and decomposes the contextual information of the question into a plurality of high dimension vectors.",
  "filing_date": "20160919",
  "patent_number": "None",
  "summary": "<SOH> BRIEF SUMMARY OF THE DISCLOSURE <EOH>One aspect of the present disclosure includes a context-aware chatbot method. The context-aware chatbot method comprises receiving a user's voice; converting the user's voice to a question to be answered; determining a question type of the question to be answered; generating at least one answer to the question based on a context-aware neural conversation model; validating the answer generated by the context-aware neural conversation model; and delivering the answer validated to the user. The context-aware neural conversation model takes contextual information of the question into consideration, and decomposes the contextual information of the question into a plurality of high dimension vectors. One aspect of the present disclosure includes a non-transitory computer-readable medium having computer program for, when being executed by a processor, performing a context-aware chatbot method based on multimodal deep neural network. The method comprises. The context-aware chatbot method comprises receiving a user's voice; converting the user's voice to a question to be answered; determining a question type of the question to be answered; generating at least one answer to the question based on a context-aware neural conversation model; validating the answer generated by the context-aware neural conversation model; and delivering the answer validated to the user. The context-aware neural conversation model takes contextual information of the question into consideration, and decomposes the contextual information of the question into a plurality of high dimension vectors. One aspect of the present disclosure includes a context-aware chatbot system. The context-aware chatbot system comprises a question acquisition module configured to receive a user's voice and convert the user's voice to a question to be answered; a question determination module configured to determine a question type of the question to be answered; a context-aware ne...",
  "date_published": "20180322",
  "title": "CONTEXT-AWARE CHATBOT SYSTEM AND METHOD",
  "ipcr_labels": [
    "G06N502",
    "G10L1526",
    "G06F1727",
    "G10L1522"
  ],
  "_processing_info": {
    "original_size": 47467,
    "optimized_size": 3385,
    "reduction_percent": 92.87
  }
}