{
  "decision": "PENDING",
  "application_number": "15261943",
  "date_published": "20180315",
  "date_produced": "20180228",
  "title": "PEER TO PEER DELIVERY OF GOODS WITHIN ONES GENERAL NEIGHBORHOOD OR EN ROUTE FROM A PLACE OF PURCHASE OR SITE OF DISTRIBUTION TO THEIR RESIDENCE OR PLACE OF WORK FOR A FEE",
  "filing_date": "20160910",
  "inventor_list": [
    {
      "inventor_name_last": "CHIVUKULA",
      "inventor_name_first": "RAMANA V.",
      "inventor_city": "MORRISVILLE",
      "inventor_state": "PA",
      "inventor_country": "US"
    }
  ],
  "ipcr_labels": [
    "G06Q1008",
    "H04L2908"
  ],
  "main_ipcr_label": "G06Q1008",
  "summary": "<SOH> BRIEF SUMMARY OF THE INVENTION <EOH>The foregoing descriptions outline some pertinent features and objects of the present invention. These may be illustrative of more exhaustive and comprehensive features described later in the application. The technical terms used in this documents, are meant with the same meaning as understood by a typical expert of the field which is related to the invention The present invention is a method or process embodying use of a software for P2P delivery of perishable and non-perishable goods within the general neighborhood of one's residence or work, or within 5-10 Mile deviation from the general route of the place of purchase (or distribution point) to one's place of residence or work for a fee. In the present embodiment, Customers of a business that want to double up as P2P Delivery Persons go through background check/s. Upon successful clearance through background checks, they are authorized as P2P Delivery Persons and an authorized server can be maintained by the business establishments with P2P Delivery Person Database. In another aspect of the invention, a P2P Delivery Person that is at a store with his/her credentials validated, can be offered a list of pending deliveries in his/her neighborhood or en route to his/her neighborhood by a store clerk or a kiosk and allow them to select the deliveries that they would like to make based on the P2P delivery rules set by a business. Upon confirmation of ‘delivery in good condition’ by P2P Delivery Person and the customer, a fee is paid to the P2P Delivery Person. The objective of the present invention is to provide the best methods and systems for delivery of perishable and non-perishable goods at lower costs. Goods are delivered within a short deviation from one's original route—5-10 miles, within general neighbourhood of one's residence or place of work and within 5-10-mile deviation of one's normal route to get from the place of purchase to place of residence or work. Businesse...",
  "patent_number": "None",
  "abstract": "The present invention relates to the Peer to peer network for delivery of goods by the customers of the business/establishment to other customers who are in their residential or work neighborhood. A database is maintained for the authorized P2P Delivery Persons. Whenever they plan or come to the establishment/point of purchase, a list of pending deliveries can be offered to them at checkout/through alerts and they may select the deliveries to be delivered. Once the product is delivered, a confirmation mail is sent back to the server and the P2P Delivery Person is paid a pre-determined fee.",
  "publication_number": "US20180075407A1-20180315",
  "_processing_info": {
    "original_size": 30965,
    "optimized_size": 3292,
    "reduction_percent": 89.37
  }
}