{
  "decision": "PENDING",
  "application_number": "15275384",
  "date_published": "20170330",
  "date_produced": "20170316",
  "title": "System And Method For Subtractive Augmented Reality And Display Contrast Enhancement",
  "filing_date": "20160924",
  "inventor_list": [
    {
      "inventor_name_last": "Hayes",
      "inventor_name_first": "Jack",
      "inventor_city": "Dublin",
      "inventor_state": "",
      "inventor_country": "IE"
    }
  ],
  "ipcr_labels": [
    "G02B2701",
    "G06T1900",
    "G09G510",
    "G06F301",
    "G06T500"
  ],
  "main_ipcr_label": "G02B2701",
  "summary": "<SOH> SUMMARY OF INVENTION <EOH>The present invention uses photochromic materials or similar derivative materials to create a subtractive display to both generally block out parts of the outside world and to create virtual shadows and other graphics. The present invention uses a spatial light modulator and its projected light to spatially modulate the photochromic or derivative material, with the aid of an optical system to direct the modulating light where necessary. Some embodiments of the present application are discussed below and address the above-identified issues. For example, one embodiment of the present disclosure is to create a display of dark pixels referred to herein as “subtractive augmented reality display” as it creates augmented reality content, particularly shadow effects and filtered color, by taking some light away whereas the standard idea of augmented reality is to create content by producing more light. The subtractive display may be achieved by addressing or modulating a material which can darken, lighten or change color directly or indirectly in response to a certain stimulating light. This can allow for the control of the material by a modified micro display system which may be the display of choice in the field of augmented reality while also getting rid of the need for many of the active display controls around the portion of the head-mounted augmented reality device which is see-through. In one embodiment, a subtractive augmented reality display system is provided. The subtractive augmented reality display system may include one or more light emitting displays, an optical system with which the user can view the ambient scene and the light emitted from the display(s) and a material in the way of the user's line of sight to the ambient scene which changes color, darkens or lightens based on interaction with light from the display system.",
  "patent_number": "None",
  "abstract": "A subtractive augmented reality display system may include one or more light emitting displays, an optical system with which the user can view the ambient scene and the light emitted from the display(s) and a material in the way of the user's line of sight to the ambient scene which changes color, darkens or lightens based on interaction with light from the display system.",
  "publication_number": "US20170090194A1-20170330",
  "_processing_info": {
    "original_size": 68573,
    "optimized_size": 2890,
    "reduction_percent": 95.79
  }
}