{
  "decision": "PENDING",
  "application_number": "15274307",
  "date_published": "20171214",
  "date_produced": "20171129",
  "title": "Device, Method, and Graphical User Interface for Managing Electronic Communications",
  "filing_date": "20160923",
  "inventor_list": [
    {
      "inventor_name_last": "Jon",
      "inventor_name_first": "Tiffany",
      "inventor_city": "Cupertino",
      "inventor_state": "CA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Lemay",
      "inventor_name_first": "Stephen Olivier",
      "inventor_city": "Palo Alto",
      "inventor_state": "CA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Coffman",
      "inventor_name_first": "Patrick Lee",
      "inventor_city": "San Francisco",
      "inventor_state": "CA",
      "inventor_country": "US"
    }
  ],
  "ipcr_labels": [
    "G06F30484",
    "G06F30481",
    "G06F30482"
  ],
  "main_ipcr_label": "G06F30484",
  "summary": "<SOH> SUMMARY <EOH>Accordingly, there is a need for electronic devices with faster, more efficient methods and interfaces for managing electronic communications. Such methods and interfaces optionally complement or replace conventional methods for managing electronic communications. Such methods and interfaces reduce the cognitive burden on a user and produce a more efficient human-machine interface. For battery-operated devices, such methods and interfaces conserve power and increase the time between battery charges. The above deficiencies and other problems associated with user interfaces for electronic devices with touch-sensitive surfaces are reduced or eliminated by the disclosed devices. In some embodiments, the device is a desktop computer. In some embodiments, the device is portable (e.g., a notebook computer, tablet computer, or handheld device). In some embodiments, the device has a touchpad. In some embodiments, the device has a touch-sensitive display (also known as a “touch screen” or “touch-screen display”). In some embodiments, the device has a graphical user interface (GUI), one or more processors, memory and one or more modules, programs or sets of instructions stored in the memory for performing multiple functions. In some embodiments, the user interacts with the GUI primarily through stylus and/or finger contacts and gestures on the touch-sensitive surface. In some embodiments, the functions optionally include image editing, drawing, presenting, word processing, website creating, disk authoring, spreadsheet making, game playing, telephoning, video conferencing, e-mailing, instant messaging, workout support, digital photographing, digital videoing, web browsing, digital music playing, and/or digital video playing. Executable instructions for performing these functions are, optionally, included in a non-transitory computer readable storage medium or other computer program product configured for execution by one or more processors. In accordance with...",
  "patent_number": "None",
  "abstract": "An electronic device: displays a plurality of representations of electronic communications associated with a first grouping and a filter affordance that corresponds to a set of filter criteria; and detects a selection input selecting the filter affordance. In response to detecting the selection input, and in accordance with a determination that the selection input corresponds to a first input type, the electronic device: ceases to display a first set of representations of electronic communications from the first grouping that do not match the set of one or more filter criteria; displays a second set of representations of electronic communications from the first grouping that match the set of one or more filter criteria; and displays an indication of the set of filter criteria that have been applied to the electronic communications associated with the first grouping.",
  "publication_number": "US20170357422A1-20171214",
  "_processing_info": {
    "original_size": 330936,
    "optimized_size": 3810,
    "reduction_percent": 98.85
  }
}