{
  "date_produced": "20180308",
  "publication_number": "US20180082188A1-20180322",
  "main_ipcr_label": "G06N502",
  "decision": "PENDING",
  "application_number": "15272288",
  "inventor_list": [
    {
      "inventor_name_last": "Larson",
      "inventor_name_first": "Bradley J.",
      "inventor_city": "San Francisco",
      "inventor_state": "CA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Xie",
      "inventor_name_first": "Linda",
      "inventor_city": "Pleasanton",
      "inventor_state": "CA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Jabaay",
      "inventor_name_first": "Paul",
      "inventor_city": "Grand Rapids",
      "inventor_state": "MI",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Kern",
      "inventor_name_first": "Jeffrey B.",
      "inventor_city": "San Francisco",
      "inventor_state": "CA",
      "inventor_country": "US"
    }
  ],
  "abstract": "A compliance determination and enforcement platform is described. A plurality of factors are stored in association with each of a plurality of accounts. A factor entering module enters factors from each user account into a compliance score model. The compliance score model determines a compliance score for each one of the accounts based on the respective factors associated with the respective account. A comparator compares the compliance score for each account with a compliance reference score to determine a subset of the accounts that fail compliance and a subset of the accounts that meet compliance. A flagging unit flags the user accounts that fail compliance to indicate non-compliant accounts. A corrective action system allows for determining, for each one of the accounts that is flagged as non-compliant, whether the account is bad or good, entering the determination into a feedback system and closing the account.",
  "filing_date": "20160921",
  "patent_number": "None",
  "summary": "<SOH> SUMMARY OF THE INVENTION <EOH>The invention provides a compliance determination and enforcement platform including a processor, a computer-readable medium connected to the processor and a set of computer readable code on the computer-readable medium. The set of computer readable code includes a data store, a plurality of user accounts stored in the data store, a transaction processor that is executable by the processor to process transactions for the respective user accounts, a compliance reference score stored in the data store, a plurality of factors stored in association with each account, a compliance score model, a factor entering module that is executable by the processor to enter at least one factor from each user account into a compliance score model, wherein the compliance score model is executable by the processor to determine a compliance score for each one of the accounts, wherein the respective compliance score for the respective account is based on the respective factor associated with the respective account, a comparator that is executable by the processor to compare the compliance score for each account with the compliance reference score to determine a subset of the accounts that fail compliance and a subset of the accounts that meet compliance, a flagging unit that is executable by the processor to flag the user accounts that fail compliance to indicate non-compliant accounts and a corrective action system that is executable by the processor to perform a corrective action only for the accounts that are flagged as non-compliant accounts. The compliance determination and enforcement platform may further include that at least one of the factors entered into the compliance score model is an age of a user of the respective account. The compliance determination and enforcement platform may further include that at least one of the factors entered into the compliance score model is a level of due diligence that has been performed on the respective ac...",
  "date_published": "20180322",
  "title": "SELF-LEARNING COMPLIANCE DETERMINATION AND ENFORCEMENT PLATFORM",
  "ipcr_labels": [
    "G06N502",
    "G06N9900"
  ],
  "_processing_info": {
    "original_size": 82754,
    "optimized_size": 3947,
    "reduction_percent": 95.23
  }
}