{
  "decision": "PENDING",
  "application_number": "15276506",
  "date_published": "20180329",
  "date_produced": "20180315",
  "title": "RENDERING AND INTERACTING WITH TRANSMEDIA CONTENT DATA",
  "filing_date": "20160926",
  "inventor_list": [
    {
      "inventor_name_last": "Laeuchli",
      "inventor_name_first": "Rebekkah",
      "inventor_city": "Burbank",
      "inventor_state": "CA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Grosse",
      "inventor_name_first": "Max",
      "inventor_city": "Burbank",
      "inventor_state": "CA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Cabral",
      "inventor_name_first": "Maria",
      "inventor_city": "Burbank",
      "inventor_state": "CA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Gross",
      "inventor_name_first": "Markus",
      "inventor_city": "Burbank",
      "inventor_state": "CA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Schriber",
      "inventor_name_first": "Sasha",
      "inventor_city": "Burbank",
      "inventor_state": "CA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Simo",
      "inventor_name_first": "Isa",
      "inventor_city": "Burbank",
      "inventor_state": "CA",
      "inventor_country": "US"
    }
  ],
  "ipcr_labels": [
    "G06F1730",
    "G06F30488",
    "G06F30485",
    "G06T120"
  ],
  "main_ipcr_label": "G06F1730",
  "summary": "<SOH> SUMMARY OF THE DISCLOSURE <EOH>In a first aspect of this disclosure, there is provided a computer-implemented method for rendering a representation of and interacting with transmedia content on an electronic device, the method comprising the following steps: receiving transmedia content data at the electronic device, the transmedia content data comprising: a plurality of transmedia content data items; linking data which define time-ordered content links between the plurality of transmedia content data items, the plurality of transmedia content data items being arranged into linked transmedia content subsets comprising different groups of the transmedia content data items and different content links therebetween; a visualisation model of the transmedia content data; and a hierarchical structure of the linked transmedia content subsets and clusters of linked transmedia content subsets; and rendering, at the electronic device, a first representation of the transmedia content data by processing the visualisation model of the transmedia content data and the hierarchical structure to map some or all of the transmedia content at a first level of the hierarchical structure onto the representation of the transmedia content. The aforementioned method permits the surfacing of transmedia content items in a structured and accessible way to one or more users. The electronic device may be implemented as user equipment, which may be a computing device, for example a client computing device, such as personal computer, laptop or a handheld computing device. For example, the handheld computing device may be a mobile phone or smartphone. The electronic device may include a user input interface configured to provide user input to the processing circuitry, such as for example the instructions to create a new time-ordered content link. This may be one or more of a keypad or touch-sensitive display. The electronic device may include a display (which may include the touch-sensitive di...",
  "patent_number": "None",
  "abstract": "A method is provided for rendering a representation of and interacting with transmedia content on an electronic device. Transmedia content data is received at the electronic device. The transmedia content data comprises: a plurality of transmedia content data items; linking data which define time-ordered content links between the plurality of transmedia content data items, whereby the plurality of transmedia content data items are arranged into linked transmedia content subsets comprising different groups of the transmedia content data items and different content links therebetween; a visualisation model of the transmedia content data; and a hierarchical structure of the linked transmedia content subsets and clusters of linked transmedia content subsets. A representation of the transmedia content data is rendered at the electronic device by processing the visualisation model of the transmedia content data and the hierarchical structure to map some or all of the transmedia content at a ...",
  "publication_number": "US20180089201A1-20180329",
  "_processing_info": {
    "original_size": 112673,
    "optimized_size": 4303,
    "reduction_percent": 96.18
  }
}