{
  "date_produced": "20180117",
  "publication_number": "US20180032884A1-20180201",
  "main_ipcr_label": "G06N504",
  "decision": "PENDING",
  "application_number": "15270925",
  "inventor_list": [
    {
      "inventor_name_last": "Murugeshan",
      "inventor_name_first": "Meenakshi Sundaram",
      "inventor_city": "Bangalore",
      "inventor_state": "",
      "inventor_country": "IN"
    },
    {
      "inventor_name_last": "Ramachandra",
      "inventor_name_first": "Manjunath",
      "inventor_city": "Bangalore",
      "inventor_state": "",
      "inventor_country": "IN"
    }
  ],
  "abstract": "Disclosed herein is method and system for dynamically generating adaptive responses to user interactions. A response generating system receives user interactions including user queries from the user. Generic characteristics and user specific features associated with the user are extracted by integrating the user interactions with pre-stored conversation history and data from data sources associated with the user. Further, domain specific keywords from the user interactions are extracted for identifying the domain associated with the user queries. Personality of the user is detected based on the generic characteristics and the user specific features. Finally, adaptive responses to the user queries are dynamically generated based on the personality of the user and the domain associated with the user queries. The method aims at enhancing overall user experience and satisfaction in the conversation along with minimizing the total time required for addressing the user queries.",
  "filing_date": "20160920",
  "patent_number": "None",
  "summary": "<SOH> SUMMARY <EOH>Disclosed herein is a method for dynamically generating adaptive response to user interactions. The method comprises receiving, by a response generating system, user interactions including one or more user queries. One or more generic characteristics associated with the user are also extracted from the user interactions. Further, one or more user specific features associated with the user are extracted by integrating the user interactions with a pre-stored conversation history of the user and data related to the user from one or more data sources. Furthermore, one or more domain specific keywords associated with the one or more user queries are extracted from the user interactions for identifying domain associated with the one or more user queries. Personality of the user is detected based on the one or more generic characteristics and the one or more user specific features. Upon detecting the personality of the user, one or more adaptive responses to the one or more user queries are generated dynamically based on the personality of the user and the domain associated with the one or more user queries. Further, the present disclosure discloses a response generating system for dynamically generating adaptive response to user interactions. The response generating system comprises a processor and a memory communicatively coupled to the processor. The memory stores processor-executable instructions, which, on execution, causes the processor to receive user interactions including one or more user queries. One or more generic characteristics associated with the user are also extracted from the user interactions. Further, one or more user specific features associated with the user are extracted by integrating the user interactions with a pre-stored conversation history of the user and data related to the user from one or more data sources. Furthermore, one or more domain specific keywords associated with the one or more user queries are extracted from the...",
  "date_published": "20180201",
  "title": "METHOD AND SYSTEM FOR DYNAMICALLY GENERATING ADAPTIVE RESPONSE TO USER INTERACTIONS",
  "ipcr_labels": [
    "G06N504"
  ],
  "_processing_info": {
    "original_size": 80864,
    "optimized_size": 3725,
    "reduction_percent": 95.39
  }
}