{
  "decision": "ACCEPTED",
  "application_number": "15276443",
  "date_published": "20170525",
  "date_produced": "20170510",
  "title": "METHOD AND SYSTEM FOR MANAGING INTERACTIVE COMMUNICATIONS CAMPAIGNS WITH TEXT MESSAGING",
  "filing_date": "20160926",
  "inventor_list": [
    {
      "inventor_name_last": "Segall",
      "inventor_name_first": "Timothy R.",
      "inventor_city": "Lexington",
      "inventor_state": "MA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Greenberg",
      "inventor_name_first": "Boris",
      "inventor_city": "Stoneham",
      "inventor_state": "MA",
      "inventor_country": "US"
    }
  ],
  "ipcr_labels": [
    "H04M351",
    "G06F1727",
    "H04M344",
    "H04L1258",
    "H04M342"
  ],
  "main_ipcr_label": "H04M351",
  "summary": "<SOH> BRIEF SUMMARY <EOH>A messaging platform includes a text messaging subsystem that includes a suite of enhancements that facilitate implementation of a multi-channel communications strategy with high level and fine-grained control over outbound message creation or inbound message handling. A text messaging campaign refers to a series of contacts (outbound and/or inbound) with respect to a contact list using one or more sub-campaigns that use a given script. A campaign typically has a preset configuration that applies to all of its sub-campaigns. A “sub-campaign” refers to one or more passes through a contact list using a script and that is constrained to a particular timeframe (or at a set of one or more such times). A “script” may have associated therewith various control functions for generating outbound messages, handling inbound messages, and the like. As one example, a script may be used to send a text message as a follow-up to a voice message, or vice versa, to provide a blended (or multi-channel) campaign. The script may be used to determine whether an outbound or inbound telephone number is associated with a wireless telephone number (such that text messaging may be enabled), to determine whether a given customer account in which the script is running is authorized to send text messages, and the like. The text messaging subsystem also provides support for event-based text messaging sub-campaigns, and it enables agents (associated with the system) to manage inbound messages more efficiently. The foregoing has outlined some of the more pertinent features of the subject matter. These features should be construed to be merely illustrative. Many other beneficial results can be attained by applying the disclosed subject matter in a different manner or by modifying the subject matter as will be described.",
  "patent_number": "9876908",
  "abstract": "A messaging platform includes a text messaging subsystem that includes a suite of enhancements that facilitate implementation of a multi-channel communications strategy with high level and fine-grained control over outbound message creation or inbound message handling.",
  "publication_number": "US20170149970A1-20170525",
  "_processing_info": {
    "original_size": 77950,
    "optimized_size": 2905,
    "reduction_percent": 96.27
  }
}