{
  "decision": "PENDING",
  "application_number": "15273641",
  "date_published": "20170112",
  "date_produced": "20161228",
  "title": "Sports Monitoring System for Headphones, Earbuds and/or Headsets",
  "filing_date": "20160922",
  "inventor_list": [
    {
      "inventor_name_last": "Prest",
      "inventor_name_first": "Christopher",
      "inventor_city": "San Francisco",
      "inventor_state": "CA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Hoellwarth",
      "inventor_name_first": "Quin C.",
      "inventor_city": "Kuna",
      "inventor_state": "ID",
      "inventor_country": "US"
    }
  ],
  "ipcr_labels": [
    "G06F316",
    "A61B501",
    "G06F1900",
    "A61B5024",
    "A61B500",
    "H04R110",
    "A61B511"
  ],
  "main_ipcr_label": "G06F316",
  "summary": "<SOH> SUMMARY OF THE INVENTION <EOH>The invention pertains to a monitoring system that can be placed proximate to the head or ear of a user. According to one embodiment, the monitoring system can be used with a hearing device, headphones, earbuds or headsets. The monitoring system can, for example, be used to monitor user activity, such as during exercise or sporting activities. The positioning of the monitoring system can also facilitate sensing of other user characteristics (e.g., biometric data), such as temperature, perspiration and heart rate. Advantageously, the invention can provide monitoring capabilities within a hearing device. Assuming the user is otherwise using the hearing device, such as to provide audio output by a portable media player, the user gains monitoring capabilities without requiring the user to wear or carry an additional article. In one embodiment, a monitoring system is integrated with headphones, earbuds or headsets. In another embodiment, the monitoring system can be coupled to headphones, earbuds or headsets. For example, when not integrated with the headphones, earbuds or headsets, the monitoring system can be coupled to the headphones, earbuds or headsets by a mechanical member. Also, the monitoring system can be attachable/detachable from the headphones, earbuds or headsets. In still another embodiment, the monitoring system can be provided within a housing attached to a cord utilized by the headphones, earbuds or headsets. In yet another embodiment, the monitoring system can be attached to a user's clothing. In these various embodiments, the headphones, earbuds or headsets can be wired or wireless. The monitoring system can also be used to control a device connected to the headphones, earbuds or headsets. The device being controlled can be a stationary device or mobile device. As examples, the device can pertain to a telephone, digital media player, etc. The invention may be implemented in numerous ways, including, but not limited ...",
  "patent_number": "None",
  "abstract": "A monitoring system that can be placed proximate to the head or ear of a user is disclosed. According to one embodiment, the monitoring system can be used with headphones, earbuds or headsets. The monitoring system can, for example, be used to monitor user activity, such as during exercise or sporting activities. The positioning of the monitoring system can also facilitate sensing of other user characteristics (e.g., biometric data), such as temperature, perspiration and heart rate. The monitoring system can also be used to control a an electronic device. In one embodiment, the monitoring system facilitates user control of the electronic device using head gestures.",
  "publication_number": "US20170010858A1-20170112",
  "_processing_info": {
    "original_size": 40247,
    "optimized_size": 3449,
    "reduction_percent": 91.43
  }
}