{
  "date_produced": "20170316",
  "publication_number": "US20170091636A1-20170330",
  "main_ipcr_label": "G06N504",
  "decision": "PENDING",
  "application_number": "15274675",
  "inventor_list": [
    {
      "inventor_name_last": "Polyakov",
      "inventor_name_first": "Valery",
      "inventor_city": "Brighton",
      "inventor_state": "MA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Brock",
      "inventor_name_first": "David",
      "inventor_city": "Natick",
      "inventor_state": "MA",
      "inventor_country": "US"
    }
  ],
  "abstract": "Workflow extraction systems, methods, and computer readable mediums are described herein. The system includes a client that executes an oilfield service application and a recording module that receives and records messages from the client. The messages include user actions performed in the oilfield service application and/or the client. The system further includes a recognition module that determines a pattern using the recorded messages and a workflow creation module that generates a package using a detected pattern.",
  "filing_date": "20160923",
  "patent_number": "None",
  "summary": "<SOH> SUMMARY <EOH>In general, in one aspect, one or more embodiments disclosed herein relate to a workflow extraction system. The system includes a client that executes an oilfield service application and a recording module that receives and records messages from the client. The messages include user actions performed in the oilfield service application and/or the client. The system further includes a recognition module that determines a pattern using the recorded messages and a workflow creation module that generates a package using the detected pattern. In another aspect, one or more embodiments disclosed herein relate to a workflow extraction method. The method includes receiving messages from a user. The messages include user actions performed in an oilfield service application and/or a client. The method further includes recording the messages and analyzing the recorded messages for a pattern. A package is generated using the detected pattern. The package causes an oilfield asset to perform actions that correspond to the detected pattern. In another aspect, one or more embodiments disclosed herein relate to a computer implemented method for automated workflow. The method includes receiving, from a client executing an oilfield service application, inputs from a user to initiate an oilfield operation. The method also includes recording messages that include interactions between the user and the oilfield service application and determining, by a processor, that the interactions correspond to an oilfield operation pattern. The method further includes receiving confirmation, from the client, that the interactions correspond to the oilfield operation pattern and storing the oilfield operation pattern in a memory for use in a subsequent oilfield operation. In yet another aspect, one or more embodiments disclosed herein relate to a computer implemented method for automated workflow. The method includes receiving, from a client executing an oilfield service application...",
  "date_published": "20170330",
  "title": "METHOD FOR AUTOMATED WORKFLOW AND BEST PRACTICES EXTRACTION FROM CAPTURED USER INTERACTIONS FOR OILFIELD APPLICATIONS",
  "ipcr_labels": [
    "G06N504",
    "E21B4100"
  ],
  "_processing_info": {
    "original_size": 54739,
    "optimized_size": 3284,
    "reduction_percent": 94.0
  }
}