{
  "date_produced": "20180315",
  "publication_number": "US20180089578A1-20180329",
  "main_ipcr_label": "G06N9900",
  "decision": "PENDING",
  "application_number": "15276587",
  "inventor_list": [
    {
      "inventor_name_last": "Yadav",
      "inventor_name_first": "Ashish Kumar",
      "inventor_city": "Mountain View",
      "inventor_state": "CA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Dinu",
      "inventor_name_first": "Daniel",
      "inventor_city": "Sunnyvale",
      "inventor_state": "CA",
      "inventor_country": "US"
    }
  ],
  "abstract": "Systems, methods, and non-transitory computer-readable media can train a machine learning model to classify at least one user account as either a first type of account or a second type of account based at least in part on one or more respective features corresponding to the user account and determine that a first user account that was created as the first type of account should be converted to the second type of account based at least in part on the machine learning model.",
  "filing_date": "20160926",
  "patent_number": "None",
  "summary": "<SOH> SUMMARY <EOH>Various embodiments of the present disclosure can include systems, methods, and non-transitory computer readable media configured to train a machine learning model to classify at least one user account as either a first type of account or a second type of account based at least in part on one or more respective features corresponding to the user account and determine that a first user account that was created as the first type of account should be converted to the second type of account based at least in part on the machine learning model. In an embodiment, the first type of account corresponds to a social profile in a social networking system, and wherein the second type of account corresponds to a social page in the social networking system. In an embodiment, the systems, methods, and non-transitory computer readable media are configured to provide at least one notification instructing a user associated with the first user account to convert the first user account to the second type of account. In an embodiment, the systems, methods, and non-transitory computer readable media are configured to generate a set of training examples that each include a set of features that describe social profiles of a plurality of users. In an embodiment, the set of features include a count of the user's social connections that are also social connections of one another in a social networking system. In an embodiment, the set of features include a count of tokens determined from information associated with the user that match one or more predefined tokens, the predefined tokens referencing terms that are associated with the second type of account. In an embodiment, the set of features include information indicating a relationship status of the user as specified in a social networking system. In an embodiment, the set of features include a count of the user's social connections that are family members in a social networking system. In an embodiment, the set of featu...",
  "date_published": "20180329",
  "title": "SYSTEMS AND METHODS FOR TRANSITIONING USER ACCOUNTS",
  "ipcr_labels": [
    "G06N9900",
    "H04L2908"
  ],
  "_processing_info": {
    "original_size": 83288,
    "optimized_size": 3185,
    "reduction_percent": 96.18
  }
}