{
  "date_produced": "20180308",
  "publication_number": "US20180082199A1-20180322",
  "main_ipcr_label": "G06N504",
  "decision": "PENDING",
  "application_number": "15271296",
  "inventor_list": [
    {
      "inventor_name_last": "Liu",
      "inventor_name_first": "Liang",
      "inventor_city": "Beijing",
      "inventor_state": "",
      "inventor_country": "CN"
    },
    {
      "inventor_name_last": "Qu",
      "inventor_name_first": "Junmei",
      "inventor_city": "Beijing",
      "inventor_state": "",
      "inventor_country": "CN"
    },
    {
      "inventor_name_last": "Yin",
      "inventor_name_first": "Wen Jun",
      "inventor_city": "Beijing",
      "inventor_state": "",
      "inventor_country": "CN"
    },
    {
      "inventor_name_last": "Sha",
      "inventor_name_first": "Hong Zhou",
      "inventor_city": "Beijing",
      "inventor_state": "",
      "inventor_country": "CN"
    },
    {
      "inventor_name_last": "Zhuang",
      "inventor_name_first": "Wei",
      "inventor_city": "Beijing",
      "inventor_state": "",
      "inventor_country": "CN"
    }
  ],
  "abstract": "A method, system, and computer program product, include identifying a plurality of pollution process sets and determining pollution sources based on pollution start times of target pollution processes with matched features in the plurality of pollution process sets within a time window.",
  "filing_date": "20160921",
  "patent_number": "None",
  "summary": "<SOH> SUMMARY <EOH>In an exemplary embodiment, the present invention can provide a computer-implemented method including identifying a plurality of pollution process sets and determining pollution sources based on pollution start times of target pollution processes with matched features in the plurality of pollution process sets within a time window. One or more other exemplary embodiments include a computer program product and a system. Other details and embodiments of the invention will be described below, so that the present contribution to the art can be better appreciated. Nonetheless, the invention is not limited in its application to such details, phraseology, terminology, illustrations and/or arrangements set forth in the description or shown in the drawings. Rather, the invention is capable of embodiments in addition to those described and of being practiced and carried out in various ways and should not be regarded as limiting. As such, those skilled in the art will appreciate that the conception upon which this disclosure is based may readily be utilized as a basis for the designing of other structures, methods and systems for carrying out the several purposes of the present invention. It is important, therefore, that the claims be regarded as including such equivalent constructions insofar as they do not depart from the spirit and scope of the present invention.",
  "date_published": "20180322",
  "title": "SYSTEM, METHOD AND COMPUTER PROGRAM PRODUCT FOR POLLUTION SOURCE ATTRIBUTION",
  "ipcr_labels": [
    "G06N504",
    "G06F1711"
  ],
  "_processing_info": {
    "original_size": 71816,
    "optimized_size": 2812,
    "reduction_percent": 96.08
  }
}