{
  "date_produced": "20180308",
  "publication_number": "US20180082202A1-20180322",
  "main_ipcr_label": "G06N700",
  "decision": "PENDING",
  "application_number": "15271050",
  "inventor_list": [
    {
      "inventor_name_last": "Vepakomma",
      "inventor_name_first": "Praneeth",
      "inventor_city": "Atlanta",
      "inventor_state": "GA",
      "inventor_country": "US"
    }
  ],
  "abstract": "A device and method for generating a crime type combination based on historical incident data. The device includes a memory and an electronic processor. The memory includes historical incident data, which includes a plurality of incidents, each having a crime type. The electronic processor is configured to obtain a sample set of incidents from the historical incident data for each crime type of a plurality of unique crime type combinations. The electronic processor is configured to for each crime type combination, compute a distance correlation between the sample sets of incidents of crime types forming the crime type combination. The electronic processor is configured to select a crime type combination from the plurality of crime type combinations based on the distance correlations of the plurality of crime type combinations, and generate a crime prediction geographic area for the selected crime type combination.",
  "filing_date": "20160920",
  "patent_number": "None",
  "summary": "<SOH> BRIEF DESCRIPTION OF THE SEVERAL VIEWS OF THE DRAWINGS <EOH>The accompanying figures, where like reference numerals refer to identical or functionally similar elements throughout the separate views, together with the detailed description below, are incorporated in and form part of the specification, and serve to further illustrate embodiments of concepts that include the claimed invention, and explain various principles and advantages of those embodiments. FIG. 1 is a block diagram of crime prediction system, in accordance with some embodiments. FIG. 2 is a block diagram of a crime type combination prediction device, in accordance with some embodiments. FIG. 3 is a flowchart of a method for incident location prediction based on historical incident data, in accordance with some embodiments. FIG. 4 is a flowchart of a method for routing a responder based on a selected crime type combination, in accordance with some embodiments. FIG. 5 is a bar chart showing distance correlation values for a plurality of crime type combinations, in accordance with some embodiments. FIG. 6 illustrates a map including crime prediction geographic areas, in accordance with some embodiments. detailed-description description=\"Detailed Description\" end=\"lead\"? Skilled artisans will appreciate that elements in the figures are illustrated for simplicity and clarity and have not necessarily been drawn to scale. For example, the dimensions of some of the elements in the figures may be exaggerated relative to other elements to help to improve understanding of embodiments of the present invention. The apparatus and method components have been represented where appropriate by conventional symbols in the drawings, showing only those specific details that are pertinent to understanding the embodiments of the present invention so as not to obscure the disclosure with details that will be readily apparent to those of ordinary skill in the art having the benefit of the description herein.",
  "date_published": "20180322",
  "title": "DEVICE AND METHOD FOR GENERATING A CRIME TYPE COMBINATION BASED ON HISTORICAL INCIDENT DATA",
  "ipcr_labels": [
    "G06N700",
    "G06F1730"
  ],
  "_processing_info": {
    "original_size": 36117,
    "optimized_size": 3513,
    "reduction_percent": 90.27
  }
}