{
  "decision": "PENDING",
  "application_number": "15273246",
  "date_published": "20170112",
  "date_produced": "20161228",
  "title": "Wearable Device Zone Group Control",
  "filing_date": "20160922",
  "inventor_list": [
    {
      "inventor_name_last": "Bates",
      "inventor_name_first": "Paul Andrew",
      "inventor_city": "Santa Barbara",
      "inventor_state": "CA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Storlie",
      "inventor_name_first": "Danielle",
      "inventor_city": "Santa Barbara",
      "inventor_state": "CA",
      "inventor_country": "US"
    }
  ],
  "ipcr_labels": [
    "G06F316",
    "G06F30482",
    "G06F314",
    "G06F116"
  ],
  "main_ipcr_label": "G06F316",
  "summary": "<SOH> BRIEF DESCRIPTION OF THE DRAWINGS <EOH>Features, aspects, and advantages of the presently disclosed technology may be better understood with regard to the following description, appended claims, and accompanying drawings where: FIG. 1 shows an example media playback system configuration in which certain embodiments may be practiced; FIG. 2 shows a functional block diagram of an example playback device; FIG. 3 shows a functional block diagram of an example control device; FIG. 4 shows an example controller interface; FIGS. 5A-5C illustrate example control interfaces. FIGS. 6A-6C illustrate example grouping control interfaces. FIG. 7 shows an example control system for a media playback network. FIG. 8 illustrates an example controller application. FIG. 9 illustrates an example data flow diagram depicting a flow of data between the wearable device, controller device, and playback system. FIGS. 10-13 show flow diagrams that illustrate example methods to facilitate zone grouping and control in a playback system. detailed-description description=\"Detailed Description\" end=\"lead\"? The drawings are for the purpose of illustrating example embodiments, but it is understood that the inventions are not limited to the arrangements and instrumentality shown in the drawings.",
  "patent_number": "None",
  "abstract": "Configuration information and selectable grouping options associated with the plurality of zones is displayed, for example, on a wearable device. Selection of a first selectable grouping option is received and in response a configuration change is transmitted. The configuration change may comprise information indicating a first zone is to join a zone group with a second zone of the plurality of zones. Updated configuration information is received indicating that a media playback system includes the zone group comprising the first zone and the second zone. The updated configuration information is displayed on the wearable device.",
  "publication_number": "US20170010857A1-20170112",
  "_processing_info": {
    "original_size": 117159,
    "optimized_size": 2643,
    "reduction_percent": 97.74
  }
}