{
  "date_produced": "20180308",
  "publication_number": "US20180082203A1-20180322",
  "main_ipcr_label": "G06N700",
  "decision": "PENDING",
  "application_number": "15271474",
  "inventor_list": [
    {
      "inventor_name_last": "Bender",
      "inventor_name_first": "Michael",
      "inventor_city": "Rye Brook",
      "inventor_state": "NY",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Smallowitz",
      "inventor_name_first": "Howard N.",
      "inventor_city": "Austin",
      "inventor_state": "TX",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Stark",
      "inventor_name_first": "George E.",
      "inventor_city": "Lakeway",
      "inventor_state": "TX",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Walker",
      "inventor_name_first": "Keith R.",
      "inventor_city": "Austin",
      "inventor_state": "TX",
      "inventor_country": "US"
    }
  ],
  "abstract": "Embodiments of the present invention provide detection of operator likelihood of deviation from a planned route. In embodiments, a route is planned on an electronic navigation system. Vehicle and/or operator parameters are monitored, and a likelihood of deviation from the route is detected. Upon detecting a likely upcoming deviation, an alert is provided to the user so that corrective action can be taken before missing a waypoint of the route.",
  "filing_date": "20160921",
  "patent_number": "None",
  "summary": "<SOH> SUMMARY <EOH>In one embodiment, there is provided a computer-implemented method for assessing a likelihood for deviation from a recommended path, comprising: detecting an operator action that is contradictory to the recommended path; and presenting, on a user interface, an alert to a user in response to the detected operator action. In another embodiment, there is provided an electronic device for assessing a likelihood for deviation from a recommended path, comprising: a processor; a memory coupled to the processor; and a geolocation receiver, wherein the processor contains instructions, that when executed by the processor, perform the steps of: obtaining a current vehicle speed; obtaining a current vehicle location; computing a recommended vehicle speed based on the current vehicle location and the recommended path; and presenting an alert to a user in response to the current vehicle speed exceeding the recommended vehicle speed. In yet another embodiment, there is provided a computer program product for assessing a likelihood for deviation from a recommended path, on an electronic device, comprising a computer readable storage medium having program instructions embodied therewith, the program instructions executable by a processor to cause the electronic device to: obtain a current vehicle speed; obtain a current vehicle location; compute a recommended vehicle speed based on the current vehicle location and the recommended path; and present an alert to a user in response to the current vehicle speed exceeding the recommended vehicle speed.",
  "date_published": "20180322",
  "title": "DETECTION OF OPERATOR LIKELIHOOD OF DEVIATION FROM PLANNED ROUTE",
  "ipcr_labels": [
    "G06N700",
    "G01C2136"
  ],
  "_processing_info": {
    "original_size": 55771,
    "optimized_size": 3028,
    "reduction_percent": 94.57
  }
}