{
  "decision": "PENDING",
  "application_number": "15277317",
  "date_published": "20170504",
  "date_produced": "20170419",
  "title": "TECHNOLOGIES FOR DISTRIBUTING DIGITAL MEDIA CONTENT LICENSES",
  "filing_date": "20160927",
  "inventor_list": [
    {
      "inventor_name_last": "Donabedian",
      "inventor_name_first": "William A.",
      "inventor_city": "Milford",
      "inventor_state": "OH",
      "inventor_country": "US"
    }
  ],
  "ipcr_labels": [
    "G06Q3002",
    "G06Q5000",
    "G06F2110"
  ],
  "main_ipcr_label": "G06Q3002",
  "summary": "<SOH> SUMMARY <EOH>In an embodiment, the present disclosure is directed, in part, to a method for managing distribution of licensed digital media content. The method includes receiving, by a media license management server, a media search request message. The media search request message includes search parameters that define a requested digital music track. The method also includes generating, by the media license management server, a candidate list of a plurality of digital music tracks determined to match the search parameters based at least in part on a plurality of electronic artist profiles of a plurality of artists. Additionally, the method includes receiving, by the media license management server, a license request message corresponding to a selected digital music track from the candidate list of the plurality of digital music tracks. The license request message can include requested licensing terms for the selected digital music track. The method further includes transmitting, by the media license management server, a licensed version of the selected digital music track to a remote computing device in response to a determination that the requested licensing terms for the selected digital music track are accepted. At least a portion of the licensed version of the selected digital music track is for presentation during an advertisement. The advertisement includes a Uniform Resource Locator (URL) corresponding to a website from which playback of the licensed version of the selected digital music track is available. Also, the method includes receiving, by the media license management server and from a music player of the website, a request for playback of the licensed version of the selected digital music track. Additionally, the method includes streaming, by the media license management server, the licensed version of the selected digital music track to the music player of the website in response to the request. In some embodiments of the method, each of the ...",
  "patent_number": "None",
  "abstract": "Technologies for managing distribution of licensed digital media content include a media license management server. The media license management server receives a media search request message including search parameters. A candidate list of digital media content items determined to match the search parameters is generated. The media license management server receives a license request corresponding to a selected digital media content item from the list. A licensed version of the selected digital media content item is transmitted to a computing device in response to acceptance of requested licensing terms. The licensed version of the digital media content item is presented during an advertisement. The advertisement includes a Uniform Resource Locator associated with a website from which playback of the digital media content item is available. In response to receiving a playback request, the licensed version of the digital media content item is streamed to a content player of the website...",
  "publication_number": "US20170124601A1-20170504",
  "_processing_info": {
    "original_size": 73935,
    "optimized_size": 3584,
    "reduction_percent": 95.15
  }
}