{
  "date_produced": "20180315",
  "publication_number": "US20180089568A1-20180329",
  "main_ipcr_label": "G06N502",
  "decision": "PENDING",
  "application_number": "15278089",
  "inventor_list": [
    {
      "inventor_name_last": "Allen",
      "inventor_name_first": "Corville O.",
      "inventor_city": "Morrisville",
      "inventor_state": "NC",
      "inventor_country": "US"
    }
  ],
  "abstract": "Mechanisms are provided that generate a knowledge data structure for a medical condition. The mechanisms parse a natural language positional statement data structure representing a natural language positional statement corresponding to a medical condition, where the natural language positional statement specifies guidance information and patient attributes indicative of patients for which an action may be performed for the medical condition. The mechanisms extract the patient attributes and a grading value associated with the natural language positional statement. The mechanisms generate at least one weight value associated with each of the patient attributes based on the grading value. The mechanisms provide the knowledge data structure, based on the extracted one or more patient attributes and the at least one weight value in association with an identifier of the action and an identifier of the medical condition, to a cognitive system that performs a cognitive operation based on the ...",
  "filing_date": "20160928",
  "patent_number": "None",
  "summary": "<SOH> SUMMARY <EOH>This Summary is provided to introduce a selection of concepts in a simplified form that are further described herein in the Detailed Description. This Summary is not intended to identify key factors or essential features of the claimed subject matter, nor is it intended to be used to limit the scope of the claimed subject matter. In one illustrative embodiment, a method is provided, in a data processing system comprising at least one processor and at least one memory, the at least one memory comprising instructions executed by the at least one processor to cause the at least one processor to generate a knowledge data structure for a medical condition. The method comprises parsing, by the data processing system, a natural language positional statement data structure representing a natural language positional statement corresponding to a medical condition. The natural language positional statement specifies guidance information and one or more patient attributes indicative of patients for which an action may be performed for the medical condition. The method comprises extracting, by the data processing system, the one or more patient attributes, and a grading value associated with the natural language positional statement, from the natural language positional statement data structure. The method also comprises generating, by the data processing system, at least one weight value associated with each of the patient attributes based on at least the grading value associated with the natural language positional statement. Moreover, the method comprises providing, by the data processing system, the knowledge data structure for the medical condition, based on the extracted one or more patient attributes and the at least one weight value in association with an identifier of the action and an identifier of the medical condition, to a cognitive system that performs a cognitive operation based on the knowledge data structure In other illustrative embodiments, ...",
  "date_published": "20180329",
  "title": "Cognitive Building of Medical Condition Base Cartridges Based on Gradings of Positional Statements",
  "ipcr_labels": [
    "G06N502",
    "G06N700",
    "G06F1900"
  ],
  "_processing_info": {
    "original_size": 171610,
    "optimized_size": 3619,
    "reduction_percent": 97.89
  }
}