{
  "decision": "PENDING",
  "application_number": "15278666",
  "date_published": "20170330",
  "date_produced": "20170316",
  "title": "METHOD AND APPARATUS FOR CONNECTING TO A HEAVY DUTY VEHICLE AND PERFORMING A VEHICLE ROADWORTHINESS CHECK",
  "filing_date": "20160928",
  "inventor_list": [
    {
      "inventor_name_last": "HATHAWAY",
      "inventor_name_first": "Bill",
      "inventor_city": "Greensboro",
      "inventor_state": "NC",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "COVINGTON",
      "inventor_name_first": "Dave",
      "inventor_city": "King",
      "inventor_state": "NC",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "LACKEY",
      "inventor_name_first": "Lee",
      "inventor_city": "Clemmons",
      "inventor_state": "NC",
      "inventor_country": "US"
    }
  ],
  "ipcr_labels": [
    "G07C500",
    "G07C508",
    "G06Q3002",
    "G07C502"
  ],
  "main_ipcr_label": "G07C500",
  "summary": "<SOH> BRIEF SUMMARY <EOH>To address the above concerns and issues of vehicle roadworthiness, embodiments disclosed involves hardware and software platforms for determining the roadworthiness of a heavy duty vehicle and/or its trailer. Vehicle roadworthiness may be an objective assessment of the vehicle's capability to perform its mission arrived at via interrogation of the vehicle's electronic control units (ECUs) through the vehicle's data-buses. The platform may have a small footprint and is easily deployed and integrated with any site where heavy trucks are in use. In one embodiment, the roadworthiness of a heavy duty vehicle, such as a truck, is performed. The roadworthiness may be an objective assessment of the vehicle and its components readiness to perform. The assessment is arrived at via interrogation of the vehicle's components through the vehicle's data networks. The platform is comprised of an apparatus to connect to the vehicle and a central monitoring station to report the results. To perform a roadworthiness check, the vehicle is connected to the apparatus via a cable or wireless connection. The apparatus reads the vehicle and component's state information and sends it to the central monitoring station where it is analyzed and a report outputted. The output contains the vehicle's roadworthiness assessment. The central monitoring station can also send the roadworthiness assessment electronically (email/text). The monitoring station is connected to a server and all vehicle connections may be uploaded thereto. A vehicle roadworthiness assessment system may include a diagnostic apparatus for performing diagnostics on a vehicle, where the diagnostic apparatus is configured to connect to and request a status of components of the vehicle; a processor to determine a diagnostic assessment for each vehicle based on the diagnostics; a monitoring station connected to the diagnostic apparatus to receive the diagnostic assessment and score for each vehicle where th...",
  "patent_number": "None",
  "abstract": "A vehicle roadworthiness assessment system may include a diagnostic apparatus for performing diagnostics on a vehicle, where the diagnostic apparatus is configured to connect to and request a status of components of the vehicle; a processor to determine a diagnostic assessment for each vehicle based on the diagnostics; a monitoring station connected to the diagnostic apparatus to receive the diagnostic assessment and score for each vehicle where the diagnostics were performed; and storage connected to the diagnostic apparatus and configured to store data of the diagnostic assessment.",
  "publication_number": "US20170092020A1-20170330",
  "_processing_info": {
    "original_size": 34395,
    "optimized_size": 3505,
    "reduction_percent": 89.81
  }
}