{
  "decision": "PENDING",
  "application_number": "15278324",
  "date_published": "20180329",
  "date_produced": "20180315",
  "title": "SYSTEM AND METHOD FOR PREVIEWING A DASHBOARD DISPLAY ON VARIOUS FORM FACTORS",
  "filing_date": "20160928",
  "inventor_list": [
    {
      "inventor_name_last": "Anand",
      "inventor_name_first": "Ashish",
      "inventor_city": "Mayfield Heights",
      "inventor_state": "OH",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Purvis",
      "inventor_name_first": "Damon",
      "inventor_city": "Corona",
      "inventor_state": "CA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Kodejs",
      "inventor_name_first": "Zdenek",
      "inventor_city": "Praha",
      "inventor_state": "",
      "inventor_country": "CZ"
    },
    {
      "inventor_name_last": "Sipek",
      "inventor_name_first": "Vojtech",
      "inventor_city": "Melník",
      "inventor_state": "",
      "inventor_country": "CZ"
    }
  ],
  "ipcr_labels": [
    "G06F30484",
    "G06F30482",
    "G05B19418"
  ],
  "main_ipcr_label": "G06F30484",
  "summary": "<SOH> BRIEF DESCRIPTION OF THE DRAWINGS <EOH>Many aspects of the disclosure can be better understood with reference to the following drawings. While several implementations are described in connection with these drawings, the disclosure is not limited to the implementations disclosed herein. On the contrary, the intent is to cover all alternatives, modifications, and equivalents. FIG. 1 illustrates a graphical user interface of a dashboard design application in an exemplary implementation. FIG. 2 illustrates a graphical user interface of a dashboard design application in an exemplary implementation. FIG. 3 illustrates a graphical user interface preview display of a dashboard design application in an exemplary implementation. FIG. 4 illustrates a graphical user interface preview display of a dashboard design application in an exemplary implementation. FIG. 5 illustrates a graphical user interface preview display of a dashboard design application in an exemplary implementation. FIG. 6 illustrates a graphical user interface preview display of a dashboard design application in an exemplary implementation. FIG. 7 illustrates a graphical user interface of a dashboard design application in an exemplary implementation. FIG. 8 illustrates a graphical user interface of a dashboard design application in an exemplary implementation. FIG. 9 illustrates a graphical user interface of a dashboard design application in an exemplary implementation. FIG. 10 illustrates a graphical user interface of a dashboard design application in an exemplary implementation. FIG. 11 illustrates a graphical user interface of a dashboard design application in an exemplary implementation. FIG. 12 illustrates a graphical user interface of a dashboard design application in an exemplary implementation. FIG. 13 illustrates a graphical user interface of a dashboard design application in an exemplary implementation. FIG. 14 is a block diagram that illustrates an industrial automation environment in an exempl...",
  "patent_number": "None",
  "abstract": "Provided herein are systems, methods, and software for previewing a dashboard report comprising displaying a graphical object on a dashboard design canvas of a design graphical user interface (GUI), receiving a user input to display a preview GUI of the dashboard design canvas, and displaying a preview of the dashboard design canvas on the preview GUI according to a preview mode. The preview mode is user-selectable and includes a monitor device preview mode that causes the preview GUI to display the preview of the dashboard design canvas as the dashboard design canvas would appear when viewed on a monitor device having a screen resolution greater than a monitor threshold and an alternate device preview mode causes the preview GUI to display the preview of the dashboard design canvas as the dashboard design canvas would appear when viewed on a preview device having a screen resolution less than the monitor threshold.",
  "publication_number": "US20180088783A1-20180329",
  "_processing_info": {
    "original_size": 59873,
    "optimized_size": 3961,
    "reduction_percent": 93.38
  }
}