{
  "decision": "PENDING",
  "application_number": "15273587",
  "date_published": "20170330",
  "date_produced": "20170316",
  "title": "THREE-DIMENSIONAL SIMULATION SYSTEM FOR GENERATING A VIRTUAL ENVIRONMENT INVOLVING A PLURALITY OF USERS AND ASSOCIATED METHOD",
  "filing_date": "20160922",
  "inventor_list": [
    {
      "inventor_name_last": "FAIN",
      "inventor_name_first": "Igor",
      "inventor_city": "BEZONS",
      "inventor_state": "",
      "inventor_country": "FR"
    },
    {
      "inventor_name_last": "KURDIJIAN",
      "inventor_name_first": "Patrice",
      "inventor_city": "LA CELLE SAINT CLOUD",
      "inventor_state": "",
      "inventor_country": "FR"
    }
  ],
  "ipcr_labels": [
    "G09G500",
    "G09B930",
    "G06T1700",
    "G06T700",
    "G06T1900",
    "G06F301"
  ],
  "main_ipcr_label": "G09G500",
  "summary": "<SOH> SUMMARY OF THE INVENTION <EOH>One aim of the invention is to provide a three-dimensional simulation system that allows an inexpensive and practical way of offering a highly interactive medium for users to interact with one another in an environment of a complex platform, for example to train users on the maintenance and/or use of the complex platform. To that end, the invention provides a system of the aforementioned type, characterized in that the system comprises, for the or each first user, a second sensor detecting the position of part of an actual limb of the first user, the computing unit being able to create, in the virtual three-dimensional simulation, an avatar of the or each first user, comprising at least one virtual head and at least one virtual limb, reconstituted and oriented relative to one another based on data from the first sensor and the second sensor. The system according to the invention may comprise one or more of the following features, considered alone or according to any technically possible combination: the limb and the virtual limb are arms of the user and the avatar, respectively; the part of the user's limb detected by the second sensor comprises the first user's hand; the computing unit is able to determine the position of the first region of the virtual limb, based on data received from the first detection sensor, and is able to determine the position of a second region of the virtual limb from data received from the second detection sensor; the computing unit is able to determine the position of the first region of the virtual limb after having determined the position of the second region of the virtual limb; the computing unit is able to create a representation of a virtual shoulder of the first user, rotatable around a vertical axis jointly with the virtual head of the first user, the first region of the virtual limb extending from the end of the virtual shoulder; it comprises, for a plurality of first users, a first sensor fo...",
  "patent_number": "None",
  "abstract": "A three-dimensional simulation system for generating a virtual environment involving a plurality of users and associated method are provided. The system includes a first sensor detecting a viewing direction of a first user, a computing unit configured to create a three-dimensional simulation of the virtual environment, based on data received from the at least one first sensor; for at least one second user, an immersive retrieval assembly for the virtual three-dimensional simulation created by the computing unit. The system includes, for the first user, a second sensor detecting the position of part of an actual limb of the first user. The computing unit is configured to create, in the virtual three-dimensional simulation, an avatar of the first user, comprising a virtual head and a virtual limb, reconstituted and oriented relative to one another based on data from the first sensor and the second sensor.",
  "publication_number": "US20170092223A1-20170330",
  "_processing_info": {
    "original_size": 56581,
    "optimized_size": 3738,
    "reduction_percent": 93.39
  }
}