{
  "decision": "PENDING",
  "application_number": "15271017",
  "date_published": "20171005",
  "date_produced": "20170920",
  "title": "Local Chat Service Simulator for Bot Development",
  "filing_date": "20160920",
  "inventor_list": [
    {
      "inventor_name_last": "Furman",
      "inventor_name_first": "Vitaliy",
      "inventor_city": "Swindon",
      "inventor_state": "",
      "inventor_country": "GB"
    },
    {
      "inventor_name_last": "Lindre",
      "inventor_name_first": "Michael Stuart",
      "inventor_city": "Mawsley",
      "inventor_state": "",
      "inventor_country": "GB"
    },
    {
      "inventor_name_last": "Wainer",
      "inventor_name_first": "Gregory W .",
      "inventor_city": "London",
      "inventor_state": "",
      "inventor_country": "GB"
    },
    {
      "inventor_name_last": "Scott",
      "inventor_name_first": "John Duncan",
      "inventor_city": "South Croydon",
      "inventor_state": "",
      "inventor_country": "GB"
    },
    {
      "inventor_name_last": "Irwin",
      "inventor_name_first": "Paul M.",
      "inventor_city": "Harpenden",
      "inventor_state": "",
      "inventor_country": "GB"
    },
    {
      "inventor_name_last": "Dragne",
      "inventor_name_first": "Lucian",
      "inventor_city": "London",
      "inventor_state": "",
      "inventor_country": "GB"
    },
    {
      "inventor_name_last": "Plumb",
      "inventor_name_first": "Graham C.",
      "inventor_city": "London",
      "inventor_state": "",
      "inventor_country": "GB"
    },
    {
      "inventor_name_last": "Kaletsky",
      "inventor_name_first": "Michael M.",
      "inventor_city": "London",
      "inventor_state": "",
      "inventor_country": "GB"
    },
    {
      "inventor_name_last": "Thorne",
      "inventor_name_first": "Richard John",
      "inventor_city": "Northwood",
      "inventor_state": "",
      "inventor_country": "GB"
    },
    {
      "inventor_name_last": "O'Grady",
      "inventor_name_first": "Adrian Kieron",
      "inventor_city": "St. Neots",
      "inventor_state": "",
      "inventor_country": "GB"
    }
  ],
  "ipcr_labels": [
    "G06F1136"
  ],
  "main_ipcr_label": "G06F1136",
  "summary": "<SOH> SUMMARY <EOH>It has been recognised that when developing a bot for deployment for use in a communication service the bot requires testing before making it live within the service. Current methods for doing this require the bot to be uploaded or published to a server from where it can be accessed by a public chat client for testing. As a result, the developer must publish a bot without it being ready, these bots may not be final versions as there may be some corrections that need to be made. However, such corrections may only become apparent to the developer upon test interactions after publishing. This can then lead to a low-quality pool of bots published to the server. The process of uploading the bot to the server in order to interact with it is often slow, and third-party developers may find it undesirable to publish their bots to production before they are ready. According to a first aspect of the present disclosure there is provided a method of testing one or more bots, each bot being for interacting with one or more human users via a communication service implemented over a network where the bot is to be published to a server and the one or more users access the communication service using a communication client application. The method comprises: storing the one or more bots locally on a user terminal of a testing user being a human tester of the one or more bots, and running a bot testing application locally on said user terminal. The bot testing application comprises: a detecting module configured to automatically detect one or more of the bots on said user terminal; and a user interface simulating module configured to render a simulated communications client user interface simulating at least one user interface function of said communication client application, including at least: presenting one or more of the detected bots as one or more respective ones of a plurality of simulated communication contacts within the simulated communications client user...",
  "patent_number": "None",
  "abstract": "A method of testing one or more bots, each bot being for interacting with one or more human users via a communication service implemented over a network where the bot is to be published to a server and the one or more users access the communication service using a communication client application. The method comprises: storing the one or more bots locally on a user terminal of a testing user being a human tester of the one or more bots, and running a bot testing application locally on said user terminal.",
  "publication_number": "US20170286269A1-20171005",
  "_processing_info": {
    "original_size": 54526,
    "optimized_size": 4379,
    "reduction_percent": 91.97
  }
}