{
  "decision": "PENDING",
  "application_number": "15273354",
  "date_published": "20180322",
  "date_produced": "20180308",
  "title": "COMMON GEOMETRIC PRIMITIVE ASSOCIATED WITH MULTIPLE GEOMETRIC PRIMITIVES",
  "filing_date": "20160922",
  "inventor_list": [
    {
      "inventor_name_last": "RODRIGUEZ",
      "inventor_name_first": "Alejandro A.",
      "inventor_city": "Saratoga",
      "inventor_state": "CA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "LIPTON",
      "inventor_name_first": "Daniel I.",
      "inventor_city": "Belmont",
      "inventor_state": "CA",
      "inventor_country": "US"
    }
  ],
  "ipcr_labels": [
    "G06T1710",
    "G06T1920"
  ],
  "main_ipcr_label": "G06T1710",
  "summary": "<SOH> SUMMARY <EOH>This disclosure generally relates to identifying and processing a common geometric primitive associated with multiple geometric primitives. In some embodiments, the multiple geometric primitives may include polygons and lines, each of which includes a set of end points. The common geometric primitive, such as a common point or a common line, may be on the multiple geometric primitives. Once the common geometric primitive is identified, it may be automatically associated with the multiple geometric primitives so that any change made by a user to the common geometric primitive can be automatically applied to the multiple geometric primitives as well. In some embodiments, the common geometric primitive may be displayed to the user in a manner that is different from the manner in which the multiple geometric primitives are displayed for ease of distinguishing. In some embodiments, the common geometric primitive and its association with the multiple geometric primitives may be temporary. For example, the common geometric primitive may be removed, while the multiple geometric primitives are still maintained on the screen, when the user no longer uses the common geometric primitive. Some embodiments relate to a method for generating a common geometric primitive. A first geometric primitive including a first set of end points and a second geometric primitive including a second set of end points may be obtained. A common point that is shared by the first geometric primitive and the second geometric primitive may be determined based on at least some of the first and second sets of end points. The common geometric primitive may be generated based on at least the common point. The common geometric primitive may be associated with the first geometric primitive and the second geometric primitive so that a change to the common geometric primitive is applied to the first geometric primitive and the second geometric primitive. This Summary is provided merely for p...",
  "patent_number": "None",
  "abstract": "Disclosed herein are system, method, and computer program product embodiments for identifying and processing a common geometric primitive associated with multiple geometric primitives. In some embodiments, a first geometric primitive including a first set of end points and a second geometric primitive including a second set of end points are obtained. A common point that is shared by the first geometric primitive and the second geometric primitive is determined based on at least some of the first and second sets of end points. The common geometric primitive is generated based on at least the common point. The common geometric primitive is associated with the first geometric primitive and the second geometric primitive so that a change to the common geometric primitive is applied to the first geometric primitive and the second geometric primitive.",
  "publication_number": "US20180082471A1-20180322",
  "_processing_info": {
    "original_size": 80938,
    "optimized_size": 3589,
    "reduction_percent": 95.57
  }
}