{
  "decision": "ACCEPTED",
  "application_number": "15273929",
  "date_published": "20170112",
  "date_produced": "20161228",
  "title": "VISION SYSTEM FOR FACILITATING THE AUTOMATED APPLICATION OF DISINFECTANT TO THE TEATS OF DAIRY LIVESTOCK",
  "filing_date": "20160923",
  "inventor_list": [
    {
      "inventor_name_last": "Hofman",
      "inventor_name_first": "Henk",
      "inventor_city": "Lemmer",
      "inventor_state": "",
      "inventor_country": "NL"
    },
    {
      "inventor_name_last": "van der Sluis",
      "inventor_name_first": "Peter Willem",
      "inventor_city": "Usselmuiden",
      "inventor_state": "",
      "inventor_country": "NL"
    },
    {
      "inventor_name_last": "Groensma",
      "inventor_name_first": "Ype",
      "inventor_city": "Heerenveen",
      "inventor_state": "",
      "inventor_country": "NL"
    }
  ],
  "ipcr_labels": [
    "A01J704",
    "A01K112",
    "A01K2900",
    "G06T700",
    "A01J5003",
    "B25J916",
    "B25J1100",
    "A01K1300",
    "A01J5007"
  ],
  "main_ipcr_label": "A01J704",
  "summary": "<SOH> SUMMARY OF THE INVENTION <EOH>According to embodiments of the present disclosure, disadvantages and problems associated with previous systems supporting dairy milking operations may be reduced or eliminated. In certain embodiments, a system includes a controller operable to access an image signal generated by a camera. The accessed image signal corresponds to one or more features of the rear of a dairy livestock. The controller is further operable to determine positions of each of the hind legs of the dairy livestock based on the accessed image signal. The controller is further operable to determine a position of an udder of the dairy livestock based on the accessed image signal and the determined positions of the hind legs of the dairy livestock. The controller is further operable to determine, based on the image signal and the determined position of the udder of the dairy livestock, a spray position from which a spray tool may apply disinfectant to the teats of the dairy livestock. Particular embodiments of the present disclosure may provide one or more technical advantages. For example, certain embodiments of the present disclosure may provide an automated system for applying disinfectant to the teats of dairy livestock. Additionally, certain embodiments of the present disclosure may minimize overspray, thereby reducing the volume of the disinfectant needed. By reducing the need for human labor and reducing the volume of disinfectant used, certain embodiments of the present disclosure may reduce the cost associated with applying disinfectant to the teats of dairy livestock in certain dairy milking operations. Furthermore, the use of the automated system of the present disclosure in conjunction with a rotary milking platform may increase the throughput of the milking platform, thereby increasing the overall milk production of the milking platform. Certain embodiments of the present disclosure may include some, all, or none of the above advantages. One or mor...",
  "patent_number": "9686962",
  "abstract": "A system includes a camera, a controller and a robotic arm. The camera generates an image of an udder of a dairy livestock. The controller determines a position of the udder of the dairy livestock based at least in part upon the image. The controller further determines a spray position based at least in part upon the determined position of the udder of the dairy livestock. Determining the spray position includes processing the accessed image to determine a tangent at the rear of the udder and a tangent at the bottom of the udder. The spray position is a position relative to the intersection of the two tangents. The robotic arm is communicatively coupled to the controller and positions a spray tool at the spray position.",
  "publication_number": "US20170006819A1-20170112",
  "_processing_info": {
    "original_size": 39097,
    "optimized_size": 3717,
    "reduction_percent": 90.49
  }
}