{
  "decision": "PENDING",
  "application_number": "15277069",
  "date_published": "20170119",
  "date_produced": "20170104",
  "title": "TRANSMISSION TERMINAL, NON-TRANSITORY RECORDING MEDIUM, TRANSMISSION METHOD, AND TRANSMISSION SYSTEM",
  "filing_date": "20160927",
  "inventor_list": [
    {
      "inventor_name_last": "KATO",
      "inventor_name_first": "Yoshinaga",
      "inventor_city": "Kanagawa",
      "inventor_state": "",
      "inventor_country": "JP"
    }
  ],
  "ipcr_labels": [
    "G06F1336",
    "H04N715",
    "G06F1340"
  ],
  "main_ipcr_label": "G06F1336",
  "summary": "<SOH> SUMMARY <EOH>According to one aspect, a transmission terminal includes at least one processor that is configured to transmit a terminal information request to request the number of transmission terminals under transmission to a transmission management apparatus connected via a network; and display image data received from one or more of the transmission terminals under transmission on a display device, and display the number of the transmission terminals under transmission received from the transmission management apparatus in response to the terminal information request on the display device. Other objects, features, and advantages will become more apparent from the following detailed description when read in conjunction with the accompanying drawings.",
  "patent_number": "None",
  "abstract": "A transmission terminal includes at least one processor configured to transmit a terminal information request to request the number of transmission terminals under transmission to a transmission management apparatus connected via a network; and display image data received from one or more of the transmission terminals under transmission on a display device, and display the number of the transmission terminals under transmission received from the transmission management apparatus in response to the terminal information request on the display device.",
  "publication_number": "US20170017592A1-20170119",
  "_processing_info": {
    "original_size": 137465,
    "optimized_size": 1932,
    "reduction_percent": 98.59
  }
}