{
  "decision": "PENDING",
  "application_number": "15274096",
  "date_published": "20170518",
  "date_produced": "20170503",
  "title": "MISSION-BASED, GAME-IMPLEMENTED CYBER TRAINING SYSTEM AND METHOD",
  "filing_date": "20160923",
  "inventor_list": [
    {
      "inventor_name_last": "Morton",
      "inventor_name_first": "Gary D.",
      "inventor_city": "Erie",
      "inventor_state": "CO",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Mihelic",
      "inventor_name_first": "Mark",
      "inventor_city": "Boulder",
      "inventor_state": "CO",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Moniz",
      "inventor_name_first": "Michael",
      "inventor_city": "Boulder",
      "inventor_state": "CO",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Thornton",
      "inventor_name_first": "Paul R.",
      "inventor_city": "Tupelo",
      "inventor_state": "MS",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Pressley",
      "inventor_name_first": "Ryan",
      "inventor_city": "Saltillo",
      "inventor_state": "MS",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Lee",
      "inventor_name_first": "Laura",
      "inventor_city": "San Diego",
      "inventor_state": "CA",
      "inventor_country": "US"
    }
  ],
  "ipcr_labels": [
    "G09B900",
    "A63F1385",
    "G06N300",
    "G09B1900"
  ],
  "main_ipcr_label": "G09B900",
  "summary": "<SOH> SUMMARY OF THE INVENTION <EOH>One aspect of the invention is a cyber training system. In one embodiment, training which is implemented by the cyber training system is mission-based, rather than task based. In one embodiment, the training which is implemented by the cyber training system is also implemented as a game. In one embodiment, the system includes a core set of databases, tools and Application Programming Interfaces (APIs) to generate a nearly infinite variety of training system configurations comprising different environments with different resources, and having different missions. The system may be configured with a game engine and a Virtual Event Manager (VEM) which are configured to implement and/or manage: (1) a plurality of scenario environment types such as: cyber threat, power grid, custom systems, etc.; (2) a plurality of unique resource and mission databases, each dedicated to an environment type; (3) a core set of tools and resources common to all environment types; (4) the selection of an environment type, use of dedicated databases, and configuration of a unique environment; (5) use of both host-based and network-based sensors; and/or (6) game play between at least two live students or between a live student and an artificial intelligence (AI) computerized player. In one embodiment, the invention comprises a dynamic, scenario-based training platform to allow both “offensive” and “defensive” oriented participants to test their skills in a game environment against a sophisticated opponent. In one embodiment, the training takes place within the framework of a game environment combining an AI opponent within a realistic virtual environment and hacking simulation. The game environment provides dynamic and highly interactive scenarios to facilitate realistic situational training within a controlled environment. This unique use of systems technology, simulation and game interface facilitates the training of personnel to rapidly develop the skills...",
  "patent_number": "None",
  "abstract": "A mission-based cyber training platform allows both offensive and defensive oriented participants to test their skills in a game-based virtual environment against a live or virtual opponent. The system builds realistic virtual environments to perform the training in an isolated and controlled setting. Dynamic configuration supports unique missions using a combination of real and/or virtual machines, software resources, tools, and network components. Game engine behaves in a manner that will vary if participant attempts to replay a scenario based upon alternate options available to the engine. Scoring and leader boards are used to identify skill gaps/strengths and measure performance for each training participant. A detailed assessment of a player's performance is provided at the end of the mission and is stored in a user profile/training record.",
  "publication_number": "US20170140660A1-20170518",
  "_processing_info": {
    "original_size": 93227,
    "optimized_size": 4186,
    "reduction_percent": 95.51
  }
}