{
  "decision": "PENDING",
  "application_number": "15272457",
  "date_published": "20180322",
  "date_produced": "20180308",
  "title": "METHOD FOR ANALYZING AN ELECTROMIGRATION (EM) RULE VIOLATION IN AN INTEGRATED CIRCUIT",
  "filing_date": "20160922",
  "inventor_list": [
    {
      "inventor_name_last": "Lo",
      "inventor_name_first": "Wan-Yu",
      "inventor_city": "Taoyuan County",
      "inventor_state": "",
      "inventor_country": "TW"
    },
    {
      "inventor_name_last": "Wang",
      "inventor_name_first": "Chung-Hsing",
      "inventor_city": "Hsinchu County",
      "inventor_state": "",
      "inventor_country": "TW"
    },
    {
      "inventor_name_last": "Lin",
      "inventor_name_first": "Chin-Shen",
      "inventor_city": "Taipei City",
      "inventor_state": "",
      "inventor_country": "TW"
    },
    {
      "inventor_name_last": "Yang",
      "inventor_name_first": "Kuo-Nan",
      "inventor_city": "Hsinchu City",
      "inventor_state": "",
      "inventor_country": "TW"
    }
  ],
  "ipcr_labels": [
    "G06F1750"
  ],
  "main_ipcr_label": "G06F1750",
  "summary": "<SOH> BRIEF DESCRIPTION OF THE DRAWINGS <EOH>Aspects of the present disclosure are best understood from the following detailed description when read with the accompanying figures. It is noted that, in accordance with the standard practice in the industry, various features are not drawn to scale. In fact, the dimensions of the various features may be arbitrarily increased or reduced for clarity of discussion. FIG. 1 is a schematic sectional view to illustrate an exemplary semiconductor device in accordance with various embodiments of the present disclosure; FIG. 2 is a schematic top view to illustrate an exemplary integrated circuit (IC) layout in accordance with various embodiments of the present disclosure; FIG. 3 is a block diagram to illustrate an exemplary system in accordance with various embodiments of the present disclosure; FIG. 4 is a block diagram to illustrate another exemplary system in accordance with various embodiments of the present disclosure; FIG. 5 is a flow chart to illustrate an exemplary method for analyzing an electromigration (EM) rule violation in accordance with various embodiments of the present disclosure; and FIG. 6 is a flow chart to illustrate an operation of the method of FIG. 5 in accordance with various embodiments of the present disclosure. detailed-description description=\"Detailed Description\" end=\"lead\"?",
  "patent_number": "None",
  "abstract": "A method includes receiving an input that is in an electronic file format and that includes information associated with an integrated circuit (IC) layout, selecting a non EM rule compliant metal line of the IC layout that is in violation of an EM rule from the input, obtaining a current of the non EM rule compliant metal line from the input, comparing the current with a threshold current, and determining whether the EM rule violation is negligible based on the result of comparison. As such, a semiconductor device may be fabricated from the IC layout when it is determined that the EM rule violation is negligible.",
  "publication_number": "US20180082010A1-20180322",
  "_processing_info": {
    "original_size": 43256,
    "optimized_size": 3005,
    "reduction_percent": 93.05
  }
}