{
  "date_produced": "20170223",
  "publication_number": "US20170068894A1-20170309",
  "main_ipcr_label": "G06N502",
  "decision": "ACCEPTED",
  "application_number": "15274635",
  "inventor_list": [
    {
      "inventor_name_last": "Pedersen",
      "inventor_name_first": "Robert D.",
      "inventor_city": "Dallas",
      "inventor_state": "TX",
      "inventor_country": "US"
    }
  ],
  "abstract": "A dynamic, distributed directed activity network comprising a directed activity control program specifying tasks to be executed including required individual task inputs and outputs, the required order of task execution, and permitted parallelism in task execution; a plurality of task execution agents, individual of said agents having a set of dynamically changing agent attributes and capable of executing different required tasks in said activity control; a plurality of task execution controllers, each controller associated with one or more of the task execution agents with access to dynamically changing agent attributes; a directed activity controller for communicating with said task execution controllers for directing execution of said activity control program; a communications network capable of supporting communication between said directed activity controller and task execution controllers; and wherein said directed activity controller and task execution controllers communicate vi...",
  "filing_date": "20160923",
  "patent_number": "9996796",
  "summary": "<SOH> SUMMARY OF THE INVENTION <EOH>Various embodiments of a system and method for improved dynamic control of distributed interrelated activities are disclosed. In one embodiment, a dynamic directed activity network comprises a directed activity control program specifying tasks to be executed including required individual task inputs and outputs, the required order of task execution, and permitted parallelism in task execution; a directed activity controller for executing the directed activity control program; a plurality of distributed task execution agents, individual of said task execution agents having a set of agent attributes and capable of executing different tasks in said activity network; a plurality of task execution controllers, each task execution controller associated with one or more of the task execution agents with access to agent attributes which may dynamically change over time; and wherein said task execution controllers and directed activity controllers execute said directed activity control program using selected task execution agents with dynamic updating of task execution agent attributes by communications between task execution controllers and the directed activity controller. In a further aspect of the invention, the task execution agents comprise computers, storage units, transportation equipment, manufacturing equipment, factories, personnel and/or communications equipment. In still a further aspect of the invention, the task execution agent attributes comprise agent capabilities, capacity, speed, availability, utilization, location and/or quantity. In still a further aspect of the invention, the task execution controllers comprise computers, digital controllers, personnel, communication devices, timers and/or sensors. In still a further aspect of the invention, the task execution controllers comprise one or more of a GPS receiver, cellular transceiver, barcode reader, RFID tag reader, RF tag reader, data transceiver, optical transceiver,...",
  "date_published": "20170309",
  "title": "DISTRIBUTED ACTIVITY CONTROL SYSTEMS AND METHODS",
  "ipcr_labels": [
    "G06N502",
    "G06F948"
  ],
  "_processing_info": {
    "original_size": 108351,
    "optimized_size": 3557,
    "reduction_percent": 96.72
  }
}