{
  "decision": "PENDING",
  "application_number": "15271693",
  "date_published": "20170112",
  "date_produced": "20161228",
  "title": "TOUCH CONTROL DISPLAY PANEL, DRIVING METHOD AND TOUCH CONTROL DISPLAY DEVICE",
  "filing_date": "20160921",
  "inventor_list": [
    {
      "inventor_name_last": "LIU",
      "inventor_name_first": "LIANG",
      "inventor_city": "Xiamen",
      "inventor_state": "",
      "inventor_country": "CN"
    },
    {
      "inventor_name_last": "LI",
      "inventor_name_first": "YUANHANG",
      "inventor_city": "Xiamen",
      "inventor_state": "",
      "inventor_country": "CN"
    },
    {
      "inventor_name_last": "LI",
      "inventor_name_first": "ZUOYIN",
      "inventor_city": "Xiamen",
      "inventor_state": "",
      "inventor_country": "CN"
    },
    {
      "inventor_name_last": "ZHU",
      "inventor_name_first": "YIHUA",
      "inventor_city": "Xiamen",
      "inventor_state": "",
      "inventor_country": "CN"
    },
    {
      "inventor_name_last": "CAI",
      "inventor_name_first": "SHOUJIN",
      "inventor_city": "Xiamen",
      "inventor_state": "",
      "inventor_country": "CN"
    },
    {
      "inventor_name_last": "LU",
      "inventor_name_first": "FENG",
      "inventor_city": "Shanghai",
      "inventor_state": "",
      "inventor_country": "CN"
    },
    {
      "inventor_name_last": "YAO",
      "inventor_name_first": "QIJUN",
      "inventor_city": "Shanghai",
      "inventor_state": "",
      "inventor_country": "CN"
    }
  ],
  "ipcr_labels": [
    "G06F3041",
    "G06F3044"
  ],
  "main_ipcr_label": "G06F3041",
  "summary": "<SOH> BRIEF SUMMARY OF THE DISCLOSURE <EOH>One aspect of the present disclosure provides a touch control display panel. The touch control display panel comprises a first substrate, and a second substrate arranged opposite to the first substrate. The touch control display panel also comprises a plurality of first electrodes disposed on the first substrate and extending in a column direction and a row direction of the first substrate, and a plurality of second electrodes disposed in a gap between two first electrodes and electrically insulated from the first electrodes. The plurality of first electrodes and the plurality of second electrodes are disposed in a same layer; a third electrode disposed on the second substrate. An orthogonal projection of the third electrode on the first substrate is at least overlapped with an orthogonal projection of the second electrodes on the first substrate. At least one controlling unit connected to the first electrodes, the second electrodes and the third electrode. Another aspect of the present disclosure provides a touch control display device comprising the touch control display panel. Another aspect of the present disclosure provides a driving method for a touch control display panel. The touch control display panel comprises a first substrate, and a second substrate arranged opposite to the first substrate. The touch control display panel also comprises a plurality of first electrodes disposed on the first substrate and extending in a column direction and a row direction of the first substrate, and a plurality of second electrodes disposed in a gap between two first electrodes and electrically insulated from the first electrodes. The plurality of first electrodes and the plurality of second electrodes are disposed in a same layer; a third electrode disposed on the second substrate. An orthogonal projection of the third electrode on the first substrate is at least overlapped with an orthogonal projection of the second electrodes...",
  "patent_number": "None",
  "abstract": "A touch control display panel, a touch control display device and a touch control display panel driving method are provided. The touch control display panel comprises a first substrate; a second substrate arranged opposite to the first substrate; a plurality of first electrodes disposed on the first substrate, a plurality of second electrodes disposed in a gap between two first electrodes and electrically insulated from the first electrodes, wherein the plurality of first electrodes and the plurality of second electrodes are disposed in a same layer; a third electrode disposed on the second substrate, wherein an orthogonal projection of the third electrode on the first substrate is at least overlapped with an orthogonal projection of the second electrodes on the first substrate; and at least one controlling unit connected to the first electrodes, the second electrodes and the third electrode.",
  "publication_number": "US20170010745A1-20170112",
  "_processing_info": {
    "original_size": 52370,
    "optimized_size": 4309,
    "reduction_percent": 91.77
  }
}