{
  "date_produced": "20180109",
  "publication_number": "US20180025287A1-20180125",
  "main_ipcr_label": "G06N9900",
  "decision": "PENDING",
  "application_number": "15275355",
  "inventor_list": [
    {
      "inventor_name_last": "Mathew",
      "inventor_name_first": "Binu K.",
      "inventor_city": "Los Gatos",
      "inventor_state": "CA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Ng",
      "inventor_name_first": "Julia C.",
      "inventor_city": "San Jose",
      "inventor_state": "CA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Zerbe",
      "inventor_name_first": "Jared L.",
      "inventor_city": "Woodside",
      "inventor_state": "CA",
      "inventor_country": "US"
    }
  ],
  "abstract": "Systems and methods are disclosed for a server generating a plurality of proxy prediction models for each of a plurality of applications for use by client devices. Providing a prediction model based on a data distribution that more closely matches the user private data of the actual user of the client device, as opposed to a generic model, can improve the accuracy of predictions and improve the benefits to the user of the client device. The plurality of prediction models are generated by a server and provided to a plurality of clients. For a particular application, a client device can use previously collected private user data to select one of the plurality of prediction models for the application as being a closest matching prediction model to use for a particular user.",
  "filing_date": "20160924",
  "patent_number": "None",
  "summary": "<SOH> SUMMARY OF THE DESCRIPTION <EOH>Systems and methods are disclosed for enhancing a user's experience when using a client device by providing a plurality of prediction models for each of a plurality of applications on the client device. Providing a prediction model that more closely matches the actual user of the client device can improve the speed and accuracy of machine learning of a prediction model that represents the user of the client device. The term “model,” as used herein, in one embodiment, refers to a data distribution, or a sketch of a data distribution, together with a machine learning model. Thus, each model has a corresponding data distribution. The phrase “matching a model” or “comparing a model,” as used herein, in one embodiment, refers to performing a divergence estimation on a data distribution of a first model and a data distribution of a second model to determine an estimated divergence between the first and second data distributions. The plurality of prediction models are generated by a server and provided to a plurality of clients. For a particular application, a client device can use previously collected private user data to select one of the plurality of prediction models for the application as being a closest matching prediction model to the particular user. The selected, close or closest matching one of the plurality of prediction models is used as a proxy prediction model (“proxy model”) for the actual user of the client device. The client device can use private user data on the client device to further train or adapt the proxy model to more accurately predict or represent the preferences, characteristics, or calibration of a sensor to the user of the client device. In an embodiment, a server can collect a substantial amount of anonymized, or de-identified user data (crowdsourced data), or voluntarily given user data (or a combination of some or all of such data), to generate a plurality of proxy models for an application or use case...",
  "date_published": "20180125",
  "title": "USING PROXIES TO ENABLE ON-DEVICE MACHINE LEARNING",
  "ipcr_labels": [
    "G06N9900",
    "G06N504"
  ],
  "_processing_info": {
    "original_size": 79560,
    "optimized_size": 3665,
    "reduction_percent": 95.39
  }
}