{
  "decision": "REJECTED",
  "application_number": "15274868",
  "date_published": "20170525",
  "date_produced": "20170510",
  "title": "Electronic Drug Dispenser System",
  "filing_date": "20160923",
  "inventor_list": [
    {
      "inventor_name_last": "Lohman",
      "inventor_name_first": "Cheryl",
      "inventor_city": "Germantown",
      "inventor_state": "MD",
      "inventor_country": "US"
    }
  ],
  "ipcr_labels": [
    "G06F1900",
    "G06F2132",
    "G06F1730",
    "A61J700",
    "A61J704"
  ],
  "main_ipcr_label": "G06F1900",
  "summary": "<SOH> SUMMARY OF THE PRESENT INVENTION <EOH>The present invention is an electronic drug dispenser system configured to be fixed at a bedside of a patient in a hospital. The system of the present invention employs biometric authentication to verify the identity of the patient accessing the dispenser. The biometric authentication preferably employs the fingerprint, thumb-impression, iris scan, face recognition, and/or voice identification to verify the identity of the patient. The system of the present invention is designed such that a patient may personally take the medicine from the dispenser without a need to call a nurse, and self-administer the medication. The system also is equipped with a camera configured to track the patient accessing the dispenser while taking the medications. An alternate power back-up is also preferably provided by the system for use in case of power failure. Additionally, the present invention is preferably configured to continue operation independently without a network connection in the event that the network goes down. Additionally, the system of the present invention also preferably performs drug tracking in order to confirm the ingestion of the drug by the patient for keeping a record of the medication provided to the patient. As such, the medications dispensed via the system of the present invention preferably include medication ingestion tracking technology, such as that employed by Proteus Digital Health. The system of the present invention may be configured to function in tandem with the medication tracking system of Proteus Digital Health.",
  "patent_number": "None",
  "abstract": "A medication administration and tracking system is described. The system is equipped with an electric medication dispenser configured to administer medication to a patient in a hospital bed without intervention from hospital staff. The dispenser is configured to allocate safe doses of prescribed or over-the-counter medications to a patient upon request by the patient. At least one method of biometric authentication is employed to solely permit access to the medication to the patient upon confirmation of his or her identity. A camera disposed on the dispenser is configured to witness the patient take the medication, and track the time and date of consumption. The medications administered are preferably equipped with a tracking sensor to help track medication levels within the patient, and monitor treatment efficacy.",
  "publication_number": "US20170147784A1-20170525",
  "_processing_info": {
    "original_size": 34029,
    "optimized_size": 2997,
    "reduction_percent": 91.19
  }
}