{
  "decision": "PENDING",
  "application_number": "15277340",
  "date_published": "20180329",
  "date_produced": "20180315",
  "title": "Method and System for Reconciling Transportation Records",
  "filing_date": "20160927",
  "inventor_list": [
    {
      "inventor_name_last": "Lansden",
      "inventor_name_first": "Jennifer M.",
      "inventor_city": "Woodhaven",
      "inventor_state": "NY",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Foy",
      "inventor_name_first": "Gerald J",
      "inventor_city": "Wilmington",
      "inventor_state": "DE",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Beadle",
      "inventor_name_first": "Tim",
      "inventor_city": "Dartmouth Woods",
      "inventor_state": "DE",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Thomas",
      "inventor_name_first": "Richard G.",
      "inventor_city": "Dover",
      "inventor_state": "DE",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Groth",
      "inventor_name_first": "Bryan W",
      "inventor_city": "Huntley",
      "inventor_state": "IL",
      "inventor_country": "US"
    }
  ],
  "ipcr_labels": [
    "G06Q1008",
    "G06F1730"
  ],
  "main_ipcr_label": "G06Q1008",
  "summary": "<SOH> BRIEF SUMMARY OF THE INVENTION <EOH>According to a first exemplary embodiment of the present invention, a method is provided for managing transport record. A first list is received from a transportation record storage provider (TRSP), and a second list is received from an outside service provider (OSP) inventory manager. Then, the first list and the second list are reconciled. The first list includes at least one record of a transport request, and the second list includes at least one record of at least one of an inbound transport and an outbound transport at the OSP. According to another exemplary embodiment of the present invention, a system is provided for managing the transportation of media between a data center and an outside service provider. The system includes a TRSP operable to receive media transportation requests, and to store said media transportation requests. The system also includes an OSP inventory manager that receives records of transported media scanned at the OSP, and a reconciliation provider that receives a first list from the TRSP and a second list from the OSP inventory manger and reconciles the first list and the second list. The first list is based on the received media transportation requests and the second list is based on the records of transported media. According to another exemplary embodiment of the present invention, a reconciliation provider is provided for reconciling transportation records. The reconciliation provider includes a first receiving unit that is operable to receive a first list from a TRSP, a second receiving unit that is operable to receive a second list from an OSP inventory manager, a processing engine that reconciles the first list and the second list; and a reporting unit operable to generate a report of the results of the reconciling of the first list and the second list, and a reporting unit operable to generate a report of the results of the reconciling of the first list and the second list. The process...",
  "patent_number": "None",
  "abstract": "Aspects of the present invention are directed to a system for next day reconciliation of transportation records. The system having a transportation record storage provider (TRSP) that receives and stores storage medium transportation requests; an outside service provider (OSP) inventory manager that receives and maintains records of transported storage mediums scanned at the OSP; and a reconciliation provider that receives a first list from the TRSP and a second list from the OSP inventory manger, for reconciliation. The reconciliation provider includes receivers for receiving the first and second list; a processing engine that reconciles the first list and the second list; and a reporting unit that reports the results of the reconciliation. The processing engine matches inbound and outbound records of the first list and second list, and processes invalid records; and analyzes and accounts for un-matched records.",
  "publication_number": "US20180089620A1-20180329",
  "_processing_info": {
    "original_size": 59659,
    "optimized_size": 4080,
    "reduction_percent": 93.16
  }
}