{
  "decision": "PENDING",
  "application_number": "15270344",
  "date_published": "20180322",
  "date_produced": "20180308",
  "title": "SECURITY FOR DEVICES CONNECTED TO A NETWORK",
  "filing_date": "20160920",
  "inventor_list": [
    {
      "inventor_name_last": "Bender",
      "inventor_name_first": "Michael",
      "inventor_city": "Rye Brook",
      "inventor_state": "NY",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Childress",
      "inventor_name_first": "Rhonda L.",
      "inventor_city": "Austin",
      "inventor_state": "TX",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Dickenson",
      "inventor_name_first": "Marc A.",
      "inventor_city": "Austin",
      "inventor_state": "TX",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Fleischman",
      "inventor_name_first": "Thomas J.",
      "inventor_city": "Poughkeepsie",
      "inventor_state": "NY",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Hahn",
      "inventor_name_first": "Timothy J.",
      "inventor_city": "Cary",
      "inventor_state": "NC",
      "inventor_country": "US"
    }
  ],
  "ipcr_labels": [
    "G06F2155",
    "H04L2906"
  ],
  "main_ipcr_label": "G06F2155",
  "summary": "<SOH> SUMMARY <EOH>According to one embodiment of the present invention, a system provides security for a device and includes at least one processor. The system monitors a plurality of networked devices for a security risk. Each networked device is associated with a corresponding security risk tolerance. In response to a monitored security risk for one or more of the plurality of networked devices exceeding the corresponding risk tolerance, a network service is initiated to perform one or more actions on each of the one or more networked devices to alleviate the associated security risk. Thus, a present invention embodiment may provide a centralized approach to provide security as a service to devices connected to a network. This may enable security risks to be monitored and countered. In addition, a security risk tolerance may be specified for a user and/or device to control the types of security risks that may trigger actions, and/or the types of actions which may be performed based on the risks associated with those actions. In other words, the risk tolerance level specifies an amount of risk a user or device is willing to accept or tolerate, and controls when intervening actions are initiated (e.g., based on a degree of risk associated with an identified security risk), and the types of actions that may be performed (e.g., based on risks associated with those actions). A further aspect of a present invention embodiment is to perform actions to alleviate a security risk including one or more from a group of remediating a monitored security risk, and quarantining one or more networked devices with the monitored security risk exceeding a corresponding security risk tolerance. This is advantageous as a present invention embodiment may not only identify a security risk, but may further perform actions to alleviate or rectify the security risk. A still further aspect of a present invention embodiment includes consolidating data from other networked devices similar to ...",
  "patent_number": "None",
  "abstract": "According to one embodiment of the present invention, a system provides security for a device and includes at least one processor. The system monitors a plurality of networked devices for a security risk. Each networked device is associated with a corresponding security risk tolerance. In response to a monitored security risk for one or more of the plurality of networked devices exceeding the corresponding risk tolerance, a network service is initiated to perform one or more actions on each of the one or more networked devices to alleviate the associated security risk. Embodiments of the present invention further include a method and computer program product for providing security to a device in substantially the same manner described above.",
  "publication_number": "US20180082059A1-20180322",
  "_processing_info": {
    "original_size": 71119,
    "optimized_size": 3897,
    "reduction_percent": 94.52
  }
}