{
  "date_produced": "20170316",
  "publication_number": "US20170091642A1-20170330",
  "main_ipcr_label": "G06N700",
  "decision": "ACCEPTED",
  "application_number": "15274589",
  "inventor_list": [
    {
      "inventor_name_last": "ENCK",
      "inventor_name_first": "STEVEN WILLIAM",
      "inventor_city": "Apex",
      "inventor_state": "NC",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "CHAPMAN-MCQUISTON",
      "inventor_name_first": "EMILY",
      "inventor_city": "Cary",
      "inventor_state": "NC",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "KELLY",
      "inventor_name_first": "DANIEL",
      "inventor_city": "Raleigh",
      "inventor_state": "NC",
      "inventor_country": "US"
    }
  ],
  "abstract": "Embodiments are generated directed to method, medium, and system including processing circuitry to generate records including randomly selected events for each of one or more subjects having one or more of the same category parameters as a subject of a particular event. The processing circuitry may also present, on a display device, a computer-generated model based on the records, the model having a decision tree data structure having decision tree nodes corresponding with historical events from the records, each of the decision tree nodes having an indication of a likelihood of occurrence for the particular event based on whether a corresponding history event of the decision tree node occurred or did not occur within a specific time period. Embodiments of the real-time distributed nature of the systems and processing discussed herein can solve big data analytics processing problems and facilitate data anomaly detection.",
  "filing_date": "20160923",
  "patent_number": "9646258",
  "summary": "<SOH> BRIEF DESCRIPTION OF THE DRAWINGS <EOH>Embodiments of this disclosure are illustrated by way of example and not by way of limitation, in the figures of the accompanying drawings in which like reference numerals refer to similar elements. FIG. 1 illustrates a block diagram that provides an illustration of the hardware components of a computing system, according to some embodiments of the present technology. FIG. 2 illustrates an example network including an example set of devices communicating with each other over an exchange system and via a network, according to some embodiments of the present technology. FIG. 3 illustrates a representation of a conceptual model of a communications protocol system, according to some embodiments of the present technology. FIG. 4 illustrates a communications grid computing system including a variety of control and worker nodes, according to some embodiments of the present technology. FIG. 5 illustrates a flow chart showing an example process for adjusting a communications grid or a work project in a communications grid after a failure of a node, according to some embodiments of the present technology. FIG. 6 illustrates a portion of a communications grid computing system including a control node and a worker node, according to some embodiments of the present technology. FIG. 7 illustrates a flow chart showing an example process for executing a data analysis or processing project, according to some embodiments of the present technology. FIG. 8 illustrates a block diagram including components of an Event Stream Processing Engine (ESPE), according to embodiments of the present technology. FIG. 9 illustrates a flow chart showing an example process including operations performed by an event stream processing engine, according to some embodiments of the present technology. FIG. 10 illustrates an ESP system interfacing between a publishing device and multiple event subscribing devices, according to embodiments of the present technolog...",
  "date_published": "20170330",
  "title": "TECHNIQUES TO PROVIDE REAL-TIME PROCESSING ENHANCEMENTS AND MODELING FOR DATA ANOMALY DETECTION PERTAINING TO MEDICAL EVENTS USING DECISION TREES",
  "ipcr_labels": [
    "G06N700",
    "G06F1730"
  ],
  "_processing_info": {
    "original_size": 167481,
    "optimized_size": 3881,
    "reduction_percent": 97.68
  }
}