{
  "decision": "PENDING",
  "application_number": "15279077",
  "date_published": "20170406",
  "date_produced": "20170323",
  "title": "SYSTEMS, METHODS AND ARTICLES TO FACILITATE BUYING AND SELLING OF ADVERTISING INVENTORY",
  "filing_date": "20160928",
  "inventor_list": [
    {
      "inventor_name_last": "Box",
      "inventor_name_first": "Tyler Wallace",
      "inventor_city": "San Francisco",
      "inventor_state": "CA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Bridges",
      "inventor_name_first": "David",
      "inventor_city": "San Francisco",
      "inventor_state": "CA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Burdick",
      "inventor_name_first": "Brian M.",
      "inventor_city": "Newcastle",
      "inventor_state": "WA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Coco",
      "inventor_name_first": "Geoffrey P.",
      "inventor_city": "Seattle",
      "inventor_state": "WA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Ferreira",
      "inventor_name_first": "Ian P.",
      "inventor_city": "Issaquah",
      "inventor_state": "WA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Jaffe",
      "inventor_name_first": "Paul",
      "inventor_city": "Sherman Oaks",
      "inventor_state": "CA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Shiels",
      "inventor_name_first": "Alfred Lawrence",
      "inventor_city": "Glen Rock",
      "inventor_state": "NJ",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Thoman",
      "inventor_name_first": "Brian",
      "inventor_city": "Everett",
      "inventor_state": "WA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Trigony",
      "inventor_name_first": "Sean",
      "inventor_city": "Hermosa Beach",
      "inventor_state": "CA",
      "inventor_country": "US"
    }
  ],
  "ipcr_labels": [
    "G06Q3002",
    "H04N212543",
    "H04N21234",
    "H04N212665",
    "H04N2181",
    "H04N21262"
  ],
  "main_ipcr_label": "G06Q3002",
  "summary": "<SOH> BRIEF SUMMARY <EOH>A system to automate advertisement placement in linear mediacasts may be summarized as including: at least one nontransitory processor-readable storage medium that stores an inventory of advertisement placement opportunities to place advertisements in at least one of a number of linear mediacasts for each of a plurality of mediacast content providers that transmit the mediacasts to a plurality of media consumers, each of the advertisement placement opportunities represented in a canonical form that specifies at least a respective period of time of the advertisement placement opportunity during a mediacast day of the mediacast content provider; and at least one processor communicatively coupled to the at least one nontransitory processor-readable storage medium and which implements an advertiser-facing interface that provides access to the inventory of advertisement placement opportunities to advertisers, and that receives requests for advertisement placement opportunities from one or more advertisers without exposing information specific to the request for advertisement placement opportunities to other advertisers. For at least one of the advertisement placement opportunities in the inventory, the canonical form may specify the respective period of time of the advertisement placement opportunity by at least two of: i) a start time of the respective advertisement placement opportunity, ii) an end time of the respective advertisement placement opportunity, and iii) a duration of the respective advertisement placement opportunity. For at least one of the advertisement placement opportunities in the inventory, the canonical form may further specify a day of the week of the advertising placement opportunity. For at least one of the advertisement placement opportunities in the inventory, the canonical form may further specify at least one of a network, a network affiliate, or a channel of the advertising placement opportunity. For at least one of ...",
  "patent_number": "None",
  "abstract": "Systems and methods for providing an advertisement marketplace where buyers and sellers can trade mediacast advertisement inventory programmatically at local, national, and/or worldwide levels. The marketplace system may include a seller-controlled marketplace system which connects sellers with buyers and offers revenue management tools for optimizing yields across direct and programmatic channels. The advertisement inventory is bought and sold as canonical inventory units which group similar but discrete advertisement slots together. The marketplace system may include a seller side platform (SSP) for sellers and an advertiser-facing interface or console for demand side platform (DSP) entities. Through the SSP, sellers can access demand and make advertisement inventory available and accept or reject a bid based on marketplace demand without revealing information relating to pricing or available inventory to buyers.",
  "publication_number": "US20170098253A1-20170406",
  "_processing_info": {
    "original_size": 112721,
    "optimized_size": 4774,
    "reduction_percent": 95.76
  }
}