{
  "decision": "PENDING",
  "application_number": "15272816",
  "date_published": "20170323",
  "date_produced": "20170309",
  "title": "METHOD AND SYSTEM FOR CROWD-SOURCED ALGORITHM DEVELOPMENT",
  "filing_date": "20160922",
  "inventor_list": [
    {
      "inventor_name_last": "Pindado",
      "inventor_name_first": "Jesus",
      "inventor_city": "Lexington",
      "inventor_state": "MA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Ceruolo",
      "inventor_name_first": "Melissa",
      "inventor_city": "Middleton",
      "inventor_state": "MA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Patel",
      "inventor_name_first": "Shyamal",
      "inventor_city": "Somerville",
      "inventor_state": "MA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "McGinnis",
      "inventor_name_first": "Ryan",
      "inventor_city": "Winooski",
      "inventor_state": "VT",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "DePetrillo",
      "inventor_name_first": "Paolo",
      "inventor_city": "Somerville",
      "inventor_state": "MA",
      "inventor_country": "US"
    }
  ],
  "ipcr_labels": [
    "G06F944",
    "H04W400",
    "H04L2908"
  ],
  "main_ipcr_label": "G06F944",
  "summary": "<SOH> SUMMARY <EOH>Algorithm development for wearable sensor based software applications involves the analysis of a significant amount of data generated by a large number of users. Data collection can be performed in a supervised setting under controlled conditions with a well-defined testing protocol to generate a labeled dataset. Once the data has been collected, algorithm developers can develop algorithms (and software applications) that analyze the data to extract features that are relevant to the problem being solved and produce the right outputs of interest from the input data. The data collection and the data analysis approach can happen in a clear, planned sequence. This traditional approach requires significant time and resources for (a) data collection and (b) algorithm development and validation, which can limit the amount of data that can be generated from each subject as well as the number of subjects. As a result, algorithms developed on a small sample size often do not perform as well when applied to large population and improving them can take a long time and require significant resources. The present invention is directed to a novel wearable computing architecture that enables the generation of labeled datasets from a large number of users in an unsupervised setting and enables an algorithm development process, whereby the data collection and algorithm development and improvement can occur simultaneously and in an ongoing basis. In accordance with some embodiments, the system can include three basic components, 1) one or more wearable sensors and/or devices, 2) one or more smart devices (e.g., smartphones or other Bluetooth enabled devices or hubs or gateways), and 3) a cloud computing platform. In accordance with some embodiments, at least one of the wearable sensors and/or devices can generate a data stream (e.g., data and other information from sensors). The data stream can include one or more of the following types of data from a range of differ...",
  "patent_number": "None",
  "abstract": "A system for development of an algorithm for analysis of sensor data includes one or more wearable sensor devices, a smart device, and a cloud computing platform. The sensors in the wearable sensor device produce sensor data (e.g., physiological data) from a user that can be processed by a software algorithm in the wearable sensor device or by a connected smart device (e.g., a smartphone) via cloud computing, producing an algorithm output. The raw sensor data along with other information, such as the algorithm output and sensor data features can be sent to the cloud computing platform for storage and to enable developers to access the data in order to modify the software algorithms. The wearable sensor device can be configured to send more or less data to the cloud computing platform according to the performance of the software algorithm.",
  "publication_number": "US20170083312A1-20170323",
  "_processing_info": {
    "original_size": 73122,
    "optimized_size": 4013,
    "reduction_percent": 94.51
  }
}