{
  "decision": "PENDING",
  "application_number": "15277593",
  "date_published": "20170330",
  "date_produced": "20170316",
  "title": "Vehicle Telematics Policing System",
  "filing_date": "20160927",
  "inventor_list": [
    {
      "inventor_name_last": "Sharan",
      "inventor_name_first": "Ashutosh",
      "inventor_city": "Gurgaon",
      "inventor_state": "",
      "inventor_country": "IN"
    }
  ],
  "ipcr_labels": [
    "G08G1052",
    "G07C500",
    "G06F1730",
    "G08G1017"
  ],
  "main_ipcr_label": "G08G1052",
  "summary": "<SOH> SUMMARY <EOH>This section provides a general summary of the disclosure, and is not a comprehensive disclosure of its full scope or all of its features. Aspects and embodiments of the disclosure are also set out in the accompanying claims. In accordance with an aspect of the present disclosure, a system for policing through vehicle telematics is provided. The system includes a detector which is configured to receive vehicle telematics information from a telematics server, detect when the vehicle telematics information corresponding to a vehicle is outside predefined safe driving parameters, and, responsive to the detection, transmit identifying information of the vehicle and the corresponding vehicle telematics information to a central policing system. In accordance with a further aspect, a method for policing using vehicle telematics information is provided. The method includes accessing vehicle telematics information from a telematics server and detecting when the vehicle telematics information corresponding to a vehicle is outside predefined safe driving parameters. The method further includes, responsive to the detection, sending identifying information of the vehicle and the corresponding vehicle telematics information to a central policing system. Further areas of applicability will become apparent from the description provided herein. The description and specific examples and embodiments in this summary are intended for purposes of illustration only and are not intended to limit the scope of the present disclosure.",
  "patent_number": "None",
  "abstract": "A vehicle telematics system for policing general road users and vehicles comprising a detector coupled to a telematics server and a central policing system is disclosed. Telematics information relating to a vehicle will be used to determine if the vehicle is outside predefined safe driving parameter ranges. When the vehicle is determined to be operating outside predefined safe driving parameter ranges, this vehicle operation, together with the identifying information and location information of the vehicle, will be sent to the central policing system, which in turn, will be broadcasted to police vehicles located near the vehicle concerned.",
  "publication_number": "US20170092122A1-20170330",
  "_processing_info": {
    "original_size": 46409,
    "optimized_size": 2754,
    "reduction_percent": 94.07
  }
}