{
  "decision": "PENDING",
  "application_number": "15275003",
  "date_published": "20171214",
  "date_produced": "20171129",
  "title": "REMOVAL OF CREDENTIALS FROM AN ELECTRONIC DEVICE",
  "filing_date": "20160923",
  "inventor_list": [
    {
      "inventor_name_last": "Khan",
      "inventor_name_first": "Ahmer A.",
      "inventor_city": "Cupertino",
      "inventor_state": "CA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Lerch",
      "inventor_name_first": "Matthias",
      "inventor_city": "Paris",
      "inventor_state": "",
      "inventor_country": "FR"
    },
    {
      "inventor_name_last": "Chadha",
      "inventor_name_first": "Vineet",
      "inventor_city": "Cupertino",
      "inventor_state": "CA",
      "inventor_country": "US"
    }
  ],
  "ipcr_labels": [
    "G06F2145",
    "G06Q2032",
    "G06Q2040"
  ],
  "main_ipcr_label": "G06F2145",
  "summary": "<SOH> SUMMARY OF THE DISCLOSURE <EOH>This document describes systems, methods, and computer-readable media for removing credentials from an electronic device. For example, a method may be provided that includes terminating the functionality of a security domain element on an electronic device while the electronic device is not communicatively coupled to a trusted service manager of the security domain element, after the terminating, communicatively coupling the electronic device to the trusted service manager, and communicating data from the electronic device to the communicatively coupled trusted service manager, wherein the communicated data is usable by the trusted service manager to determine a stored value of the security domain element. As another example, a method may include terminating the functionality of a security domain element on an electronic device, communicatively coupling the electronic device to a trusted service manager of the security domain element, and, after the terminating, communicating data from the electronic device to the communicatively coupled trusted service manager, wherein the communicated data is usable by the trusted service manager to determine a stored value of the security domain element. This Summary is provided only to summarize some example embodiments, so as to provide a basic understanding of some aspects of the subject matter described in this document. Accordingly, it will be appreciated that the features described in this Summary are only examples and should not be construed to narrow the scope or spirit of the subject matter described herein in any way. Unless otherwise stated, features described in the context of one example may be combined or used with features described in the context of one or more other examples. Other features, aspects, and advantages of the subject matter described herein will become apparent from the following Detailed Description, Figures, and Claims.",
  "patent_number": "None",
  "abstract": "Systems, methods, and computer-readable media for managing credentials are provided. In one example embodiment, a method may include terminating the functionality of a security domain element on an electronic device, communicatively coupling the electronic device to a trusted service manager of the security domain element, and, after the terminating, communicating data from the electronic device to the communicatively coupled trusted service manager, wherein the communicated data is usable by the trusted service manager to determine a stored value of the security domain element. Additional embodiments are also provided.",
  "publication_number": "US20170357798A1-20171214",
  "_processing_info": {
    "original_size": 184439,
    "optimized_size": 3433,
    "reduction_percent": 98.14
  }
}