{
  "decision": "PENDING",
  "application_number": "15271447",
  "date_published": "20170323",
  "date_produced": "20170309",
  "title": "DISPLAY HOUSING FOR A DIGITAL DISPLAY SCREEN",
  "filing_date": "20160921",
  "inventor_list": [
    {
      "inventor_name_last": "Simpson",
      "inventor_name_first": "Matthew William",
      "inventor_city": "Roselands",
      "inventor_state": "",
      "inventor_country": "AU"
    }
  ],
  "ipcr_labels": [
    "G06F120",
    "G06F116",
    "H05K720"
  ],
  "main_ipcr_label": "G06F120",
  "summary": "<SOH> Summary of Invention <EOH>Embodiments of the present invention overcome or ameliorate one or more of the above described disadvantages. There is disclosed herein an embodiment of a display housing for a digital display screen, the display housing comprising a display screen enclosure adapted to receive a display screen and a computer housing arranged to receive a computer associated with the display screen for providing display content thereto, the computer housing having at least one air intake arranged at a first surface thereof and at least one air outlet arranged at a second surface thereof so as to define an airflow path between the at least one air intake and the at least one air outlet, the computer housing being adapted to receive the computer at a location in the airflow path; and wherein the display screen enclosure is arranged relative to the computer housing such that a fan disposed in a rear portion of a display screen received in the display screen enclosure is located adjacent the at least one air outlet of the computer housing during use. The display housing in the above described embodiment utilises a fan built into the rear of the display screen to cool the computer by drawing warm air in the computer housing that has been heated by the computer through the air outlet and into the fan via the display screen enclosure. This action in turn causes air to be drawn into the computer housing at the air intake such that, whilst the fan is operational, a constant airflow stream passes through the computer housing. The computer is located between the air inlet and the air outlet such that the airflow cools the computer as it is drawn through the computer housing without the need for additional electronic components, air conditioning units or other equipment, thereby saving installation and maintenance costs. This in turn allows the housing to have a small footprint that can be installed into a greater range of areas when compared with known devices th...",
  "patent_number": "None",
  "abstract": "A display housing for a digital display screen, in one embodiment comprising a display screen enclosure adapted to receive a display screen and a computer housing arranged to receive a computer associated with the display screen for providing display content thereto. The computer housing has at least one air intake arranged at a first surface thereof and at least one air outlet arranged at a second surface thereof to define an airflow path between the at least one air intake and the at least one air outlet. The computer housing is adapted to receive the computer at a location in the airflow path and the display screen enclosure is arranged relative to the computer housing such that a fan disposed in a rear portion of a display screen received in the display screen enclosure is located adjacent the at least one air outlet of the computer housing during use.",
  "publication_number": "US20170083059A1-20170323",
  "_processing_info": {
    "original_size": 36075,
    "optimized_size": 3431,
    "reduction_percent": 90.49
  }
}