{
  "date_produced": "20180503",
  "publication_number": "US20180137428A1-20180517",
  "main_ipcr_label": "G06N9900",
  "decision": "PENDING",
  "application_number": "15275509",
  "inventor_list": [
    {
      "inventor_name_last": "Abdo",
      "inventor_name_first": "Baleegh",
      "inventor_city": "Carmel",
      "inventor_state": "NY",
      "inventor_country": "US"
    }
  ],
  "abstract": "A technique relates to configuring a superconducting router. The superconducting router is operated in a first mode. Ports are configured to be in reflection in the first mode in order to reflect a signal. The superconducting router is operated in a second mode. A given pair of the ports is connected together and in transmission in the second mode, such that the signal is permitted to pass between the given pair of the ports.",
  "filing_date": "20160926",
  "patent_number": "None",
  "summary": "<SOH> SUMMARY <EOH>According to one or more embodiments, a method of configuring a superconducting router is provided. The method includes operating the superconducting router in a first mode, in which ports are configured to be in reflection in the first mode in order to reflect a signal. Also, the method includes operating the superconducting router in a second mode, in which a given pair of the ports is connected together and in transmission in the second mode, such that the signal is permitted to pass between the given pair of the ports. According to one or more embodiments, a method of configuring a superconducting circulator is provided. The method includes operating the superconducting circulator to receive a readout signal at an input port while an output port is in reflection. The readout signal is to be transmitted through a common port to a quantum system, and the readout signal is configured to cause a reflected readout signal to resonate back from the quantum system. Also, the method includes operating the superconducting circulator to output the reflected readout signal at the output port while the input port is in reflection. According to one or more embodiments, a superconducting router is provided. The superconducting router includes ports configured to operate in a first mode and a second mode. In the first mode, the ports are configured to be in reflection in order to reflect a signal. The superconducting router includes a given pair of the ports configured to operate in the second mode. In the second mode, the given pair of the ports is connected together and in transmission, such that the signal is permitted to pass between the given pair of the ports. According to one or more embodiments, a superconducting circulator is provided. The superconducting circulator includes an input port connected to a first tunable filter such that the input port is configured to operate in a first mode and a second mode, and an output port connected to a second tu...",
  "date_published": "20180517",
  "title": "ROUTING QUANTUM SIGNALS IN THE MICROWAVE DOMAIN USING TIME DEPENDENT SWITCHING",
  "ipcr_labels": [
    "G06N9900",
    "H01L3902"
  ],
  "_processing_info": {
    "original_size": 79010,
    "optimized_size": 3006,
    "reduction_percent": 96.2
  }
}