{
  "decision": "PENDING",
  "application_number": "15278236",
  "date_published": "20180329",
  "date_produced": "20180315",
  "title": "LEADFRAME FOR SURFACE MOUNTED CONTACT FINGERS",
  "filing_date": "20160928",
  "inventor_list": [
    {
      "inventor_name_last": "Lai",
      "inventor_name_first": "Min-Tih",
      "inventor_city": "Orangevale",
      "inventor_state": "CA",
      "inventor_country": "US"
    }
  ],
  "ipcr_labels": [
    "G06F116",
    "H05K118",
    "H05K111",
    "H05K340",
    "H05K330"
  ],
  "main_ipcr_label": "G06F116",
  "summary": "<SOH> BRIEF DESCRIPTION OF THE DRAWINGS <EOH>FIG. 1 is a schematic diagram of an edge card having a gum-stick form factor. FIG. 2 is a schematic diagram of an edge card having surface mounted contact fingers in accordance with embodiments of the present disclosure. FIG. 3 is a schematic diagram of a leadframe stamped from a copper foil in accordance with embodiments of the present disclosure. FIGS. 4A-D are schematic diagrams illustrating an example assembly procedure for forming edge cards in accordance with embodiments of the present disclosure. FIG. 5 is a schematic diagram of placement of a leadframe onto an edge card strip in accordance with embodiments of the present disclosure. FIG. 6 is a block diagram of an example computing device that may connected via a linear edge connector. detailed-description description=\"Detailed Description\" end=\"lead\"?",
  "patent_number": "None",
  "abstract": "Aspects of the disclosure are directed to a printed circuit board and methods of making a printed circuit board. A printed circuit board strip can include a plurality of finger pads to receive metal contact fingers. The printed circuit board strip can also include a plurality of surface mount technology (SMT) solder pads on each of the printed circuit boards. One or more integrated circuit packages can be placed using SMT or pick-and-place techniques or similar techniques onto at least some of the SMT solder pads. The printed circuit board strip can also include a leadframe comprising metal contact fingers on the plurality of finger pads. The one or more integrated circuit packages and the leadframe comprising the metal contact fingers can be mechanically and electrically connected to printed circuit board strip through a solder process, such as that used in SMT or pick-and-place package assembly.",
  "publication_number": "US20180088628A1-20180329",
  "_processing_info": {
    "original_size": 31116,
    "optimized_size": 2354,
    "reduction_percent": 92.43
  }
}