{
  "decision": "ACCEPTED",
  "application_number": "15276101",
  "date_published": "20170112",
  "date_produced": "20161228",
  "title": "COLLECTING MESSAGES FROM A GROUP CHAT WINDOW THAT MENTION A SPECIFIC USER",
  "filing_date": "20160926",
  "inventor_list": [
    {
      "inventor_name_last": "Lan",
      "inventor_name_first": "Yan",
      "inventor_city": "Shenzhen",
      "inventor_state": "",
      "inventor_country": "CN"
    },
    {
      "inventor_name_last": "Liao",
      "inventor_name_first": "Qian Cheng",
      "inventor_city": "Wuhan",
      "inventor_state": "",
      "inventor_country": "CN"
    },
    {
      "inventor_name_last": "Wang",
      "inventor_name_first": "Li",
      "inventor_city": "Beijing",
      "inventor_state": "",
      "inventor_country": "CN"
    },
    {
      "inventor_name_last": "Wang",
      "inventor_name_first": "Xiao Li",
      "inventor_city": "Beijing",
      "inventor_state": "",
      "inventor_country": "CN"
    },
    {
      "inventor_name_last": "Zhang",
      "inventor_name_first": "Jun Qing",
      "inventor_city": "Beijing",
      "inventor_state": "",
      "inventor_country": "CN"
    }
  ],
  "ipcr_labels": [
    "H04L1258",
    "G06F1727",
    "G06K900"
  ],
  "main_ipcr_label": "H04L1258",
  "summary": "<SOH> SUMMARY <EOH>According to one embodiment, a method for collecting a plurality of online group chat messages. The method may include receiving a message associated with an online group chat session between a plurality of chat participants. The method may also include determining the received message satisfies at least one of a plurality of message collection rules. The method may further include recording the received message to at least one of a plurality of message tables based on each of the plurality of chat participants mentioned in the received message. The method may also include determining a first chat participant within the plurality of chat participants chooses to open a private chat session with at least one second chat participant within the plurality of chat participants. The method may further include identifying a plurality of recorded messages within the plurality of message tables associated with the at least one second chat participant. The method may also include displaying the plurality of identified recorded messages in a private chat session sub-window. According to another embodiment, a computer system for collecting a plurality of online group chat messages. The computer system may include one or more processors, one or more computer-readable memories, one or more computer-readable tangible storage devices, and program instructions stored on at least one of the one or more storage devices for execution by at least one of the one or more processors via at least one of the one or more memories, whereby the computer system is capable of performing a method. The computer system may include receiving a message associated with an online group chat session between a plurality of chat participants. The computer system may also include determining the received message satisfies at least one of a plurality of message collection rules. The computer system may further include recording the received message to at least one of a plurality of message ...",
  "patent_number": "9917805",
  "abstract": "Collecting online group chat messages. The method may include receiving a message associated with an online group chat session between chat participants. The method may also include determining the received message satisfies at least one message collection rule. The method may further include recording the received message to at least one message table based on each chat participant mentioned in the received message. The method may also include determining a first chat participant chooses to open a private chat session with at least one second chat participant. The method may further include identifying recorded messages within the message tables associated with the at least one second chat participant. The method may also include displaying the identified recorded messages in a private chat session sub-window.",
  "publication_number": "US20170012915A1-20170112",
  "_processing_info": {
    "original_size": 66019,
    "optimized_size": 3970,
    "reduction_percent": 93.99
  }
}