{
  "decision": "PENDING",
  "application_number": "15287378",
  "date_published": "20170831",
  "date_produced": "20170816",
  "title": "ADVANCING PAYMENT TO AN AFFILIATE BASED ON COMPANY ELECTRONIC LINK ACTIVITY",
  "filing_date": "20161006",
  "inventor_list": [
    {
      "inventor_name_last": "Khandelwal",
      "inventor_name_first": "Harsch",
      "inventor_city": "Kitchener",
      "inventor_state": "",
      "inventor_country": "CA"
    }
  ],
  "ipcr_labels": [
    "G06Q2010",
    "G06Q2012",
    "G06Q3002"
  ],
  "main_ipcr_label": "G06Q2010",
  "summary": "<SOH> SUMMARY OF THE INVENTION <EOH>The systems and methods disclosed herein provide for advancing payment for visitor interaction with affiliate links and to obviate or mitigate at least some of the above presented disadvantages. Affiliates earn income based on the models described above. Typically, most affiliates promote many different affiliate programs with the same and/or different companies and keeping track of multiple payments for the different programs can be difficult. Further, there is a delay between earning the income (i.e., the date on which an amount becomes owing under the affiliate program(s)) and the affiliate receiving payment for the income earned from the company(s). A further problem with current affiliate programs is that the affiliate receives payment for link interactions taken by the visitor, however this payment is typically provided separately from reporting of the manner/degree of link usage by the visitor. Accordingly, it is common that the affiliate does not know what specific visitor link interaction the payment is attributable to. Contrary to present affiliate payment systems there is provided a method and system for communicating payment to an affiliate based on electronic link activity for directing visitor traffic over a network to a company. The link activity is attributed to the affiliate. The method and system comprise receiving a request for payment for the affiliate including a specified payment period, a specified link set, and at least one company associated with the link set; contacting the at least one company for the payment period for confirming a level of the link activity for the link set during the payment period. The system and method also comprise generating a payment for the affiliate including compensation commensurate with the confirmed level of link activity, wherein the payment is subsequently communicated to the affiliate. According to one aspect there is provided a method for communicating payment to an aff...",
  "patent_number": "None",
  "abstract": "A method for advancing payment of a portion of one or more amounts due under an affiliate program to an affiliate, the amount being owed by a merchant of a website subject to the affiliate program. The method includes the steps of, first, providing a means for transmitting information to an administrator. The information is for use by the administrator to verify the affiliate's identity. Second, the method provides a means for enabling the administrator to verify the identity of the affiliate based on the information. Third, the method provides a means whereby the affiliate assigns the amount due under the affiliate program absolutely to the administrator, and whereby the affiliate requests that the portion of the amount due be advanced. Next, the method provides confirmation from the merchant that the amount due under the affiliate program is assigned absolutely to the administrator. Finally, the method provides a means for enabling the administrator to effect payment to the affiliate...",
  "publication_number": "US20170249609A1-20170831",
  "_processing_info": {
    "original_size": 81436,
    "optimized_size": 3595,
    "reduction_percent": 95.59
  }
}