{
  "date_produced": "20180328",
  "publication_number": "US20180101780A1-20180412",
  "main_ipcr_label": "G06N504",
  "decision": "PENDING",
  "application_number": "15287142",
  "inventor_list": [
    {
      "inventor_name_last": "Allen",
      "inventor_name_first": "Corville O.",
      "inventor_city": "Morrisville",
      "inventor_state": "NC",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Freed",
      "inventor_name_first": "Andrew R.",
      "inventor_city": "Cary",
      "inventor_state": "NC",
      "inventor_country": "US"
    }
  ],
  "abstract": "Embodiments relate to a system, program product, and method for use with an intelligent computer platform to decipher analogical phrases. A phrase is parsed into a set of terms to reveal an analogical pattern. The set of terms are categorized according to syntactic placement and each term is placed into two or more categories according to word type patterns in the phrase to produce metadata. The metadata is matched to outcome metadata generated from a set of outcomes produced from data storage and a set of grammatical data is generated for each potential outcome. A statistical model is trained, whereby the training includes weighing and ranking each potential outcome according to degree of congruence with the syntactic placement and word type patterns of the phrase. A highest outcome is selected, the highest outcome being the potential outcome with the highest rank and a confidence level data metric is then applied.",
  "filing_date": "20161006",
  "patent_number": "None",
  "summary": "<SOH> SUMMARY <EOH>The embodiments include a system, computer program product, and method for deciphering a phrase presented in an analogical pattern format. In one aspect, a system is provided for use with an intelligent computer platform for deciphering an analogical phrase. A processing unit is operatively coupled to memory and is in communication with an artificial intelligence platform. A tool, in communication with the processing unit, is activated by the artificial intelligence platform and employed to decipher a phrase. More specifically, deciphering the phrase includes parsing a phrase into a set of terms to reveal an analogical pattern. The set of terms are categorized according to syntactic placement and the terms are placed into two or more categories according to word type patterns in the phrase to produce metadata. The tool matches the metadata to outcome metadata generated from a set of outcomes produced from data storage and generates a set of grammatical data for each potential outcome. A statistical model is trained whereby the training includes weighing and ranking each potential outcome according to degree of congruence with the syntactic placement and word type patterns of the phrase. The tool selects a highest outcome, whereby the highest outcome is the potential outcome with the highest rank. A confidence level data metric is then applied to the highest outcome. In another aspect, a computer program device is provided for use with an intelligent computer platform for deciphering an analogical phrase. The device has program code embodied therewith. The program code is executable by a processing unit to parse a phrase into a set of terms to reveal an analogical pattern. The processing unit is then to categorize the set of terms according to syntactic placement and place the terms into two or more categories according to word type patterns in the phrase to produce metadata. The processing unit is to match the metadata to outcome metadata generate...",
  "date_published": "20180412",
  "title": "Machine Learning of Analogic Patterns",
  "ipcr_labels": [
    "G06N504",
    "G06N9900",
    "G06N700"
  ],
  "_processing_info": {
    "original_size": 93825,
    "optimized_size": 3628,
    "reduction_percent": 96.13
  }
}