{
  "decision": "PENDING",
  "application_number": "15284391",
  "date_published": "20180405",
  "date_produced": "20180322",
  "title": "VOICE ACTIVATED REMITTANCES",
  "filing_date": "20161003",
  "inventor_list": [
    {
      "inventor_name_last": "Studnicka",
      "inventor_name_first": "Todd",
      "inventor_city": "San Jose",
      "inventor_state": "CA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Vyas",
      "inventor_name_first": "Adhish",
      "inventor_city": "San Jose",
      "inventor_state": "CA",
      "inventor_country": "US"
    }
  ],
  "ipcr_labels": [
    "G06Q2040",
    "G06Q2032"
  ],
  "main_ipcr_label": "G06Q2040",
  "summary": "<SOH> BRIEF DESCRIPTION OF THE DRAWINGS <EOH>FIG. 1 is a block diagram of a networked system suitable for implementing the processes described herein for voice activated remittances, according to an embodiment; FIG. 2 is an example data flow diagram for voice activated remittances, according to an embodiment; FIG. 3 is an example data flow diagram for voice activated remittances, according to another embodiment; FIG. 4 is an example process flowchart for voice activated remittances, according to an embodiment; FIG. 5 is an example process flowchart for voice activated remittances, according to another particular embodiment; and FIG. 6 is a block diagram of a computer system suitable for implementing one or more components in FIG. 1 , FIG. 2 , and/or FIG. 3 , according to an embodiment. detailed-description description=\"Detailed Description\" end=\"lead\"? Embodiments of the present disclosure and their advantages are best understood by referring to the detailed description that follows. It should be appreciated that like reference numerals are used to identify like elements illustrated in one or more of the figures, wherein showings therein are for purposes of illustrating embodiments of the present disclosure and not for purposes of limiting the same.",
  "patent_number": "None",
  "abstract": "A system is provided for voice activated remittances. The system may perform operations that include receiving at least one audio stream corresponding to a real-time voice communication between a first user and a second user and identifying, based on the at least one audio stream, a set of words. The operation may also include determining that the set of words indicates a desired payment transaction between the first user and the second user and determining a payment amount to be remitted from the first user to the second user. Further the operations may include causing the payment amount to be remitted from a first financial account corresponding to the first user to a second financial account corresponding to the second user.",
  "publication_number": "US20180096355A1-20180405",
  "_processing_info": {
    "original_size": 87464,
    "optimized_size": 2681,
    "reduction_percent": 96.93
  }
}