{
  "date_produced": "20180322",
  "publication_number": "US20180096253A1-20180405",
  "main_ipcr_label": "G06N700",
  "decision": "PENDING",
  "application_number": "15284734",
  "inventor_list": [
    {
      "inventor_name_last": "Goldstein",
      "inventor_name_first": "Brett Jonathan",
      "inventor_city": "Washington Island",
      "inventor_state": "WI",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "King",
      "inventor_name_first": "Maggie Kate",
      "inventor_city": "South Bend",
      "inventor_state": "IN",
      "inventor_country": "US"
    }
  ],
  "abstract": "A system and method for predicting or forecasting rare events, such as instances of violent crime within a spatial region, in combination with other correlative variables, such as weather data. One or more machine learning algorithms is employed in order to predict rare events in conjunction with geospatial information and one or more correlative variables. By employing a combination of a downsampling of the rare event data, followed by the application of an ensemble of machine learning algorithms, increased precision of the predictions of future occurrences of the rare events may be achieved.",
  "filing_date": "20161004",
  "patent_number": "None",
  "summary": "<SOH> SUMMARY OF THE INVENTION <EOH>The present invention presents a system and method for predicting or forecasting rare events, such as instances of violent crime within a spatial region, in combination with other correlative variables, such as weather data. In particular, one or more machine learning algorithms is employed in order to predict rare events in conjunction with geospatial information and one or more correlative variables. Existing machine learning algorithms, standing alone, are not particularly well suited to working with rare event data, i.e., data that tends to be highly unbalanced between the number of “events” in the dataset versus “non events”. Existing data on rare events, such as historical crime events, is combined with variables that correlate with a rare data event, such as a crime event, such as, for example, weather data, emergency incident call data, non-emergency incident call data, social media-derived data, or other predictive variables, to calculate risk assessments for future events of a similar nature. Conventional predictive algorithms tend not to perform well on rare-event, or unbalanced data. Specifically, conventional machine learning algorithms tend to misclassify all events as non-events, as they are not sophisticated enough to accommodate the unbalanced nature of the rare event data employed in training the model. The inventors have discovered that, by employing a combination of a downsampling of the rare event data, followed by the application of an ensemble of machine learning algorithms, significantly more precise predictions may be made concerning the future occurrences of rare events, such as violent crime. The present invention comprises a database storing rare event data, such as historical violent crime incident data, and historical data on at least one correlative variable, such as, in the case of violent crime, historical weather data, including ambient temperature data. One or more software modules of an overall ...",
  "date_published": "20180405",
  "title": "RARE EVENT FORECASTING SYSTEM AND METHOD",
  "ipcr_labels": [
    "G06N700",
    "G06N9900"
  ],
  "_processing_info": {
    "original_size": 58104,
    "optimized_size": 3331,
    "reduction_percent": 94.27
  }
}