{
  "decision": "PENDING",
  "application_number": "15289018",
  "date_published": "20170406",
  "date_produced": "20170323",
  "title": "METHOD AND SYSTEM FOR EXPLORING THE ASSOCIATIONS BETWEEN DRUG SIDE-EFFECTS AND THERAPEUTIC INDICATIONS",
  "filing_date": "20161007",
  "inventor_list": [
    {
      "inventor_name_last": "Cao",
      "inventor_name_first": "Nan",
      "inventor_city": "Ossining",
      "inventor_state": "NY",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Hu",
      "inventor_name_first": "Jianying",
      "inventor_city": "Bronx",
      "inventor_state": "NY",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Sorrentino",
      "inventor_name_first": "Robert K.",
      "inventor_city": "Rye Brook",
      "inventor_state": "NY",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Wang",
      "inventor_name_first": "Fei",
      "inventor_city": "Ossining",
      "inventor_state": "NY",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Zhang",
      "inventor_name_first": "Ping",
      "inventor_city": "White Plains",
      "inventor_state": "NY",
      "inventor_country": "US"
    }
  ],
  "ipcr_labels": [
    "G06F1900",
    "G06N502"
  ],
  "main_ipcr_label": "G06F1900",
  "summary": "<SOH> SUMMARY <EOH>A system for analyzing chemical data comprising a processor; one or more classifiers, stored in memory and coupled to the processor, further comprising an indication predictive module configured to predict whether a given chemical treats a particular indication or not and a side effect predictive module configured to predict whether a given chemical causes a side-effect or not; a correlation engine configured to determine one or more correlations between one or more indications and one or more side effects for the given chemical; and a visualization tool configured to analyze the one or more correlations and to output results of the analysis. A method for analyzing chemical data, comprising classifying, using one or more classifiers stored in memory and coupled to a processor, wherein classifying further comprises predicting whether a given chemical treats one or more indications or not using an indication prediction module and predicting whether a given chemical causes one or more side effects or not using a side-effect predictive module; determining one or more correlations between one or more indications and one or more side effects for the given chemical using a correlation engine module; and analyzing the one or more correlations and outputting results using a visualization tool. A computer readable storage medium comprising a computer readable program, wherein the computer readable program when executed on a computer causes the computer to perform the steps of classifying, using one or more classifiers stored in memory and coupled to a processor, wherein classifying further comprises predicting whether a given chemical treats one or more indications or not using an indication prediction module and predicting whether a given chemical causes one or more side effects or not using a side-effect predictive module; determining one or more correlations between one or more indications and one or more side effects for the given chemical using a corre...",
  "patent_number": "None",
  "abstract": "A system and method for analyzing chemical data including a processor and one or more classifiers, stored in memory and coupled to the processor, which further includes an indication predictive module configured to predict whether a given chemical treats a particular indication or not and a side effect predictive module configured to predict whether a given chemical causes a side-effect or not. A correlation engine is configured to determine one or more correlations between one or more indications and one or more side effects for the given chemical and a visualization tool is configured to analyze the one or more correlations and to output results of the analysis.",
  "publication_number": "US20170098062A1-20170406",
  "_processing_info": {
    "original_size": 45413,
    "optimized_size": 3852,
    "reduction_percent": 91.52
  }
}