{
  "date_produced": "20170510",
  "publication_number": "US20170147935A1-20170525",
  "main_ipcr_label": "G06N700",
  "decision": "PENDING",
  "application_number": "15284187",
  "inventor_list": [
    {
      "inventor_name_last": "BAI",
      "inventor_name_first": "FAN",
      "inventor_city": "ANN ARBOR",
      "inventor_state": "MI",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "KAR",
      "inventor_name_first": "GORKEM",
      "inventor_city": "PISCATAWAY",
      "inventor_state": "NJ",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "MARTIN",
      "inventor_name_first": "DOUGLAS C.",
      "inventor_city": "OXFORD",
      "inventor_state": "MI",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "GRIMM",
      "inventor_name_first": "DONALD K.",
      "inventor_city": "UTICA",
      "inventor_state": "MI",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "GRUTESER",
      "inventor_name_first": "MARCO",
      "inventor_city": "PRINCETON",
      "inventor_state": "NJ",
      "inventor_country": "US"
    }
  ],
  "abstract": "A system and method for identifying a vehicle driver based on driver behaviors. The system and method include analyzing a sequence of vehicle start-up behaviors for rapid identification of the driver. The start-up analysis includes detecting and evaluating the sequence and timing of events including door opening, door closing, seat belt fastening, ignition switch usage and shift/drive, among others. The technique further includes analyzing a set of longitudinal (or long-term) behaviors for more robust verification of driver identification. The longitudinal behaviors include acceleration and braking patterns, speed pattern (compared to road type and speed limit), stop sign behavior, cruise control usage and many others. Statistical clustering techniques are employed for both the start-up and longitudinal behavior analyses to identify the driver.",
  "filing_date": "20161003",
  "patent_number": "None",
  "summary": "<SOH> SUMMARY OF THE INVENTION <EOH>In accordance with the teachings of the present invention, a system and method are disclosed for identifying a vehicle driver based on driver behaviors. The system and method include analyzing a sequence of vehicle start-up behaviors for rapid identification of the driver. The start-up analysis includes detecting and evaluating the sequence and timing of events including door opening, door closing, seat belt fastening, ignition switch usage and shift/drive, among others. The technique further includes analyzing a set of longitudinal (or long-term) behaviors for more robust verification of driver identification. The longitudinal behaviors include acceleration and braking patterns, speed pattern (compared to road type and speed limit), stop sign behavior, cruise control usage and many others. Statistical clustering techniques are employed for both the start-up and longitudinal behavior analyses to identify the driver. Additional features of the present invention will become apparent from the following description and appended claims, taken in conjunction with the accompanying drawings.",
  "date_published": "20170525",
  "title": "METHOD AND APPARATUS OF DIFFERENTIATING DRIVERS BASED ON DRIVING BEHAVIORS",
  "ipcr_labels": [
    "G06N700",
    "G06N9900",
    "G06F1730",
    "G07C502",
    "G01M17007"
  ],
  "_processing_info": {
    "original_size": 48395,
    "optimized_size": 3180,
    "reduction_percent": 93.43
  }
}