{
  "date_produced": "20170104",
  "publication_number": "US20170017889A1-20170119",
  "main_ipcr_label": "G06N504",
  "decision": "PENDING",
  "application_number": "15280960",
  "inventor_list": [
    {
      "inventor_name_last": "Krueger",
      "inventor_name_first": "Brett A.",
      "inventor_city": "Rochester Hills",
      "inventor_state": "MI",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Krueger",
      "inventor_name_first": "Kraig T.",
      "inventor_city": "Glen Ellyn",
      "inventor_state": "IL",
      "inventor_country": "US"
    }
  ],
  "abstract": "A method includes receiving inputs indicative of a user state of a user. The received inputs include one or more of: sensor inputs from one or more sensors in communication with the data processing hardware; application inputs received from one or more software applications executing on the data processing hardware or a remote device in communication with the data processing hardware; or user inputs received from a graphical user interface. The method further includes determining possible information to propose to the user based on the received inputs and executing behavior routines having corresponding objectives. Each behavior routine is configured to evaluate the possible information based on whether the possible information is related to or achieves the corresponding objective. The method includes selecting suggested information from the possible information based on evaluations of one or more behavior routines for presentation to the user.",
  "filing_date": "20160929",
  "patent_number": "None",
  "summary": "<SOH> SUMMARY <EOH>One aspect of the disclosure provides a method that includes receiving, at data processing hardware, inputs indicative of a user state of a user. The received inputs include sensor inputs from one or more sensors in communication with the data processing hardware and/or user inputs received from a graphical user interface. The method includes determining, by the data processing hardware, possible activities for the user to perform based on the received inputs, determining, by the data processing hardware, one or more predicted outcomes for each possible activity based on the received inputs, and executing, by the data processing hardware, behaviors having corresponding objectives. Each behavior is configured to evaluate a possible activity based on whether the possible activity and the corresponding one or more predicted outcomes of the possible activity achieves the corresponding objective. The method further includes selecting, by the data processing hardware, one or more possible activities based on evaluations of one or more behaviors, and outputting results including the selected one or more possible activities. Another aspect includes a method that includes receiving, at data processing hardware, inputs indicative of a user state of a user. The received inputs include one or more of sensor inputs from one or more sensors in communication with the data processing hardware, application inputs received from one or more software applications executing on the data processing hardware or a remote device in communication with the data processing hardware, and/or user inputs received from a graphical user interface. The method includes determining, by the data processing hardware, possible information for the user based on the received inputs and executing, by the data processing hardware, behaviors having corresponding objectives. Each behavior is configured to evaluate the possible information based on whether the possible information is related t...",
  "date_published": "20170119",
  "title": "Suggesting Activities",
  "ipcr_labels": [
    "G06N504"
  ],
  "_processing_info": {
    "original_size": 232255,
    "optimized_size": 3628,
    "reduction_percent": 98.44
  }
}