{
  "decision": "PENDING",
  "application_number": "15287143",
  "date_published": "20171130",
  "date_produced": "20171115",
  "title": "SYSTEM AND METHOD FOR MANAGEMENT OF WORKFLOW CONFIGURATIONS",
  "filing_date": "20161006",
  "inventor_list": [
    {
      "inventor_name_last": "SHAH",
      "inventor_name_first": "Viral Prakash",
      "inventor_city": "Mumbai",
      "inventor_state": "",
      "inventor_country": "IN"
    },
    {
      "inventor_name_last": "Shukla",
      "inventor_name_first": "Shobhit",
      "inventor_city": "Mumbai",
      "inventor_state": "",
      "inventor_country": "IN"
    },
    {
      "inventor_name_last": "Jain",
      "inventor_name_first": "Ikshita",
      "inventor_city": "Mumbai",
      "inventor_state": "",
      "inventor_country": "IN"
    },
    {
      "inventor_name_last": "Keshore",
      "inventor_name_first": "Meenal",
      "inventor_city": "Mumbai",
      "inventor_state": "",
      "inventor_country": "IN"
    },
    {
      "inventor_name_last": "Dhakad",
      "inventor_name_first": "Ramprasad",
      "inventor_city": "Mumbai",
      "inventor_state": "",
      "inventor_country": "IN"
    },
    {
      "inventor_name_last": "Chandarana",
      "inventor_name_first": "Bhakti",
      "inventor_city": "Mumbai",
      "inventor_state": "",
      "inventor_country": "IN"
    }
  ],
  "ipcr_labels": [
    "G06Q1010",
    "G06F1730"
  ],
  "main_ipcr_label": "G06Q1010",
  "summary": "<SOH> SUMMARY <EOH>The following presents a simplified summary of some embodiments of the disclosure in order to provide a basic understanding of the embodiments. This summary is not an extensive overview of the embodiments. It is not intended to identify key/critical elements of the embodiments or to delineate the scope of the embodiments. Its sole purpose is to present some embodiments in a simplified form as a prelude to the more detailed description that is presented below. In view of the foregoing, an embodiment herein provides a technique for management of workflow configurations is disclosed. In one aspect, a computer-implemented method for management of workflow configurations is disclosed. In this aspect, an update in a workflow configuration is received. Further, a list of transactions in a workflow at multiple levels are fetched upon receiving the update in the workflow configuration. For example, the workflow includes the list of transactions at the multiple levels and a list of stakeholders associated with the list of transactions. Furthermore, a plurality of clauses at each of the multiple levels are executed to determine a set of eligible stakeholders for performing the list of transactions and corresponding actions. Each of the plurality of clauses are decision control points configured at each of the multiple levels. Moreover, the list of stakeholders and corresponding actions for each of the list of transactions at the multiple levels are dynamically updated based on the set of eligible stakeholders for performing the list of transactions and corresponding actions. In another aspect, a system for management of workflow configurations is disclosed. In an example, the system includes one or more processors and a memory communicatively coupled to the processors. Further, the memory includes a workflow management module. In an example implementation, the workflow management module receives an update in a workflow configuration. Further, the workflow ma...",
  "patent_number": "None",
  "abstract": "A technique for management of workflow configurations is disclosed. In an embodiment, an update in a workflow configuration is received. Further, a list of transactions in a workflow at multiple levels are fetched upon receiving the update in the workflow configuration, the workflow includes the list of transactions and a list of stakeholders associated with the list of transactions. Furthermore, a plurality of clauses at each of the multiple levels are executed to determine a set of eligible stakeholders for performing the list of transactions and corresponding actions. Each of the plurality of clauses are decision control points configured at each of the multiple levels. Moreover, the list of stakeholders and corresponding actions for each of the list of transactions at the multiple levels are dynamically updated based on the set of eligible stakeholders for performing the list of transactions and corresponding actions.",
  "publication_number": "US20170344951A1-20171130",
  "_processing_info": {
    "original_size": 44040,
    "optimized_size": 4215,
    "reduction_percent": 90.43
  }
}