{
  "date_produced": "20170323",
  "publication_number": "US20170098154A1-20170406",
  "main_ipcr_label": "G06N306",
  "decision": "PENDING",
  "application_number": "15286202",
  "inventor_list": [
    {
      "inventor_name_last": "Glendenning",
      "inventor_name_first": "Paul",
      "inventor_city": "Woodside",
      "inventor_state": "CA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Leventhal",
      "inventor_name_first": "Michael C.",
      "inventor_city": "Los Gatos",
      "inventor_state": "CA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Dlugosch",
      "inventor_name_first": "Paul",
      "inventor_city": "Eagle",
      "inventor_state": "ID",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Noyes",
      "inventor_name_first": "Harold B",
      "inventor_city": "Boise",
      "inventor_state": "ID",
      "inventor_country": "US"
    }
  ],
  "abstract": "The Automata Processor Workbench (AP Workbench) is an application for creating and editing designs of AP networks (e.g., one or more portions of the state machine engine, one or more portions of the FSM lattice, or the like) based on, for example, an Automata Network Markup Language (ANML). For instance, the application may include a tangible, non-transitory computer-readable medium configured to store instructions executable by a processor of an electronic device, wherein the instructions include instructions to represent an automata network as a graph.",
  "filing_date": "20161005",
  "patent_number": "None",
  "summary": "<SOH> BRIEF DESCRIPTION OF DRAWINGS <EOH>FIG. 1 illustrates an example of system having a state machine engine, according to various embodiments; FIG. 2 illustrates an example of an FSM lattice of the state machine engine of FIG. 1 , according to various embodiments; FIG. 3 illustrates an example of a block of the FSM lattice of FIG. 2 , according to various embodiments; FIG. 4 illustrates an example of a row of the block of FIG. 3 , according to various embodiments; FIG. 4A illustrates a block as in FIG. 3 having counters in rows of the block, according to various embodiments of the invention; FIG. 5 illustrates an example of a Group of Two of the row of FIG. 4 , according to embodiments; FIG. 6 illustrates an example of a finite state machine graph, according to various embodiments; FIG. 7 illustrates an example of two-level hierarchy implemented with FSM lattices, according to various embodiments; FIG. 7A illustrates a second example of two-level hierarchy implemented with FSM lattices, according to various embodiments; FIG. 8 illustrates an example of a method for a compiler to convert source code into a binary file for programming of the FSM lattice of FIG. 2 , according to various embodiments; FIG. 9 illustrates a state machine engine, according to various embodiments; FIG. 10 illustrates an example of an Automata Processor (AP) Workbench startup; FIG. 11 illustrates an example of a property sheet screen in AP Workbench; FIG. 12 illustrates an example of activities preparing for simulation screen in AP Workbench; FIG. 13 illustrates an example of project preferences screen in AP Workbench; FIG. 14 illustrates an example of a find dialog screen in AP Workbench; FIG. 15 illustrates an example of a routing preferences screen in AP Workbench; FIG. 16 illustrates an example of xompile project dialog screen in AP Workbench; FIG. 17 illustrates an example of a publish macros dialog screen in AP Workbench; FIG. 18 illustrates an example of a validation preferences scr...",
  "date_published": "20170406",
  "title": "METHODS AND SYSTEMS FOR CREATING NETWORKS",
  "ipcr_labels": [
    "G06N306",
    "G06F1730",
    "G06F30481",
    "G06N310"
  ],
  "_processing_info": {
    "original_size": 166303,
    "optimized_size": 3569,
    "reduction_percent": 97.85
  }
}