{
  "date_produced": "20180328",
  "publication_number": "US20180101772A1-20180412",
  "main_ipcr_label": "G06N504",
  "decision": "PENDING",
  "application_number": "15288477",
  "inventor_list": [
    {
      "inventor_name_last": "Adderly",
      "inventor_name_first": "Darryl M.",
      "inventor_city": "Morrisville",
      "inventor_state": "NC",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Mannan",
      "inventor_name_first": "Rosanna S.",
      "inventor_city": "San Jose",
      "inventor_state": "CA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Schultz",
      "inventor_name_first": "Kevin L.",
      "inventor_city": "Raleigh",
      "inventor_state": "NC",
      "inventor_country": "US"
    }
  ],
  "abstract": "In an approach to predicting user touch events, one or more computer processors receive a detected electromagnetic noise signal of an object. The one or more computer processors compare the detected electromagnetic noise signal of the object to one or more stored electromagnetic noise signals associated with one or more objects. Based, at least in part, on the comparison, the one or more computer processors determine the identity of the object. Responsive to determining the identity of the object, the one or more computer processors store metadata associated with at least one of the objects and an electromagnetic noise signal detection event. The one or more computer processors determine whether an amount of the metadata associated with the object meets a learning threshold. If the amount of metadata meets the learning threshold, the one or more computer processors predict a subsequent electromagnetic noise signal detection event associated with the object.",
  "filing_date": "20161007",
  "patent_number": "None",
  "summary": "<SOH> SUMMARY <EOH>Embodiments of the present invention disclose a method, a computer program product, and a system for predicting a user touch event. The method includes one or more computer processors receiving a detected electromagnetic noise signal of an object. The one or more computer processors compare the detected electromagnetic noise signal of the object to one or more stored electromagnetic noise signals associated with one or more objects. Based, at least in part, on the comparison, the one or more computer processors determine the identity of the object. Responsive to determining the identity of the object, the one or more computer processors store metadata associated with at least one of the objects and an electromagnetic noise signal detection event. The one or more computer processors determine whether an amount of the metadata associated with the object meets a learning threshold. Responsive to determining the amount of metadata associated with the object meets the learning threshold, the one or more computer processors predict a subsequent electromagnetic noise signal detection event associated with the object.",
  "date_published": "20180412",
  "title": "ELECTROMAGNETIC NOISE SIGNAL BASED PREDICTIVE ANALYTICS",
  "ipcr_labels": [
    "G06N504",
    "G06N9900",
    "G06F3041",
    "G06F3046"
  ],
  "_processing_info": {
    "original_size": 61404,
    "optimized_size": 2998,
    "reduction_percent": 95.12
  }
}