{
  "date_produced": "20180322",
  "publication_number": "US20180096242A1-20180405",
  "main_ipcr_label": "G06N3063",
  "decision": "PENDING",
  "application_number": "15282705",
  "inventor_list": [
    {
      "inventor_name_last": "Modha",
      "inventor_name_first": "Dharmendra",
      "inventor_city": "San Jose",
      "inventor_state": "CA",
      "inventor_country": "US"
    }
  ],
  "abstract": "A scalable stream synaptic supercomputer for extreme throughput neural networks is provided. The firing state of a plurality of neurons of a first neurosynaptic core is determined substantially in parallel. The firing state of the plurality of neurons is delivered to at least one additional neurosynaptic core substantially in parallel.",
  "filing_date": "20160930",
  "patent_number": "None",
  "summary": "<SOH> BRIEF SUMMARY <EOH>According to embodiments of the present disclosure, a method of and computer program product for operating a neural network are provided. The firing state of a plurality of neurons of a first neurosynaptic core is determined substantially in parallel. The firing state of the plurality of neurons is delivered to at least one additional neurosynaptic core substantially in parallel. According to embodiments of the present disclosure, a neuromorphic system is provided. The system includes a plurality of neurosynaptic cores. The neurosynaptic cores comprise a plurality of axons, a plurality of synapses, and a plurality of neurons. An inter-core network connects the plurality of neurosynaptic cores. The inter-core network is adapted to deliver from a first neurosynaptic core of the plurality of neurosynaptic cores to at least one additional neurosynaptic core the firing state of the plurality of neurons of the first neurosynaptic core substantially in parallel. According to embodiments of the present disclosure, a method of and computer program product for simulating a neural network are provided. A plurality of neurosynaptic cores are simulated. The simulated neurosynaptic cores comprise a plurality of simulated axons, a plurality of simulated synapses, and a plurality of simulated neurons. An network is simulated connecting the plurality of simulated neurosynaptic cores. The determination of the firing state of the plurality of simulated neurons of a first of the simulated neurosynaptic cores substantially in parallel is simulated. The delivery of the firing state of the plurality of simulated neurons to at least an additional of the simulated neurosynaptic cores substantially in parallel is simulated.",
  "date_published": "20180405",
  "title": "SCALABLE STREAM SYNAPTIC SUPERCOMPUTER FOR EXTREME THROUGHPUT NEURAL NETWORKS",
  "ipcr_labels": [
    "G06N3063",
    "G06N304"
  ],
  "_processing_info": {
    "original_size": 40222,
    "optimized_size": 2667,
    "reduction_percent": 93.37
  }
}