{
  "date_produced": "20180322",
  "publication_number": "US20180096260A1-20180405",
  "main_ipcr_label": "G06N9900",
  "decision": "PENDING",
  "application_number": "15283238",
  "inventor_list": [
    {
      "inventor_name_last": "Zimmer",
      "inventor_name_first": "Vincent J.",
      "inventor_city": "Tacoma",
      "inventor_state": "WA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Spurlock",
      "inventor_name_first": "Joel R.",
      "inventor_city": "Portland",
      "inventor_state": "OR",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Venugopalan",
      "inventor_name_first": "Ramnath",
      "inventor_city": "Webster",
      "inventor_state": "NY",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Smith",
      "inventor_name_first": "Ned M.",
      "inventor_city": "Beaverton",
      "inventor_state": "OR",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Muttik",
      "inventor_name_first": "Igor G.",
      "inventor_city": "Berkhamsted",
      "inventor_state": "",
      "inventor_country": "GB"
    },
    {
      "inventor_name_last": "Poornachandran",
      "inventor_name_first": "Rajesh",
      "inventor_city": "Portland",
      "inventor_state": "OR",
      "inventor_country": "US"
    }
  ],
  "abstract": "Disclosed herein are cloud-based machine learning systems and methods for monitoring networked devices to identify and classify characteristics, to infer typical or atypical behavior and assign reputation profiles across various networked devices, and to make remediation recommendations. In some embodiments, a cloud-based machine learning system may learn the typical operation and interfacing of a plurality of reputable devices that are known to be free from malicious software and other threats. In some embodiments, a cloud-based machine learning system may learn the typical operation and interfacing of a device, and may identify atypical operations or interfaces associated with that device by comparing the operations and interfaces to those of a plurality of networked devices or to those of a defined standard reference device.",
  "filing_date": "20160930",
  "patent_number": "None",
  "summary": "<SOH> BRIEF DESCRIPTION OF THE DRAWINGS <EOH>To provide a more complete understanding of the present disclosure and features and advantages thereof, reference is made to the following description, taken in conjunction with the accompanying figures, wherein like reference numerals represent like parts, in which: FIG. 1 is a simplified block diagram of an exemplary cloud-based machine learning system for monitoring networked devices, in accordance with various embodiments; FIG. 2 is a simplified block diagram of an exemplary device monitored by a cloud-based machine learning system, in accordance with various embodiments; FIG. 3 is a simplified block diagram of a cloud-based machine learning module, in accordance with various embodiments; and FIGS. 4A and 4B are flow diagrams of an illustrative method of monitoring devices and assigning reputation score to a device using a cloud-based machine learning module, in accordance with various embodiments; detailed-description description=\"Detailed Description\" end=\"lead\"? The FIGURES of the drawings are not necessarily drawn to scale, as their dimensions can be varied considerably without departing from the scope of the present disclosure.",
  "date_published": "20180405",
  "title": "STATIC AND DYNAMIC DEVICE PROFILE REPUTATION USING CLOUD-BASED MACHINE LEARNING",
  "ipcr_labels": [
    "G06N9900",
    "G06N504"
  ],
  "_processing_info": {
    "original_size": 67390,
    "optimized_size": 3369,
    "reduction_percent": 95.0
  }
}