{
  "decision": "PENDING",
  "application_number": "15287682",
  "date_published": "20170406",
  "date_produced": "20170323",
  "title": "SYSTEMS AND METHODS FOR DYNAMICALLY GENERATING PATROL SCHEDULES BASED ON HISTORIC DEMAND DATA",
  "filing_date": "20161006",
  "inventor_list": [
    {
      "inventor_name_last": "Herman",
      "inventor_name_first": "Shawn Michael",
      "inventor_city": "Fort Collins",
      "inventor_state": "CO",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Johnson",
      "inventor_name_first": "Jason Kyle",
      "inventor_city": "Fort Collins",
      "inventor_state": "CO",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Poore",
      "inventor_name_first": "Jeffery Brian",
      "inventor_city": "Windsor",
      "inventor_state": "CO",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Du Toit",
      "inventor_name_first": "Philip Christopher",
      "inventor_city": "Berthoud",
      "inventor_state": "CO",
      "inventor_country": "US"
    }
  ],
  "ipcr_labels": [
    "G06Q1006",
    "G06N502"
  ],
  "main_ipcr_label": "G06Q1006",
  "summary": "<SOH> BRIEF DESCRIPTION OF DRAWING(S) <EOH>The accompanying drawings, which are incorporated in and constitute a part of this specification, illustrate the disclosed embodiments and together with the description, serve to explain the principles of the various aspects of the disclosed embodiments. In the drawings: FIG. 1 is a flow diagram illustrating an exemplary method for dynamically generating patrol schedules based on historic demand event data and current event data consistent with embodiments of the present disclosure; FIG. 2A illustrates a first exemplary expected-demand map; FIG. 2B illustrates a second exemplary expected-demand map; FIG. 3 illustrates an exemplary patrol schedule display; FIG. 4A illustrates a first exemplary assignment display; FIG. 4B illustrates a second exemplary assignment display; FIG. 5 illustrates an exemplary compliance-data display; FIG. 6 illustrates an exemplary compliance-value display; FIG. 7 illustrates an exemplary proximity display; FIG. 8 illustrates an exemplary event map; FIG. 9 illustrates an exemplary patrol scheduling system for implementing methods and systems consistent with the present disclosure; and FIG. 10 illustrates an exemplary system for generating patrol schedules. detailed-description description=\"Detailed Description\" end=\"lead\"? It is to be understood that both the foregoing general description and the following detailed description are exemplary and explanatory only and are not restrictive of the claims.",
  "patent_number": "None",
  "abstract": "Systems and methods are described herein for dynamically generating and updating a patrol schedule for a shift based on historic demand event data, and a predicted-demand model based on the historic demand event data. The systems and methods also receive information associated with patrol officers assigned to a shift and constraints on the officers' availability, and generate a patrol schedule comprising patrol assignments for the assigned patrol officers optimized based on at least one policing objective. The patrol schedule may be dynamically updated based on changing information and provided to the patrol officer via mobile device or display in the patrol officer's vehicle.",
  "publication_number": "US20170098181A1-20170406",
  "_processing_info": {
    "original_size": 100181,
    "optimized_size": 3247,
    "reduction_percent": 96.76
  }
}