{
  "decision": "ACCEPTED",
  "application_number": "15283854",
  "date_published": "20180405",
  "date_produced": "20180322",
  "title": "COMMUNICATION HEADSETS AND SYSTEMS FOR MOBILE APPLICATION CONTROL AND POWER SAVINGS",
  "filing_date": "20161003",
  "inventor_list": [
    {
      "inventor_name_last": "McGary",
      "inventor_name_first": "Dale",
      "inventor_city": "Pittsburgh",
      "inventor_state": "PA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Sharbaugh",
      "inventor_name_first": "Richard",
      "inventor_city": "New Kensington",
      "inventor_state": "PA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Nichols",
      "inventor_name_first": "Matthew",
      "inventor_city": "Pittsburgh",
      "inventor_state": "PA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Nickel",
      "inventor_name_first": "Sean",
      "inventor_city": "Monroeville",
      "inventor_state": "PA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "DiPiazza",
      "inventor_name_first": "Bryan Michael",
      "inventor_city": "Belle Vernon",
      "inventor_state": "PA",
      "inventor_country": "US"
    }
  ],
  "ipcr_labels": [
    "H04R110",
    "G06F316",
    "H04R108"
  ],
  "main_ipcr_label": "H04R110",
  "summary": "<SOH> SUMMARY <EOH>A headset assembly is provided, according to various embodiments. The headset assembly comprises a headband comprising a proximity sensor activation element and a receiver assembly configured to be rotated with respect to the headband between a first position and a second position. The receiver assembly comprises a memory, a proximity sensor, a processor communicatively coupled to the memory and the proximity sensor, a microphone boom having a first end and a second end, and a microphone located adjacent the first end of the microphone boom and a speaker located adjacent the second end of the microphone boom. The processor comprises a programmable input/output port (PIO). The proximity sensor activation element is positioned to trigger the proximity sensor to activate the programmable input/output port when the receiver assembly is rotated to the second position and to deactivate the programmable input/output port when the receiver assembly is rotated to the first position. The proximity sensor is configured to transmit at least one signal representing a position of the receiver assembly with respect to the headband. A system is provided, according to various embodiments. The system comprises a headset assembly communicatively coupled to a mobile device. The headset assembly comprises a headband comprising a proximity sensor activation element and a receiver assembly coupled to the headband and configured to be rotated with respect thereto between a first position and a second position. The receiver assembly comprises a memory, a proximity sensor, a processor communicatively coupled to the memory and to the proximity sensor, a microphone boom having a first end and a second end, and a microphone located adjacent the first end of the microphone boom and a speaker located adjacent the second end of the microphone boom. The processor comprises a programmable input/output port. The processor is configured, by a software program to receive the at least...",
  "patent_number": "9936278",
  "abstract": "Headset assemblies and systems for mobile application control and power savings are provided. Headset assembly includes headband with proximity sensor activation element and receiver assembly configured to be rotated with respect to the headband between a first position and a second position. Receiver assembly has memory, proximity sensor, processor communicatively coupled to memory and proximity sensor, microphone boom having first and second ends, and microphone located adjacent first end and speaker located adjacent second end. Processor comprises PIO port. Proximity sensor activation element is positioned to trigger proximity sensor to activate PIO port when receiver assembly is rotated to the second position and to deactivate PIO port when receiver assembly is rotated to first position. Proximity sensor is configured to transmit at least one signal representing receiver assembly position.",
  "publication_number": "US20180098145A1-20180405",
  "_processing_info": {
    "original_size": 76941,
    "optimized_size": 4115,
    "reduction_percent": 94.65
  }
}