{
  "date_produced": "20180328",
  "publication_number": "US20180101774A1-20180412",
  "main_ipcr_label": "G06N504",
  "decision": "PENDING",
  "application_number": "15289781",
  "inventor_list": [
    {
      "inventor_name_last": "Werris",
      "inventor_name_first": "Ian",
      "inventor_city": "San Francisco",
      "inventor_state": "CA",
      "inventor_country": "US"
    }
  ],
  "abstract": "Systems, methods, and non-transitory computer-readable media can train a machine learning model to output respective scores for content items based at least in part on information describing a user, wherein a score for a content item measures a likelihood that the user will select the content item to be included in a social profile of the user. A determination is made that a first user of the social networking system is eligible for a content item suggestion. A first content item to be provided as a suggestion to the first user is determined based at least in part on the model. The first content item is provided as a suggestion to the first user for use in a social profile of the first user.",
  "filing_date": "20161010",
  "patent_number": "None",
  "summary": "<SOH> SUMMARY <EOH>Various embodiments of the present disclosure can include systems, methods, and non-transitory computer readable media configured to train a machine learning model to output respective scores for content items based at least in part on information describing a user, wherein a score for a content item measures a likelihood that the user will select the content item to be included in a social profile of the user. A determination is made that a first user of the social networking system is eligible for a content item suggestion. A first content item to be provided as a suggestion to the first user is determined based at least in part on the model. The first content item is provided as a suggestion to the first user for use in a social profile of the first user. In an embodiment, the systems, methods, and non-transitory computer readable media are configured to determine that the first user has not selected a cover photo for use in the social profile of the first user. In an embodiment, the systems, methods, and non-transitory computer readable media are configured to determine that the first user has uploaded a content item to the social networking system. In an embodiment, the systems, methods, and non-transitory computer readable media are configured to generate a set of training examples that each include information describing a user and a corresponding set of features that describe a cover photo being used in a social profile of the user. In an embodiment, the systems, methods, and non-transitory computer readable media are configured to determine one or more sets of words that describe a user from content that was published by the user through the social networking system. In an embodiment, the systems, methods, and non-transitory computer readable media are configured to extract at least one noun, verb, or concept from the content that was published by the user. In an embodiment, the systems, methods, and non-transitory computer readable media...",
  "date_published": "20180412",
  "title": "SYSTEMS AND METHODS FOR SUGGESTING CONTENT",
  "ipcr_labels": [
    "G06N504",
    "H04L2908",
    "G06N9900"
  ],
  "_processing_info": {
    "original_size": 83002,
    "optimized_size": 3256,
    "reduction_percent": 96.08
  }
}