{
  "date_produced": "20180328",
  "publication_number": "US20180101782A1-20180412",
  "main_ipcr_label": "G06N700",
  "decision": "PENDING",
  "application_number": "15287710",
  "inventor_list": [
    {
      "inventor_name_last": "Gohl",
      "inventor_name_first": "Pascal",
      "inventor_city": "Zurich",
      "inventor_state": "",
      "inventor_country": "CH"
    },
    {
      "inventor_name_last": "Omari",
      "inventor_name_first": "Sammy",
      "inventor_city": "Winterthur",
      "inventor_state": "",
      "inventor_country": "CH"
    }
  ],
  "abstract": "This disclosure relates to systems and methods for determining predicted risk for a flight path of an unmanned aerial vehicle. A previously stored three-dimensional representation of a user-selected location may be obtained. The three-dimensional representation may be derived from depth maps of the user-selected location generated during previous unmanned aerial vehicle flights. The three-dimensional representation may reflect a presence of objects and object existence accuracies for the individual objects. The object existence accuracies for the individual objects may provide information about accuracy of existence of the individual objects within the user-selected location. A user-created flight path may be obtained for a future unmanned aerial flight within the three-dimensional representation of the user-selected location. Predicted risk may be determined for individual portions of the user-created flight path based upon the three-dimensional representation of the user-selected loc...",
  "filing_date": "20161006",
  "patent_number": "None",
  "summary": "<SOH> SUMMARY <EOH>The disclosure relates to determining predicted risk for a flight path of an unmanned aerial vehicle (“UAV”) based upon a three-dimensional representation of a geographical location, in accordance with one or more implementations. A previously stored three-dimensional representation of a user-selected location may be obtained. The three-dimensional representation may be derived from depth maps of the user-selected location generated during previous unmanned aerial flights. The three-dimensional representation may reflect a presence of objects and object existence accuracies for the individual objects. The object existence accuracies for the individual objects may provide information about accuracy of existence of the individual objects and/or accuracy of existence of boundaries of the individual objects within the user-selected location. A user-created flight path may be obtained for a future unmanned aerial flight within the three-dimensional representation of the user-selected location. Predicted risk may be determined for the individual portions of the user-created flight path based upon the three-dimensional representation of the user-selected location. In some implementations, a system configured to determine predicted risk for a flight path of an unmanned aerial vehicle may include one or more servers. The server(s) may be configured to communicate with one or more client computing platform(s) according to a client/server architecture. The users of the system may access the system via client computing platform(s). the server(s) may be configured to execute one or more computer program components. The computer program components may include one or more of a representation component, a flight path component, a risk component, and/or other components. The representation component may be configured to obtain a previously stored three-dimensional representation of a user-selected location. The representation component may be configured to obtain ...",
  "date_published": "20180412",
  "title": "SYSTEMS AND METHODS FOR DETERMINING PREDICTED RISK FOR A FLIGHT PATH OF AN UNMANNED AERIAL VEHICLE",
  "ipcr_labels": [
    "G06N700",
    "G08G500",
    "B64C3902"
  ],
  "_processing_info": {
    "original_size": 68505,
    "optimized_size": 3760,
    "reduction_percent": 94.51
  }
}