{
  "decision": "PENDING",
  "application_number": "15282341",
  "date_published": "20180405",
  "date_produced": "20180322",
  "title": "TECHNIQUES AND ARCHITECTURES FOR PROTECTION OF EFFICIENTLY ALLOCATED UNDER-UTILIZED RESOURCES",
  "filing_date": "20160930",
  "inventor_list": [
    {
      "inventor_name_last": "Walsh",
      "inventor_name_first": "James E.",
      "inventor_city": "Woodinville",
      "inventor_state": "WA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Tiwari",
      "inventor_name_first": "Sameer",
      "inventor_city": "Fremont",
      "inventor_state": "CA",
      "inventor_country": "US"
    }
  ],
  "ipcr_labels": [
    "G06F950"
  ],
  "main_ipcr_label": "G06F950",
  "summary": "<SOH> BRIEF DESCRIPTION OF THE DRAWINGS <EOH>Embodiments of the invention are illustrated by way of example, and not by way of limitation, in the figures of the accompanying drawings in which like reference numerals refer to similar elements. FIG. 1 is a block diagram of one embodiment of an architecture that can provide efficient allocation of under-utilized resources as described herein. FIG. 2 is a conceptual illustration of a scavengable resource where a resource utilization fence is being utilized. FIG. 3 is a flow diagram of one embodiment of a technique for managing a resource allocation fence. FIG. 4 is a block diagram of one embodiment of an agent that can function to manage a resource allocation fence. FIG. 5 illustrates a block diagram of an environment where an on-demand database service might be used. FIG. 6 illustrates a block diagram of an environment where an on-demand database service might be used. detailed-description description=\"Detailed Description\" end=\"lead\"?",
  "patent_number": "None",
  "abstract": "A computing environment having a first plurality of executing processes being executed by one or more processors. The executing processes each have associated resources. The executing processes utilize the associated resources. A consumed portion of a resource that is utilized by a selected executing process from the first plurality of executing resources is determined. An unconsumed portion of the resource is estimated. A first preselected amount of the unconsumed portion is allocated for utilization by a process not in the first plurality. A second preselected amount of the unconsumed portion is reserved as a fence between the consumed portion and the allocated first preselected amount of the unconsumed portion.",
  "publication_number": "US20180095803A1-20180405",
  "_processing_info": {
    "original_size": 58922,
    "optimized_size": 2451,
    "reduction_percent": 95.84
  }
}