{
  "decision": "PENDING",
  "application_number": "15289274",
  "date_published": "20180412",
  "date_produced": "20180328",
  "title": "SLA-BASED POWER MANAGEMENT IN DISAGGREGATED COMPUTING SYSTEMS",
  "filing_date": "20161010",
  "inventor_list": [
    {
      "inventor_name_last": "MAHINDRU",
      "inventor_name_first": "Ruchi",
      "inventor_city": "Elmsford",
      "inventor_state": "NY",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "BIVENS",
      "inventor_name_first": "John A.",
      "inventor_city": "Ossining",
      "inventor_state": "NY",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "DAS",
      "inventor_name_first": "Koushik K.",
      "inventor_city": "Yorktown Heights",
      "inventor_state": "NY",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "LI",
      "inventor_name_first": "Min",
      "inventor_city": "San Jose",
      "inventor_state": "CA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "RAMASAMY",
      "inventor_name_first": "HariGovind V.",
      "inventor_city": "Ossining",
      "inventor_state": "NY",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "RUAN",
      "inventor_name_first": "Yaoping",
      "inventor_city": "White Plains",
      "inventor_state": "NY",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "SALAPURA",
      "inventor_name_first": "Valentina",
      "inventor_city": "Chappaqua",
      "inventor_state": "NY",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "SCHENFELD",
      "inventor_name_first": "Eugen",
      "inventor_city": "South Brunswick",
      "inventor_state": "NJ",
      "inventor_country": "US"
    }
  ],
  "ipcr_labels": [
    "G06F132",
    "G06F948"
  ],
  "main_ipcr_label": "G06F132",
  "summary": "<SOH> SUMMARY OF THE INVENTION <EOH>Various embodiments for power management in a disaggregated computing system, by a processor device, are provided. In one embodiment, a method comprises distributing initial electrical power levels thereby allocating a voltage and a clock speed to each one of a set of processor cores in the disaggregated computing system; and adjusting the voltage and the clock speed of respective processor cores within the set of processor cores according to a workload priority of respective workloads performed by each respective one of the processor cores, wherein the workload priority is assigned based upon a service level agreement (SLA). In addition to the foregoing exemplary embodiment, various other system and computer program product embodiments are provided and supply related advantages. The foregoing Summary has been provided to introduce a selection of concepts in a simplified form that are further described below in the Detailed Description. This Summary is not intended to identify key features or essential features of the claimed subject matter, nor is it intended to be used as an aid in determining the scope of the claimed subject matter. The claimed subject matter is not limited to implementations that solve any or all disadvantages noted in the background.",
  "patent_number": "None",
  "abstract": "For power management in a disaggregated computing system, initial electrical power levels are distributed thereby allocating a voltage and a clock speed to each one of a set of processor cores in the disaggregated computing system. The voltage and the clock speed of respective processor cores within the set of processor cores are adjusted according to a workload priority of respective workloads performed by each respective one of the processor cores, wherein the workload priority is assigned based upon a service level agreement (SLA).",
  "publication_number": "US20180101214A1-20180412",
  "_processing_info": {
    "original_size": 89533,
    "optimized_size": 3461,
    "reduction_percent": 96.13
  }
}