{
  "date_produced": "20180322",
  "publication_number": "US20180096251A1-20180405",
  "main_ipcr_label": "G06N504",
  "decision": "PENDING",
  "application_number": "15283025",
  "inventor_list": [
    {
      "inventor_name_last": "Dinu",
      "inventor_name_first": "Daniel",
      "inventor_city": "Sunnyvale",
      "inventor_state": "CA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Peng",
      "inventor_name_first": "Lingjuan",
      "inventor_city": "Menlo Park",
      "inventor_state": "CA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Qi",
      "inventor_name_first": "Niting",
      "inventor_city": "Union City",
      "inventor_state": "CA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Yadav",
      "inventor_name_first": "Ashish Kumar",
      "inventor_city": "Mountain View",
      "inventor_state": "CA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Vora",
      "inventor_name_first": "Neal Suresh",
      "inventor_city": "San Jose",
      "inventor_state": "CA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Nader",
      "inventor_name_first": "Andre",
      "inventor_city": "San Francisco",
      "inventor_state": "CA",
      "inventor_country": "US"
    }
  ],
  "abstract": "Systems, methods, and non-transitory computer readable media can determine one or more user-related metrics relating to each page of a plurality of pages associated with an administrator based on a first machine learning model. One or more recommendations relating to each page of the plurality of pages can be determined based on a second machine learning model. One or more pages of the plurality of pages for which to display cards including page updates in a feed of the administrator can be determined, based on the determined user-related metrics and the determined recommendations.",
  "filing_date": "20160930",
  "patent_number": "None",
  "summary": "<SOH> SUMMARY <EOH>Various embodiments of the present disclosure can include systems, methods, and non-transitory computer readable media configured to determine one or more user-related metrics relating to each page of a plurality of pages associated with an administrator based on a first machine learning model. One or more recommendations relating to each page of the plurality of pages can be determined based on a second machine learning model. One or more pages of the plurality of pages for which to display cards including page updates in a feed of the administrator can be determined, based on the determined user-related metrics and the determined recommendations. In some embodiments, the cards for the one or more pages are displayed in a content item in the feed of the administrator. In certain embodiments, a card for a page of the one or more pages is displayed as a card in the content item. In an embodiment, the card for the page displays one or more of: page information relating to the page, user-related metrics relating to the page, or recommendations relating to the page. In some embodiments, feedback associated with one or more of: the displayed cards for pages, the displayed user-related metrics, or the displayed recommendations is obtained. In certain embodiments, the content item includes a card that provides a list including at least one page not included in the one or more pages and a number of unread items associated with the at least one page. In an embodiment, the first machine learning model is trained based on training data indicating user-related metrics selected by a plurality of administrators. In some embodiments, the second machine learning model is trained based on training data indicating recommendations selected by a plurality of administrators. In certain embodiments, the determining one or more pages of the plurality of pages for which to display cards including page updates in a feed of the administrator is based on a third machine lea...",
  "date_published": "20180405",
  "title": "SYSTEMS AND METHODS FOR PROVIDING FEED PAGE UPDATES IN A SOCIAL NETWORKING SYSTEM",
  "ipcr_labels": [
    "G06N504",
    "G06N9900",
    "G06F30482"
  ],
  "_processing_info": {
    "original_size": 102176,
    "optimized_size": 3927,
    "reduction_percent": 96.16
  }
}