{
  "date_produced": "20180322",
  "publication_number": "US20180096261A1-20180405",
  "main_ipcr_label": "G06N9900",
  "decision": "PENDING",
  "application_number": "15283308",
  "inventor_list": [
    {
      "inventor_name_last": "Chu",
      "inventor_name_first": "Hong-Min",
      "inventor_city": "Taipei",
      "inventor_state": "",
      "inventor_country": "TW"
    },
    {
      "inventor_name_last": "Tsou",
      "inventor_name_first": "Yu-Lin",
      "inventor_city": "New Taipei City",
      "inventor_state": "",
      "inventor_country": "TW"
    },
    {
      "inventor_name_last": "Yang",
      "inventor_name_first": "Shao-Wen",
      "inventor_city": "San Jose",
      "inventor_state": "CA",
      "inventor_country": "US"
    }
  ],
  "abstract": "An anomaly detection model generator accesses sensor data generated by a plurality of sensors, determines a plurality of feature vectors from the sensor data, and executes a plurality of unsupervised anomaly detection machine learning algorithms in an ensemble using the plurality of feature vectors to generate a set of predictions. Respective entropy-based weightings are determined for each of the plurality of unsupervised anomaly detection machine learning algorithms from the set of predictions. A set of pseudo labels is generated based on the predictions and weightings, and a supervised machine learning algorithm uses the set of pseudo labels as training data to generate an anomaly detection model corresponding to the plurality of sensors.",
  "filing_date": "20161001",
  "patent_number": "None",
  "summary": "<SOH> BRIEF DESCRIPTION OF THE DRAWINGS <EOH>FIG. 1A illustrates an embodiment of a system including multiple sensor devices and an example management system. FIG. 1B illustrates an embodiment of a cloud computing network. FIG. 2 illustrates an embodiment of a system including an example management system. FIG. 3 is a simplified flow diagram illustrating an example generation of an anomaly detection model. FIG. 4 is a simplified flow diagram illustrating an example generation of anomaly labels for use in generating an anomaly detection model. FIG. 5 is a simplified block diagram illustrating examples of the generation and use of anomaly detection models. FIG. 6 is a flowchart illustrating an example technique for generating an anomaly detection model using an ensemble of unsupervised machine learning algorithms. FIG. 7 is a block diagram of an exemplary processor in accordance with one embodiment; and FIG. 8 is a block diagram of an exemplary computing system in accordance with one embodiment. detailed-description description=\"Detailed Description\" end=\"lead\"? Like reference numbers and designations in the various drawings indicate like elements.",
  "date_published": "20180405",
  "title": "UNSUPERVISED MACHINE LEARNING ENSEMBLE FOR ANOMALY DETECTION",
  "ipcr_labels": [
    "G06N9900"
  ],
  "_processing_info": {
    "original_size": 96760,
    "optimized_size": 2756,
    "reduction_percent": 97.15
  }
}