{
  "date_produced": "20170412",
  "publication_number": "US20170116522A1-20170427",
  "main_ipcr_label": "G06N312",
  "decision": "PENDING",
  "application_number": "15280353",
  "inventor_list": [
    {
      "inventor_name_last": "Ibrahim",
      "inventor_name_first": "Sahrul Hilmi",
      "inventor_city": "Kajang",
      "inventor_state": "",
      "inventor_country": "MY"
    },
    {
      "inventor_name_last": "Bin Ahmad Fatan",
      "inventor_name_first": "Ahmad Abdulsalam",
      "inventor_city": "Pagoh",
      "inventor_state": "",
      "inventor_country": "MY"
    },
    {
      "inventor_name_last": "Padhi",
      "inventor_name_first": "Surjya Narayana",
      "inventor_city": "Seri Petaling",
      "inventor_state": "",
      "inventor_country": "MY"
    },
    {
      "inventor_name_last": "Bin Ismail",
      "inventor_name_first": "Muhamad Noh",
      "inventor_city": "Kajang",
      "inventor_state": "",
      "inventor_country": "MY"
    },
    {
      "inventor_name_last": "Bin Shahrir",
      "inventor_name_first": "Mohammad Shazri",
      "inventor_city": "Puchong",
      "inventor_state": "",
      "inventor_country": "MY"
    },
    {
      "inventor_name_last": "Sutan Nameh",
      "inventor_name_first": "Sevia Mahdaliza Idrus",
      "inventor_city": "Johor Bahru",
      "inventor_state": "",
      "inventor_country": "MY"
    },
    {
      "inventor_name_last": "Bt. Mohd Zaini",
      "inventor_name_first": "Noor Fazilatulakma",
      "inventor_city": "Ipoh",
      "inventor_state": "",
      "inventor_country": "MY"
    }
  ],
  "abstract": "A system and method for automatically assigning multiple tasks with multiple objectives to multiple teams (group of technician on field) is provided. This invention provides a means to minimize total operation cost and business process through the optimization consisting of the best assignment of resources to available task. In the tasks assignment and resource allocation method disclosed herein, new genetically adapted search agent (Genetic algorithm) are employed to improve the population, to provide the most optimum match matrix among jobs and teams, and calculate the best score of the fittest chromosome. The assignments generated by this method satisfy all constraints.",
  "filing_date": "20160929",
  "patent_number": "None",
  "summary": "<SOH> SUMMARY OF INVENTION <EOH>The invention provides a computer implemented method for assigning tasks to a group of workers including the steps of retrieving, by a data retrieval module, information relating to a set of activities to be executed, a set resources to be utilized during the execution of the activities, a set of constraints to be satisfied, and a set of objectives to be accomplished from a database; assigning, by a weight assigning module, a weight value according to the set of constraints for each of the activities; sorting, by a task sorting module, the activities according to each of their respective weight value; assigning, by the task sorting module, at least one resource to each of the activities; generating, by a match matrix generator, a matrix carrying the list of activities with their corresponding resource assigned; and applying, by a genetic algorithm module, a genetic algorithm process on the generated matrix to produce an optimum solution for the assignment of the at least one resource to each of the activities. Preferably, the genetic algorithm process includes the steps of generating a plurality rows of initial population, wherein each row of the initial population corresponds to one chromosome in a genetic algorithm, and each activity in the row of the initial population corresponds to a gene in the genetic algorithm, forming a fitness function based on the initial population to acquire fitness values of the chromosomes, selecting an optimum fitness value by using roulette wheel selection, performing a chromosome crossover process and a mutation process to generate new and mutated sets of chromosomes, executing an iteration process on the chromosome crossover process and the mutation process until a predetermined maximum repetition value is reached so as to obtain an optimum chromosome, and outputting the outcomes of the genetic algorithm process to a display unit. Alternatively, the step of sorting the activities is according to des...",
  "date_published": "20170427",
  "title": "Method For Task Scheduling And Resources Allocation And System Thereof",
  "ipcr_labels": [
    "G06N312"
  ],
  "_processing_info": {
    "original_size": 34309,
    "optimized_size": 4194,
    "reduction_percent": 87.78
  }
}