{
  "decision": "PENDING",
  "application_number": "15282654",
  "date_published": "20180405",
  "date_produced": "20180322",
  "title": "INTERACTION CONTEXT-BASED VIRTUAL REALITY",
  "filing_date": "20160930",
  "inventor_list": [
    {
      "inventor_name_last": "Osman",
      "inventor_name_first": "Steven",
      "inventor_city": "San Mateo",
      "inventor_state": "CA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Arroyo Palacios",
      "inventor_name_first": "Jorge",
      "inventor_city": "San Mateo",
      "inventor_state": "CA",
      "inventor_country": "US"
    }
  ],
  "ipcr_labels": [
    "G06F30484",
    "G06F1727",
    "G06T1900"
  ],
  "main_ipcr_label": "G06F30484",
  "summary": "<SOH> SUMMARY <EOH>As understood herein, a user's profile data and input history may be used to alleviate the problems noted above. Accordingly, a device includes a computer memory that is not a transitory signal and that in turn includes instructions executable by at least one processor to access at least one stored record of computer-aided communication between at least first and second users, analyze the record for context, and determine whether to alter at least one computer parameter based on analyzing the record for context. The computer parameter may include a language used by a speech recognition module and/or a language used by an automatic text correction module. The computer parameter may also include presentation of a widget, such that for a first context a first widget is presented and for a second context a second widget is presented. Additionally, the computer parameter may include presentation of a virtual reality (VR) scene, such that for a first context a first VR scene is presented and for a second context a second VR scene is presented. In addition to or in lieu of the foregoing, the computer parameter may include presentation of a file type selector, such that for a first context a first file type selector is presented and for a second context a second file type selector is presented. Still further, the computer parameter may include presentation of a chat application, such that for a first context a first configuration of the chat application is presented and for a second context a second configuration of the chat application is presented. In another aspect, a method includes accessing at least one record of communication between first and second users, generating a result of the accessing using a computer, determining whether to alter at least one computer parameter using the result, altering the at least one computer parameter responsive to determining to alter the at least one computer parameter, and not altering the at least one computer pa...",
  "patent_number": "None",
  "abstract": "Conversation-based context rules for altering virtual reality (VR) gaming and for switching between input languages based on heuristics related to past conversations between users.",
  "publication_number": "US20180095624A1-20180405",
  "_processing_info": {
    "original_size": 71988,
    "optimized_size": 2892,
    "reduction_percent": 95.98
  }
}