{
  "date_produced": "20170323",
  "publication_number": "US20170098155A1-20170406",
  "main_ipcr_label": "G06N3063",
  "decision": "PENDING",
  "application_number": "15281174",
  "inventor_list": [
    {
      "inventor_name_last": "LEPAGE",
      "inventor_name_first": "Dominic",
      "inventor_city": "Longueuil",
      "inventor_state": "",
      "inventor_country": "CA"
    },
    {
      "inventor_name_last": "CHAKER",
      "inventor_name_first": "Mohamed",
      "inventor_city": "Montreal",
      "inventor_state": "",
      "inventor_country": "CA"
    }
  ],
  "abstract": "A synthetic neuronal structure makes use of a semiconductor-metal phase transition material having material regions separated by discontinuities. The discontinuities represent interfaces such that different phases in two adjacent regions result in a metal-semiconductor interface. The interface supports a charge accumulation and a discharge of accumulated charge when an activation energy provided, for example, by electrical current, localized heating or optical energy, reaches a threshold necessary for breakdown of a potential barrier presented by the interface, and thus mimics a leaky integrate-and-fire neuron. With many such interfaces distributed through the structure, the local inputs to a neuron become a weighted sum of energy from neighboring neurons. Thus, different combinations of signals at one or more inputs connected to the structure will favor different neural pathways through the structure, thereby resulting in a neural network.",
  "filing_date": "20160930",
  "patent_number": "None",
  "summary": "<SOH> SUMMARY OF THE INVENTION <EOH>In accordance with the present invention, a synthetic neuronal structure is provided that makes use of a semiconductor-metal phase transition material with different material regions separated by discontinuities. The phase of a given material region is changeable in response to the application of a threshold activation energy. When the material regions separated by a discontinuity are in different phases, a metal-semiconductor interface is formed at the location of the discontinuity. The metal-semiconductor interface can support a charge accumulation and a discharge of accumulated charge when the activation energy reaches a threshold necessary for breakdown of a potential barrier presented by the interface. The charge accumulation is increased by a flow of electric charges (a current), but eventually limits the current and increases the voltage across the interface. If the activation energy threshold is reached, there is a breakdown of the potential barrier at the interface, and a discharge of accumulated charges occurs. The system is thus reset and the cycle restarted. This embodiment of the invention further comprises at least one input contact by which an input signal may be supplied to at least one of the material regions, and at least one output contact by which an output signal from at least one of the material regions may be detected or forwarded to another system. The synthetic neuronal structure is such that an activation energy above a predetermined threshold changes the conductivity of the structure by changing the phase of one or more of the material regions. That activation energy may be provided, for example, by a change in electrical current density, a change in temperature or a change in optical energy directed toward the structure. In an exemplary embodiment, the interfaces operate as switchable Schottky barriers, as the respective phase states of adjacent material regions may create a junction that is metal-semic...",
  "date_published": "20170406",
  "title": "SELF-ORGANIZED SOLID-STATE SYNTHETIC NEURONAL STRUCTURE",
  "ipcr_labels": [
    "G06N3063",
    "G06N304"
  ],
  "_processing_info": {
    "original_size": 44687,
    "optimized_size": 3655,
    "reduction_percent": 91.82
  }
}