{
  "decision": "PENDING",
  "application_number": "15284016",
  "date_published": "20170126",
  "date_produced": "20170110",
  "title": "BROWSING ELECTRONIC MESSAGES DISPLAYED AS TILES",
  "filing_date": "20161003",
  "inventor_list": [
    {
      "inventor_name_last": "Wang",
      "inventor_name_first": "Yanling",
      "inventor_city": "Belmont",
      "inventor_state": "CA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Wang",
      "inventor_name_first": "Hui",
      "inventor_city": "Foster City",
      "inventor_state": "CA",
      "inventor_country": "US"
    }
  ],
  "ipcr_labels": [
    "G06F30482",
    "G06F30484",
    "H04L1258",
    "G06F30488"
  ],
  "main_ipcr_label": "G06F30482",
  "summary": "<SOH> SUMMARY <EOH>This Summary is provided to introduce a selection of concepts in a simplified form that are further described below in the Detailed Description. This Summary is not intended to identify key features or essential features of the claimed subject matter, nor is it intended to be used as an aid in determining the scope of the claimed subject matter. Electronic messages are displayed as tiles. A tile includes a background that includes information obtained from the electronic message. For example, the background of a tile may be a preview of an attachment to the message (e.g. a picture, document, link . . . ). When the message includes an attachment, an overlay is displayed over the background. The overlay includes information relating to the electronic message (i.e. subject, sender, time stamp, message preview . . . ). When the message does not include an attachment then the tile may include all/portion of the content of the electronic message. For example, the tile may include the subject, sender, time, and message content. A user may switch between different browsing experiences to navigate the electronic messages (e.g. conversation view, list view, strip view, . . . ). For example, when a tile represents a conversation each sender within the conversation may be displayed on a tile along with a preview of the messages of the conversation (i.e. the most recent message).",
  "patent_number": "None",
  "abstract": "Electronic messages are displayed as tiles. A tile may include a background related to the electronic message. For example, the background of a tile may be a preview of an attachment to the message. When the message includes an attachment (e.g. document, picture, link . . . ), an overlay is displayed over the background. The overlay includes information relating to the electronic message (i.e. subject, sender, time, message preview . . . ). When the message does not include an attachment then the tile may include all/portion of the content of the electronic message. For example, the tile may include the subject, sender, time stamp, and message content. A user may switch between different browsing experiences (e.g. conversation view, list view, strip view, . . . ). When a tile represents a conversation each sender within the conversation may be displayed on a tile along with a preview of the messages of the conversation (i.e. the most recent message).",
  "publication_number": "US20170024089A1-20170126",
  "_processing_info": {
    "original_size": 51854,
    "optimized_size": 3088,
    "reduction_percent": 94.04
  }
}