{
  "date_produced": "20170104",
  "publication_number": "US20170017904A1-20170119",
  "main_ipcr_label": "G06N9900",
  "decision": "PENDING",
  "application_number": "15287846",
  "inventor_list": [
    {
      "inventor_name_last": "Heng",
      "inventor_name_first": "Fook-Luen",
      "inventor_city": "Yorktown Heights",
      "inventor_state": "NY",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Li",
      "inventor_name_first": "Zhiguo",
      "inventor_city": "Yorktown Heights",
      "inventor_state": "NY",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Siegel",
      "inventor_name_first": "Stuart A.",
      "inventor_city": "Millburn",
      "inventor_state": "NJ",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Singhee",
      "inventor_name_first": "Amith",
      "inventor_city": "Bangalore",
      "inventor_state": "",
      "inventor_country": "IN"
    },
    {
      "inventor_name_last": "Wang",
      "inventor_name_first": "Haijing",
      "inventor_city": "Valhalla",
      "inventor_state": "NY",
      "inventor_country": "US"
    }
  ],
  "abstract": "A method, system, and computer program product for resource management are described. The method includes selecting trouble regions within the service area, generating clustered regions, and training a trouble forecast model for the trouble regions for each type of damage, the training for each trouble region using training data from every trouble region within the clustered region associated with the trouble region. The method also includes applying the trouble forecast model for each trouble region within the service area for each type of damage, determining a trouble forecast for the service area for each type of damage based on the trouble forecast for each of the trouble regions within the service area, and determining a job forecast for the service area based on the trouble forecast for the service area, wherein the managing resources is based on the job forecast for the service area.",
  "filing_date": "20161007",
  "patent_number": "None",
  "summary": "<SOH> SUMMARY <EOH>Embodiments include a computer-implemented method, system, and computer program product for managing resources based on weather-related damage in a service area. The method includes selecting trouble regions within the service area, generating clustered regions, each of the clustered regions including at least one of the trouble regions within the service area and each of the trouble regions within the service area being associated with one of the clustered regions, and training a trouble forecast model for the trouble regions for each type of damage, the training for each trouble region using training data from every trouble region within the clustered region associated with the trouble region. The method also includes applying the trouble forecast model for each trouble region within the service area for each type of damage, determining a trouble forecast for the service area for each type of damage based on the trouble forecast for each of the trouble regions within the service area, and determining a job forecast for the service area based on the trouble forecast for the service area, wherein the managing resources is based on the job forecast for the service area. Additional features and advantages are realized through the techniques of the present invention. Other embodiments and aspects of the invention are described in detail herein and are considered a part of the claimed invention. For a better understanding of the invention with the advantages and the features, refer to the description and to the drawings.",
  "date_published": "20170119",
  "title": "WEATHER-DRIVEN MULTI-CATEGORY INFRASTRUCTURE IMPACT FORECASTING",
  "ipcr_labels": [
    "G06N9900",
    "G06N700"
  ],
  "_processing_info": {
    "original_size": 43251,
    "optimized_size": 3623,
    "reduction_percent": 91.62
  }
}