{
  "decision": "PENDING",
  "application_number": "15286206",
  "date_published": "20180405",
  "date_produced": "20180322",
  "title": "NON-RECTILINEAR TOUCH SURFACE",
  "filing_date": "20161005",
  "inventor_list": [
    {
      "inventor_name_last": "Mali",
      "inventor_name_first": "Akhil Keshav",
      "inventor_city": "Pune",
      "inventor_state": "",
      "inventor_country": "IN"
    },
    {
      "inventor_name_last": "Apostol",
      "inventor_name_first": "Joy Marie",
      "inventor_city": "Romulus",
      "inventor_state": "MI",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Pfau",
      "inventor_name_first": "Douglas Allen",
      "inventor_city": "Canton",
      "inventor_state": "MI",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Walsh",
      "inventor_name_first": "Kathleen Ann",
      "inventor_city": "Farmington Hills",
      "inventor_state": "MI",
      "inventor_country": "US"
    }
  ],
  "ipcr_labels": [
    "G06F3047"
  ],
  "main_ipcr_label": "G06F3047",
  "summary": "<SOH> SUMMARY <EOH>The following description relates to a non-rectilinear touch surface, as well as a method for providing a non-rectilinear touch surface. A touch surface device is described herein. The touch surface includes a plurality of x-axis wires that extend from a left side to a right side, the right side opposing the left side; a plurality of y-axis wires that extend from a top side to a bottom side, the bottom side opposing the top side, the plurality of y-axis wires and the plurality of x-axis wires being overlaid with each other. Further, each of the plurality of x-axis wires are coupled to one of a plurality of signal generating elements or one of a plurality of sensing elements, and each of the plurality of y-axis wires are coupled to an opposite one of the plurality of signal generating elements or one of the plurality of sensing elements, and each of the plurality of y-axis wires form a respective angle from a side that extend from the top to bottom side and a horizontal plane, and includes a middle wire that has a respective angle of 90 degrees, and each of plurality of the y-axis wires to a right of the middle wire's respective angle is greater than 90 degrees, and vary in an increasing amount, and each of the plurality of the y-axis wires to a left of the middle wire's respective angle less than 90 degrees, and vary in a decreasing amount. In another embodiment, the touch surface includes an orientation where each of the plurality of x-axis wires and the plurality of y-axis wires include a plurality of diamond shaped projections. In another embodiment, each of the plurality of diamond shaped projections are sized so a plurality of gaps that form in response to the plurality of x-axis wires and y-axis wires being overlaid with each are consistent in size. In another embodiment, the touch surface further comprises partial diamond shape projects on ends of each of the plurality of x-axis wires. In another embodiment, each of the plurality of respect...",
  "patent_number": "None",
  "abstract": "A non-rectilinear touch surface is disclosed herein. The non-rectilinear touch surface is shown with wires extending from a top to bottom side, and a left to right side, with the intersection of said wires allowing for the performance of touch-based technology. Also included herein is a method for producing the non-rectilinear touch surface.",
  "publication_number": "US20180095563A1-20180405",
  "_processing_info": {
    "original_size": 29061,
    "optimized_size": 3317,
    "reduction_percent": 88.59
  }
}