{
  "decision": "PENDING",
  "application_number": "15286247",
  "date_published": "20170406",
  "date_produced": "20170323",
  "title": "INFORMATION PROCESSING DEVICE, AND SWITCHING DEVICE",
  "filing_date": "20161005",
  "inventor_list": [
    {
      "inventor_name_last": "KOHARA",
      "inventor_name_first": "Tasuku",
      "inventor_city": "Kanagawa",
      "inventor_state": "",
      "inventor_country": "JP"
    }
  ],
  "ipcr_labels": [
    "G06F3041",
    "G06F3044",
    "G06F302",
    "H04N100",
    "G06F314",
    "G06F301"
  ],
  "main_ipcr_label": "G06F3041",
  "summary": "<SOH> SUMMARY <EOH>The present disclosure provides an information processing device, switching device and method by an input may be provided to a touchscreen via a switching device mounted upon the touchscreen. In accordance with the present disclosure, an information processing device comprises a touchscreen that includes a first surface that outputs images and detects an input to the first surface, a sensor that detects whether a switching device is mounted on the touchscreen, and processing circuitry. The processing circuitry is configured to control a display state of the touchscreen based on a detection result of the sensor so that the touchscreen outputs in a first display mode when the switching device is not mounted on the touchscreen, and the touchscreen outputs in a second display mode when the switching device is mounted on the touchscreen. The processing circuitry controls the touchscreen so that, when outputting in the second display mode, the output images are formatted according to an arrangement of a plurality of switches on the switching device and a position of the switching device on the touchscreen. The switching device may include an identifier, and the sensor may detect whether the switching device is mounted on the touchscreen according to whether the sensor recognizes the identifier. The switching device includes a plurality of identifiers so that, when the sensor detects that the switching device is mounted on the touchscreen, the sensor also detects an orientation of the switching device by recognizing respective positions of the plurality of identifiers, and the processing circuitry recognizes the orientation of the switching device based on the orientation detected by the sensor, and formats the output images according to the orientation of the switching device. The sensor detects a placement error of the switching upon the touchscreen, and the processing circuitry controls the touchscreen to output the images to indicate the placement er...",
  "patent_number": "None",
  "abstract": "An information processing device includes a touchscreen that includes a first surface that outputs images and detects an input to the first surface, a sensor that detects whether a switching device is mounted an the touchscreen, and processing circuitry. The processing circuitry is configured to control a display state of the touchscreen based on a detection result of the sensor so that the touchscreen outputs in a first display mode when the switching device is not mounted on the touchscreen, and the touchscreen outputs in a second display mode when the switching device is mounted on the touchscreen.",
  "publication_number": "US20170097719A1-20170406",
  "_processing_info": {
    "original_size": 58501,
    "optimized_size": 3203,
    "reduction_percent": 94.52
  }
}