{
  "date_produced": "20171004",
  "publication_number": "US20170300809A1-20171019",
  "main_ipcr_label": "G06N3063",
  "decision": "PENDING",
  "application_number": "15280027",
  "inventor_list": [
    {
      "inventor_name_last": "Modha",
      "inventor_name_first": "Dharmendra S.",
      "inventor_city": "San Jose",
      "inventor_state": "CA",
      "inventor_country": "US"
    }
  ],
  "abstract": "In one embodiment, the present invention provides a neural network circuit comprising multiple symmetric core circuits. Each symmetric core circuit comprises a first core module and a second core module. Each core module comprises a plurality of electronic neurons, a plurality of electronic axons, and an interconnection network comprising multiple electronic synapses interconnecting the axons to the neurons. Each synapse interconnects an axon to a neuron. The first core module and the second core module are logically overlayed on one another such that neurons in the first core module are proximal to axons in the second core module, and axons in the first core module are proximal to neurons in the second core module. Each neuron in each core module receives axonal firing events via interconnected axons and generates a neuronal firing event according to a neuronal activation function.",
  "filing_date": "20160929",
  "patent_number": "None",
  "summary": "<SOH> BRIEF SUMMARY <EOH>In one embodiment, the present invention provides a neural network circuit comprising multiple symmetric core circuits. Each symmetric core circuit comprises a first core module and a second core module. Each core module comprises a plurality of electronic neurons, a plurality of electronic axons, and an interconnection network comprising multiple electronic synapses interconnecting the axons to the neurons. Each synapse interconnects an axon to a neuron. The first core module and the second core module are logically overlayed on one another such that neurons in the first core module are proximal to axons in the second core module, and axons in the first core module are proximal to neurons in the second core module. Each neuron in each core module receives axonal firing events via interconnected axons and generates a neuronal firing event according to a neuronal activation function. In another embodiment, the present invention provides a neural network circuit comprising multiple core modules. Each core module comprises a plurality of electronic neurons, a plurality of electronic axons, and an electronic synapse array comprising multiple electronic synapses interconnecting the axons to the neurons. Each synapse interconnects an axon to a neuron. Each neuron in each core module receives axonal firing events via interconnected axons and generates a neuronal firing event according to a neuronal activation function. These and other features, aspects and advantages of the present invention will become understood with reference to the following description, appended claims and accompanying figures.",
  "date_published": "20171019",
  "title": "HIERARCHICAL SCALABLE NEUROMORPHIC SYNAPTRONIC SYSTEM FOR SYNAPTIC AND STRUCTURAL PLASTICITY",
  "ipcr_labels": [
    "G06N3063",
    "G06N306",
    "G06N304",
    "G06N304",
    "G06N306",
    "G06F1730",
    "G06N302"
  ],
  "_processing_info": {
    "original_size": 64130,
    "optimized_size": 3191,
    "reduction_percent": 95.02
  }
}