{
  "date_produced": "20170412",
  "publication_number": "US20170116512A1-20170427",
  "main_ipcr_label": "G06N3063",
  "decision": "PENDING",
  "application_number": "15296566",
  "inventor_list": [
    {
      "inventor_name_last": "KUROKAWA",
      "inventor_name_first": "Yoshiyuki",
      "inventor_city": "Sagamihara",
      "inventor_state": "",
      "inventor_country": "JP"
    }
  ],
  "abstract": "A neuron circuit can switch between two functions: as an input neuron circuit, and as a hidden neuron circuit. An error circuit can switch between two functions: as a hidden error circuit, and as an output neuron circuit. A switching circuit is configured to be capable of changing the connections between the neuron circuit, a synapse circuit, and the error circuit. The synapse circuit includes an analog memory that stores data that corresponds to the connection strength between the input neuron circuit and the hidden neuron circuit or between the hidden neuron circuit and the output neuron circuit, a writing circuit that changes the data in the analog memory, and a weighting circuit that weights an input signal in reaction to the data of the analog memory and outputs the weighted output signal. The analog memory includes a transistor comprising an oxide semiconductor with extremely low off-state current.",
  "filing_date": "20161018",
  "patent_number": "None",
  "summary": "<SOH> BRIEF DESCRIPTION OF THE DRAWINGS <EOH>In the accompanying drawings: FIG. 1 illustrates an example of a block diagram; FIGS. 2A, 2B, 2C, and 2D each illustrate an example of a circuit diagram; FIG. 3 illustrates an example of a block diagram; FIG. 4 illustrate an example of a block diagram; FIG. 5 illustrates an example of a circuit diagram; FIG. 6 illustrates an example of a circuit diagram; FIG. 7 illustrates an example of a circuit diagram; FIG. 8 illustrates an example of a circuit diagram; FIG. 9 illustrates an example of a circuit diagram; FIG. 10 illustrates an example of a flow chart; FIG. 11 illustrates an example of a flow chart; FIGS. 12A to 12F each illustrate an operation example; FIG. 13 illustrates an example of a flow chart; FIG. 14 illustrates an example of a block diagram; FIG. 15 illustrates an example of a schematic diagram; FIG. 16 illustrates an example of a video distribution system; FIGS. 17A to 17D each illustrate an example of a receiver device; FIG. 18 illustrates an example of a block diagram; FIG. 19A illustrates an example of a top view, and FIGS. 19B and 19C each illustrate an example of a cross-sectional diagram; FIG. 20A illustrates an example of a cross-sectional diagram, and FIG. 20B illustrates an example of an energy band diagram; FIGS. 21A and 21B are cross-sectional diagrams illustrating oxygen diffusion paths; FIG. 22A illustrates an example of a top view, and FIGS. 22B and 22C each illustrate an example of a cross-sectional diagram; FIG. 23A illustrates an example of a top view, and FIGS. 23B and 23C each illustrate an example of a cross-sectional diagram; FIG. 24A illustrates an example of a top view, and FIGS. 24B and 24C each illustrate an example of a cross-sectional diagram; FIG. 25A illustrates an example of a top view, and FIGS. 25B and 25C each illustrate an example of a cross-sectional diagram; FIG. 26A illustrates an example of a top view, and FIGS. 26B, 26C and 26D each illustrate an example of a cross-sectio...",
  "date_published": "20170427",
  "title": "SEMICONDUCTOR DEVICE AND ELECTRONIC DEVICE",
  "ipcr_labels": [
    "G06N3063",
    "G11C2700"
  ],
  "_processing_info": {
    "original_size": 191509,
    "optimized_size": 3466,
    "reduction_percent": 98.19
  }
}