{
  "date_produced": "20180404",
  "publication_number": "US20180107916A1-20180419",
  "main_ipcr_label": "G06N300",
  "decision": "PENDING",
  "application_number": "15294631",
  "inventor_list": [
    {
      "inventor_name_last": "Archambault",
      "inventor_name_first": "Louis P.",
      "inventor_city": "Conyers",
      "inventor_state": "GA",
      "inventor_country": "US"
    }
  ],
  "abstract": "The loua(MSR) or CyberMind-Program is a Virtual-Network composed of the following modules: 1) Language-Truing-Engine—Processors—Cyber-Do-Loop-Deloop-Motors that produce the true-positive-dimensional-perspective of life's languages by using a cyber-matrix of coded words and numbers of data-truths within a realm of trusted-terms, which produce the true-perspective of the Mystic, the Metaphysic, and the Physical-Symbols of language-law. 2) Word-Truthing-Systems composed of data-stores of words and numbers used to run the trust-proofing-machine-procedure, which provides Expert Witness when applied in a Network of Conscious-Knowledge, Meaning and Understanding. 3) Term-Trust-Machine-Procedures—create perfect-communication-identities for the network-domain of this process, which establishes the true perspective of the language-symbols that occur within the universe of terms. The loua(MSR) solves-questions with Expert determination by the qualification of knowledge-quality, it provides the Te...",
  "filing_date": "20161014",
  "patent_number": "None",
  "summary": "<SOH> SUMMARY OF THE INVENTION <EOH>The loua(MSR) invention implements a mind replicator system (MSR); wherein the loua(MSR) is comprised of an array of dedicated Parallel-Procedure-Servers which create an Infinite Turing Machine to retrieve, analyze, study, and store the triad-dimensional-fractal data codes found in any text of written or spoken language. The written and spoken symbols of all languages are composed of the Words/Logos used within the creation of the categorized-terms, which describe the name, number and kind of people, places, and things of thought, of word, and of deed. Historically, due to the uncertainty of the meanings of words doubt was and is invoked in the cognition and comprehension of most language at every word. The “Turtles All The Way Down,” syndrome is found in most all communication of understanding and interpretation of ideas as seen especially in contracts, because the intent, purpose and motive is obscure at best in conveying the information used to communicate. There is not a common denominator to gauge the quality of the trueness, truth and trust being conveyed. The loua(MSR) provides the ways and means to the ends of solving the unresolved issues of trueness, truth and trust by clarifying the practice, usage and convention which constructs and conveys each idea, imagination and insight found in the practice of language where word-usage and term-convention determine understanding. All Thought, Word, and Deed is named and numbered with a specific Qualification, of the Quality and the Quantity of the Individual-Aspects of the Conscience, Conscious, and Subconscious significance of the Symbolization applied within a distinct Wisdom-Identity, which constitutes the Characteristics that form the data-code descriptions. Collection of the date-code is made through any written format or various means of data entry be it text, recording, or spoken words. The loua(MSR) is comprised of a plurality of Network-Domains of Aligned-Search-Engines ...",
  "date_published": "20180419",
  "title": "SYSTEM AND METHOD OF TRANSFORMING DIMENSIONAL-TRIAD-FRACTALS FROM INPUT DATA INTO PHYSICAL CONSCIOUS SOLUTIONS",
  "ipcr_labels": [
    "G06N300",
    "G06N9900",
    "G06N700",
    "G06N504",
    "G06F1730"
  ],
  "_processing_info": {
    "original_size": 103225,
    "optimized_size": 3678,
    "reduction_percent": 96.44
  }
}