{
  "decision": "REJECTED",
  "application_number": "15298170",
  "date_published": "20170209",
  "date_produced": "20170125",
  "title": "ON-PAGE CONFIGURATION OF PAGE ANALYTICS AND CAMPAIGN CREATION",
  "filing_date": "20161019",
  "inventor_list": [
    {
      "inventor_name_last": "Shottan",
      "inventor_name_first": "Jonathan",
      "inventor_city": "San Francisco",
      "inventor_state": "CA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Shah",
      "inventor_name_first": "Vishal",
      "inventor_city": "Saratogo",
      "inventor_state": "CA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Smith",
      "inventor_name_first": "Doug",
      "inventor_city": "Orinda",
      "inventor_state": "CA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Turgut",
      "inventor_name_first": "Ozan",
      "inventor_city": "Mountain View",
      "inventor_state": "CA",
      "inventor_country": "US"
    }
  ],
  "ipcr_labels": [
    "G06Q3002",
    "G06F1730"
  ],
  "main_ipcr_label": "G06Q3002",
  "summary": "<SOH> SUMMARY OF THE INVENTION <EOH>A system for creating and using a universal tag to gather consumer data from a website and for analyzing the gathered consumer data is provided. An embodiment of the invention provides a universal tag system that has two main subsystems. The first subsystem is a configuration system that is used to define the consumer data to be collected from the website and to define taxonomy and transformation rules to be applied to the collected consumer data. The second subsystem is a runtime system that runs a universal tag client-side script, which is triggered when a consumer lands on a webpage of the website, and that is used for collecting the defined consumer data. The runtime system then applies the transformation rules to the collected data and updates a user profile of the consumer with the transformed data. As well, the runtime system applies the taxonomy rules to the collected data and categorizes the consumer for the purpose of subsequent targeted advertising.",
  "patent_number": "None",
  "abstract": "A system for creating and using a universal tag to gather consumer data from a web site for the purposes of targeted advertising is provided. The universal tag system has two main subsystems. The first subsystem is a configuration system that is used to define the consumer data to be collected from the website and to define taxonomy and transformation rules to be applied to the collected consumer data. The second subsystem is a runtime system that runs a universal tag client-side script, which is triggered when a consumer lands on a webpage of the website, for collecting the defined consumer data. The runtime system then applies the transformation rules to the collected data and updates a user profile corresponding to the consumer with the transformed data. As well, the runtime system applies the taxonomy rules to the collected data and categorizes the consumer for the purposes of subsequent targeted advertising.",
  "publication_number": "US20170039600A1-20170209",
  "_processing_info": {
    "original_size": 70695,
    "optimized_size": 2939,
    "reduction_percent": 95.84
  }
}