{
  "decision": "PENDING",
  "application_number": "15294387",
  "date_published": "20170420",
  "date_produced": "20170405",
  "title": "MEMORY SYSTEM",
  "filing_date": "20161014",
  "inventor_list": [
    {
      "inventor_name_last": "LEE",
      "inventor_name_first": "Yong-Woo",
      "inventor_city": "Gyeonggi-do",
      "inventor_state": "",
      "inventor_country": "KR"
    },
    {
      "inventor_name_last": "KIM",
      "inventor_name_first": "Min-Chang",
      "inventor_city": "Gyeonggi-do",
      "inventor_state": "",
      "inventor_country": "KR"
    },
    {
      "inventor_name_last": "KIM",
      "inventor_name_first": "Chang-Hyun",
      "inventor_city": "Gyeonggi-do",
      "inventor_state": "",
      "inventor_country": "KR"
    },
    {
      "inventor_name_last": "LEE",
      "inventor_name_first": "Do-Yun",
      "inventor_city": "Gyeonggi-do",
      "inventor_state": "",
      "inventor_country": "KR"
    },
    {
      "inventor_name_last": "LEE",
      "inventor_name_first": "Jae-Jin",
      "inventor_city": "Gyeonggi-do",
      "inventor_state": "",
      "inventor_country": "KR"
    },
    {
      "inventor_name_last": "JUNG",
      "inventor_name_first": "Hun-Sam",
      "inventor_city": "Gyeonggi-do",
      "inventor_state": "",
      "inventor_country": "KR"
    }
  ],
  "ipcr_labels": [
    "G06F306",
    "G06F120875"
  ],
  "main_ipcr_label": "G06F306",
  "summary": "<SOH> SUMMARY <EOH>Various embodiments of the present invention are directed to a memory system including plural heterogeneous memories coupled to a common bus and having different latencies, and a system including the same. In accordance with an embodiment of the present invention, memory system may include: a memory module including: a first memory device including a first memory and a first memory controller suitable for controlling the first memory to store data; and a second memory device including a second memory and a second memory controller suitable for controlling the second memory to store data; and a processor suitable for executing an operating system (OS) and an application, and accessing data storage memory through the first and second memory devices. The first and second memories may be separated from the processor. The processor may access the second memory device through the first memory device. The first memory controller may transfer a signal between the processor and the second memory device based on at least one of a value of a memory selection field and a handshaking information field included in the signal. The memory module may include one or more memory stacks, wherein one or more volatile memories as the first memory, one or more non-volatile memories as the second memory, and the first and second memory controllers are stacked in the memory stacks. The first and second memory devices stacked in the memory stacks may be communicatively coupled to each other through a through-via. The first and second memory controllers may interface with the first and second memories and the processor through the through-via. In accordance with an embodiment of the present invention, a memory system may include: a memory module including: a first memory device including a first memory and a first memory controller suitable for controlling the first memory to store data; a and second memory device including a second memory and a second memory controller sui...",
  "patent_number": "None",
  "abstract": "A memory system includes: a memory module including: a first memory device including a first memory and a first memory controller suitable for controlling the first memory to store data and a second memory device including a second memory and a second memory controller suitable for controlling the second memory to store data; and a processor suitable for executing an operating system (OS) and an application to access a data storage memory through the first and second memory devices.",
  "publication_number": "US20170109077A1-20170420",
  "_processing_info": {
    "original_size": 125247,
    "optimized_size": 3732,
    "reduction_percent": 97.02
  }
}