{
  "decision": "ACCEPTED",
  "application_number": "15298520",
  "date_published": "20170209",
  "date_produced": "20170125",
  "title": "REFRIGERATOR",
  "filing_date": "20161020",
  "inventor_list": [
    {
      "inventor_name_last": "RYU",
      "inventor_name_first": "Inhwan",
      "inventor_city": "Seoul",
      "inventor_state": "",
      "inventor_country": "KR"
    },
    {
      "inventor_name_last": "Cha",
      "inventor_name_first": "Minjoo",
      "inventor_city": "Seoul",
      "inventor_state": "",
      "inventor_country": "KR"
    },
    {
      "inventor_name_last": "Yang",
      "inventor_name_first": "Hyein",
      "inventor_city": "Seoul",
      "inventor_state": "",
      "inventor_country": "KR"
    }
  ],
  "ipcr_labels": [
    "F25D2900",
    "H04N5232",
    "G06Q1008",
    "F25D2302",
    "F25D2304",
    "H04N718",
    "G06T1160"
  ],
  "main_ipcr_label": "F25D2900",
  "summary": "<SOH> BRIEF DESCRIPTION OF THE DRAWINGS <EOH>The embodiments will be described in detail with reference to the following drawings in which like reference numerals refer to like elements wherein: FIG. 1 is a perspective view of a refrigerator in accordance with an embodiment as broadly described herein; FIG. 2 is a block diagram of a terminal, in accordance with an embodiment as broadly described herein: FIG. 3 is a front view of a refrigerator, in accordance with an embodiment as broadly described herein; FIG. 4 is a control block diagram for the refrigerator shown in FIG. 3 ; FIG. 5 is an exploded perspective view of a door rotation drive device of the refrigerator shown in FIG. 3 ; FIG. 6 is a schematic view of rotation of one or more doors of the refrigerator shown in FIG. 3 ; FIG. 7 illustrates an exemplary plurality of pictures of an interior of the refrigerator shown in FIG. 3 ; FIG. 8 illustrates the pictures of FIG. 7 corrected and transmitted to a terminal; FIG. 9 is an exemplary implementation of the combined picture shown in FIG. 8 ; FIG. 10 is a flowchart a picture taking process based on an elapsed open time of a door, in accordance with embodiment as broadly described herein; FIG. 11 is a flowchart of a picture taking process based on a rotation position of a door when the door is open, in accordance with an embodiment as broadly described herein; FIG. 12 is a flowchart of a picture taking process based on an elapsed time when a door is closed, in accordance with an embodiment as broadly described herein; FIG. 13 is a flowchart of a picture taking process based on a rotation position of a door when the door is closed, in accordance with an embodiment as broadly described herein; FIG. 14 is a perspective view of a refrigerator, in accordance with another embodiment as broadly described herein; FIG. 15 is a control block diagram for the refrigerator shown in FIG. 14 ; FIG. 16 illustrates a plurality of pictures corrected into a single picture and transmi...",
  "patent_number": "9829243",
  "abstract": "A refrigerator is provided. The refrigerator may include a main body having a storage compartment, a first door rotatably installed at a first side of the main body to open and close a first portion of the storage compartment, and a second door rotatably installed at a second side of the main body to open and close a second portion of the storage compartment. A first camera may be installed at the first door to take a picture of an interior of the first storage compartment during rotation of the first door, and a second camera may be installed at the second door to take a picture of the interior of the first storage compartment during rotation of the second door. A controller may combine plural pictures taken by the first camera and the second camera into a single corrected image of a region of the first compartment spanning from the first door to the second door.",
  "publication_number": "US20170038128A1-20170209",
  "_processing_info": {
    "original_size": 69986,
    "optimized_size": 3721,
    "reduction_percent": 94.68
  }
}