{
  "date_produced": "20180404",
  "publication_number": "US20180107943A1-20180419",
  "main_ipcr_label": "G06N9900",
  "decision": "PENDING",
  "application_number": "15295817",
  "inventor_list": [
    {
      "inventor_name_last": "White",
      "inventor_name_first": "Ryen William",
      "inventor_city": "Woodinville",
      "inventor_state": "WA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Hofmeester",
      "inventor_name_first": "Gerrit",
      "inventor_city": "Woodinville",
      "inventor_state": "WA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Voss",
      "inventor_name_first": "William",
      "inventor_city": "Seattle",
      "inventor_state": "WA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Grieves",
      "inventor_name_first": "Jason Anthony",
      "inventor_city": "Bellevue",
      "inventor_state": "WA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Nathan",
      "inventor_name_first": "Girish Sthanu",
      "inventor_city": "Sammamish",
      "inventor_state": "WA",
      "inventor_country": "US"
    }
  ],
  "abstract": "A wearable device includes one or more biometric sensors configured to determine biometric data of a wearer of the wearable device and a stress assessment tool. The stress assessment tool is configured to determine a periodic stress score, via a machine-learning model, based at least on the biometric data, visually present, via a display associated with the wearable device, a graphical user interface (GUI) including the periodic stress score, receive wearer feedback evaluating the accuracy of the periodic stress score, adjust the machine-learning model based on the wearer feedback, determine a reassessed periodic stress score, via the machine-learning model, and visually present, via the display, the reassessed periodic stress score in the GUI.",
  "filing_date": "20161017",
  "patent_number": "None",
  "summary": "<SOH> SUMMARY <EOH>A wearable device is provided that includes one or more biometric sensors configured to determine biometric data of a wearer of the wearable device and a stress assessment tool. The stress assessment tool is configured to determine a periodic stress score via a machine-learning model based at least on the biometric data, visually present via a display associated with the wearable device a graphical user interface (GUI) including the periodic stress score, receive wearer feedback evaluating the accuracy of the periodic stress score, adjust the machine-learning model based on the wearer feedback, determine a reassessed periodic stress score, via the machine-learning model, and visually present, via the display, the reassessed periodic stress score in the GUI. This Summary is provided to introduce a selection of concepts in a simplified form that are further described below in the Detailed Description. This Summary is not intended to identify key features or essential features of the claimed subject matter, nor is it intended to be used to limit the scope of the claimed subject matter. Furthermore, the claimed subject matter is not limited to implementations that solve any or all disadvantages noted in any part of this disclosure.",
  "date_published": "20180419",
  "title": "PERIODIC STRESS TRACKING",
  "ipcr_labels": [
    "G06N9900",
    "G06Q1010"
  ],
  "_processing_info": {
    "original_size": 75525,
    "optimized_size": 3156,
    "reduction_percent": 95.82
  }
}