{
  "date_produced": "20180328",
  "publication_number": "US20180101761A1-20180412",
  "main_ipcr_label": "G06N300",
  "decision": "PENDING",
  "application_number": "15290861",
  "inventor_list": [
    {
      "inventor_name_last": "NELSON",
      "inventor_name_first": "STEVEN A.",
      "inventor_city": "San Jose",
      "inventor_state": "CA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "KITADA",
      "inventor_name_first": "HIROSHI",
      "inventor_city": "Tuckahoe",
      "inventor_state": "NY",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "WONG",
      "inventor_name_first": "LANA",
      "inventor_city": "Belleville",
      "inventor_state": "NJ",
      "inventor_country": "US"
    }
  ],
  "abstract": "Artificial intelligence is introduced into an electronic meeting context to perform various tasks before, during, and/or after electronic meetings. The tasks may include a wide variety of tasks, such as agenda creation, participant selection, real-time meeting management, meeting content supplementation, and post-meeting processing. The artificial intelligence may analyze a wide variety of data such as data pertaining to other electronic meetings, data pertaining to organizations and users, and other general information pertaining to any topic. Capability is also provided to create, manage, and enforce meeting rules templates that specify requirements and constraints for various aspects of electronic meetings.",
  "filing_date": "20161011",
  "patent_number": "None",
  "summary": "<SOH> SUMMARY <EOH>An apparatus includes one or more processors and one or more non-transitory computer-readable media storing instructions which, when processed by the one or more processors cause an electronic meeting process executing on the apparatus to receive, from an artificial intelligence service, meeting participant statistics that indicate performance by one or more meeting participants during a plurality of electronic meetings. The electronic meeting process generates and displays, on a user interface, a meeting participant report that includes the meeting participant statistics that indicate performance by one or more meeting participants during a plurality of electronic meetings. The approach may also be implemented by one or more non-transitory computer-readable media storing instructions which, when processed by one or more processors, causes the functionality to be performed. The approach may also be implemented by one or more computer-implemented methods.",
  "date_published": "20180412",
  "title": "Post-Meeting Processing Using Artificial Intelligence",
  "ipcr_labels": [
    "G06N300"
  ],
  "_processing_info": {
    "original_size": 173092,
    "optimized_size": 2538,
    "reduction_percent": 98.53
  }
}