{
  "decision": "PENDING",
  "application_number": "15290110",
  "date_published": "20170202",
  "date_produced": "20170119",
  "title": "DYNAMIC CONTENT PREVIEW",
  "filing_date": "20161011",
  "inventor_list": [
    {
      "inventor_name_last": "YOSHIDA",
      "inventor_name_first": "Naofumi",
      "inventor_city": "Yokohama-shi",
      "inventor_state": "",
      "inventor_country": "JP"
    },
    {
      "inventor_name_last": "KURABAYASHI",
      "inventor_name_first": "Shuichi",
      "inventor_city": "Fujisawa-shi",
      "inventor_state": "",
      "inventor_country": "JP"
    },
    {
      "inventor_name_last": "TAKANO",
      "inventor_name_first": "Kosuke",
      "inventor_city": "Fujisawa-shi",
      "inventor_state": "",
      "inventor_country": "JP"
    }
  ],
  "ipcr_labels": [
    "G06F1730",
    "G06Q3002"
  ],
  "main_ipcr_label": "G06F1730",
  "summary": "<SOH> SUMMARY <EOH>In an example, a content preview system may include a content feature analysis unit configured to analyze one or more content features of a content file, and a preview type determination unit configured to determine a preview type for the content file based at least in part on the content features analyzed by the content feature analysis unit. In another example, a content server may include a database configured to store at least one of a content file, content information associated with the content file, and a purchase history of a user; a content feature analysis unit configured to analyze one or more content features of the content file, an information extraction unit configured to extract from the database at least one of the content information associated with the content file and the purchase history of the user; and a preview type determination unit configured to determine a preview type for the content file based at least in part on at least one of the content features analyzed by the content feature analysis unit, the content information extracted by the information extraction unit, and the purchase history extracted by the information extraction unit. In yet another example, a method performed under control of a content preview system may include analyzing one or more content features of a content file, and determining a preview type for the content file based at least in part on the analyzed content features. The foregoing summary is illustrative only and is not intended to be in any way limiting. In addition to the illustrative aspects, embodiments, and features described above, further aspects, embodiments, and features will become apparent by reference to the drawings and the following detailed description.",
  "patent_number": "None",
  "abstract": "Technologies are generally described for generating a preview of a content file dynamically based at least in part on content features of the content file. In some examples, a content preview system may include a content feature analysis unit configured to analyze one or more content features of a content file, and a preview type determination unit configured to determine a preview type for the content file based at least in part on the content features analyzed by the content feature analysis unit.",
  "publication_number": "US20170031902A1-20170202",
  "_processing_info": {
    "original_size": 57193,
    "optimized_size": 3102,
    "reduction_percent": 94.58
  }
}