{
  "decision": "PENDING",
  "application_number": "15290517",
  "date_published": "20171116",
  "date_produced": "20171103",
  "title": "Structurally Defining Knowledge Elements Within a Cognitive Graph",
  "filing_date": "20161011",
  "inventor_list": [
    {
      "inventor_name_last": "Lindsley",
      "inventor_name_first": "Hannah R.",
      "inventor_city": "Austin",
      "inventor_state": "TX",
      "inventor_country": "US"
    }
  ],
  "ipcr_labels": [
    "G06F1730",
    "G06F1730",
    "G06N504",
    "G06N9900"
  ],
  "main_ipcr_label": "G06F1730",
  "summary": "<SOH> SUMMARY OF THE INVENTION <EOH>A method, system and computer-usable medium are disclosed for cognitive inference and learning operations. In one embodiment, the invention relates to a method for a computer-implementable method for managing a cognitive graph comprising: receiving data from a plurality of data sources; processing the data from the plurality of data sources, the processing the data from the plurality of data sources identifying a plurality of knowledge elements; and, storing the knowledge elements within the cognitive graph as a collection of knowledge elements, the storing universally representing knowledge obtained from the data, each knowledge element being structurally defined within the cognitive graph.",
  "patent_number": "None",
  "abstract": "A computer-implementable method for managing a cognitive graph comprising: receiving data from a plurality of data sources; processing the data from the plurality of data sources, the processing the data from the plurality of data sources identifying a plurality of knowledge elements; and, storing the knowledge elements within the cognitive graph as a collection of knowledge elements, the storing universally representing knowledge obtained from the data, each knowledge element being structurally defined within the cognitive graph.",
  "publication_number": "US20170329870A1-20171116",
  "_processing_info": {
    "original_size": 243762,
    "optimized_size": 1862,
    "reduction_percent": 99.24
  }
}