{
  "decision": "PENDING",
  "application_number": "15297143",
  "date_published": "20170504",
  "date_produced": "20170419",
  "title": "ELECTRONIC DEVICE AND METHOD FOR PLAYING BACK SOUND DATA",
  "filing_date": "20161019",
  "inventor_list": [
    {
      "inventor_name_last": "CHEN",
      "inventor_name_first": "YU-CHUN",
      "inventor_city": "New Taipei",
      "inventor_state": "",
      "inventor_country": "TW"
    }
  ],
  "ipcr_labels": [
    "G06F316",
    "G11B2010"
  ],
  "main_ipcr_label": "G06F316",
  "summary": "<SOH> BRIEF DESCRIPTION OF THE DRAWINGS <EOH>Many aspects of the disclosure can be better understood with reference to the following drawings. The components in the drawings are not necessarily drawn to scale, the emphasis instead being placed upon clearly illustrating the principles of the disclosure. Moreover, in the drawings, like reference numerals designate corresponding parts throughout the several views. FIG. 1 and FIG. 2 are block diagrams of one embodiment of an electronic device. FIG. 3 is a block diagram of one embodiment of modules of a playing back system of the electronic device of FIG. 1 . FIG. 4 illustrates a flowchart of one embodiment of a method for playing back sound data recorded by the electronic device of FIG. 1 . detailed-description description=\"Detailed Description\" end=\"lead\"?",
  "patent_number": "None",
  "abstract": "A method for playing back sound information in an electronic device includes setting a first trigger condition for starting a recording function, and the data which records sound is stored into an attached storage device. When a predetermined operation is detected, the sound data pertaining to a predetermined or selected time period is extracted and stored. Through the method the electronic device can play back the extracted sound data.",
  "publication_number": "US20170123753A1-20170504",
  "_processing_info": {
    "original_size": 26112,
    "optimized_size": 1810,
    "reduction_percent": 93.07
  }
}