{
  "decision": "PENDING",
  "application_number": "15298259",
  "date_published": "20180705",
  "date_produced": "20180620",
  "title": "HISTORIC VALUE BASED PREDICTIVE OPTIONS COMMERCE",
  "filing_date": "20161020",
  "inventor_list": [
    {
      "inventor_name_last": "NEAL",
      "inventor_name_first": "Alex",
      "inventor_city": "Encinitas",
      "inventor_state": "CA",
      "inventor_country": "US"
    }
  ],
  "ipcr_labels": [
    "G06Q3002",
    "G06Q3006"
  ],
  "main_ipcr_label": "G06Q3002",
  "summary": "<SOH> BRIEF DESCRIPTION OF THE DRAWINGS <EOH>The features and nature of the present invention will become more apparent from the detailed description set forth below when taken in conjunction with the drawings in which like reference characters identify correspondingly throughout. FIG. 1 is a block diagram depicting a system suitable for Historic Value Based Predictive Options Commerce, according to some example embodiments; FIG. 2 is a block diagram illustrating a network-based publication system for processing a search engine query, and presenting search results (e.g., marketplace listings) pertaining to Historic Value Based Predictive Options Commerce, as described more fully herein; FIG. 3 shows a functional block diagram of Historic Value Based Predictive Options Commerce system operations, according to some example embodiments; FIG. 4 shows a detailed state diagram illustrating a Historic Value Determination Procedure, or historical pricing calculation, according to some example embodiments; FIG. 5 shows a detailed state diagram for a Buyback Value Forecast Procedure, according to some example embodiments; FIG. 6 shows a detailed flow chart for a Commerce Option Vetting Procedure, according to some example embodiments; FIG. 7 shows a detailed state diagram illustrating a Commerce Option Comparator Procedure, according to some example embodiments. FIG. 8 shows a detailed state diagram illustrating a Commerce Option Final Confidence Rating Procedure, according to some example embodiments; FIG. 9 . illustrates a user interface for Historic Value Based Predictive Options Commerce, according to some example embodiments; FIG. 10 . illustrates another user interface for Historic Value Based Predictive Options Commerce, according to some example embodiments; and FIG. 11 is a block diagram illustrating components of a machine, according to some example embodiments, able to read instructions from a machine-readable medium and perform any one or more of the systems and m...",
  "patent_number": "nan",
  "abstract": "A novel system and apparatus predicts future consumer item buyback prices based on historical pricing and estimated depreciation. The estimated future buyback price is used to determine the current net cost of purchasing an item compared to the net cost of renting the item. Personal preference factors are evaluated and a commerce option recommendation is made with an associated confidence rating. A user is also provided with a graphical price history of the item. Thus, a Historic Value Based Predictive Options Commerce system assists a consumer in deciding whether to purchase or rent a considered item, by providing the user with a system to allow consumers to transparently evaluate the net cost of ownership versus rental commerce options. A commerce recommendation and/or confidence rating may be associated with the commerce options.",
  "publication_number": "US20180189813A1-20180705",
  "_processing_info": {
    "original_size": 68702,
    "optimized_size": 3390,
    "reduction_percent": 95.07
  }
}