{
  "date_produced": "20180315",
  "publication_number": "US20180089570A1-20180329",
  "main_ipcr_label": "G06N502",
  "decision": "PENDING",
  "application_number": "15295321",
  "inventor_list": [
    {
      "inventor_name_last": "Kenthapadi",
      "inventor_name_first": "Krishnaram",
      "inventor_city": "Sunnyvale",
      "inventor_state": "CA",
      "inventor_country": "US"
    }
  ],
  "abstract": "A skills detector system is provided with an on-line social network system. The skills detector system is configured to determine which skills are referenced in an electronic presentation and generate respective importance scores of the determined skills as related to the presentation. Respective importance scores of the determined skills as related to the presentation can be used beneficially to select one or more electronic courses that are relevant in teaching skills discussed or mentioned in the presentation and recommend those courses to viewers of the presentation.",
  "filing_date": "20161017",
  "patent_number": "None",
  "summary": "<SOH> BRIEF DESCRIPTION OF DRAWINGS <EOH>Embodiments of the present invention are illustrated by way of example and not limitation in the figures of the accompanying drawings, in which like reference numbers indicate similar elements and in which: FIG. 1 is a diagrammatic representation of a network environment within which an example method and system to identify skills associated with an electronic presentation may be implemented; FIG. 2 is block diagram of a system to identify skills associated with an electronic presentation, in accordance with one example embodiment; FIG. 3 is a flowchart illustrating a method to identify skills associated with an electronic presentation, in accordance with an example embodiment; and FIG. 4 is a diagrammatic representation of an example machine in the form of a computer system within which a set of instructions, for causing the machine to perform any one or more of the methodologies discussed herein, may be executed. detailed-description description=\"Detailed Description\" end=\"lead\"?",
  "date_published": "20180329",
  "title": "SKILLS DETECTOR SYSTEM",
  "ipcr_labels": [
    "G06N502",
    "H04L1226",
    "H04L2908",
    "G06F1730",
    "G06Q5000"
  ],
  "_processing_info": {
    "original_size": 55054,
    "optimized_size": 2182,
    "reduction_percent": 96.04
  }
}