{
  "date_produced": "20171103",
  "publication_number": "US20170330095A1-20171116",
  "main_ipcr_label": "G06N504",
  "decision": "PENDING",
  "application_number": "15290496",
  "inventor_list": [
    {
      "inventor_name_last": "Lindsley",
      "inventor_name_first": "Hannah R.",
      "inventor_city": "Austin",
      "inventor_state": "TX",
      "inventor_country": "US"
    }
  ],
  "abstract": "A computer-implementable method for managing a cognitive graph comprising: receiving data from a plurality of data sources; processing the data from the plurality of data sources, the processing the data from the plurality of data sources identifying a plurality of knowledge elements; and, storing the knowledge elements within the cognitive graph as a collection of knowledge elements, the storing universally representing knowledge obtained from the data, each knowledge element of the collection of knowledge elements being persisted in its original form.",
  "filing_date": "20161011",
  "patent_number": "None",
  "summary": "<SOH> SUMMARY OF THE INVENTION <EOH>A method, system and computer-usable medium are disclosed for cognitive inference and learning operations. In one embodiment, the invention relates to a method for a computer-implementable method for managing a cognitive graph comprising: receiving data from a plurality of data sources; processing the data from the plurality of data sources, the processing the data from the plurality of data sources identifying a plurality of knowledge elements; and, storing the knowledge elements within the cognitive graph as a collection of knowledge elements, the storing universally representing knowledge obtained from the data, each knowledge element of the collection of knowledge elements being persisted in its original form.",
  "date_published": "20171116",
  "title": "Universal Cognitive Graph Having Persistent Knowledge Elements",
  "ipcr_labels": [
    "G06N504",
    "G06F1730",
    "G06F1730",
    "G06N9900"
  ],
  "_processing_info": {
    "original_size": 244735,
    "optimized_size": 1904,
    "reduction_percent": 99.22
  }
}