{
  "date_produced": "20171025",
  "publication_number": "US20170323209A1-20171109",
  "main_ipcr_label": "G06N504",
  "decision": "PENDING",
  "application_number": "15290639",
  "inventor_list": [
    {
      "inventor_name_last": "Rinzler",
      "inventor_name_first": "Keith",
      "inventor_city": "Sandy Springs",
      "inventor_state": "GA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Cino",
      "inventor_name_first": "Ryan",
      "inventor_city": "Decatur",
      "inventor_state": "GA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Scully",
      "inventor_name_first": "Brian",
      "inventor_city": "Marietta",
      "inventor_state": "GA",
      "inventor_country": "US"
    }
  ],
  "abstract": "A situational awareness system providing geographic, personal characteristic and subject matter of interest awareness using information obtained from location reporting mobile devices. The system displays personal characteristic information for target member segments defined with a great deal of specificity, which may be followed by online queries to the target member segment. Member participation in online queries may require interested members to “opt-in” to limit query distribution to members that have indicated an interest in responding to online queries on the particular subject matter of interest. This increases the efficiency and effectiveness of the online queries, while reducing the cost and imposition on members who are not be interested in participating. Obtaining geographic, personal characteristic and subject matter of interest awareness can be a free component provided as a benefit to registered members and customers, configured to occur prior to the payment screen requir...",
  "filing_date": "20161011",
  "patent_number": "None",
  "summary": "<SOH> SUMMARY OF THE INVENTION <EOH>The present disclosure meets the needs described above in a situational awareness system that provides geographic, personal characteristic and subject matter of interest awareness using information obtained from location reporting mobile devices. A customer or member specifies geographic, personal characteristic, and subject matter of interest criteria with a great deal of specificity to identify members meeting the specified criteria. The system displays personal characteristic information for the target member segment, which may be followed by online queries to the target member segment. For example, a target member segment may be based on traveler tracking parameters, and an online message containing traveler awareness data may be transmitted to the target member segment. Member participation in online queries may require interested members to “opt-in” to limit query distribution to members that have indicated an interest in responding to online queries on the particular subject matter of interest. This greatly increases the efficiency and effectiveness of the online queries, while reducing the cost and imposition effect on members who are not interested in participating. Obtaining geographic, personal characteristic and subject matter of interest awareness can be a free component provided as a benefit to registered members and customers, configured to occur prior to the payment screen required for online query distribution. In view of the foregoing, it will be appreciated that the present disclosure provides an improved situational awareness system. The specific systems and techniques for accomplishing the advantages described above will become apparent from the following detailed description of the embodiments and the appended drawings and claims.",
  "date_published": "20171109",
  "title": "Situational Awareness System",
  "ipcr_labels": [
    "G06N504",
    "G06F1730",
    "G06N700",
    "G06Q3002"
  ],
  "_processing_info": {
    "original_size": 132839,
    "optimized_size": 3680,
    "reduction_percent": 97.23
  }
}