{
  "date_produced": "20170405",
  "publication_number": "US20170109656A1-20170420",
  "main_ipcr_label": "G06N9900",
  "decision": "PENDING",
  "application_number": "15294509",
  "inventor_list": [
    {
      "inventor_name_last": "Cook",
      "inventor_name_first": "Diane J.",
      "inventor_city": "Pullman",
      "inventor_state": "WA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Minor",
      "inventor_name_first": "Bryan",
      "inventor_city": "Pullman",
      "inventor_state": "WA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Doppa",
      "inventor_name_first": "Janardhan Rao",
      "inventor_city": "Pullman",
      "inventor_state": "WA",
      "inventor_country": "US"
    }
  ],
  "abstract": "A physical environment is equipped with a plurality of sensors (e.g., motion sensors). As individuals perform various activities within the physical environment, sensor readings are received from one or more of the sensors. Based on the sensor readings, activities being performed by the individuals are recognized and the sensor data is labeled based on the recognized activities. Future activity occurrences are predicted based on the labeled sensor data. Activity prompts may be generated and/or facility automation may be performed for one or more future activity occurrences.",
  "filing_date": "20161014",
  "patent_number": "None",
  "summary": "<SOH> SUMMARY <EOH>In a smart environment (e.g., a home or other environment fitted with a plurality of sensors) equipped with various types of sensors, activities performed by individuals within the smart environment can be recognized. Based upon sensor data gathered from the smart environment and the recognized activities, future occurrences of one or more activities within the smart environment can be predicted. Having the predicted future occurrences of one or more activities can further enable an activity prompting application, which can be used to prompt individuals (e.g., individuals with memory impairment) associated with the smart environment to perform particular activities at the predicted activity occurrence times. In addition, facility automation in support of predicted activities may also be implemented. This Summary is provided to introduce a selection of concepts in a simplified form that are further described below in the Detailed Description. This Summary is not intended to identify key features or essential features of the claimed subject matter, nor is it intended to be used as an aid in determining the scope of the claimed subject matter. The various features described herein may, for instance, refer to device(s), system(s), method(s), and/or computer-readable instructions as permitted by the context above and throughout the document.",
  "date_published": "20170420",
  "title": "DATA-DRIVEN ACTIVITY PREDICTION",
  "ipcr_labels": [
    "G06N9900",
    "G06N502"
  ],
  "_processing_info": {
    "original_size": 54198,
    "optimized_size": 2779,
    "reduction_percent": 94.87
  }
}