{
  "date_produced": "20171103",
  "publication_number": "US20170330082A1-20171116",
  "main_ipcr_label": "G06N502",
  "decision": "PENDING",
  "application_number": "15290414",
  "inventor_list": [
    {
      "inventor_name_last": "Lindsley",
      "inventor_name_first": "Hannah R.",
      "inventor_city": "Austin",
      "inventor_state": "TX",
      "inventor_country": "US"
    }
  ],
  "abstract": "A system comprising: a processor; a data bus coupled to the processor; and a non-transitory, computer-readable storage medium embodying computer program code, the non-transitory, computer-readable storage medium being coupled to the data bus. The computer program code interacting with a plurality of computer operations and comprising instructions executable by the processor and configured for: receiving data from a data source; determining whether the data comprises text; processing the data, the processing comprising performing a lossless parsing operation on the data, the processing the data identifying a plurality of knowledge elements based upon the parsing operation; and, storing the knowledge elements within the cognitive graph as a collection of knowledge elements, the storing universally representing knowledge obtained from the data.",
  "filing_date": "20161011",
  "patent_number": "None",
  "summary": "<SOH> SUMMARY OF THE INVENTION <EOH>A method, system and computer-usable medium are disclosed for cognitive inference and learning operations. In one embodiment, the invention relates to a system comprising: a processor; a data bus coupled to the processor; and a non-transitory, computer-readable storage medium embodying computer program code, the non-transitory, computer-readable storage medium being coupled to the data bus. The computer program code interacting with a plurality of computer operations and comprising instructions executable by the processor and configured for: receiving data from a data source; determining whether the data comprises text; processing the data, the processing comprising performing a lossless parsing operation on the data, the processing the data identifying a plurality of knowledge elements based upon the parsing operation; and, storing the knowledge elements within the cognitive graph as a collection of knowledge elements, the storing universally representing knowledge obtained from the data. In another embodiment, the invention relates to a non-transitory, computer-readable storage medium embodying computer program code, the computer program code comprising computer executable instructions configured for: receiving data from a data source; determining whether the data comprises text; processing the data, the processing comprising performing a lossless parsing operation on the data, the processing the data identifying a plurality of knowledge elements based upon the parsing operation; and, storing the knowledge elements within the cognitive graph as a collection of knowledge elements, the storing universally representing knowledge obtained from the data.",
  "date_published": "20171116",
  "title": "Lossless Parsing When Storing Knowledge Elements Within a Universal Cognitive Graph",
  "ipcr_labels": [
    "G06N502",
    "G06N504"
  ],
  "_processing_info": {
    "original_size": 249331,
    "optimized_size": 3150,
    "reduction_percent": 98.74
  }
}