{
  "date_produced": "20180411",
  "publication_number": "US20180114111A1-20180426",
  "main_ipcr_label": "G06N308",
  "decision": "PENDING",
  "application_number": "15299145",
  "inventor_list": [
    {
      "inventor_name_last": "Gill",
      "inventor_name_first": "Deepinder S.",
      "inventor_city": "Hyderabad",
      "inventor_state": "",
      "inventor_country": "IN"
    },
    {
      "inventor_name_last": "Vangala",
      "inventor_name_first": "Vipindeep",
      "inventor_city": "Hyderabad",
      "inventor_state": "",
      "inventor_country": "IN"
    }
  ],
  "abstract": "Systems and methods for creating and/or using an artificial intelligence memory system that models human memory are provided. The AI memory system creates and/or uses a user centric memory graph. The user centric memory graph implicitly links memory elements of a user utilizing relationships created in space, time, and cognitive dimensions similar to how the human brain stores and recalls different memory elements. The user centric memory graph is used by searching and/or constraining the user centric memory graph based on a determined user context and/or a user query.",
  "filing_date": "20161020",
  "patent_number": "None",
  "summary": "<SOH> SUMMARY <EOH>In summary, the disclosure generally relates to an artificial intelligence (AI) memory system and/or method that builds and/or utilizes a user centric knowledge graph that models the memory system of the human brain for an application. The user centric knowledge graph models the memory system of the human brain by linking memory elements from collected user signal based on relationships in the space, time and/or cognitive dimensions of the user. The ability of the AI memory system and/or method to create and/or use an AI that models human memory improves a user's ability to accomplish tasks, improves the recall of needed memory items, improves the usability, improves the performance, and/or improves user interactions of/with an application when compared to previously utilized applications that do not model human memory and/or that are not user centric. One aspect of the disclosure is directed to building and using an artificial intelligence memory system that models human memory. The system includes at least one processor and a memory. The memory encodes computer executable instruction that, when executed by the at least one processor, are operative to: collect user signals that include memory elements from a user; enrich the memory elements with world knowledge to form enriched elements; create a user centric memory graph by linking the enriched elements based on relationships created in space, time, and cognitive dimensions; store the user centric memory graph; determine a user context based on the enriched elements; identify relevant elements on the user centric memory graph based on the user context to form a contextually constrained memory graph; rank the relevant elements on the contextually constrained memory graph based on the user context to form ranked elements; determine a response based the contextually constrained memory graph and the ranked elements; compare the response to a relevancy threshold; determine that the response meets the...",
  "date_published": "20180426",
  "title": "SYSTEMS AND METHODS FOR BUILDING AND UTILIZING ARTIFICIAL INTELLIGENCE THAT MODELS HUMAN MEMORY",
  "ipcr_labels": [
    "G06N308",
    "G06N300"
  ],
  "_processing_info": {
    "original_size": 80825,
    "optimized_size": 3321,
    "reduction_percent": 95.89
  }
}