{
  "date_produced": "20170405",
  "publication_number": "US20170109627A1-20170420",
  "main_ipcr_label": "G06N308",
  "decision": "PENDING",
  "application_number": "15297630",
  "inventor_list": [
    {
      "inventor_name_last": "Sherwin",
      "inventor_name_first": "Jason",
      "inventor_city": "Brooklyn",
      "inventor_state": "NY",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Muraskin",
      "inventor_name_first": "Jordan",
      "inventor_city": "New York",
      "inventor_state": "NY",
      "inventor_country": "US"
    }
  ],
  "abstract": "Systems and methods to analyze decision-making. A processor accesses at least one storage medium storing a high-fidelity recording, the high-fidelity recording includes a stimulus event and one or more rules associated with the stimulus event. The processor presents the high-fidelity recording through a presentation device. The processor receives neural metrics from a neural sensor while the high-fidelity recording is being presented. The processor applies rules to generate reference metrics associated with the stimulus event. The processor modifies elements of the high-fidelity recording based on the reference metrics to distinguish the stimulus event within the high fidelity recording. The processor presents the modified recording by the presentation device.",
  "filing_date": "20161019",
  "patent_number": "None",
  "summary": "<SOH> SUMMARY <EOH>The problem solved concerns the neural and behavioral measurement of decisions related to presented simulations. Such measurements are employed to determine a level of cognitive skill pertinent to a given context. One example provided in this disclosure is directed to measure a response to decisions provoked by a video depicting a football scene. In such a scene, there are game performance-relevant events (e.g., a snap, or commencement of play) that are cues for a player's ensuing actions on the field. Neural and behavioral responses to these events are measured, and the resulting data is used as a profile of each individual's abilities in football-related decision making. Although described in the context of football, the techniques disclosed herein are not unique to this sport or sporting generally. Rather, the technique of electronically marking simulated (e.g., video-based) events to be used as markers in simultaneous neuroimaging with proper post-processing may be used for various simulation-based decision settings. Previous attempts to solve the problem of simulation-based decision-making with time-precise neural and behavioral data have created simulated scenes (e.g., sporting scenes) with computerized graphics or otherwise precisely controlled electronically-produced events (e.g., as in video game design). However, one issue is that the fidelity of these simulations is not high enough to adequately stimulate the nervous systems to evoke the context-specific and decision-related neural activity that is sufficiently matched to real-life situations. Fidelity of a simulated event encompasses elements that contribute to how closely a recreation of the event reflects an actual event. In the example of a football scene, an audio-visual recording provides a richness of visual and audible cues that a subject (e.g., a football player) would recognize as a portrayal of such a scene. High definition recordings provide detail that can immerse the subje...",
  "date_published": "20170420",
  "title": "SYSTEM AND METHOD TO EVALUATE DECISION-MAKING",
  "ipcr_labels": [
    "G06N308",
    "G06N502"
  ],
  "_processing_info": {
    "original_size": 51943,
    "optimized_size": 3462,
    "reduction_percent": 93.34
  }
}