{
  "decision": "PENDING",
  "application_number": "15291701",
  "date_published": "20170413",
  "date_produced": "20170329",
  "title": "PORTABLE DEVICE AND SCREEN DISPLAY METHOD OF PORTABLE DEVICE",
  "filing_date": "20161012",
  "inventor_list": [
    {
      "inventor_name_last": "KIM",
      "inventor_name_first": "Gae-Youn",
      "inventor_city": "Gyeonggi-do",
      "inventor_state": "",
      "inventor_country": "KR"
    },
    {
      "inventor_name_last": "Lee",
      "inventor_name_first": "Do-Hyung",
      "inventor_city": "Gyeonggi-do",
      "inventor_state": "",
      "inventor_country": "KR"
    },
    {
      "inventor_name_last": "Lee",
      "inventor_name_first": "Sae-Rom",
      "inventor_city": "Seoul",
      "inventor_state": "",
      "inventor_country": "KR"
    },
    {
      "inventor_name_last": "Kang",
      "inventor_name_first": "Byung-Jin",
      "inventor_city": "Seoul",
      "inventor_state": "",
      "inventor_country": "KR"
    },
    {
      "inventor_name_last": "Park",
      "inventor_name_first": "Seong-Woong",
      "inventor_city": "Seoul",
      "inventor_state": "",
      "inventor_country": "KR"
    }
  ],
  "ipcr_labels": [
    "G06F30488",
    "G06F3041",
    "G06F30482",
    "G06F116"
  ],
  "main_ipcr_label": "G06F30488",
  "summary": "<SOH> SUMMARY <EOH>An aspect of the present disclosure provides a portable device and a screen display method of a portable device may be provided, the portable device capable of displaying a screen of an application currently being executed in a main display area and displaying a screen of a previously executed application in an edge display area. An aspect of the present disclosure provides a controller that may control a third application screen corresponding to a third user input to be displayed on an edge touch screen, and control a part of a second application screen and a part of a first application screen to be displayed in edge display areas. An aspect of the present disclosure provides a controller that may perform a control such that successive motions of a first touch from an active area of edge display areas to a main display area are detected, and an application drawer corresponding to successive motions of the first touch is displayed. An aspect of the present disclosure provides a controller that may perform a control such that successive motions of a second touch from an inactive area of edge display areas to a main display area are detected, and an edge panel corresponding to successive motions of the second touch is displayed. An aspect of the present disclosure provides a portable device that can display a currently executed application screen in a main display area and display a previously executed application screen in an edge display area, and a screen display method of a portable device may be provided. An aspect of the present disclosure provides a portable device that can display a currently executed application screen in a main display area and display a plurality of previously executed application screens in edge display areas, and a screen display method of a portable device may be provided. An aspect of the present disclosure provides a portable device that can display a currently executed application screen in a main display area, disp...",
  "patent_number": "None",
  "abstract": "Provided are a portable device and a screen display method of a portable device. The portable device includes an edge touch screen that has a main display area, has a left edge display area and a right edge display area which are individually extended from the main display area, and configured to display an application screen thereon; and a controller configured to control the edge touch screen, a first application screen corresponding to a first user input to be displayed on the edge touch screen, a second application screen corresponding to a second user input to be displayed in the main display area, and a part of the first application screen to be displayed in the left edge display area or the right edge display area.",
  "publication_number": "US20170102872A1-20170413",
  "_processing_info": {
    "original_size": 107637,
    "optimized_size": 3890,
    "reduction_percent": 96.39
  }
}