{
  "decision": "PENDING",
  "application_number": "15293946",
  "date_published": "20170202",
  "date_produced": "20170119",
  "title": "Presenting Previously Selected Search Results",
  "filing_date": "20161014",
  "inventor_list": [
    {
      "inventor_name_last": "Bilinski",
      "inventor_name_first": "Brandon",
      "inventor_city": "San Francisco",
      "inventor_state": "CA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Otto",
      "inventor_name_first": "Owen",
      "inventor_city": "Berkeley",
      "inventor_state": "CA",
      "inventor_country": "US"
    }
  ],
  "ipcr_labels": [
    "G06F1730"
  ],
  "main_ipcr_label": "G06F1730",
  "summary": "<SOH> BRIEF SUMMARY <EOH>According to an implementation of the disclosed subject matter, a method may include obtaining a first previously selected search result from a first search provider. The first previously selected search result may be a first result, selected by a user, of a first prior search query executed by the first search provider. A second previously selected search result may be obtained from a second search provider. The second previously selected search result may be a second result, selected by the user, of a second prior search query executed by the second search provider. Next, the first and second previously selected search results may be presented in an interface associated with a third search provider. An implementation according to the disclosed subject matter provides a system providing a processor configured to obtain a first previously selected search result from a first search provider. The first previously selected search result may be a first result, selected by a user, of a first prior search query executed by the first search provider. A second previously selected search result may be obtained from a second search provider. The second previously selected search result may be a second result, selected by the user, of a second prior search query executed by the second search provider. Next, the first and second previously selected search results may be presented in an interface associated with a third search provider. Implementations of the disclosed subject matter present previously selected search results to a user. The disclosed system may make it easier for a user to re-find a particular search result he selected from among multiple search results provided to him in response to a search query. By presenting previously selected search results to a user, the user may be able to avoid having to re-run a search query in search of a particular search result he previously selected. This may result in improved search efficiency and time s...",
  "patent_number": "None",
  "abstract": "The disclosed subject matter provides methods and systems for presenting previously selected search results to a user. A first previously selected search result may be obtained from a first search provider. The first previously selected search result may be a first result, selected by a user, of a first prior search query executed by the first search provider. A second previously selected search result may be obtained from a second search provider, and the second previously selected search result may be a second result, selected by the user, of a second prior search query executed by the second search provider. Next, the first and second previously selected search results may be presented in an interface associated with a third search provider.",
  "publication_number": "US20170031993A1-20170202",
  "_processing_info": {
    "original_size": 42458,
    "optimized_size": 3439,
    "reduction_percent": 91.9
  }
}