{
  "decision": "PENDING",
  "application_number": "15296882",
  "date_published": "20180419",
  "date_produced": "20180404",
  "title": "MANAGING PROJECT STATUS USING BUSINESS INTELLIGENCE AND PREDICTIVE ANALYTICS",
  "filing_date": "20161018",
  "inventor_list": [
    {
      "inventor_name_last": "Gamare",
      "inventor_name_first": "Kalyani Sandeep",
      "inventor_city": "Cedar Park",
      "inventor_state": "TX",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "D'Souza",
      "inventor_name_first": "Rodney Karl",
      "inventor_city": "Austin",
      "inventor_state": "TX",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Pate",
      "inventor_name_first": "Cory D.",
      "inventor_city": "Pflugerville",
      "inventor_state": "TX",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Taylor, III",
      "inventor_name_first": "Travis E.",
      "inventor_city": "Hutto",
      "inventor_state": "TX",
      "inventor_country": "US"
    }
  ],
  "ipcr_labels": [
    "G06Q1006",
    "G06N9900"
  ],
  "main_ipcr_label": "G06Q1006",
  "summary": "<SOH> SUMMARY OF THE INVENTION <EOH>A method for project status management is provided that includes creating an issue identification data structure in a non-transitory memory device using a processor, such as in response to a user identification of the issue using a user interface to a software project management system operating on a server. A notification to an analyst is generated using the server to process the issue identification data structure. Sub-component dependencies are then created in the issue identification data structure using the server. After issue resolution data associated with the issue identification data structure is received at the server, a new business intelligence rule is created using the server. The new business intelligence rule is associated with the issue identification data structure using the server. Systems, methods, features, and advantages of the present disclosure will be or become apparent to one with skill in the art upon examination of the following drawings and detailed description. It is intended that all such additional systems, methods, features, and advantages be included within this description, be within the scope of the present disclosure, and be protected by the accompanying claims.",
  "patent_number": "None",
  "abstract": "A method for project status management is provided that includes creating an issue identification data structure in a non-transitory memory device using a processor. Generating a notification to an analyst using the processor to process the issue identification data structure. Creating one or more sub-component dependencies in the issue identification data structure using the processor. Receiving issue resolution data associated with the issue identification data structure at the processor. Creating a new business intelligence rule using the processor. Associating the new business intelligence rule with the issue identification data structure using the processor.",
  "publication_number": "US20180107959A1-20180419",
  "_processing_info": {
    "original_size": 40542,
    "optimized_size": 2959,
    "reduction_percent": 92.7
  }
}