{
  "date_produced": "20180328",
  "publication_number": "US20180101779A1-20180412",
  "main_ipcr_label": "G06N504",
  "decision": "PENDING",
  "application_number": "15290658",
  "inventor_list": [
    {
      "inventor_name_last": "Canim",
      "inventor_name_first": "Mustafa",
      "inventor_city": "Ossining",
      "inventor_state": "NY",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Farrell",
      "inventor_name_first": "Robert G.",
      "inventor_city": "Cornwall",
      "inventor_state": "NY",
      "inventor_country": "US"
    }
  ],
  "abstract": "A policy violation detection computer-implemented method, system, and computer program product, includes extracting a policy activity from a policy, the policy activity including an actor in the policy, an object of the policy, an action of the policy, and policy scope metadata, capturing a transaction by a user including metadata of the transaction, translating the transaction by the user into an actor in the transaction, an action of the transaction, and an object of the transaction, and alerting the user of a policy violation by navigating a knowledge graph is-a hierarchy to relate the actor in the transaction to the actor in the policy, the object of the transaction to an object of the policy, and the action of the transaction to an action of the policy activity.",
  "filing_date": "20161011",
  "patent_number": "None",
  "summary": "<SOH> SUMMARY <EOH>In an exemplary embodiment, the present invention can provide a computer-implemented policy violation detection method, the method including extracting a policy activity from a policy, the policy activity including an actor in the policy, an object of the policy, an action of the policy, and policy scope metadata, capturing a transaction by a user including metadata of the transaction, translating the transaction by the user into an actor in the transaction, an action of the transaction, and an object of the transaction, and alerting the user of a policy violation by navigating a knowledge graph is-a hierarchy to relate the actor in the transaction to the actor in the policy, the object of the transaction to an object of the policy, and the action of the transaction to an action of the policy activity. One or more other exemplary embodiments include a computer program product and a system. Other details and embodiments of the invention will be described below, so that the present contribution to the art can be better appreciated. Nonetheless, the invention is not limited in its application to such details, phraseology, terminology, illustrations and/or arrangements set forth in the description or shown in the drawings. Rather, the invention is capable of embodiments in addition to those described and of being practiced and carried out in various ways and should not be regarded as limiting. As such, those skilled in the art will appreciate that the present invention may readily be utilized as a basis for the designing of other structures, methods and systems. It is important, therefore, that the claims be regarded as including equivalent constructions within the spirit and scope of the present invention.",
  "date_published": "20180412",
  "title": "SYSTEM, METHOD AND COMPUTER PROGRAM PRODUCT FOR DETECTING POLICY VIOLATIONS",
  "ipcr_labels": [
    "G06N504",
    "H04L2908"
  ],
  "_processing_info": {
    "original_size": 58125,
    "optimized_size": 3250,
    "reduction_percent": 94.41
  }
}