{
  "decision": "ACCEPTED",
  "application_number": "15294738",
  "date_published": "20170202",
  "date_produced": "20170119",
  "title": "PLATFORM AND APPLICATION METHOD FOR INTER-SYSTEM DATA EXCHANGE BASED ON DATA TAGS",
  "filing_date": "20161016",
  "inventor_list": [
    {
      "inventor_name_last": "Qu",
      "inventor_name_first": "Lidong",
      "inventor_city": "Beijing",
      "inventor_state": "",
      "inventor_country": "CN"
    }
  ],
  "ipcr_labels": [
    "G06F1730",
    "G06K1906"
  ],
  "main_ipcr_label": "G06F1730",
  "summary": "<SOH> SUMMARY OF THE INVENTION <EOH>The purpose of the present invention is to overcome the above-mentioned disadvantages of the prior art, to provide an integrated system that can quickly and conveniently realize a range of services based on data tags. The disclosed systems and methods can facilitate data exchange between systems, improve user experiences, and enable data tags to be applied to larger scale commercial applications. The disclosed platform and application methods for inter-system data exchanges based on data tag are easy to implement and have low implementation costs. To achieve the above objects, a platform for inter-system data exchanges based on data tag according to the present invention can include: a service management system, a data tag management systems, an application terminal, and a service resource system. Among them, the service management system stores service resource information for a plurality of services. The service resource information includes at least its corresponding application information and address information. The data tag management system obtains service resource information for at least one service resource from the service management system, and generates a data tag based on the service resource information. The application terminal is responsive to user actions and can obtain the data tag from the data tag data management system and extract the corresponding service resource information from the data tag. The service resource system includes multiple service providing servers, each service providing server corresponding to one of the service resources and is configured to exchange information with the application terminal and send a service result to the application terminal. The data tag management system includes a data tag issuing server configured to obtain service resource information from the service management system based on applications, and generate data tag according to the service resource information. The...",
  "patent_number": "9613154",
  "abstract": "The present invention relates to platforms, systems, and application methods for data exchanges between systems based on data tag. The platform for data exchange between systems includes a service management system, a data tag management systems, an application terminal, and a service resource system. The data tag management system obtains service resource information from the service management system based on different applications, and generates data tags. The application terminal obtains the corresponding service resource information from the data tag, interacts with the service management system to obtain service result, thus achieving a variety of service applications. The disclosed system and method can effectively integrate a range of services, facilitate inter-system data exchanges, and improve user experiences, which allow tag data to be applied to the larger scale commercial applications. The disclosed systems and methods are easy to implement at low costs.",
  "publication_number": "US20170032048A1-20170202",
  "_processing_info": {
    "original_size": 37692,
    "optimized_size": 3562,
    "reduction_percent": 90.55
  }
}