{
  "date_produced": "20180404",
  "publication_number": "US20180107942A1-20180419",
  "main_ipcr_label": "G06N9900",
  "decision": "PENDING",
  "application_number": "15292970",
  "inventor_list": [
    {
      "inventor_name_last": "JIANG",
      "inventor_name_first": "YIFEI",
      "inventor_city": "Sunnyvale",
      "inventor_state": "CA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "LI",
      "inventor_name_first": "DONG",
      "inventor_city": "Sunnyvale",
      "inventor_state": "CA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "TAO",
      "inventor_name_first": "JIAMING",
      "inventor_city": "Sunnyvale",
      "inventor_state": "CA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "HU",
      "inventor_name_first": "JIANGTAO",
      "inventor_city": "Sunnyvale",
      "inventor_state": "CA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "LI",
      "inventor_name_first": "LIYUN",
      "inventor_city": "Sunnyvale",
      "inventor_state": "CA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "YANG",
      "inventor_name_first": "GUANG",
      "inventor_city": "Sunnyvale",
      "inventor_state": "CA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "WANG",
      "inventor_name_first": "JINGAO",
      "inventor_city": "Sunnyvale",
      "inventor_state": "CA",
      "inventor_country": "US"
    }
  ],
  "abstract": "A social driving style learning framework or system for autonomous vehicles is utilized, which can dynamically learn the social driving styles from surrounding vehicles and adopt the driving style as needed. Each of the autonomous vehicles within a particular driving area is equipped with the driving style learning system to perceive the driving behaviors of the surrounding vehicles to derive a set of driving style elements. Each autonomous vehicle transmits the driving style elements to a centralized remote server. The server aggregates the driving style elements collected from the autonomous vehicles to determine a driving style corresponding to that particular driving area. The server transmits the driving style back to each of the autonomous vehicles. The autonomous vehicles can then decide whether to adopt the driving style, for example, to follow the traffic flow with the rest of the vehicles nearby.",
  "filing_date": "20161013",
  "patent_number": "None",
  "summary": "<SOH> BRIEF DESCRIPTION OF THE DRAWINGS <EOH>Embodiments of the invention are illustrated by way of example and not limitation in the figures of the accompanying drawings in which like references indicate similar elements. FIG. 1 is a block diagram illustrating a networked system according to one embodiment of the invention. FIG. 2 is a block diagram illustrating an example of an autonomous vehicle according to one embodiment of the invention. FIG. 3 is a block diagram illustrating an example of a perception and planning system used with an autonomous vehicle according to one embodiment of the invention. FIG. 4 is a block diagram illustrating an autonomous driving configuration according to one embodiment of the invention. FIG. 5 is a block diagram illustrating an autonomous driving configuration according to another embodiment of the invention. FIG. 6 is a flow diagram illustrating a process of operating an autonomous vehicle according one embodiment of the invention. FIG. 7 is a flow diagram illustrating a process of determining driving styles for operating autonomous vehicles according one embodiment of the invention. FIG. 8 is a block diagram illustrating an autonomous driving configuration according to another embodiment of the invention. FIG. 9 is a flow diagram illustrating a process of operating an autonomous vehicle according one embodiment of the invention. FIG. 10 is a block diagram illustrating a data processing system according to one embodiment. detailed-description description=\"Detailed Description\" end=\"lead\"?",
  "date_published": "20180419",
  "title": "GROUP DRIVING STYLE LEARNING FRAMEWORK FOR AUTONOMOUS VEHICLES",
  "ipcr_labels": [
    "G06N9900",
    "G05D100"
  ],
  "_processing_info": {
    "original_size": 72679,
    "optimized_size": 3895,
    "reduction_percent": 94.64
  }
}