{
  "decision": "PENDING",
  "application_number": "15297513",
  "date_published": "20170427",
  "date_produced": "20170412",
  "title": "PROGRAM, SYSTEM AND METHOD",
  "filing_date": "20161019",
  "inventor_list": [
    {
      "inventor_name_last": "ODAGIRI",
      "inventor_name_first": "Kei",
      "inventor_city": "Tokyo",
      "inventor_state": "",
      "inventor_country": "JP"
    }
  ],
  "ipcr_labels": [
    "G06F30338",
    "A63F1335",
    "A63F1324",
    "G06F3038",
    "A63F1325"
  ],
  "main_ipcr_label": "G06F30338",
  "summary": "<SOH> SUMMARY OF THE INVENTION <EOH>It is an object of at least one of embodiments according to the present invention to solve the problem described above, and to improve operability of a system in which a controller that does not have a function as a pointing device is used. According to one non-limiting aspect of the present invent ion, there is provided a non-transitory computer-readable medium including a program product for causing a computer to realize functions to carry out various kinds of processing on the basis of an operational input via an operation key or a stick provided in a controller. The functions include a receiving function configured to receive a predetermined operational input (hereinafter, referred to as a “first input”) and an operational input different from the first input (hereinafter, referred to as a “second input”) of operational inputs. The functions also include an updating function configured to update a coordinate indicating one point in a two-dimensional system on the basis of the first input (hereinafter, referred to as a “first coordinate”), the updating function being configured to update a coordinate different from the first coordinate (hereinafter, referred to as a “second coordinate”) on the basis of the second input. The functions also include a displaying function configured to display, on a display screen of a display device, at least one of an image corresponding to the first coordinate (hereinafter, referred to as a “first image”) and an image corresponding to the second coordinate (hereinafter, referred to as a “second image”). According to another non-limiting aspect of the present invention, there is provided a system including a communication network, a server, and a user terminal, the user terminal carrying out various kinds of processing on the basis of an operational input via an operation key or a stick provided in a controller. The system includes a receiving section configured to receive a predetermined operati...",
  "patent_number": "None",
  "abstract": "A non-transitory computer-readable medium including a program product for causing a computer to realize functions to carry out various kinds of processing on the basis of an operational input via an operation key or a stick provided in a controller is provided. The functions include: a receiving function configured to receive a predetermined operational input (first input) and an operational input different from the first input (second input) of operational inputs; an updating function configured to update a coordinate indicating one point in a two-dimensional system on the basis of the first input (first coordinate), the updating function being configured to update a coordinate different from the first coordinate (second coordinate) on the basis of the second input; and a displaying function configured to display, on a display screen of a display device, at least one of an image corresponding to the first coordinate (first image) and an image corresponding to the second coordinate (se...",
  "publication_number": "US20170115748A1-20170427",
  "_processing_info": {
    "original_size": 88032,
    "optimized_size": 3622,
    "reduction_percent": 95.89
  }
}