{
  "date_produced": "20180328",
  "publication_number": "US20180101781A1-20180412",
  "main_ipcr_label": "G06N504",
  "decision": "PENDING",
  "application_number": "15291972",
  "inventor_list": [
    {
      "inventor_name_last": "CHARRON",
      "inventor_name_first": "DAVID S.",
      "inventor_city": "ROCHESTER",
      "inventor_state": "MN",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "GILBERTSON",
      "inventor_name_first": "KYLE E.",
      "inventor_city": "ROCHESTER",
      "inventor_state": "MN",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "KONIK",
      "inventor_name_first": "RAFAL P.",
      "inventor_city": "ORONOCO",
      "inventor_state": "MN",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "LAWRENCE",
      "inventor_name_first": "NICHOLAS T.",
      "inventor_city": "ROCHESTER",
      "inventor_state": "MN",
      "inventor_country": "US"
    }
  ],
  "abstract": "An approach is described of structuring resources among a plurality of resources in a system architecture. A method pertaining to such approach may include accessing a knowledge base including attributes relevant to the plurality of resources. The attributes of the knowledge base may include concepts and logical relationships associated with the concepts. The method further may include, responsive to receiving at least one resource to be processed with respect to the plurality of resources, extracting characteristics from the at least one resource based upon the attributes of the knowledge base, and storing the extracted characteristics in a repository. The method further may include, responsive to an application request, creating a URI structure representing at least one matching resource among the plurality of resources that corresponds to the application request.",
  "filing_date": "20161012",
  "patent_number": "None",
  "summary": "<SOH> SUMMARY <EOH>The various embodiments described herein provide techniques of structuring resources among a plurality of resources in a system architecture. An associated method may include accessing a knowledge base including attributes relevant to the plurality of resources. The knowledge base may be accessed via a processor. The method further may include, responsive to receiving at least one resource to be processed with respect to the plurality of resources, extracting characteristics from the at least one resource based upon the attributes of the knowledge base, and storing the extracted characteristics in a repository. The method further may include, responsive to an application request, creating a Uniform Resource Identifier (URI) structure, wherein the URI structure represents at least one matching resource among the plurality of resources that corresponds to the application request. In an embodiment, establishing the knowledge base according to the method may include populating the knowledge base by collecting information from at least one data source and further may include training the knowledge base by determining attributes from the collected information. Additionally, establishing the knowledge base may include retraining the knowledge base. Attributes of the knowledge base may include concepts and logical relationships associated with the concepts. Furthermore, the extracted characteristics may include concept identifiers and concept values defined for the concepts of the knowledge base. In a further embodiment, the method step of creating the URI structure may include accessing the attributes of the knowledge base and accessing from the repository identification information and at least one characteristic of the at least one matching resource. Furthermore, creating the URI structure may include generating a URI set based upon the attributes of the knowledge base. The generated URI set may include at least one URI path reflecting the at least one...",
  "date_published": "20180412",
  "title": "CREATING A UNIFORM RESOURCE IDENTIFIER STRUCTURE TO REPRESENT RESOURCES",
  "ipcr_labels": [
    "G06N504",
    "G06F1730",
    "G06N9900"
  ],
  "_processing_info": {
    "original_size": 74130,
    "optimized_size": 3917,
    "reduction_percent": 94.72
  }
}