{
  "decision": "PENDING",
  "application_number": "15295345",
  "date_published": "20180419",
  "date_produced": "20180404",
  "title": "STUDENT PROGRESS SYSTEM",
  "filing_date": "20161017",
  "inventor_list": [
    {
      "inventor_name_last": "Huntington",
      "inventor_name_first": "Raymond J.",
      "inventor_city": "Juno Beach",
      "inventor_state": "FL",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Collins",
      "inventor_name_first": "Beverly",
      "inventor_city": "Haworth",
      "inventor_state": "NJ",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Frontignano",
      "inventor_name_first": "Frank",
      "inventor_city": "Jersey City",
      "inventor_state": "NJ",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Blake",
      "inventor_name_first": "Benjamin",
      "inventor_city": "Montville",
      "inventor_state": "NJ",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Lovallo",
      "inventor_name_first": "Carol",
      "inventor_city": "Old Bridge",
      "inventor_state": "NJ",
      "inventor_country": "US"
    }
  ],
  "ipcr_labels": [
    "G09B512",
    "G06F1730"
  ],
  "main_ipcr_label": "G09B512",
  "summary": "<SOH> BRIEF SUMMARY <EOH>Embodiments within the disclosure generally relate to the creation and management of personalized student programs by a tutoring center, tutor, teacher, or other such educators. One aspect includes a method for generating and monitoring one or more student programs. One or more processors may load education data corresponding to one or more students. For each student the one or more processors may generate a generated student program. The one or more processors may identify one or more generated student programs which fail to satisfy at least one or more rules and automatically report the one or more generated student programs which fail to satisfy the at least one or more rules. In some embodiments the one or more processors may, for each student, track the student's progress through the respective generated student program, identify the one or more generated student programs which fail to satisfy the at least one or more rules based on the student's progress, and automatically report the one or more generated student programs which fail to satisfy the at least one or more rules based on the student's progress.’ In some embodiments, for each of the one or more generated student programs which fail to satisfy the at least one or more rules, the generated student program may be updated. Each updated student program may be determined to satisfy all of the one or more rules and the updated student programs may be published. In some embodiments, for each student, the generated student program may be published. In some embodiments, identifying the one or more generated student programs which fail to satisfy the at least one or more rules occurs at a predetermined time period. In some embodiments, automatically reporting the one or more generated student programs which fail to satisfy the at least one or more rules comprises providing a visual notification to a display. Another aspect includes a system for generating and monitoring one or more stu...",
  "patent_number": "None",
  "abstract": "Aspects of the disclosure relate to generating and monitoring one or more student programs. For example, one or more processors may load education data corresponding to one or more students. The one or more processors may generate, for each student, a generated student program and identify one or more generated student programs which fail to satisfy at least one or more rules. The one or more generated student programs which fail to satisfy the at least one or more rules may be automatically reported, by the one or more processors.",
  "publication_number": "US20180108265A1-20180419",
  "_processing_info": {
    "original_size": 62043,
    "optimized_size": 3671,
    "reduction_percent": 94.08
  }
}