{
  "date_produced": "20170125",
  "publication_number": "US20170039473A1-20170209",
  "main_ipcr_label": "G06N308",
  "decision": "PENDING",
  "application_number": "15299124",
  "inventor_list": [
    {
      "inventor_name_last": "Starrett, JR.",
      "inventor_name_first": "William Henry",
      "inventor_city": "Richardson",
      "inventor_state": "TX",
      "inventor_country": "US"
    }
  ],
  "abstract": "This document discloses effective augmented telepathic communication as a gadget-free extension of human senses. The conveyance of mental information and cognitive processes to perceive or communicate being made possible by data structures for generating and maintaining representations of biological systems activity with auditory, visual, kinesthetic, tactile, emotion, movement, smell, taste, and concept data in a computing environment. In preferable embodiments of the present invention, one or more methods include steps for representing brain, nervous system, and sensory systems activity with mental information and cognitive processes as data for incorporating values with applications, systems, or instance relevant computing environments. In a preferable embodiment of the present invention, methods also include the association of data representing the objects, elements, assets, acts, conditions, processes, or products of perceiving, cognizing, communicating, experiencing, imagining, r...",
  "filing_date": "20161020",
  "patent_number": "None",
  "summary": "<SOH> BRIEF SUMMARY OF THE INVENTION <EOH>Objects of the present invention provide novel methods, systems, non-transitory computer readable medium, and machines for maintaining data relating to effective augmented telepathic communication as a gadget-free extension of human senses. Objects of the present invention are methods, systems, non-transitory computer readable medium, and machines for generating, analyzing, extending, communicating, integrating, storing, converting, editing, encoding, or maintaining representations of biological systems activity, mental information, and cognitive processes optionally being represented in association with expressions referencing auditory, visual, kinesthetic, tactile, emotion, concept, movement, smell, taste, and communications data in a computing environment. Aspects of the present invention include novel systems and methods for generating and maintaining data structure representations of mental information or cognitive processes being used for one or more of the following: extending human communication and intelligence; directly perceiving or communicating without optional voicing, writing, or gesturing; augmenting with computing environments; and leveraging external data for answering questions or anticipating needs. An advantage from generating and maintaining data structures representing active and passive mental information or cognitive processes from preferable embodiments of the present invention is communication with or without subvocalization and without optional voicing, writing, or gesturing. Advantages of generating and maintaining data structures representing direct sensory perception multiply from the opportunity to interface the human mind and body with computing environments without cables, optional nearby gadgetry, or invasive, uncomfortable, or cumbersome appliances. In preferable embodiments of the present invention, a computer readable medium (example, for instance, random access memory or a computer disk...",
  "date_published": "20170209",
  "title": "Methods, systems, non-transitory computer readable medium, and machines for maintaining augmented telepathic data",
  "ipcr_labels": [
    "G06N308",
    "G06N306"
  ],
  "_processing_info": {
    "original_size": 73708,
    "optimized_size": 3631,
    "reduction_percent": 95.07
  }
}