{
  "date_produced": "20180404",
  "publication_number": "US20180107932A1-20180419",
  "main_ipcr_label": "G06N504",
  "decision": "PENDING",
  "application_number": "15295317",
  "inventor_list": [
    {
      "inventor_name_last": "Pandurangarao",
      "inventor_name_first": "Anil Kumar",
      "inventor_city": "Karnataka",
      "inventor_state": "",
      "inventor_country": "IN"
    }
  ],
  "abstract": "Telematics and external data relating to the real-time driving of a population of drivers vehicle may be collected and used to calculate a driving pattern map. The driving pattern map is used to determine a driving quotient for individual drivers wherein the driving quotient is a relative score. The driving quotient may be displayed to the driver.",
  "filing_date": "20161017",
  "patent_number": "None",
  "summary": "<SOH> SUMMARY OF THE INVENTION <EOH>Aspects of the disclosure relate to methods and systems for calculating and utilizing a driving quotient. In at least one embodiment, a plurality of real-time driving data or inputs is captured by a telematics device. The real-time driving inputs may include one or more of one or more of speed, acceleration, braking, steering, user of turn signals, user of seat belts, use of radio, use of a phone, location, miles driven, type of trip, engine status, oil level, tire pressure, number of passengers, and lane departures. One or more driving conditions may be received. The driving conditions may be one or more of weather, road conditions, type of road, and time of day. This data is collected for a plurality of drivers as well as for an individual driver. A processor partitions the data from the plurality of drivers to create a driving pattern map such as a distribution curve. For example, the processor tiers particular driving patterns with driver ratings. From this data and resulting driving pattern map, and data from an individual driver, a processor may calculate a driving quotient for the individual driver. The driving pattern map and driving quotient may be based at least in part on the plurality of real-time driving inputs and the one or more driving conditions from both the plurality of drivers and the individual driver. The driver quotient is a relative score identified for every driver compared with population of other drivers. The calculated driving quotient may be sent to one or more devices, such as a portable device. The driving quotient may be sent to one or more third parties. The third parties may be one or more of a financial institution, an insurance company, a credit agency, a department of motor vehicles. The third party may utilize the driving quotient in aspects of its business. The driving quotient may be sent to and stored on a device. The device may be a computing device or may be a portable device, such as a c...",
  "date_published": "20180419",
  "title": "Partioning Sensor Based Data to Generate Driving Pattern Map",
  "ipcr_labels": [
    "G06N504",
    "G06N700"
  ],
  "_processing_info": {
    "original_size": 59679,
    "optimized_size": 2918,
    "reduction_percent": 95.11
  }
}