{
  "date_produced": "20171103",
  "publication_number": "US20170330106A1-20171116",
  "main_ipcr_label": "G06N9900",
  "decision": "PENDING",
  "application_number": "15290447",
  "inventor_list": [
    {
      "inventor_name_last": "Lindsley",
      "inventor_name_first": "Hannah R.",
      "inventor_city": "Austin",
      "inventor_state": "TX",
      "inventor_country": "US"
    }
  ],
  "abstract": "A computer-implementable method for managing a cognitive graph comprising: receiving data from a data source; processing the data, the processing comprising performing a parsing operation on the data, the processing the data identifying a plurality of knowledge elements based upon the parsing operation, the parsing operation comprising ranking of parse options; and, storing the knowledge elements within the cognitive graph as a collection of knowledge elements, the storing universally representing knowledge obtained from the data.",
  "filing_date": "20161011",
  "patent_number": "None",
  "summary": "<SOH> SUMMARY OF THE INVENTION <EOH>A method, system and computer-usable medium are disclosed for cognitive inference and learning operations. In one embodiment, the invention relates to a computer-implementable method for managing a cognitive graph comprising: receiving data from a data source; processing the data, the processing comprising performing a parsing operation on the data, the processing the data identifying a plurality of knowledge elements based upon the parsing operation, the parsing operation comprising ranking of parse options; and, storing the knowledge elements within the cognitive graph as a collection of knowledge elements, the storing universally representing knowledge obtained from the data.",
  "date_published": "20171116",
  "title": "Ranking of Parse Options Using Machine Learning",
  "ipcr_labels": [
    "G06N9900",
    "G06N504"
  ],
  "_processing_info": {
    "original_size": 243490,
    "optimized_size": 1807,
    "reduction_percent": 99.26
  }
}