{
  "decision": "PENDING",
  "application_number": "15291994",
  "date_published": "20170413",
  "date_produced": "20170329",
  "title": "MESSAGING NOVELTY DEVICE",
  "filing_date": "20161012",
  "inventor_list": [
    {
      "inventor_name_last": "Peretz",
      "inventor_name_first": "Neil",
      "inventor_city": "San Mateo",
      "inventor_state": "CA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Fullam",
      "inventor_name_first": "Scott",
      "inventor_city": "PALO ALTO",
      "inventor_state": "CA",
      "inventor_country": "US"
    }
  ],
  "ipcr_labels": [
    "G06Q3002",
    "A63F906",
    "G06F30346",
    "H04W418",
    "G09G522"
  ],
  "main_ipcr_label": "G06Q3002",
  "summary": "<SOH> BRIEF DESCRIPTION OF THE DRAWINGS <EOH>FIG. 1 depicts a front view of an example of a novelty device. FIG. 2 depicts a cross-sectional view of an example of a novelty device. FIG. 3 depicts a front perspective view of an example of a customized die. FIG. 4 depicts a diagram of an example of a system for controlling customizable message provisioning in a novelty device. FIG. 5 depicts a flowchart of an example of a method for controlling a customizable display system integrated as part of a novelty device. FIG. 6 depicts a diagram of an example of a message provisioning system and a customizable display system integrated as part of a novelty device. FIGS. 7A and 7B depict a diagram of a flowchart of an example operation of a novelty device with an integrated customizable display system and a customizable message provisioning system. FIG. 8 depicts a diagram of a solar powered customizable display system integrated with a novelty device. FIG. 9 depicts a diagram of a movement activated self-powering customizable display system integrated with a novelty device. FIG. 10 depicts a diagram of a battery powered customizable display system integrated with a novelty device. FIG. 11 depicts a diagram of a customized content maintenance system. FIG. 12 depicts a diagram of an example of a customized content reproduction management system. FIG. 13 depicts a flowchart of an example of a method for reproducing content at a customizable display system integrated as part of a novelty device based on user interaction with the novelty device. FIG. 14 depicts a flowchart of an example of a method for reproducing content at a customizable display system integrated as part of a novelty device based on environmental conditions at the novelty device. FIG. 15 depicts a flowchart of an example of a method of reproducing content on a customizable display system according to user personas. detailed-description description=\"Detailed Description\" end=\"lead\"?",
  "patent_number": "None",
  "abstract": "A messaging novelty device. A messaging novelty device can include a customizable message provisioning system and a customizable display system. A method of operating a messaging novelty device can include controlling reproduction of content on a customizable display system of the novelty device according to how a user interacts with the novelty device and content presentation rules.",
  "publication_number": "US20170103426A1-20170413",
  "_processing_info": {
    "original_size": 146572,
    "optimized_size": 3061,
    "reduction_percent": 97.91
  }
}