{
  "date_produced": "20180228",
  "publication_number": "US20180075369A1-20180315",
  "main_ipcr_label": "G06N9900",
  "decision": "PENDING",
  "application_number": "15291685",
  "inventor_list": [
    {
      "inventor_name_last": "Calmon",
      "inventor_name_first": "Flavio du Pin",
      "inventor_city": "White Plains",
      "inventor_state": "NY",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Goodwin",
      "inventor_name_first": "Richard Thomas",
      "inventor_city": "Dobbs Ferry",
      "inventor_state": "NY",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Jagmohan",
      "inventor_name_first": "Ashish",
      "inventor_city": "Irvington",
      "inventor_state": "NY",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Ratakonda",
      "inventor_name_first": "Krishna Chaitanya",
      "inventor_city": "Yorktown Heights",
      "inventor_state": "NY",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Vempaty",
      "inventor_name_first": "Aditya",
      "inventor_city": "Elmsford",
      "inventor_state": "NY",
      "inventor_country": "US"
    }
  ],
  "abstract": "Techniques for improving products based on data-driven models are provided. In one example, a system comprises a receiving component that receives product data representing information about a set of products, wherein a first product of the set of products comprises a first combination of a first set of ingredients, and wherein the product data comprises product composition data representing a composition of the first product. The system further comprises a learning component that generates product space data representing a product space that characterizes the set of products and respective degrees of similarity between members of the set of products, wherein a degree of similarity between the first product and a second product of the set of products is determined based on product distance data representing a determined distance metric resulting from a comparison of the first set of ingredients to a second set of ingredients combined to produce the second product.",
  "filing_date": "20161012",
  "patent_number": "None",
  "summary": "<SOH> SUMMARY <EOH>The following presents a summary to provide a basic understanding of one or more embodiments of the invention. This summary is not intended to identify key or critical elements, or delineate any scope of the particular embodiments or any scope of the claims. Its sole purpose is to present concepts in a simplified form as a prelude to the more detailed description that is presented later. In one or more embodiments described herein, systems, computer-implemented methods, apparatus and/or computer program products that facilitate machine learning to provide incremental static program analysis. According to an embodiment, a system is provided. The system can comprise a memory that stores computer executable components and a processor that executes computer executable components stored in the memory. The computer executable components can comprise a receiving component that can receive product data representing information about a set of products. A first product of the set of products can comprise a first combination of a first set of ingredients. The product data can comprise product composition data representing a composition of the first product. The computer executable components can further comprise a learning component that can generate product space data representing a product space that characterizes the set of products and respective degrees of similarity between members of the set of products. A degree of similarity between the first product and a second product of the set of products can be determined based on product distance data representing a determined distance metric resulting from a comparison of the first set of ingredients to a second set of ingredients combined to produce the second product. In some embodiments, elements described in connection with the system can be embodied in different forms such as a computer-implemented method, a computer program product, or another form.",
  "date_published": "20180315",
  "title": "DATA-DRIVEN MODELS FOR IMPROVING PRODUCTS",
  "ipcr_labels": [
    "G06N9900",
    "G06Q1006"
  ],
  "_processing_info": {
    "original_size": 87579,
    "optimized_size": 4097,
    "reduction_percent": 95.32
  }
}