{
  "decision": "PENDING",
  "application_number": "15298961",
  "date_published": "20170427",
  "date_produced": "20170412",
  "title": "METHOD FOR AUTHORIZING A SOFTWARE UPDATE IN A MOTOR VEHICLE",
  "filing_date": "20161020",
  "inventor_list": [
    {
      "inventor_name_last": "GUSSEN",
      "inventor_name_first": "Uwe",
      "inventor_city": "Huetgenwald",
      "inventor_state": "",
      "inventor_country": "DE"
    },
    {
      "inventor_name_last": "NEUGEBAUER",
      "inventor_name_first": "Georg",
      "inventor_city": "Herzogenrath",
      "inventor_state": "",
      "inventor_country": "DE"
    },
    {
      "inventor_name_last": "WEGNER",
      "inventor_name_first": "Goetz-Philipp",
      "inventor_city": "Dortmund",
      "inventor_state": "",
      "inventor_country": "DE"
    },
    {
      "inventor_name_last": "BUSCH",
      "inventor_name_first": "Rainer",
      "inventor_city": "Aachen",
      "inventor_state": "",
      "inventor_country": "DE"
    }
  ],
  "ipcr_labels": [
    "H04L932",
    "G06F2162",
    "H04L2906",
    "G06F9445",
    "H04L2908"
  ],
  "main_ipcr_label": "H04L932",
  "summary": "<SOH> SUMMARY <EOH>The object of the disclosure is therefore to improve methods known from the prior art for authorizing a software update in a motor vehicle with respect to unauthorized hacking. The method according to the disclosure is used to authorize a software update in a motor vehicle. In this case, authorize means checking for the presence of an entitlement to the software update. In this case, the authorization process may comprise authenticating data assigned to the process to be authorized. In the method according to the proposal, the motor vehicle has an electronic data memory with a software package stored in the latter. The electronic data memory may belong to any desired vehicle electronic apparatus in the motor vehicle. In the method according to the disclosure, authorization for at least partially updating the software package is carried out. In other words, at least some of the data in the software package is therefore replaced with the updated data or the software package is supplemented with the updated data. The software package is updated upon successful authorization. Authorization is successful when the presence of the entitlement is positively determined. The method according to the disclosure is characterized in that the motor vehicle has a local communication apparatus for near field communication. Here and in the text below, the term “near field communication” can be understood as meaning communication by radio with a maximum range of 50 cm, in particular with a maximum range of 10 cm. This is preferably communication by radio according to the international “near field communication” transmission standard which is standardized in the document ETSI TS 102 190. The method according to the disclosure is also characterized in that successful authorization is based on the fact that the local communication apparatus establishes near field communication with a portable mobile apparatus. The portable mobile apparatus may be any desired portable o...",
  "patent_number": "None",
  "abstract": "A software package is stored on an electronic data memory of the motor vehicle. A near field communication is established between a local communication apparatus and a mobile apparatus. The software package is at least partially updated responsive to a successful authorization performed over the established near field communication between the local communication apparatus and the mobile apparatus.",
  "publication_number": "US20170118023A1-20170427",
  "_processing_info": {
    "original_size": 53628,
    "optimized_size": 3457,
    "reduction_percent": 93.55
  }
}