{
  "date_produced": "20180404",
  "publication_number": "US20180107935A1-20180419",
  "main_ipcr_label": "G06N700",
  "decision": "PENDING",
  "application_number": "15297050",
  "inventor_list": [
    {
      "inventor_name_last": "Jeon",
      "inventor_name_first": "Sangick",
      "inventor_city": "San Francisco",
      "inventor_state": "CA",
      "inventor_country": "US"
    }
  ],
  "abstract": "A safety system associated with a travel coordination system collects safety data describing safety incidents by providers and generates a plurality of safety incident prediction models using the safety data. The safety incident prediction models predict likelihoods that providers in the computerized travel coordination system will be involved in safety incidents. Two types of safety incidents predicted by the safety system include dangerous driving incidents and interpersonal conflict incidents. The safety system uses the plurality of safety incident prediction models to generate a set of predictions indicating probabilities that a given provider in the travel coordination system will be involved in a safety incident in the future. The safety system selects a safety intervention for the given provider responsive to the set of predictions and performs the selected safety intervention on the given provider.",
  "filing_date": "20161018",
  "patent_number": "None",
  "summary": "<SOH> SUMMARY <EOH>The above and other needs are met by methods, non-transitory computer-readable storage media, and computer systems for predicting potential safety incidents using machine learning. Examples described herein provide a computer-implemented method for predicting potential safety incidents using machine learning. In one example, the method includes collecting safety data describing safety incidents by providers and/or riders in a computerized travel coordination system and generating a plurality of safety incident prediction models using the safety data. The safety incident prediction models predict likelihoods that providers and/or riders in the computerized travel coordination system will be involved in safety incidents. The method also includes using the plurality of safety incident prediction models to generate a set of predictions indicating probabilities that a given provider in the computerized travel coordination system will be involved in a safety incident in the future, selecting a safety intervention for the given provider responsive to the set of predictions, and performing the selected safety intervention on the given provider. Such a method can be performed by a computer system(s) and/or one or more client devices that communicate with the computer system(s). Still further, a computer system includes a non-transitory computer-readable storage medium storing instructions executable by a processor for collecting safety data describing safety incidents by providers in a computerized travel coordination system, generating a plurality of safety incident prediction models using the safety data (where the safety incident prediction models predict likelihoods that providers in the computerized travel coordination system will be involved in safety incidents), generating a set of predictions indicating probabilities that a given provider in the computerized travel coordination system will be involved in safety incidents, generating a set of predic...",
  "date_published": "20180419",
  "title": "PREDICTING SAFETY INCIDENTS USING MACHINE LEARNING",
  "ipcr_labels": [
    "G06N700",
    "G06N9900"
  ],
  "_processing_info": {
    "original_size": 63569,
    "optimized_size": 3473,
    "reduction_percent": 94.54
  }
}