{
  "date_produced": "20180404",
  "publication_number": "US20180107918A1-20180419",
  "main_ipcr_label": "G06N304",
  "decision": "PENDING",
  "application_number": "15294303",
  "inventor_list": [
    {
      "inventor_name_last": "Amir",
      "inventor_name_first": "Arnon",
      "inventor_city": "San Jose",
      "inventor_state": "CA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Datta",
      "inventor_name_first": "Pallab",
      "inventor_city": "San Jose",
      "inventor_state": "CA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Megiddo",
      "inventor_name_first": "Nimrod",
      "inventor_city": "Palo Alto",
      "inventor_state": "CA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Modha",
      "inventor_name_first": "Dharmendra",
      "inventor_city": "San Jose",
      "inventor_state": "CA",
      "inventor_country": "US"
    }
  ],
  "abstract": "Core utilization optimization by dividing computational blocks across neurosynaptic cores is provided. In some embodiments, a neural network description describing a neural network is read. The neural network comprises a plurality of functional units on a plurality of cores. A functional unit is selected from the plurality of functional units. The functional unit is divided into a plurality of subunits. The plurality of subunits are connected to the neural network in place of the functional unit. The plurality of functional units and the plurality of subunits are reallocated between the plurality of cores. One or more unused cores are removed from the plurality of cores. An optimized neural network description is written based on the reallocation.",
  "filing_date": "20161014",
  "patent_number": "None",
  "summary": "<SOH> BRIEF SUMMARY <EOH>According to embodiment of the present disclosure, a method of and computer program product for optimizing a neurosynaptic network are provided. A neural network description describing a neural network is read. The neural network comprises a plurality of functional units on a plurality of cores. A functional unit is selected from the plurality of functional units. The functional unit is divided into a plurality of subunits. The plurality of subunits are connected to the neural network in place of the functional unit. The plurality of functional units and the plurality of subunits are reallocated between the plurality of cores. One or more unused cores are removed from the plurality of cores. An optimized neural network description is written based on the reallocation.",
  "date_published": "20180419",
  "title": "CORE UTILIZATION OPTIMIZATION BY DIVIDING COMPUTATIONAL BLOCKS ACROSS CORES",
  "ipcr_labels": [
    "G06N304",
    "G06N308"
  ],
  "_processing_info": {
    "original_size": 49745,
    "optimized_size": 2570,
    "reduction_percent": 94.83
  }
}