{
  "date_produced": "20180404",
  "publication_number": "US20180107917A1-20180419",
  "main_ipcr_label": "G06N300",
  "decision": "PENDING",
  "application_number": "15297902",
  "inventor_list": [
    {
      "inventor_name_last": "Hewavitharana",
      "inventor_name_first": "Sanjika",
      "inventor_city": "Milpitas",
      "inventor_state": "CA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Kale",
      "inventor_name_first": "Ajinkya Gorakhnath",
      "inventor_city": "San Jose",
      "inventor_state": "CA",
      "inventor_country": "US"
    }
  ],
  "abstract": "In various example embodiments, a system and method for applying a quantitative range for qualitative terms. In one example, a method includes gathering user interactions, identifying a qualitative term included in the user interactions, building an electronic knowledge graph that associates the qualitative term with a quantitative range for the product identified using the qualitative term according to values in the user interactions that include the qualitative term, receiving a query for the product that includes the qualitative term, and performing, in response to receiving the query, a search that limits results according to the quantitative range stored in the knowledge graph.",
  "filing_date": "20161019",
  "patent_number": "None",
  "summary": "<SOH> BRIEF DESCRIPTION OF THE SEVERAL VIEWS OF THE DRAWINGS <EOH>In order more easily to identify the discussion of any particular element or act, the most significant digit or digits in a reference number refer to the figure number in which that element is first introduced. FIG. 1 is a block diagram illustrating a networked system, according to some example embodiments. FIG. 2 is a block diagram showing architectural details of an intelligent personal assistant system, according to some example embodiments. FIG. 3A is a block diagram illustrating components of a speech recognition component, according to one example embodiment. FIG. 3B is a flow sequence for text normalization in an artificial intelligence framework, according to one example embodiment. FIG. 4 is a block diagram illustrating a representative software architecture software architecture, according to some example embodiments, which may be used in conjunction with various hardware architectures herein described. FIG. 5 is a block diagram illustrating components of a machine, according to some example embodiments, able to read instructions from a machine-readable medium (e.g., a machine-readable storage medium) and perform any one or more of the methodologies discussed herein. FIG. 6 illustrates an aspect of the subject matter in accordance with one example embodiment. FIG. 7 illustrates another aspect of the subject matter in accordance with one embodiment. FIG. 8 illustrates an aspect of the subject matter in accordance with another embodiment. FIG. 9 illustrates an aspect of the subject matter in accordance with one example embodiment. FIG. 10 is a block diagram illustrating one example embodiment of a system for applying a quantitative range for qualitative terms. FIG. 11 is a chart illustrating user interaction data used to apply a quantitative range for qualitative terms, in accordance with one embodiment. FIG. 12 is a flow chart diagram illustrating one example embodiment of a method for applyi...",
  "date_published": "20180419",
  "title": "APPLYING A QUANTITATIVE RANGE FOR QUALITATIVE TERMS",
  "ipcr_labels": [
    "G06N300",
    "G06F1730",
    "G06N9900"
  ],
  "_processing_info": {
    "original_size": 117557,
    "optimized_size": 3418,
    "reduction_percent": 97.09
  }
}