{
  "date_produced": "20180404",
  "publication_number": "US20180107944A1-20180419",
  "main_ipcr_label": "G06N9900",
  "decision": "PENDING",
  "application_number": "15296520",
  "inventor_list": [
    {
      "inventor_name_last": "Lin",
      "inventor_name_first": "Ying",
      "inventor_city": "Shanghai",
      "inventor_state": "",
      "inventor_country": "CN"
    },
    {
      "inventor_name_last": "Yin",
      "inventor_name_first": "Huagang",
      "inventor_city": "Shanghai",
      "inventor_state": "",
      "inventor_country": "CN"
    },
    {
      "inventor_name_last": "Zhang",
      "inventor_name_first": "Jiaqi",
      "inventor_city": "Shanghai",
      "inventor_state": "",
      "inventor_country": "CN"
    }
  ],
  "abstract": "Systems and methods for processing machine learning attributes are disclosed. An example method includes: identifying a user transaction associated with a set of transaction attributes and a first transaction status; selecting, based on a risk evaluation model, a first plurality of transaction attributes from the set of transaction attributes; modifying a first value of a first transaction attribute in the first plurality of transaction attributes to produce a first modified plurality of transaction attributes; determining, based on the risk evaluation model, that the first modified plurality of transaction attributes identify a second transaction status different from the first transaction status; and in response to the determining, identifying the first transaction attribute as a risk attribute associated with the user transaction.",
  "filing_date": "20161018",
  "patent_number": "None",
  "summary": "<SOH> BRIEF DESCRIPTION OF THE FIGURES <EOH>FIG. 1 is a schematic view illustrating an embodiment of a system for selecting machine learning attributes and modifying the values thereof to determine whether an attribute contributed to a transaction denial or delay. FIG. 2A-2B is a flow chart illustrating an embodiment of a process for selecting machine learning attributes and modifying the values thereof to determine whether an attribute contributed to a transaction denial or delay. FIG. 3 is a flow chart illustrating an embodiment of a method for selecting machine learning attributes and modifying the values thereof to determine whether an attribute contributed to a transaction denial or delay. FIG. 4 is a schematic view illustrating an embodiment of a user device. FIG. 5 is a schematic view illustrating an embodiment of a computing system. detailed-description description=\"Detailed Description\" end=\"lead\"? Embodiments of the present disclosure and their advantages are best understood by referring to the detailed description that follows. It should be appreciated that like reference numerals are used to identify like elements illustrated in one or more of the figures, wherein showings therein are for purposes of illustrating embodiments of the present disclosure and not for purposes of limiting the same.",
  "date_published": "20180419",
  "title": "Processing Machine Learning Attributes",
  "ipcr_labels": [
    "G06N9900",
    "G06N700"
  ],
  "_processing_info": {
    "original_size": 66192,
    "optimized_size": 2987,
    "reduction_percent": 95.49
  }
}