{
  "date_produced": "20180328",
  "publication_number": "US20180101777A1-20180412",
  "main_ipcr_label": "G06N504",
  "decision": "PENDING",
  "application_number": "15292080",
  "inventor_list": [
    {
      "inventor_name_last": "Benja-Athon",
      "inventor_name_first": "Anuthep",
      "inventor_city": "New York",
      "inventor_state": "NY",
      "inventor_country": "US"
    }
  ],
  "abstract": "The EM Oracle having heuristics networked repositories for collective learning to reader and improve abiotic intelligence capable of rendering abiotic decisions based on rendered heuristics and logics being rendered and improved by collective learning in and among heuristics networked repositories. The abiotic decisions render and display dominant, and prevalent heuristics and logics in said touchscreens as targets of modifications to modify fates and create abiotic selection to revolutionize evolution.",
  "filing_date": "20161012",
  "patent_number": "None",
  "summary": "<SOH> SUMMARY OF THE INVENTION <EOH>The present invention created networks of servers and mobile communication devices to modify people's fates and revolutionize evolution at the rate immensely faster than that of the universe. The EM Oracle comprising networks for collective learning to render abiotic decisions capable of abiotic selection and modifying fates to revolutionize evolution based on heuristics and logics rendered in the networks wherein the abiotic decisions render networks-rendered relations of inherent heuristic algorithms and logics inherent in and among networks-rendered relations of adaptable heuristic bits of relational data in and among adaptable heuristic compilations of relational data, in the adaptable heuristic compilations of relational databases in memories henceforth rendered heuristics and logics in and among said heuristic networked servers and devices repositories, rendered heuristics and logics for marking and displaying rendered dominant and prevalent heuristics and logics in and among servers and mobile communication devices. To modify people's fates, people are able to render, view and interact with said rendered dominant and prevalent heuristics and logics in the touchsceens and viewing screens. Targeting said dominant and prevalent heuristics and logics, the EM Oracle rendering and guiding physical, biological, genetic and chemical interventions, therapeutics and engineerings and predicting and extrapolating the products, events and sequelae as consequences of the interventions, therapeutics and engineerings to render abiotic selection to improve people's lives and longevity thus revolutionizing evolution. detailed-description description=\"Detailed Description\" end=\"lead\"?",
  "date_published": "20180412",
  "title": "EM Oracle",
  "ipcr_labels": [
    "G06N504",
    "G06N9900",
    "H04L2908"
  ],
  "_processing_info": {
    "original_size": 115663,
    "optimized_size": 2773,
    "reduction_percent": 97.6
  }
}