{
  "date_produced": "20170119",
  "publication_number": "US20170032254A1-20170202",
  "main_ipcr_label": "G06N502",
  "decision": "PENDING",
  "application_number": "15291668",
  "inventor_list": [
    {
      "inventor_name_last": "Chen",
      "inventor_name_first": "Bei",
      "inventor_city": "Dublin",
      "inventor_state": "",
      "inventor_country": "IE"
    },
    {
      "inventor_name_last": "Ploennigs",
      "inventor_name_first": "Joern",
      "inventor_city": "Dublin",
      "inventor_state": "",
      "inventor_country": "IE"
    },
    {
      "inventor_name_last": "Schumann",
      "inventor_name_first": "Anika",
      "inventor_city": "Dublin",
      "inventor_state": "",
      "inventor_country": "IE"
    },
    {
      "inventor_name_last": "Sinn",
      "inventor_name_first": "Mathieu",
      "inventor_city": "Dublin",
      "inventor_state": "",
      "inventor_country": "IE"
    }
  ],
  "abstract": "A method for generating an operational rule associated with a building management system includes identifying, with a processing device, a first pattern associated with a series of operational observations corresponding to a property of the building management system, correlating a first contextual attribute with the first pattern, and deriving the operational rule at least in part based on the first pattern and the first contextual attribute.",
  "filing_date": "20161012",
  "patent_number": "None",
  "summary": "<SOH> SUMMARY <EOH>According to one embodiment of the present invention, a method for generating an operational rule associated with a building management system includes identifying, with a processing device, a first pattern associated with a series of operational observations corresponding to a property of the building management system, correlating a first contextual attribute with the first pattern, and deriving the operational rule at least in part based on the first pattern and the first contextual attribute. According to another embodiment of the present invention, a system for generating an operational rule associated with a building management system includes a pattern extractor configured to identify a first pattern associated with a series of operational observations corresponding to a property of the building management system, a context correlator configured to correlate a first contextual attribute with the first pattern, and a rule deriver configured to derive the operational rule at least in part based on the first pattern and the first contextual attribute. According to yet another embodiment of the present invention, a computer program product for generating an operational rule associated with a building management system, the computer program product including a computer readable storage medium having program code embodied therewith, the program code executable by a computer to implement identifying a first pattern associated with a series of operational observations corresponding to a property of the building management system, correlating a first contextual attribute with the first pattern, and deriving the operational rule at least in part based on the first pattern and the first contextual attribute. Additional features and advantages are realized through the techniques of the present invention. Other embodiments and aspects of the invention are described in detail herein and are considered a part of the claimed invention. For a better underst...",
  "date_published": "20170202",
  "title": "COMPUTER-BASED EXTRACTION OF COMPLEX BUILDING OPERATION RULES FOR PRODUCTS AND SERVICES",
  "ipcr_labels": [
    "G06N502",
    "H04L1228",
    "G05B1502"
  ],
  "_processing_info": {
    "original_size": 40158,
    "optimized_size": 3465,
    "reduction_percent": 91.37
  }
}