{
  "decision": "PENDING",
  "application_number": "15304625",
  "date_published": "20170209",
  "date_produced": "20170125",
  "title": "SUBSTRATE PERMEABILITY ASSESSMENT BASED ON AN IMAGE",
  "filing_date": "20161017",
  "inventor_list": [
    {
      "inventor_name_last": "Felip",
      "inventor_name_first": "Carlos",
      "inventor_city": "Barcelona",
      "inventor_state": "",
      "inventor_country": "ES"
    },
    {
      "inventor_name_last": "Domingo Reguant",
      "inventor_name_first": "Xavier",
      "inventor_city": "Sant Cugat Del Valles",
      "inventor_state": "",
      "inventor_country": "ES"
    },
    {
      "inventor_name_last": "Moliner Rafa",
      "inventor_name_first": "Oriol",
      "inventor_city": "Sant Cugat del Valles",
      "inventor_state": "",
      "inventor_country": "ES"
    }
  ],
  "ipcr_labels": [
    "H04N123",
    "G06T700",
    "G06T740",
    "H04N100",
    "G06K946"
  ],
  "main_ipcr_label": "H04N123",
  "summary": "<SOH> BRIEF DESCRIPTION OF THE DRAWINGS <EOH>The following detailed description references the drawings, wherein: FIG. 1 is a block diagram of an example printing device consistent with disclosed implementations; FIG. 2A is an orthogonal view of an example printing device consistent with disclosed implementations; FIG. 2B is a magnified view of an example print platen of the example printing device shown in FIG. 2A consistent with disclosed implementations; FIG. 3 is a block diagram of an example printing device consistent with disclosed implementations; FIG. 4 is a flow chart of an example process for substrate permeability assessment consistent with disclosed implementations; FIG. 5 is a flow chart of an example process for identifying a substrate type consistent with disclosed implementations; FIG. 6 is a flow chart of an example process for determining whether an image of a substrate includes a repeating pattern consistent with disclosed implementations; FIG. 7A is an example of an image of a substrate captured by an image capture device consistent with disclosed implementations; FIG. 7B is an example of a color scale representation of the image shown in FIG. 7A consistent with disclosed implementations; FIG. 7C is an example of an application of a FFT to the image shown in FIG. 7A consistent with disclosed implementations; FIG. 8 is a flow chart of an example process for determining if a substrate is permeable consistent with disclosed implementations: FIG. 9 is a flow chart of example process for determining if a number of voids are shown in an image of a substrate consistent with disclosed implemenations; and FIG. 10 is a flow chart of an example process for determining an accessory recommendation consistent with disclosed implementations. detailed-description description=\"Detailed Description\" end=\"lead\"?",
  "patent_number": "None",
  "abstract": "Example implementations relate to substrate permeability assessment. Some examples may determine whether voids are shown in an image of a substrate and whether there is a repeating pattern in the image. Some examples may also determine whether printing fluid would pass through the substrate during printing based on the determinations of whether voids are shown in the image and whether there is a repeating pattern in the image.",
  "publication_number": "US20170041493A1-20170209",
  "_processing_info": {
    "original_size": 80462,
    "optimized_size": 3184,
    "reduction_percent": 96.04
  }
}