{
  "decision": "PENDING",
  "application_number": "15302122",
  "date_published": "20170629",
  "date_produced": "20170614",
  "title": "DEVICE AND METHOD SIMULATING THE DETECTION OF MOVING RADIOACTIVE SOURCES",
  "filing_date": "20161005",
  "inventor_list": [
    {
      "inventor_name_last": "THEVENIN",
      "inventor_name_first": "Mathieu",
      "inventor_city": "Saclay",
      "inventor_state": "",
      "inventor_country": "FR"
    },
    {
      "inventor_name_last": "BOUDERGUI",
      "inventor_name_first": "Karim",
      "inventor_city": "Nogent-Le-Phaye",
      "inventor_state": "",
      "inventor_country": "FR"
    }
  ],
  "ipcr_labels": [
    "G01T700",
    "G01R2908",
    "G06F1750",
    "G01B714"
  ],
  "main_ipcr_label": "G01T700",
  "summary": "<SOH> BRIEF DESCRIPTION OF THE DRAWINGS <EOH>Other aspects, aims, advantages and characteristics of the invention will become clearer on reading the following detailed description of preferred forms of embodiment thereof, given by way of non-limiting example, and made with reference to the appended drawings in which: FIG. 1 is a diagram representing a possible embodiment of the device according to the invention; FIG. 2 represents the random generation over time of a number of pulses as a function of the detected distance separating the receiver; FIGS. 3 and 4 illustrate two possible embodiment variants of the pulse generator of the device according to the invention; FIG. 5 represents an energy spectrum of a radioactive source in the form of probability of appearance of pulses as a function of their amplitude. detailed-description description=\"Detailed Description\" end=\"lead\"?",
  "patent_number": "None",
  "abstract": "A device simulating detection of at least one moving radioactive source, including a receiver receiving signals transmitted by at least one signal transmitter, the device including a pulse generator coupled to the receiver and configured to determine a distance between the receiver and the at least one transmitter from a signal received from the at least one transmitter by the receiver, to generate pulses of which the number varies depending on the distance detected, and to deliver the generated pulses to an electronic processing unit to be tested, configured to be coupled, in nominal detection usage, to one or more detectors of one or more radioactive sources.",
  "publication_number": "US20170184738A1-20170629",
  "_processing_info": {
    "original_size": 23847,
    "optimized_size": 2305,
    "reduction_percent": 90.33
  }
}