{
  "decision": "PENDING",
  "application_number": "15302175",
  "date_published": "20170202",
  "date_produced": "20170119",
  "title": "SELF-MEASURING GARMENT",
  "filing_date": "20161006",
  "inventor_list": [
    {
      "inventor_name_last": "Cooper",
      "inventor_name_first": "Simon",
      "inventor_city": "Ashdod",
      "inventor_state": "",
      "inventor_country": "IL"
    },
    {
      "inventor_name_last": "Slobodkin",
      "inventor_name_first": "Michael",
      "inventor_city": "Tel Aviv",
      "inventor_state": "",
      "inventor_country": "IL"
    }
  ],
  "ipcr_labels": [
    "G06Q3006",
    "A41C300",
    "A41B1100",
    "A41H102"
  ],
  "main_ipcr_label": "G06Q3006",
  "summary": "<SOH> SUMMARY <EOH>Embodiments of the present invention provide improved apparatus and methods for measuring body dimensions, as well as methods and systems that enable a user to select appropriately-sized clothing based on such measurements. There is therefore provided, in accordance with an embodiment of the present invention, measurement apparatus, including an elastic fabric, configured as a garment to be worn over a part of a body of a human subject. One or more conductive fibers are integrated with the elastic fabric to as to stretch together with the elastic fabric when worn over the part of the body. A controller is coupled to measure an electrical property of the one or more conductive fibers in response to stretching of the elastic fabric, and to output an indication of a dimension of the part of the body based on the measured property. In some embodiments, the controller is configured to measure the change in an inductance of the one or more conductive fibers in response to the stretching of the elastic fabric. The one or more conductive fibers may be attached to the elastic fabric in a zigzag pattern, such that an angle between segments of the zigzag pattern changes in response to the stretching of the elastic fabric, thereby changing the inductance. Additionally or alternatively, the apparatus includes an elastic fabric strip, wherein at least one of the conductive fibers is attached to the elastic fabric strip, and the elastic fabric strip is attached to the elastic fabric of the garment. In one embodiment, the at least one of the conductive fibers is woven into the elastic fabric strip. Additionally or alternatively, the elastic fabric strip is attached to the garment by the at least one of the conductive fibers. Alternatively or additionally, the controller may be configured to measure the change in a resistance of the one or more conductive fibers in response to the stretching of the elastic fabric. Typically, the garment includes multiple conductiv...",
  "patent_number": "None",
  "abstract": "Measurement apparatus includes an elastic fabric, configured as a garment (20, 80) to be worn over a part of a body of a subject. One or more conductive fibers (22, 24, 25, 92, 93) are integrated with the elastic fabric to as to stretch together with the elastic fabric when worn over the part of the body. A controller (26) is coupled to measure an electrical property of the one or more conductive fibers in response to stretching of the elastic fabric, and to output an indication of a dimension of the part of the body based on the measured property.",
  "publication_number": "US20170032444A1-20170202",
  "_processing_info": {
    "original_size": 66919,
    "optimized_size": 3243,
    "reduction_percent": 95.15
  }
}