{
  "date_produced": "20170208",
  "publication_number": "US20170053213A1-20170223",
  "main_ipcr_label": "G06N9900",
  "decision": "PENDING",
  "application_number": "15307430",
  "inventor_list": [
    {
      "inventor_name_last": "ZHOU",
      "inventor_name_first": "Dong",
      "inventor_city": "Haidian District, Beijing",
      "inventor_state": "",
      "inventor_country": "CN"
    }
  ],
  "abstract": "The present invention discloses a method and a system for filtering goods review information. The method comprises: acquiring a plurality of predetermined advertisement spam samples, each advertisement spam sample comprising a review text and a user identification; establishing an advertisement spam user identification library comprising the user identifications of the plurality of advertisement spam samples; and acquiring a new review comprising a user identification and a review text, and determining the new review as an advertisement spam review if the user identification of the new review is included in the advertisement spam user identification library. An advertisement spam review is identified according to a user identification that publishes the review in the present invention. A new method is provided in the technical field of identifying an advertisement spam review for solving the problem that messy spam reviews are difficult to identify.",
  "filing_date": "20161028",
  "patent_number": "None",
  "summary": "<SOH> SUMMARY OF THE INVENTION <EOH>Concerning the above, it is necessary to provide a method and a system for filtering goods review information to address the technical problem of inaccurate classification of advertisement spam reviews in the prior art. A method for filtering goods review information, comprising; acquiring a plurality of predetermined advertisement spam samples, each advertisement spam sample comprising a review text and a user identification; establishing an advertisement spam user identification library comprising user identifications of the plurality of advertisement spam samples; and acquiring a new review comprising a user identification and a review text, and determining the new review as an advertisement spam review if the user identification of the new review is included in the advertisement spam user identification library. A system for filtering goods review information, comprising: a sample acquiring module for acquiring a plurality of predetermined advertisement spam samples, each advertisement spam sample comprising a review text and a user identification; an identification library establishing module for establishing an advertisement spam user identification library comprising user identifications of the plurality of advertisement spam samples; and a new review determining module for acquiring a new review comprising a user identification and a review text, and determining the new review as an advertisement spam review if the user identification of the new review is included in the advertisement spam user identification library. The present invention identifies an advertisement spam review using a user identification that publishes the review, and provides a totally new method in the field of identifying an advertisement Spain review. It solves the problem that is it difficult to identify messy spam reviews, and leads to significant improvement in the accuracy and recall rate of identifying advertisement spam reviews. This plays a ke...",
  "date_published": "20170223",
  "title": "METHOD AND SYSTEM FOR FILTERING GOODS EVALUATION INFORMATION",
  "ipcr_labels": [
    "G06N9900",
    "G06F1730"
  ],
  "_processing_info": {
    "original_size": 39471,
    "optimized_size": 3536,
    "reduction_percent": 91.04
  }
}