{
  "decision": "PENDING",
  "application_number": "15307789",
  "date_published": "20170921",
  "date_produced": "20170906",
  "title": "PHOTOELECTRIC SENSOR AND DRIVING METHOD THEREOF, ARRAY SUBSTRATE AND DISPLAY DEVICE",
  "filing_date": "20161028",
  "inventor_list": [
    {
      "inventor_name_last": "WU",
      "inventor_name_first": "Chunwei",
      "inventor_city": "Beijing",
      "inventor_state": "",
      "inventor_country": "CN"
    }
  ],
  "ipcr_labels": [
    "G06F3041",
    "H01L31113",
    "H01L310376",
    "H01L31103",
    "G06F3042",
    "H01L2712"
  ],
  "main_ipcr_label": "G06F3041",
  "summary": "<SOH> SUMMARY <EOH>It is desirable to solve the above problem of the current photoelectric sensor. It is also desirable to improve the signal-to-noise ratio of the electric signal detected by a reading line. According to one aspect, there is provided a photoelectric sensor. The photoelectric sensor comprises a photoelectric element, an amplifying transistor, a readout transistor, a reset transistor and a capacitor, and has a plurality of control input terminals. Wherein the photoelectric element comprises an output terminal and a reference level input terminal. The output terminal of the photoelectric element, the gate of the amplifying transistor and the source of the reset transistor are connected to a first terminal of the capacitor. The reference level input terminal of the photoelectric element and the source of the readout transistor are connected to a first reference voltage input terminal. The drain of the reset transistor and the drain of the amplifying transistor are connected to a second reference voltage input terminal. The gate of the read-out transistor and the gate of the reset transistor are respectively connected to a control input terminal. Optionally, the photoelectric element comprises a photoelectric transistor, the drain of the photoelectric transistor is connected to the output terminal of the photoelectric element, the source thereof is connected to the reference level input terminal of the photoelectric element, and the gate thereof is connected to a control input terminal. Optionally, the first reference voltage is high voltage, and the second reference voltage is low voltage. Optionally, the read-out transistor and the reset transistor conduct at the same level. Optionally, each of the transistors is an N-type transistor. Optionally, the gate of the photoelectric transistor is connected to the second reference voltage input terminal. Optionally, the second terminal of the capacitor is connected to the second reference voltage input termina...",
  "patent_number": "None",
  "abstract": "The present disclosure provides a photoelectric sensor and driving method thereof, as well as an array substrate and a display device. The photoelectric sensor comprises a photoelectric element having an output terminal and a reference level input terminal, an amplifying transistor, a readout transistor, a reset transistor, a capacitor and a plurality of control input terminals. The output terminal of the photoelectric element, the gate of the amplifying transistor and the source of the reset transistor are connected to a first terminal of the capacitor. The reference level input terminal, the sources of the readout transistor and amplifying transistor are connected to a first reference voltage input terminal. The drains of the reset transistor and amplifying transistor are connected to a second reference voltage input terminal. The gates of the read-out transistor and reset transistor are respectively connected to a control input terminal.",
  "publication_number": "US20170269782A1-20170921",
  "_processing_info": {
    "original_size": 34709,
    "optimized_size": 3585,
    "reduction_percent": 89.67
  }
}