{
  "decision": "PENDING",
  "application_number": "15308082",
  "date_published": "20170914",
  "date_produced": "20170830",
  "title": "WIRELESS INPUT SYSTEM BASED ON INTRA-BODY COMMUNICATION AND IMPLEMENTATION METHOD THEREOF",
  "filing_date": "20161031",
  "inventor_list": [
    {
      "inventor_name_last": "CHEN",
      "inventor_name_first": "XILING",
      "inventor_city": "GUANGDONG",
      "inventor_state": "",
      "inventor_country": "CN"
    }
  ],
  "ipcr_labels": [
    "G06F3023",
    "G06F301",
    "G06F116"
  ],
  "main_ipcr_label": "G06F3023",
  "summary": "<SOH> SUMMARY OF THE INVENTION <EOH>Based on the above-mentioned drawbacks of an input method of a small screen in a conventional intelligent wearable device, one objective of the present invention is to provide a wireless input system based on an intra-body communication and implementation method thereof to improve the input efficiency of the intelligent wearable device (e.g., an intelligent watch) equipped with a small screen to increase the convenience of the users where the wireless input system has a simple structure, a convenient operation, and a better security. For the above-mentioned objective, the present invention employs the following technical schemes. A wireless input system based on an intra-body communication includes an intelligent wearable device wherein the wireless input system based on the intra-body communication further includes a wireless keyboard coupled to the intelligent wearable device by a wireless manner to receive an input information, wherein the wireless keyboard includes an intra-body communication unit of a transmitting terminal and the intelligent wearable device includes an intra-body communication unit of a receiving terminal so that the wireless keyboard communicates with the intelligent wearable device therebetween via a human body to perform a wireless input procedure, and wherein the intra-body communication unit of the transmitting terminal is disposed in a press-button position of the wireless keyboard to directly contact a typing finger of a user, and the intra-body communication unit of the receiving terminal is disposed in the intelligent wearable device to directly contact a skin surface of the human body of the user; the wireless keyboard further including a control unit of the transmitting terminal and a storage unit; wherein the control unit of the transmitting terminal coupled to the intra-body communication unit of the transmitting terminal controls operations of the units within the wireless keyboard; wherein the...",
  "patent_number": "None",
  "abstract": "A wireless input system based on an intra-body communication and an implementation method thereof are provided. The method includes detecting, by a wireless keyboard, that a user clicks a plurality of keys of a keyboard and recording a keying code information corresponding to the keys; transmitting the recorded keying code information via an intra-body communication; receiving, by an intelligent wearable device, the keying code information; and mapping the received keying code information to a simulated keyboard keying code information and starting a searching mode of a default input method to search corresponding text messages for input. The present invention improves the input efficiency of the intelligent wearable device.",
  "publication_number": "US20170262068A1-20170914",
  "_processing_info": {
    "original_size": 57605,
    "optimized_size": 3332,
    "reduction_percent": 94.22
  }
}