{
  "decision": "ACCEPTED",
  "application_number": "15303508",
  "date_published": "20170511",
  "date_produced": "20170427",
  "title": "REMOTE CONTROL OF A MOTOR VEHICLE DURING A PARKED PHASE",
  "filing_date": "20161011",
  "inventor_list": [
    {
      "inventor_name_last": "DALKE",
      "inventor_name_first": "Christoph",
      "inventor_city": "Kipfenberg",
      "inventor_state": "",
      "inventor_country": "DE"
    }
  ],
  "ipcr_labels": [
    "B60R1603",
    "G06F132",
    "B60R2520"
  ],
  "main_ipcr_label": "B60R1603",
  "summary": "<SOH> SUMMARY <EOH>It is the object of the invention to provide a remote service with low latency in a motor vehicle during a parked phase. The object is achieved by the subject matters of the independent claims. Advantageous developments of the invention result from the features of the dependent claims. According to the invention, a control unit is provided for the motor vehicle, which is designed to switch off a main module upon reception of an ignition-off signal transmitted in the motor vehicle for initiating the parked phase. Here, a main module is understood to mean a circuitry area of the control unit that is provided to be operated in the driving mode of the motor vehicle, that is to say when the ignition is switched on. For switching off, the main module in the control unit is, for example, switched off or disconnected from the on-board electrical network. The ignition-off signal can be, for example, a digital signal, which represents a terminal 15 signal as defined in the German industry standard DIN 72552. Accordingly, in the parked phase, by switching off the ignition, a drive motor of the motor vehicle is switched off, for example, an internal combustion engine or an electric motor, and the described control unit is operated exclusively with electrical energy from a vehicle battery of the motor vehicle. In order to provide the remote service nonetheless, a mobile radio module is provided in the control unit, which is designed to remain logged into a mobile radio network when the main module is switched off. In other words, the mobile radio module can be identified in the mobile radio network via a SIM and it can be addressed or contacted from the mobile radio network. Moreover, an auxiliary processor device is provided in the control unit, which is designed to reserve an Internet address on an address server of the Internet via the mobile radio module, and to store this Internet address on a control server of the Internet, which is designed for the remo...",
  "patent_number": "9975504",
  "abstract": "The invention relates to a control unit for a motor vehicle, wherein the control unit is configured to switch off, upon reception of an ignition-off signal transmitted in the motor vehicle for initiating a parked phase, a main module provided for operation with ignition switched on. It is the object of the invention to provide a remote service with low latency during the parked phase. For this purpose, in the control unit, a mobile radio module is provided, which is configured so that it remains logged into a mobile radio network with the main module switched off. An auxiliary processor device is configured to reserve an Internet address on an address server of the Internet via the mobile radio module, and to store the Internet address on a control server of the Internet, which is configured for the remote control of the motor vehicle.",
  "publication_number": "US20170129425A1-20170511",
  "_processing_info": {
    "original_size": 41532,
    "optimized_size": 3421,
    "reduction_percent": 91.76
  }
}