{
  "date_produced": "20170419",
  "publication_number": "US20170124449A1-20170504",
  "main_ipcr_label": "G06N3063",
  "decision": "PENDING",
  "application_number": "15307269",
  "inventor_list": [
    {
      "inventor_name_last": "Cario",
      "inventor_name_first": "Laurent",
      "inventor_city": "Nantes",
      "inventor_state": "",
      "inventor_country": "FR"
    },
    {
      "inventor_name_last": "Corraze",
      "inventor_name_first": "Benoit",
      "inventor_city": "Carquefou",
      "inventor_state": "",
      "inventor_country": "FR"
    },
    {
      "inventor_name_last": "Stoliar",
      "inventor_name_first": "Pablo",
      "inventor_city": "Nantes",
      "inventor_state": "",
      "inventor_country": "FR"
    },
    {
      "inventor_name_last": "Tranchant",
      "inventor_name_first": "Julien",
      "inventor_city": "Reze",
      "inventor_state": "",
      "inventor_country": "FR"
    },
    {
      "inventor_name_last": "Janod",
      "inventor_name_first": "Etienne",
      "inventor_city": "La Chapelle Sur Erdre",
      "inventor_state": "",
      "inventor_country": "FR"
    },
    {
      "inventor_name_last": "Besland",
      "inventor_name_first": "Marie-Paule",
      "inventor_city": "Orvault",
      "inventor_state": "",
      "inventor_country": "FR"
    },
    {
      "inventor_name_last": "Rozenberg",
      "inventor_name_first": "Marcelo",
      "inventor_city": "Paris",
      "inventor_state": "",
      "inventor_country": "FR"
    }
  ],
  "abstract": "An artificial neuron includes a single-component electric dipole including a single material which belongs to the class of Mott insulators and is connected to first and second electric electrodes.",
  "filing_date": "20161027",
  "patent_number": "None",
  "summary": "<SOH> 4. SUMMARY OF THE INVENTION <EOH>One particular embodiment of the invention proposes an artificial neuron constituted by a single-component electrical dipole comprising a sole material belonging to the family of Mott insulators connected to two electrical electrodes. Thus, the invention proposes an artificial neuron of novel design constituted by a single single-component electrical dipole. The term “electrical dipole” is understood to mean an electronic component having two terminals. In the context of experiments carried out on Mott insulators displaying the phenomenon of volatile resistive transition induced by electrical pulses, the inventors have discovered a novel property of this family of materials which makes it possible to implement an artificial neuron in a far more simple way than in the prior art. Indeed, unlike in the prior-art artificial neurons which require the implementation of complex electronic circuits, the single-component artificial neuron according to the invention is constituted by a single electrical dipole, itself constituted by an insulating MOTT material included between two electrical electrodes. When this dipole is subjected to a sequence of electrical spikes (representing information coming from the synapses), it fulfills three elementary functions of an artificial neuron as described in the LIF reference model, namely integration with leaking and firing. This solution implements only one elementary component fulfilling all the functions of an artificial neuron and is all the more surprising as, for those skilled in the art, the prior art solutions propose complex circuits based on various electronic components. The solutions proposed by the prior art would therefore divert those skilled in the art away from the approach leading to the invention which runs counter to what has been previously established. Besides, because it implements only one electrical dipole, the single-component artificial neuron according to the invention r...",
  "date_published": "20170504",
  "title": "SINGLE-COMPONENT ARTIFICIAL NEURON BASED ON MOTT INSULATORS, NETWORK OF ARTIFICIAL NEURONS AND CORRESPONDING MANUFACTURING METHOD",
  "ipcr_labels": [
    "G06N3063",
    "G11C1154",
    "G11C1300",
    "H01L4500"
  ],
  "_processing_info": {
    "original_size": 71044,
    "optimized_size": 3739,
    "reduction_percent": 94.74
  }
}