{
  "decision": "PENDING",
  "application_number": "15303621",
  "date_published": "20170216",
  "date_produced": "20170201",
  "title": "SYSTEM AND METHODS FOR DISTRIBUTED UNINTERRUPTABLE POWER SUPPLIES",
  "filing_date": "20161012",
  "inventor_list": [
    {
      "inventor_name_last": "Wang",
      "inventor_name_first": "Jian",
      "inventor_city": "Beijing",
      "inventor_state": "",
      "inventor_country": "CN"
    },
    {
      "inventor_name_last": "Chiang",
      "inventor_name_first": "Wei-Shih",
      "inventor_city": "Shanghai",
      "inventor_state": "",
      "inventor_country": "CN"
    }
  ],
  "ipcr_labels": [
    "H02J906",
    "H02J700",
    "H05K714",
    "G06F118",
    "G06F130"
  ],
  "main_ipcr_label": "H02J906",
  "summary": "<SOH> SUMMARY <EOH>According to one aspect, a distributed uninterruptible power supply (UPS) for mounting in a data center rack is provided. The distributed power system comprises an input constructed to receive alternating current (AC) input power, an AC bus coupled to the input, a DC bus constructed to couple to at least one DC load in the data center rack, a battery bus coupled to at least one battery, and at least one power module. The at least one power module has a first input coupled to the AC bus, a second input coupled to the battery bus, and an output coupled to the DC bus and is constructed to generate DC power based on received power from at least one of the AC bus and the battery bus. In one embodiment, the at least one power module includes a power module DC bus, a converter coupled between the first input of the at least one power module and the power module DC bus, and a first DC/DC converter coupled between the power module DC bus and the output of the at least one power module. In one embodiment, the power module further includes a second DC/DC converter coupled between the power module DC bus and the second input of the at least one power module. In one embodiment, the power module further includes a power diode having a cathode terminal coupled to the power module bus and an anode terminal coupled to the second input. In one embodiment, the power module DC bus is coupled to the second input of the power module. In one embodiment, the converter is constructed to charge the at least one battery based on AC power received from the input. In one embodiment, the distributed UPS further comprises a charger coupled between the AC bus and the battery bus, the charger constructed to charge the at least one battery based on AC power received from the AC bus. In one embodiment, the distributed UPS further comprises a controller coupled to the DC bus, the AC bus, the battery bus, and the at least one power module, the controller configured to monitor distrib...",
  "patent_number": "None",
  "abstract": "According to one aspect, a distributed uninterruptible power supply (UPS) for mounting in a data center rack is provided. The distributed power system includes an input constructed to receive alternating current (AC) input power, an AC bus coupled to the input, a DC bus constructed to couple to at least one DC load in the data center rack, a battery bus coupled to at least one battery, and at least one power module. The at least one power module has a first input coupled to the AC bus, a second input coupled to the battery bus, and an output coupled to the DC bus and is constructed to generate DC power based on received power from at least one of the AC bus and the battery bus.",
  "publication_number": "US20170047772A1-20170216",
  "_processing_info": {
    "original_size": 53442,
    "optimized_size": 3422,
    "reduction_percent": 93.6
  }
}