{
  "date_produced": "20170517",
  "publication_number": "US20170154268A1-20170601",
  "main_ipcr_label": "G06N504",
  "decision": "PENDING",
  "application_number": "15308665",
  "inventor_list": [
    {
      "inventor_name_last": "GOLDIN",
      "inventor_name_first": "Ephraim",
      "inventor_city": "Tel Aviv",
      "inventor_state": "",
      "inventor_country": "IL"
    }
  ],
  "abstract": "A computer-readable medium comprising computer readable code for predicting customer behavior regarding to at least one offer, the computer-readable medium comprising: a computer-readable code adapted to, obtain a set of population data extracted from at least one database of population group and target building potential list; a computer-readable code adapted to, create a sampling process said sampling process samples said population data set and creates sample of said potential list; a computer-readable code adapted to, automatically create and execute a segmentation model to partitioned said sample from said population data set to segments; a computer-readable code adapted to, automatically generate sub-offers for each of said segments; a computer-readable code adapted to, automatically create and execute statistical behavior model for each of said sub-offer; a computer-readable code adapted to, combine results and statistical formulas of said sub-offer behavior models; a computer-r...",
  "filing_date": "20161103",
  "patent_number": "None",
  "summary": "<SOH> SUMMARY OF THE INVENTION <EOH>The present invention relates to analysis of computer databases and, more particularly, to automatic data mining. In accordance with an embodiment of the present invention there is provided a computer-readable medium comprising computer readable code for predicting customer behavior regarding to at least one offer, the computer-readable medium including, a computer-readable code adapted to, obtain a set of population data extracted from at least one database of population group and target building potential list. The computer-readable medium further includes a computer-readable code adapted to, create a sampling process, the sampling process samples the population data set and creates sample of the potential list. The computer-readable medium further includes a computer-readable code adapted to, automatically create and execute a segmentation model to find segments in the sample of the population data. The computer-readable medium further includes a computer-readable code adapted to, automatically generate sub-offers for each of the segments. The computer-readable medium further includes a computer-readable code adapted to, automatically create and execute statistical behavior model for each of the sub-offer. The computer-readable medium further includes a computer-readable code adapted to, combine results and formulas of the sub-offer behavior models. The computer-readable medium further includes a computer-readable code adapted to, create a model for parent-offer obtained from the combine results and formulas of the behavior models wherein, the parent model provides score prediction and statistical measures for each customer in the sample according to the model of the sub_offer of the segment that the customer belongs to. The computer-readable code further adapted to, automatically create a scoring process for all of said data population set, whereby, after all customers are scored, all scores are gathered into one overall score...",
  "date_published": "20170601",
  "title": "AN AUTOMATIC STATISTICAL PROCESSING TOOL",
  "ipcr_labels": [
    "G06N504",
    "G06Q3002",
    "G06F1718"
  ],
  "_processing_info": {
    "original_size": 80367,
    "optimized_size": 3554,
    "reduction_percent": 95.58
  }
}