{
  "decision": "ACCEPTED",
  "application_number": "15306618",
  "date_published": "20170216",
  "date_produced": "20170201",
  "title": "ALERTING DEVICE",
  "filing_date": "20161025",
  "inventor_list": [
    {
      "inventor_name_last": "OSUGI",
      "inventor_name_first": "Takuya",
      "inventor_city": "Kariya-city",
      "inventor_state": "",
      "inventor_country": "JP"
    }
  ],
  "ipcr_labels": [
    "B60Q900",
    "G06K900",
    "G06F301"
  ],
  "main_ipcr_label": "B60Q900",
  "summary": "<SOH> SUMMARY OF INVENTION <EOH>In view of the foregoing difficulties, it is an object of the present disclosure to provide an alerting device capable of readily alerting a driver who is looking at a mobile terminal. According to an aspect of the present disclosure, an alerting device, which alerts a driver of a vehicle when the driver is looking at a display unit of a mobile terminal equipped with a camera, includes a gaze determination portion and an alert command portion. The gaze determination portion determines whether the driver is looking at the display unit based on image data of an image captured by the camera equipped to the mobile terminal. The alert command portion outputs a command to alert the driver when the gaze determination portion determines that the driver is looking at the display unit of the mobile terminal. The alerting device configured as above makes a gaze determination for determining whether the driver is looking at the display unit with use of the camera equipped to the mobile terminal and is therefore capable of making a gaze determination more readily than in a case where a vehicle-mounted camera is used.",
  "patent_number": "9925832",
  "abstract": "An alerting device, which alerts a driver of a vehicle when the driver is looking at a display unit of a mobile terminal equipped with a camera, includes a gaze determination portion, an alert command portion, and a circumstance determination portion. The gaze determination portion determines whether the driver is looking at the display unit based on an image captured by the camera of the mobile terminal. When the circumstance determination portion determines that a current circumstance is not a gaze allowed circumstance and the gaze determination portion determines that the driver is looking at the display unit, the alert command portion outputs a command to alert the driver of the looking at the display unit. The circumstance determination portion determines that the current circumstance is the gaze allowed circumstance when the vehicle is halted at an intersection by a red traffic light.",
  "publication_number": "US20170043715A1-20170216",
  "_processing_info": {
    "original_size": 58135,
    "optimized_size": 2582,
    "reduction_percent": 95.56
  }
}