{
  "decision": "PENDING",
  "application_number": "15303158",
  "date_published": "20170202",
  "date_produced": "20170119",
  "title": "INFORMATION PROCESSING APPARATUS",
  "filing_date": "20161010",
  "inventor_list": [
    {
      "inventor_name_last": "NISHIDA",
      "inventor_name_first": "Yukio",
      "inventor_city": "Tokyo",
      "inventor_state": "",
      "inventor_country": "JP"
    },
    {
      "inventor_name_last": "SENDAI",
      "inventor_name_first": "Tomoko",
      "inventor_city": "Tokyo",
      "inventor_state": "",
      "inventor_country": "JP"
    },
    {
      "inventor_name_last": "HIROI",
      "inventor_name_first": "Noriyoshi",
      "inventor_city": "Tokyo",
      "inventor_state": "",
      "inventor_country": "JP"
    }
  ],
  "ipcr_labels": [
    "G06Q2020",
    "G06K714",
    "G06K1906"
  ],
  "main_ipcr_label": "G06Q2020",
  "summary": "<SOH> SUMMARY OF THE INVENTION <EOH>However, in any of the above-mentioned purchasing methods, the customer is required to make efforts to a certain extent. For example, in the proposed method mentioned above, the customer is required to carry the handy terminal in the store and make the handy terminal read an IC tag of a commodity. In particular, such an act is a burden for a customer who is not used to the operation of electronic equipment. In addition, in Internet shopping, a customer must prepare a user terminal (Personal Computer (PC), a smart device, or the like) which is connectable to the Internet and a communication environment and operate the user terminal to access a specific Electronic Commerce (EC) site. The present invention is contrived in view of such situations and provides a technique for assisting purchasing and the like. The wording “assisting purchasing and the like” as used herein includes not only assistance to an act of purchasing but also assistance before and after the purchase. In aspects of the invention, the following configurations are adopted in order to solve the above-described problems. A first aspect relates to an information processing apparatus. The information processing apparatus according to the first aspect includes a symbol detection unit that detects an identification symbol included in an object based on sensor information, and an association unit that associates, in accordance with a positional relationship between a commodity or a commodity symbol corresponding to the commodity and the object including the detected identification symbol, identification information obtained using the detected identification symbol with information on the commodity. A second aspect relates to a purchase assisting method executed by at least one computer. The purchase assisting method according to the second aspect includes detecting an identification symbol included in an object based on sensor information, and associating, in accordance w...",
  "patent_number": "None",
  "abstract": "An information processing apparatus (100) includes a symbol detection unit (101) that detects an identification symbol included in an object based on sensor information, and an association unit (102) that associates, in accordance with a positional relationship between a commodity or a commodity symbol corresponding to the commodity and the object including the detected identification symbol, identification information obtained using the detected identification symbol with information on the commodity.",
  "publication_number": "US20170032349A1-20170202",
  "_processing_info": {
    "original_size": 115480,
    "optimized_size": 3341,
    "reduction_percent": 97.11
  }
}