{
  "decision": "PENDING",
  "application_number": "15304737",
  "date_published": "20170209",
  "date_produced": "20170125",
  "title": "STORAGE MANAGEMENT",
  "filing_date": "20161017",
  "inventor_list": [
    {
      "inventor_name_last": "Hillier",
      "inventor_name_first": "Christopher Anthony Grant",
      "inventor_city": "Fort Collins",
      "inventor_state": "CO",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Ballard",
      "inventor_name_first": "Curtis C",
      "inventor_city": "Fort Collins",
      "inventor_state": "CO",
      "inventor_country": "US"
    }
  ],
  "ipcr_labels": [
    "G06F306",
    "G11B5008"
  ],
  "main_ipcr_label": "G06F306",
  "summary": "<SOH> BRIEF DESCRIPTION OF DRAWINGS <EOH>The detailed description is described with reference to the accompanying figures. In the figures, the left-most digit(s) of a reference number identifies the figure in which the reference number first appears. The same numbers are used throughout the figures to reference like features and components: FIG. 1A illustrates a storage management system, according to an example of the present subject matter. FIG. 1B illustrates a network implementation of the storage management system, according to another example of the present subject matter. FIG. 2A illustrates a method for storage management, according to an example of the present subject matter. FIG. 2B illustrates a method for storage management, according to another example of the present subject matter. FIG. 3 illustrates a computer readable medium storing instructions for storage management, according to an example of the present subject matter. detailed-description description=\"Detailed Description\" end=\"lead\"?",
  "patent_number": "None",
  "abstract": "Storage management is performed by detecting installation of at least one new physical tape drive in a storage system. The storage system may include a plurality of tape drives. The plurality of tape drives include physical tape drives and virtual tape drives. Based on the detection, a unique name of at least one virtual tape drive is transferred to the at least one new physical tape drive.",
  "publication_number": "US20170038991A1-20170209",
  "_processing_info": {
    "original_size": 46589,
    "optimized_size": 2109,
    "reduction_percent": 95.47
  }
}