{
  "date_produced": "20170510",
  "publication_number": "US20170147939A1-20170525",
  "main_ipcr_label": "G06N9900",
  "decision": "ACCEPTED",
  "application_number": "15316713",
  "inventor_list": [
    {
      "inventor_name_last": "Dzurak",
      "inventor_name_first": "Andrew",
      "inventor_city": "Elizabeth Bay, New South Wales",
      "inventor_state": "",
      "inventor_country": "AU"
    },
    {
      "inventor_name_last": "Veldhorst",
      "inventor_name_first": "Menno",
      "inventor_city": "Bergschenhoek",
      "inventor_state": "",
      "inventor_country": "NL"
    },
    {
      "inventor_name_last": "Yang",
      "inventor_name_first": "Chih-Hwan Henry",
      "inventor_city": "Ashfield, New South Wales",
      "inventor_state": "",
      "inventor_country": "AU"
    }
  ],
  "abstract": "A processing element for an advanced processing apparatus. The processing element comprises a silicon-insulator interface and a confining arrangement for confining one or more quantum dots in the semiconductor. The processing element has also a control arrangement for controlling a quantum property of the one or more quantum dots and operate the one or more quantum dots as a qubit to perform quantum processing.",
  "filing_date": "20161206",
  "patent_number": "9886668",
  "summary": "<SOH> SUMMARY OF THE INVENTION <EOH>In accordance with a first aspect, the present invention provides a processing element for an advanced processing apparatus, comprising silicon and a dielectric material forming an interface between the materials, a confining arrangement for confining one or more electrons or holes in the silicon to form a quantum dot, and a control arrangement for controlling a quantum property of the quantum dot to operate as a qubit. In an embodiment, the dielectric comprises substantially silicon dioxide. The silicon/silicon dioxide interface has previously been considered to provide a relatively high disorder environment and therefore not conducive to the formation of a viable quantum dot that could be used in quantum processing. The Applicants have found that a viable quantum dot can be achieved, and the quantum properties of the quantum dot can be controlled to operate as a qubit, and, in an embodiment, with high control fidelity. The Si/SiO 2 interface has been a central component of Complementary-Metal-Oxide-Semiconductor (CMOS) integrated circuit technologies for most of the past two decades. In an embodiment, the surface silicon layer in which the quantum dots are formed is isotopically enriched to contain predominantly 28 Si atoms, and this embodiment therefore takes advantage of the long coherence times that become available due to the low nuclear spin concentration in the silicon lattice. A very small nuclear spin background will still remain due to the small remaining fraction of 29 Si atoms. In an embodiment, an underlying handle wafer, which is well separated spatially from the quantum dots, may comprise naturally occurring silicon, which contains of order of 5 percent of 29 Si atoms. In an embodiment, the control arrangement comprises a control arranged to tune the quantum dot so that the energy at which the state of the quantum dot is affected can be adjusted over a range of energy values. In an embodiment, the quantum dot is fo...",
  "date_published": "20170525",
  "title": "ADVANCED PROCESSING APPARATUS",
  "ipcr_labels": [
    "G06N9900",
    "H03K19195",
    "H01L2966"
  ],
  "_processing_info": {
    "original_size": 53103,
    "optimized_size": 3301,
    "reduction_percent": 93.78
  }
}