{
  "date_produced": "20171213",
  "publication_number": "US20170372191A1-20171228",
  "main_ipcr_label": "G06N300",
  "decision": "PENDING",
  "application_number": "15312266",
  "inventor_list": [
    {
      "inventor_name_last": "REAUX-SAVONTE",
      "inventor_name_first": "Corey",
      "inventor_city": "London",
      "inventor_state": "",
      "inventor_country": "GB"
    }
  ],
  "abstract": "System, structure and method for a conscious, human-like artificial intelligence system in a non-natural entity. The creation of artificial intelligence capable of emulating one or more types of intelligence usually found in humans in a non-natural entity. With the correct structuring and functionality, the Al can think, understand and act as a human would. The Al would be “conscious”. FIG. 1.4 best depicts this.",
  "filing_date": "20161118",
  "patent_number": "None",
  "summary": "<SOH> SUMMARY <EOH>The disclosed invention helps meet the growing and changing needs of humanity as it heads into the future. In some embodiments, the Al has distinct functions that allow it to process and understand information in a human-like manner. In some embodiments, the Al can feel and express emotion. In some embodiments, the Al can have a personality. In an aspect of the invention, an Al system is able to understand, learn, remember and create information by processing data it comes across. In another aspect of the invention, an Al system is able to understand concepts only familiar to natural organisms. In another aspect of the invention, an Al system is able to override its default settings as it self-develops. In another aspect of the invention, an Al system is able to alter its level of sensitivity towards experiences, affecting its personality, mood, emotion and/or reactions.",
  "date_published": "20171228",
  "title": "SYSTEM, STRUCTURE AND METHOD FOR A CONSCIOUS, HUMAN-LIKE ARTIFICIAL INTELLIGENCE SYSTEM IN A NON-NATURAL ENTITY",
  "ipcr_labels": [
    "G06N300",
    "G06N504"
  ],
  "_processing_info": {
    "original_size": 83384,
    "optimized_size": 1937,
    "reduction_percent": 97.68
  }
}