{
  "decision": "PENDING",
  "application_number": "15312030",
  "date_published": "20170330",
  "date_produced": "20170316",
  "title": "FETAL HEALTH MONITOR",
  "filing_date": "20161117",
  "inventor_list": [
    {
      "inventor_name_last": "KHINE",
      "inventor_name_first": "Michelle",
      "inventor_city": "Irvine",
      "inventor_state": "CA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "PEGAN",
      "inventor_name_first": "Jonathan",
      "inventor_city": "Irvine",
      "inventor_state": "CA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "LEE",
      "inventor_name_first": "Eugene",
      "inventor_city": "Irvine",
      "inventor_state": "CA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "BACHMAN",
      "inventor_name_first": "Mark",
      "inventor_city": "Irvine",
      "inventor_state": "CA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "KIM",
      "inventor_name_first": "Joshua",
      "inventor_city": "Oakland",
      "inventor_state": "CA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "PARK",
      "inventor_name_first": "Sun-Jun",
      "inventor_city": "Oakland",
      "inventor_state": "CA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "FORDE",
      "inventor_name_first": "Gareth",
      "inventor_city": "Irvine",
      "inventor_state": "CA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "LIGON",
      "inventor_name_first": "Dorsey",
      "inventor_city": "Grand Rapids",
      "inventor_state": "MI",
      "inventor_country": "US"
    }
  ],
  "ipcr_labels": [
    "A61B511",
    "A61B500",
    "G06F1900"
  ],
  "main_ipcr_label": "A61B511",
  "summary": "<SOH> SUMMARY OF THE INVENTION <EOH>The present disclosure relates generally to a wearable sensor for monitoring fetal movement (e.g., fetal kicks) and/or health. The disclosure relates to technology for monitoring fetal health during later stages (e.g., weeks 24+) of pregnancy. More specifically, a sensor can be worn by a mother to extract biometric data about the fetus. This data can be used as an indirect indicator of fetal health. We disclose wearable strain sensors that can detect fetal movement by externally measuring the activity of the fetus, quantified by the frequency of movement. Such a sensor can be worn at all times by the mother to continuously provide quantitative information. This wearable sensor is less cumbersome then existing technology to improve user compliance. With continuous monitoring a decline in fetal movement can be detected earlier then without this device. Some embodiments relate to a method of monitoring fetal health in utero, comprising coupling a sensor apparatus to an abdominal surface of a patient, the sensor apparatus including a crumpled conductor capable of detecting strain. Current through the sensor apparatus can be detected during flexing of the surface. A characteristic of the sensor apparatus can be measured based on the strain to generate an output for a user indicative of the fetal health. Some embodiments relate to a sensor apparatus comprising: a flexible substrate adapted to be coupled with a portion of (e.g., the belly or abdomen of) a pregnant mother, and a conductor disposed on or in the flexible substrate, wherein the conductor is capable of repeatable variation in resistance when subject to a strain induced by motion of a fetus, e.g., strain of up to about 900%. In some embodiments, the conductor is capable of a repeatable detection of variation in resistance when subject to a strain of up to about 330%. In some embodiments, the conductor is capable of a repeatable detection of variation in resistance When subject...",
  "patent_number": "None",
  "abstract": "A wearable sensor apparatus is disclosed that includes a flexible substrate adapted to be coupled with a skin surface of an expectant mother. A conductor is disposed on the flexible substrate. The conductor can include micron-scale invaginations. The conductor can be capable of repeatable variation in resistance when subject to a strain. Also disclosed is a system for monitoring the health of a fetus in utero that includes a wearable sensor apparatus. The wearable sensor apparatus is configured to output a signal responsive to an electrical input. The system includes a computing system with one or more hardware processors. The computing system is programmed to implement a signal processing module configured to access the output signal from the wearable strain gauge and generate an output indicative of health of the baby in utero. The output can be based in part on the received output signal and previously stored correlations between signal data from the wearable strain gauge and observ...",
  "publication_number": "US20170086709A1-20170330",
  "_processing_info": {
    "original_size": 111870,
    "optimized_size": 4540,
    "reduction_percent": 95.94
  }
}