{
  "decision": "PENDING",
  "application_number": "15314672",
  "date_published": "20170713",
  "date_produced": "20170627",
  "title": "OPTICAL TRACKING SYSTEM, AND METHOD FOR CALCULATING POSTURE AND LOCATION OF MARKER PART IN OPTICAL TRACKING SYSTEM",
  "filing_date": "20161129",
  "inventor_list": [
    {
      "inventor_name_last": "LEE",
      "inventor_name_first": "Hyun Ki",
      "inventor_city": "Daegu",
      "inventor_state": "",
      "inventor_country": "KR"
    },
    {
      "inventor_name_last": "CHAE",
      "inventor_name_first": "You Seong",
      "inventor_city": "Daegu",
      "inventor_state": "",
      "inventor_country": "KR"
    },
    {
      "inventor_name_last": "KIM",
      "inventor_name_first": "Min Young",
      "inventor_city": "Daegu",
      "inventor_state": "",
      "inventor_country": "KR"
    }
  ],
  "ipcr_labels": [
    "G06T7246",
    "G06T780",
    "G06T773"
  ],
  "main_ipcr_label": "G06T7246",
  "summary": "<SOH> SUMMARY <EOH>Therefore, an aspect of the present invention is to provide an optical tracking system that can track markers accurately and easily while simplifying the markers. Another aspect of the present invention is to provide a method of calculating the posture and location of a marker part of an optical tracking system that can be applied to the optical tracking system above. An optical tracking system, according to an exemplary embodiment of the present invention, may include: a marker part that is configured to include a pattern that has particular information and a first lens that is spaced apart from the pattern and has a first focal length; a first image forming part that is configured to include a second lens that has a second focal length and a first image forming unit that is spaced apart from the second lens and on which a first image of the pattern is formed by the first lens and the second lens; a second image forming part that is configured to include a third lens that has a third focal length and a second image forming unit that is spaced apart from the third lens and on which a second image of the pattern is formed by the first lens and the third lens; and a processing part that is configured to determine a posture of the marker part from a first coordinate conversion formula between a coordinate on a pattern surface of the pattern and a first pixel coordinate on the first image of the pattern and from a second coordinate conversion formula between the coordinate on the pattern surface of the pattern and a second pixel coordinate on the second image of the pattern, the second coordinate conversion formula including a rotation conversion between the first pixel coordinate and the second pixel coordinate, and is configured to track the marker part. In an embodiment, the processing part may acquire: the first conversion matrix that converts a first coordinate corresponding to a coordinate on the pattern surface of the pattern to a second coordi...",
  "patent_number": "None",
  "abstract": "An optical tracking system includes a marker part, an image forming part, and a processing part. The marker part includes a pattern having particular information and a first lens. First and second image forming parts include second and third lenses and first and second image forming units. The processing part determines the posture of the marker part from a first coordinate conversion formula between a coordinate on the pattern surface of a pattern and first pixel coordinate on a first image of the pattern, and a second coordinate conversion formula between a coordinate on the pattern surface of the pattern and second pixel coordinate on a second image of the pattern, the second coordinate conversion formula including the rotation conversion between the first pixel coordinate and the second pixel coordinate and tracks the marker part by using the posture of the marker part.",
  "publication_number": "US20170200278A1-20170713",
  "_processing_info": {
    "original_size": 126840,
    "optimized_size": 3788,
    "reduction_percent": 97.01
  }
}