{
  "decision": "PENDING",
  "application_number": "15319410",
  "date_published": "20170601",
  "date_produced": "20170517",
  "title": "TOUCH SYSTEMS AND METHODS INCLUDING REJECTION OF UNINTENTIONAL TOUCH SIGNALS",
  "filing_date": "20161216",
  "inventor_list": [
    {
      "inventor_name_last": "Vavra",
      "inventor_name_first": "Joshua D.",
      "inventor_city": "Derry",
      "inventor_state": "NH",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Rebeschi",
      "inventor_name_first": "Thomas J.",
      "inventor_city": "Merrimack",
      "inventor_state": "NH",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Cordeiro",
      "inventor_name_first": "Craig A.",
      "inventor_city": "Westford",
      "inventor_state": "MA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Tomic",
      "inventor_name_first": "Jakisa",
      "inventor_city": "Drnis",
      "inventor_state": "",
      "inventor_country": "HR"
    }
  ],
  "ipcr_labels": [
    "G06F3041",
    "G06F30354",
    "G06F3038",
    "G06F3044"
  ],
  "main_ipcr_label": "G06F3041",
  "summary": "<SOH> BRIEF SUMMARY <EOH>Some embodiments are directed to a method of determining a touch location on a touch surface of a touch panel comprising a matrix of intersecting electrodes with nodes at intersections of the electrodes. The method includes discriminating between one or more intentional touches and one or more unintentional touches on the touch surface using first criteria. For each touch identified as an intentional touch, discrimination between a finger touch and a pen touch is performed using a second criteria. According to some embodiments, a touch sensor includes a touch panel having a touch surface and a matrix of electrodes with nodes at intersections of the electrodes. A touch controller is configured to discriminate between one or more intentional touches and one or more unintentional touches on the touch surface using first criteria. For each touch identified as an intentional touch, the controller discriminates between a finger touch and a pen touch using second criteria. Some embodiments involve a method of operating a touch sensor. A profile of a touch on a touch surface of the touch sensor is determined. The touch profile is bounded by an edge of connected nodes having a signal value greater than a threshold. One or more peak nodes corresponding to signal peaks within the touch profile are identified. The touch is classified as an intentional touch or an unintentional touch based on the one or more peak nodes and an area and/or shape of the touch profile. In accordance with some embodiments, a touch sensor includes a touch panel and a controller. The touch panel has a touch surface and a matrix of electrodes with nodes at intersections of the electrodes. The touch controller is configured to identify a profile of a touch on the touch surface. The profile is bounded by an edge of adjacent nodes having a signal value greater than a threshold. The controller identifies one or more peak nodes corresponding to signal peaks within the touch profile. ...",
  "patent_number": "None",
  "abstract": "A touch sensor can be used with a finger and/or a pen configured to provide a touch input to the touch sensor. Some implementations involve touch capacitive touch sensing, although many implementations are also applicable to other touch and pen technologies, such as resistive, surface acoustic wave, bending wave, touch force, electromagnetic (E-M). Discrimination between intentional touches and unintentional touches on the touch surface can be performed using first criteria. For each touch identified as an intentional touch, discrimination between a fmger touch and a pen touch can be performed using second criteria.",
  "publication_number": "US20170153763A1-20170601",
  "_processing_info": {
    "original_size": 310171,
    "optimized_size": 3667,
    "reduction_percent": 98.82
  }
}