{
  "decision": "PENDING",
  "application_number": "15311831",
  "date_published": "20170323",
  "date_produced": "20170309",
  "title": "TICKETING OPERATIONS",
  "filing_date": "20161116",
  "inventor_list": [
    {
      "inventor_name_last": "FÁBREGAS CASAS",
      "inventor_name_first": "Maria Del Carmen",
      "inventor_city": "BARCELONA",
      "inventor_state": "",
      "inventor_country": "ES"
    },
    {
      "inventor_name_last": "TIRADO MORAGA",
      "inventor_name_first": "Jordi",
      "inventor_city": "CORNELLÀ DE LLOBREGAT",
      "inventor_state": "",
      "inventor_country": "ES"
    },
    {
      "inventor_name_last": "FERNÁNDEZ CASANELLAS",
      "inventor_name_first": "Daniel",
      "inventor_city": "CORNELLÀ DE LLOBREGAT",
      "inventor_state": "",
      "inventor_country": "ES"
    }
  ],
  "ipcr_labels": [
    "G06Q1002",
    "H04L932",
    "H04L2906"
  ],
  "main_ipcr_label": "G06Q1002",
  "summary": "<SOH> SUMMARY <EOH>The present disclosure provides systems and methods solving at least some of the abovementioned problems. In a first aspect, a generating system is provided for generating an executable code for a set of ticketing terminals, which have a common hardware configuration, to perform one or more ticketing operations by executing the executable code. The generating system comprises a first module, a second module and a third module. The first module is configured to receive a hardware independent code implementing the one or more ticketing operations. The second module is coupled to the first module and is configured to generate the executable code by processing at least the hardware independent code, the executable code being dependent on the common hardware configuration. The third module is coupled to the second module and is configured to send the executable code to the set of ticketing terminals for them to perform the one or more ticketing operations by executing the executable code. In the context of the present disclosure, a module may be defined as a combination of hardware and/or software elements configured to operate together for providing one or more desired functionalities. In this sense, a module may be also seen as comprising one or more sub-modules which may work together for the module to provide the required functionality or functionalities. According to this definition of the term module, the proposed generating system may be seen as a single module having three sub-modules: a first one for receiving the hardware independent code, a second one for generating the executable code from the hardware independent code, and a third one for sending the executable code to the terminals. The hardware independent code may be an intermediate code between a source code conceptually implementing the ticketing operations and the executable code to be executed by the ticketing terminals. This hardware independent code may have been generated by a su...",
  "patent_number": "None",
  "abstract": "A generating system is provided for generating an executable code for a set of ticketing terminals, which have a common hardware configuration, to perform one or more ticketing operations by executing the executable code. The generating system comprises a first module, a second module and a third module. The first module is configured to receive a hardware independent code implementing the one or more ticketing operations. The second module is configured to generate the executable code, which is dependent on the hardware configuration, by processing at least the hardware independent code. The third module is configured to send the executable code to the set of ticketing terminals for them to perform the one or more ticketing operations by executing the executable code. A producing system is also provided for producing the hardware independent code. A distributing system is also provided comprising one producing system and a plurality of generating systems.",
  "publication_number": "US20170083834A1-20170323",
  "_processing_info": {
    "original_size": 70167,
    "optimized_size": 3874,
    "reduction_percent": 94.48
  }
}