{
  "patent_number": "None",
  "application_number": "15322236",
  "date_published": "20170720",
  "date_produced": "20170705",
  "filing_date": "20170403",
  "main_ipcr_label": "G06N504",
  "abstract": "Disclosed is a method and system for providing type information and evaluation information, using data collected from a user terminal. A method for providing type information and evaluation information may comprise the steps of: storing and maintaining an evaluation item for an individual; identifying collection data—the collection data includes a location of the evaluation target person and time record data—collected from at least one of a terminal of a person to be evaluated and a reader device installed at a predetermined place; and generating at least one of type information and evaluation information for the individual on the basis of predetermined correlation between the evaluation item and the collection data.",
  "publication_number": "US20170206454A1-20170720",
  "summary": "<SOH> BRIEF DESCRIPTION OF DRAWINGS <EOH>FIG. 1 is a diagram illustrating a concept of a type information and evaluation information providing system according to an example embodiment; FIG. 2A is a block diagram illustrating an example of a configuration of a type information and evaluation information providing apparatus according to an example embodiment; FIG. 2B is a block diagram illustrating an example of a configuration of a collected data analyzing apparatus according to an example embodiment; FIG. 3 is a flowchart illustrating a type information and evaluation information providing method according to an example embodiment; and FIG. 4 is a flowchart illustrating a type information and evaluation information providing method according to another example embodiment. detailed-description description=\"Detailed Description\" end=\"lead\"?",
  "ipcr_labels": [
    "G06N504",
    "H04W402"
  ],
  "inventor_list": [
    {
      "inventor_name_last": "JIHN",
      "inventor_name_first": "Chang Ho",
      "inventor_city": "Seongnam-si",
      "inventor_state": "",
      "inventor_country": "KR"
    }
  ],
  "title": "METHOD AND SYSTEM FOR PROVIDING TYPE INFORMATION AND EVALUATION INFORMATION, USING DATA COLLECTED FROM USER TERMINAL",
  "decision": "PENDING",
  "_processing_info": {
    "original_size": 61673,
    "optimized_size": 2204,
    "reduction_percent": 96.43
  }
}