{
  "patent_number": "None",
  "application_number": "15329348",
  "date_published": "20170810",
  "date_produced": "20170726",
  "filing_date": "20170126",
  "main_ipcr_label": "G06N308",
  "abstract": "In one example, neuro-fuzzy expert system logic analyzes and assigns significance values to events occurring in a cloud infrastructure. The logic includes event significance logic and a plurality of neuro-fuzzy logic modules. Each of the logic modules includes fuzzy logic to determine a fuzzy value of an effect of a detected event on the cloud infrastructure. The event significance logic includes neuro-fuzzy logic to determine, based on the values of the effects of the detected event determined by the plurality of neuro-fuzzy logic modules, a value indicative of significance of the event to the cloud infrastructure.",
  "publication_number": "US20170228640A1-20170810",
  "summary": "<SOH> BRIEF DESCRIPTION OF THE DRAWINGS <EOH>For a detailed description of various examples, reference will now be made to the accompanying drawings in which: FIGS. 1 and 2 show block diagrams of system that applies neuro-fuzzy logic to analyze events in a cloud infrastructure in accordance with principles disclosed herein; FIG. 3 shows neuro-fuzzy logic arranged to determine the significance of an event in cloud infrastructure in accordance with principles disclosed herein; FIGS. 4A-4F shows examples of fuzzy values applied in a system for analyzing events in a cloud infrastructure in accordance with principles disclosed herein; FIG. 5 shows an arrangement of logic layers in neuro-fuzzy logic for analyzing events in a cloud infrastructure in accordance with principles disclosed herein; FIG. 6 shows a flow diagram for a method for applying neuro-fuzzy logic to analyze events in a cloud infrastructure in accordance with principles disclosed herein; and FIG. 7 shows a flow diagram for a method for training neuro-fuzzy logic to analyze events in a cloud infrastructure in accordance with principles disclosed herein. detailed-description description=\"Detailed Description\" end=\"lead\"?",
  "ipcr_labels": [
    "G06N308",
    "G06N304"
  ],
  "inventor_list": [
    {
      "inventor_name_last": "Ivanov",
      "inventor_name_first": "Plamen Valentinov",
      "inventor_city": "Sofia",
      "inventor_state": "",
      "inventor_country": "BG"
    }
  ],
  "title": "CLOUD INFRASTRUCTURE EVENT ANALYSIS",
  "decision": "PENDING",
  "_processing_info": {
    "original_size": 34702,
    "optimized_size": 2361,
    "reduction_percent": 93.2
  }
}