{
  "patent_number": "None",
  "application_number": "15324428",
  "date_published": "20170608",
  "date_produced": "20170524",
  "filing_date": "20170106",
  "main_ipcr_label": "G06N504",
  "abstract": "The present invention provides a method and an apparatus for predicting the temporal course of a power requirement in a housing development comprising one or a plurality of housing units each comprising a plurality of power consumers, the housing development having a common power supply that is subject to a temporally variable tariff. The method is designed such that a prediction of the power consumption (404) of the housing development (201) for a future time period having a specified duration T is made and continuously updated, it being possible for a load transfer for reducing the power costs to be determined on the basis of a current prediction of the power consumption (404), each prediction of the power consumption (404) using data of detected load profiles (402) of the housing development (202) that are formed by detecting the temporal course of the overall power consumption of the housing development in the time period having the specified duration T, a current prediction (404) ...",
  "publication_number": "US20170161623A1-20170608",
  "summary": "<SOH> BRIEF DESCRIPTION OF THE FIGURES <EOH>In the figures: FIG. 1 shows a typical housing unit in a housing development; FIG. 2 shows a typical housing development and the temporal course of the power consumed in the housing development; FIG. 3 is an example of how known daily load profiles of the housing development can be assigned one or more characteristic variables; FIG. 4 shows how a prediction for a future load profile is made according to an embodiment of the invention; FIG. 5 is a block diagram showing an embodiment of a computer; and FIG. 6 shows how a prediction for a future load profile is made according to another embodiment of the invention. detailed-description description=\"Detailed Description\" end=\"lead\"?",
  "ipcr_labels": [
    "G06N504",
    "G06Q5006"
  ],
  "inventor_list": [
    {
      "inventor_name_last": "HANEN",
      "inventor_name_first": "Heinze",
      "inventor_city": "Karlsruhe",
      "inventor_state": "",
      "inventor_country": "DE"
    },
    {
      "inventor_name_last": "DIEDRICH",
      "inventor_name_first": "Frank",
      "inventor_city": "Karlsruhe",
      "inventor_state": "",
      "inventor_country": "DE"
    },
    {
      "inventor_name_last": "BERTSCH",
      "inventor_name_first": "Valentin",
      "inventor_city": "Karlsruhe",
      "inventor_state": "",
      "inventor_country": "DE"
    },
    {
      "inventor_name_last": "SCHWARZ",
      "inventor_name_first": "Hannes",
      "inventor_city": "Karlsruhe",
      "inventor_state": "",
      "inventor_country": "DE"
    }
  ],
  "title": "METHOD AND APPARATUS FOR PREDICTING THE TEMPORAL COURSE OF A POWER REQUIREMENT IN A HOUSING DEVELOPMENT",
  "decision": "PENDING",
  "_processing_info": {
    "original_size": 42252,
    "optimized_size": 2776,
    "reduction_percent": 93.43
  }
}