{
  "patent_number": "None",
  "application_number": "15327776",
  "date_published": "20170720",
  "date_produced": "20170705",
  "filing_date": "20170120",
  "main_ipcr_label": "G06N304",
  "abstract": "Systems and methods associated with neural network verification are disclosed. One example method may be embodied on a non-transitory computer-readable medium storing computer-executable instructions. The instructions, when executed by a computer, may cause the computer to train a neural network with a training data set to perform a predefined task. The instructions may also cause the computer to train the neural network with a sentinel data set. The sentinel data set may cause the neural network to provide an identification signal in response to a predefined query set. The instructions may also cause the computer to verify whether a suspicious service operates an unauthorized copy of the neural network. The suspicious service may be verified by extracting the identification signal from responses the suspicious service provides to the predefined query set.",
  "publication_number": "US20170206449A1-20170720",
  "summary": "<SOH> BRIEF DESCRIPTION OF THE DRAWINGS <EOH>The present application my be more fully appreciated in connection with the following detailed description taken in conjunction with the accompanying drawings, in which like reference characters refer to like parts throughout, and in which: FIG. 1 illustrates an example sec network which example is and methods, and equivalents may operate. FIG. 2 illustrates a flowchart of example operation associated with neural network verification. FIG. 3 illustrates another flowchart of example operations associated with neural network verification. FIG. 4 illustrates another flowchart of example operations associated with neural network verification. FIG. 5 illustrates an example system associated with neural network verification. FIG. 6 illustrates another example system associated with neural network verification. FIG. 7 illustrates another flowchart of example operations associated with neural network verification. FIG. 8 illustrates an example computing device in which example systems and methods, and equivalents, may operate. detailed-description description=\"Detailed Description\" end=\"lead\"?",
  "ipcr_labels": [
    "G06N304",
    "G06N308"
  ],
  "inventor_list": [
    {
      "inventor_name_last": "Lain",
      "inventor_name_first": "Antonio",
      "inventor_city": "Menlo Park",
      "inventor_state": "CA",
      "inventor_country": "US"
    }
  ],
  "title": "NEURAL NETWORK VERIFICATION",
  "decision": "PENDING",
  "_processing_info": {
    "original_size": 41619,
    "optimized_size": 2543,
    "reduction_percent": 93.89
  }
}