{
  "patent_number": "None",
  "application_number": "15326202",
  "date_published": "20170713",
  "date_produced": "20170627",
  "filing_date": "20170113",
  "main_ipcr_label": "G06N502",
  "abstract": "A method and a computerized system programmed to carry out the method of predicting the capacity of a public-transport vehicle for passengers to board at the stop and for displaying this predicted capacity on remote computer devices or service screens is provided. The method comprises a prediction process and a data procurement process. The capacity of the public-transport vehicle for passengers to board at the stop is predicted in the prediction process by combining measurements of a filling level of the public-transport vehicle when the public-transport vehicle is at the stop or approaching the stop, which are performed in the course of the data procurement process, with a number of passengers expected to alight the public-transport vehicle.",
  "publication_number": "US20170200082A1-20170713",
  "summary": "<SOH> SUMMARY OF THE INVENTION <EOH>According to a first aspect, a method is provided of predicting a capacity of the public-transport vehicle for passengers to board at a stop, and for at least one of (i) displaying information representative of this capacity on at least one stationary display device at the stop and (ii) enabling data representative of this capacity to be transmitted to at least one remote computer device. The capacity of the public-transport vehicle for passengers to board at the stop corresponds to the number of passengers that can board the public transport vehicle at the stop. The method comprises two automatic processes, a prediction process and a data procurement process. The prediction process comprises predicting a capacity of the public-transport vehicle for passengers to board at the stop by measuring a filling level of the public-transport vehicle before the stop when the public-transport vehicle is approaching the stop and combining the measured filling level with a stored indication of a number of passengers expected to alight from the public-transport vehicle at the stop. The stored indication of the number of passengers expected to alight from the public-transport vehicle at the stop is the result of at least one previous execution of the data procurement process. The prediction process further comprises at least one of (i) displaying the information representative of the predicted capacity of the public-transport vehicle for passengers to board at the stop on the at least one stationary display device at the stop and (ii) enabling data representative of this capacity to be transmitted to the at least one remote computer device. The data procurement process comprises determining, when the vehicle is at the stop, the number of passengers that have alighted from the public-transport vehicle at the stop and updating the stored indication of the number of passengers expected to alight from the public-transport vehicle at the stop to be u...",
  "ipcr_labels": [
    "G06N502"
  ],
  "inventor_list": [
    {
      "inventor_name_last": "Böhm",
      "inventor_name_first": "Gerrit",
      "inventor_city": "Geretsried",
      "inventor_state": "",
      "inventor_country": "DE"
    }
  ],
  "title": "CAPACITY PREDICTION FOR PUBLIC TRANSPORT VEHICLES",
  "decision": "PENDING",
  "_processing_info": {
    "original_size": 123179,
    "optimized_size": 3293,
    "reduction_percent": 97.33
  }
}