{
  "date_produced": "20170405",
  "publication_number": "US20170109645A1-20170420",
  "main_ipcr_label": "G06N700",
  "decision": "ACCEPTED",
  "application_number": "15336076",
  "inventor_list": [
    {
      "inventor_name_last": "Hohndel",
      "inventor_name_first": "Dirk",
      "inventor_city": "Portland",
      "inventor_state": "OR",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Van De Ven",
      "inventor_name_first": "Adriaan",
      "inventor_city": "Portland",
      "inventor_state": "OR",
      "inventor_country": "US"
    }
  ],
  "abstract": "Embodiments of techniques and systems for performance of predicted actions are described. In embodiments, a predicted action performance engine (“PAE”) may receive one or probabilities of potential actions that may be performed on a computing device. The PAE may also receive a system context for the computing device describing available resources on the computing device, workload, etc. Based on these probabilities and the system context, the PAE may determine one or more predicted actions and/or resource utilizations which are likely to occur and which may be performed ahead of time. The PAE may then facilitate performance of these actions and/or resource utilizations. Other embodiments may be described and claimed.",
  "filing_date": "20161027",
  "patent_number": "9886667",
  "summary": "<SOH> BRIEF DESCRIPTION OF THE DRAWINGS <EOH>Embodiments will be readily understood by the following detailed description in conjunction with the accompanying drawings. To facilitate this description, like reference numerals designate like structural elements. Embodiments are illustrated by way of example, and not by way of limitation, in the figures of the accompanying drawings. FIG. 1 is a block diagram illustrating an example predicted action performance system, in accordance with various embodiments. FIG. 2 is a block diagram illustrating an example probabilities engine, in accordance with various embodiments. FIG. 3 illustrates an example action prediction and performance process, in accordance with various embodiments. FIG. 4 illustrates an example probability generation process, in accordance with various embodiments. FIG. 5 illustrates an example flow structure generation process, in accordance with various embodiments. FIG. 6 illustrates an example observation collection process, in accordance with various embodiments. FIG. 7 illustrates an example flow structure, in accordance with various embodiments. FIG. 8 illustrates an example process for generating probabilities from a flow structure, in accordance with various embodiments. FIG. 9 illustrates an example expected value structure, in accordance with various embodiments. FIG. 10 illustrates an example predicted action performance process, in accordance with various embodiments. FIG. 11 illustrates an example computing environment suitable for practicing the disclosure, in accordance with various embodiments. detailed-description description=\"Detailed Description\" end=\"lead\"?",
  "date_published": "20170420",
  "title": "PERFORMANCE OF PREDICTED ACTIONS",
  "ipcr_labels": [
    "G06N700",
    "G06F950",
    "G06F1130"
  ],
  "_processing_info": {
    "original_size": 51607,
    "optimized_size": 3098,
    "reduction_percent": 94.0
  }
}