{
  "decision": "PENDING",
  "application_number": "15339675",
  "date_published": "20180503",
  "date_produced": "20180418",
  "title": "AUTOMATED MECHANISM TO ANALYZE ELEVATED AUTHORITY USAGE AND CAPABILITY",
  "filing_date": "20161031",
  "inventor_list": [
    {
      "inventor_name_last": "ANDERSON",
      "inventor_name_first": "Mark J.",
      "inventor_city": "Oronoco",
      "inventor_state": "MN",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "BUDNIK",
      "inventor_name_first": "Carol S.",
      "inventor_city": "Rochester",
      "inventor_state": "MN",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "DIETENBERGER",
      "inventor_name_first": "Anna P.",
      "inventor_city": "Rochester",
      "inventor_state": "MN",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "FORSTIE",
      "inventor_name_first": "Scott",
      "inventor_city": "Rochester",
      "inventor_state": "MN",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "HASSELBECK",
      "inventor_name_first": "Brian J.",
      "inventor_city": "Rochester",
      "inventor_state": "MN",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "MEI",
      "inventor_name_first": "Allen K.",
      "inventor_city": "Rochester",
      "inventor_state": "MN",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "STREIFEL",
      "inventor_name_first": "Ellen B.",
      "inventor_city": "Rochester",
      "inventor_state": "MN",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "UEHLING",
      "inventor_name_first": "Jeffrey M.",
      "inventor_city": "Saint Charles",
      "inventor_state": "MO",
      "inventor_country": "US"
    }
  ],
  "ipcr_labels": [
    "G06F2162"
  ],
  "main_ipcr_label": "G06F2162",
  "summary": "<SOH> SUMMARY <EOH>According to one embodiment of the present disclosure, a method for securing file access. Generally, the method comprises monitoring a set of file access requests to a file from an application to obtain permission and identity information related to the monitored requests, wherein the monitoring includes obtaining a runtime stack from the application, determining, based on environment information in the runtime stack, whether a first set of privileges available to the application are greater than a second set of privileges available to a the user of the application, storing the permission and identity information and an indication of whether the first set of privileges is greater than the second set of privileges in a data file, and adjusting the privileges for the user based on the determination. According to another embodiment of the present disclosure, a system for securing file access. Generally, the system comprises a processor and a memory including a program which when executed by the processor, performs an operation comprising monitoring a set of file access requests to a file from an application to obtain permission and identity information related to the monitored requests, wherein the monitoring includes obtaining a runtime stack from the application, determining, based on environment information in the runtime stack, whether a first set of privileges available to the application are greater than a second set of privileges available to a the user of the application, storing the permission and identity information and an indication of whether the first set of privileges is greater than the second set of privileges in a data file, and adjusting the privileges for the user based on the determination. According to another embodiment of the present disclosure, a computer program product comprising a computer-readable storage medium having computer-readable program code embodied therewith, the computer-readable program code executable by one ...",
  "patent_number": "None",
  "abstract": "Systems, methods, and computer program products to perform an operation comprising monitoring a set of file access requests to a file from an application to obtain permission and identity information related to the monitored requests, wherein the monitoring includes obtaining a runtime stack from the application, determining, based on environment information in the runtime stack, whether a first set of privileges available to the application are greater than a second set of privileges available to a the user of the application, storing the permission and identity information and an indication of whether the first set of privileges is greater than the second set of privileges in a data file, and adjusting the privileges for the user based on the determination.",
  "publication_number": "US20180121665A1-20180503",
  "_processing_info": {
    "original_size": 90563,
    "optimized_size": 4387,
    "reduction_percent": 95.16
  }
}