{
  "date_produced": "20180411",
  "publication_number": "US20180114134A1-20180426",
  "main_ipcr_label": "G06N700",
  "decision": "PENDING",
  "application_number": "15333239",
  "inventor_list": [
    {
      "inventor_name_last": "Alva",
      "inventor_name_first": "Jesus G.",
      "inventor_city": "Cedar Park",
      "inventor_state": "TX",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Borkar",
      "inventor_name_first": "Ketaki",
      "inventor_city": "Campbell",
      "inventor_state": "CA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Olivieri",
      "inventor_name_first": "Ricardo N.",
      "inventor_city": "Austin",
      "inventor_state": "TX",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Williamson",
      "inventor_name_first": "Leigh A.",
      "inventor_city": "Austin",
      "inventor_state": "TX",
      "inventor_country": "US"
    }
  ],
  "abstract": "Approaches presented herein enable identification of an owner of a misplaced item. More specifically, an owner identification system receives information about an item from a finder of the item and generates, based on the information, a found item profile including characteristics historically associated with typical owners of such an item. The system generates a set of profiles of user preferences based on social media activity of the users and determines, based on a comparison of the found item profile with the user preferences profile, a likelihood that the user is the owner of the item. Based on this determination, the finder of the item can be notified of an identification of a potential owner. Successful matches between found items and their owners can be entered into a cognitive learning system to improve future outcomes.",
  "filing_date": "20161025",
  "patent_number": "None",
  "summary": "<SOH> SUMMARY <EOH>In general, embodiments described herein provide for identification of an owner of a misplaced item. More specifically, an owner identification system receives information about an item from a finder of the item and generates, based on the information, a found item profile including characteristics historically associated with typical owners of such an item. The system generates a set of profiles of user preferences based on social media activity of the users and determines, based on a comparison of the found item profile with the user preferences profile, a likelihood that the user is the owner of the item. Based on this determination, the finder of the item can be notified of an identification of a potential owner. Successful matches between found items and their owners can be entered into a cognitive learning system to improve future outcomes. One aspect of the present invention includes a computer-implemented method for identifying an owner of a misplaced item, the computer-implemented method comprising: receiving information about a found item from a finder of the found item; generating, based on the received information, a found item profile comprising a set of characteristics historically associated with owners of the found item; generating a user preferences profile comprising a set of preferences of a user; determining, based on a comparison of the found item profile with the user preferences profile, a likelihood that the user is the owner of the found item; and notifying, in response to the likelihood being above a predetermined threshold, the finder of an identification of a potential owner based on the determination. Another aspect of the present invention includes a computer system for identifying an owner of a misplaced item, the computer system comprising: a memory medium comprising program instructions; a bus coupled to the memory medium; and a processor, for executing the program instructions, coupled to a found item owner identi...",
  "date_published": "20180426",
  "title": "IDENTIFYING OWNERS OF FOUND ITEMS",
  "ipcr_labels": [
    "G06N700",
    "G06N9900"
  ],
  "_processing_info": {
    "original_size": 84771,
    "optimized_size": 3821,
    "reduction_percent": 95.49
  }
}