{
  "decision": "PENDING",
  "application_number": "15338822",
  "date_published": "20170216",
  "date_produced": "20170201",
  "title": "TOUCH SCREEN PANEL",
  "filing_date": "20161031",
  "inventor_list": [
    {
      "inventor_name_last": "LEE",
      "inventor_name_first": "Seung-Jin",
      "inventor_city": "Yongin-si",
      "inventor_state": "",
      "inventor_country": "KR"
    }
  ],
  "ipcr_labels": [
    "G06F3044"
  ],
  "main_ipcr_label": "G06F3044",
  "summary": "<SOH> SUMMARY OF THE INVENTION <EOH>The other aspects of the present invention, there is provided a touch screen panel, comprising a substrate comprising an active area and a non-active area positioned outside the active area, first and second sensing electrodes formed over the active area, wherein the first electrodes connected along a first direction, and the second sensing electrodes connected along a second direction that intersects the first direction, and outside wiring lines formed in the non-active area to connect the first and second sensing electrodes to an external driving circuit in units of lines and having at least one of slits that cross insides of the outside wiring lines so that widths of conductive paths are reduced in partial sections. The slit may include a first slit extended in a direction that intersects a longitudinal direction of the outside wiring lines and a second slit extended to parallel in the longitudinal direction of the outside wiring lines. The slit may be L or T shaped. The slit may include a plurality of slits formed over one outside wiring line. The outside wiring lines may have different lengths and the number of slits may be increased as the lengths of the wiring lines are smaller. The outside wiring lines may have different lengths and a length of the second slit may be increased as the lengths of the wiring lines are smaller. The outside wiring lines may include strip patterns divided by the slit. The strip patterns may be extended to parallel in a longitudinal direction of the outside wiring lines. The outside wiring lines may have. substantially a uniform width in all sections. The outside wiring lines may be a low resistance metal material The outside wiring lines may include at least one selected from consisting; of Mo, At, Ti, Cu, Al, and Mo/Al/Mo.",
  "patent_number": "None",
  "abstract": "A touch screen panel that includes a substrate comprising an active area and a non-active area positioned outside the active area, first and second sensing electrodes formed over the active area, wherein the first sensing electrodes connected along a first direction, and wherein the second sensing electrodes connected along a second direction that intersects the first direction, and outside wiring lines formed in the non-active area to connect the first and second sensing electrodes to an external driving circuit in units of lines and having at least one of slits that cross insides of the outside wiring lines so that widths of conductive paths are reduced in partial sections.",
  "publication_number": "US20170045971A1-20170216",
  "_processing_info": {
    "original_size": 34362,
    "optimized_size": 3013,
    "reduction_percent": 91.23
  }
}