{
  "decision": "PENDING",
  "application_number": "15335656",
  "date_published": "20170706",
  "date_produced": "20170621",
  "title": "Active Pen for a Touch Module, a Touch Input System and a Driving Method Thereof",
  "filing_date": "20161027",
  "inventor_list": [
    {
      "inventor_name_last": "Fang",
      "inventor_name_first": "Zhixiang",
      "inventor_city": "Beijing",
      "inventor_state": "",
      "inventor_country": "CN"
    },
    {
      "inventor_name_last": "Zhang",
      "inventor_name_first": "Dayu",
      "inventor_city": "Beijing",
      "inventor_state": "",
      "inventor_country": "CN"
    }
  ],
  "ipcr_labels": [
    "G06F30354",
    "G06F3038",
    "G06F3044",
    "G06F30346",
    "G06F3041"
  ],
  "main_ipcr_label": "G06F30354",
  "summary": "<SOH> SUMMARY <EOH>According to at least an embodiment of the present disclosure, there is provided an active pen for a touch module, comprising: gravity sensing part, a signal transmitting part connected with an output end of said gravity sensing part; wherein, said gravity sensing part is configured to output a corresponding gravity sensing output signal according to an angle between said active pen and a horizontal plane; said signal transmitting part is configured to transmit said gravity sensing output signal to said touch module. According to at least an embodiment of the present disclosure, there is provided a touch input system, comprising: touch module and active pen; said active pen comprising: gravity sensing part, a signal transmitting part connected with an output end of said gravity sensing part; said gravity sensing part is configured to output a corresponding gravity sensing output signal according to an angle between said active pen and a horizontal plane; said signal transmitting part is configured to transmit said gravity sensing output signal to said touch module; said touch module includes a plurality of touch electrode, and a touch chip connected with said touch electrode; said touch chip is configured to, according to a signal transmitted from said active pen, received by the respective touch electrodes, detect a capacity change amount of the respective touch electrodes. According to at least embodiment of the present disclosure, there is provided a driving method for a touch input system, comprising: obtaining the angle between said active pen and a horizontal plane; outputting a corresponding gravity sensing output signal according to an angle between said active pen and a horizontal plane; transmitting said gravity sensing output signal to a touch module.",
  "patent_number": "None",
  "abstract": "An active pen for a touch module, including: gravity sensing part, a signal transmitting part connected with an output end of said gravity sensing part; wherein, said gravity sensing part is configured to output a corresponding gravity sensing output signal according to an angle between said active pen and a horizontal plane; said signal transmitting part is configured to transmit said gravity sensing output signal to said touch module. Such active pen has no requirement on the material of the pen tip, reducing the cost.",
  "publication_number": "US20170192539A1-20170706",
  "_processing_info": {
    "original_size": 32221,
    "optimized_size": 3092,
    "reduction_percent": 90.4
  }
}