{
  "decision": "ACCEPTED",
  "application_number": "15334010",
  "date_published": "20171019",
  "date_produced": "20171004",
  "title": "ROUTE RE-PLANNING USING ENEMY FORCE LETHALITY PROJECTION",
  "filing_date": "20161025",
  "inventor_list": [
    {
      "inventor_name_last": "ROSSWOG",
      "inventor_name_first": "James C.",
      "inventor_city": "Endicott",
      "inventor_state": "NY",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "HERMAN",
      "inventor_name_first": "Carl R.",
      "inventor_city": "Owego",
      "inventor_state": "NY",
      "inventor_country": "US"
    }
  ],
  "ipcr_labels": [
    "G01C2134",
    "G01C2134",
    "G01C2100",
    "G01C2120",
    "G08G500",
    "G01S1300",
    "G01S1395",
    "G06K962"
  ],
  "main_ipcr_label": "G01C2134",
  "summary": "<SOH> BRIEF DESCRIPTION OF THE DRAWINGS <EOH>FIG. 1 is a chart showing an exemplary route planning method in accordance with the present disclosure. FIG. 2 is a chart showing an exemplary route re-planning method in accordance with the present disclosure. FIG. 3 is a diagram of an exemplary mission plan at time T 0 in accordance with the present disclosure. FIG. 4 is a diagram of an exemplary mission at time T 1 . FIG. 5 is a diagram of an exemplary mission at time T 2 . FIG. 6 is a diagram of an exemplary mission at time T 3 with no route re-planning needed. FIG. 7 is a diagram exemplary mission at time T 1 with a threat at a deviated location. FIG. 8 is a diagram of an exemplary mission at time T 1 with new movement predications made for the threat at the deviated location in accordance with the present disclosure. FIG. 9 is a diagram of an exemplary mission at time showing a route re-planned in accordance with the present disclosure. FIG. 10 is a diagram of an exemplary system for route re-planning in accordance with the present disclosure. detailed-description description=\"Detailed Description\" end=\"lead\"?",
  "patent_number": "9791283",
  "abstract": "A method, system and computer readable media for route re-planning including generating enemy force movement predictions to be used during mission planning. During a mission, enemy force movements can be compared to the predictions. By using enemy force movement predictions for an initial comparison, the enemy force movements may only need to be compared to the own force mission plan if the enemy forces deviate from the predictions. When enemy force movement deviates from the predictions, new enemy force movement predictions can be generated. The new enemy force movement predictions can then be compared to the own force mission plan to determine if a route re-plan is needed. The route can be re-planned to determine a route that reduces or eliminates the chance of a lethal encounter with an enemy or threat.",
  "publication_number": "US20170299398A1-20171019",
  "_processing_info": {
    "original_size": 31720,
    "optimized_size": 2724,
    "reduction_percent": 91.41
  }
}