{
  "decision": "PENDING",
  "application_number": "15334944",
  "date_published": "20180201",
  "date_produced": "20180117",
  "title": "CURSOR GENERATION SYSTEM, CURSOR GENERATION METHOD, AND NON-TRANSITORY COMPUTER READABLE STORAGE MEDIUM",
  "filing_date": "20161026",
  "inventor_list": [
    {
      "inventor_name_last": "Yao",
      "inventor_name_first": "Shun-Yi",
      "inventor_city": "New Taipei City",
      "inventor_state": "",
      "inventor_country": "TW"
    },
    {
      "inventor_name_last": "WANG",
      "inventor_name_first": "YI-HUNG",
      "inventor_city": "New Taipei City",
      "inventor_state": "",
      "inventor_country": "TW"
    }
  ],
  "ipcr_labels": [
    "G06F3038",
    "G06F30346",
    "G06F30481",
    "G06F30354"
  ],
  "main_ipcr_label": "G06F3038",
  "summary": "<SOH> SUMMARY <EOH>To address the above issue, a cursor generation system according to an embodiment is provided, which comprises a digital pen and a computer device. The digital pen comprises recognition information, a first wireless communication module, and a displacement sensor. The first wireless communication module is electrically connected to the displacement sensor. The displacement sensor detects a displacement of the digital pen to obtain displacement information. The first wireless communication module is for transmitting a mating request signal, the recognition information, and the displacement information. The computer device comprises a cursor application, a processer, a second wireless communication module, and a display. The cursor application is associated with the recognition information of the digital pen. The processor is respectively electrically connected to the second wireless communication module and the display. The second wireless communication module receives the mating request signal and mates with the first wireless communication module to wirelessly receive the recognition information and the displacement information. Wherein the processer executes the cursor application corresponding to the recognition information to register a vendor-defined usage page associated with the digital pen. Further, the processor executes the cursor application to generate a cursor icon displaying on the display according to the vendor-defined usage page. Further, the processor reads the displacement information and controls the shifting and displaying of the cursor icon on the display according to the vendor-defined usage page and the displacement information. A cursor generation method according to an embodiment is provided, which comprises: receiving a mating request signal transmitted by a first wireless communication module of a digital pen by a computer device, wherein a second wireless communication module of the computer device receives the mating ...",
  "patent_number": "None",
  "abstract": "A cursor generation system includes a digital pen and a computer device. The digital pen includes recognition information, a first wireless communication module, and a displacement sensor. The first wireless communication module is for transmitting a mating request signal, the recognition information, and the displacement information. The computer device includes a cursor application, a processer, a second wireless communication module, and a display. The second wireless communication module mates with the first wireless communication module to receive the recognition information and the displacement information. The processer executes the cursor application corresponding to the recognition information to register a vendor-defined usage page associated with the digital pen. The processor executes the cursor application to generate a cursor icon displaying on the display according to the vendor-defined usage page, reads the displacement information, and controls the shifting and display...",
  "publication_number": "US20180032154A1-20180201",
  "_processing_info": {
    "original_size": 49400,
    "optimized_size": 3788,
    "reduction_percent": 92.33
  }
}