{
  "decision": "PENDING",
  "application_number": "15336168",
  "date_published": "20170427",
  "date_produced": "20170412",
  "title": "ADAPTIVE ANALOG BLOCKS WITH DIGITAL WRAPPERS INTEGRATED ONTO PROGRAMMABLE FABRIC",
  "filing_date": "20161027",
  "inventor_list": [
    {
      "inventor_name_last": "SHANKAR",
      "inventor_name_first": "Kapil",
      "inventor_city": "Saratoga",
      "inventor_state": "CA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "CHAN",
      "inventor_name_first": "Thomas",
      "inventor_city": "Saratoga",
      "inventor_state": "CA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "CROTTY",
      "inventor_name_first": "Patrick J.",
      "inventor_city": "San Jose",
      "inventor_state": "CA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "BIRKNER",
      "inventor_name_first": "John",
      "inventor_city": "Woodside",
      "inventor_state": "CA",
      "inventor_country": "US"
    }
  ],
  "ipcr_labels": [
    "G06F128",
    "G05F166"
  ],
  "main_ipcr_label": "G06F128",
  "summary": "<SOH> SUMMARY <EOH>An integrated analog and digital adaptive platform includes: a plurality of adaptive analog blocks, each of the plurality of adaptive analog blocks being integrated with a respective digital wrapper; and a programmable digital fabric configured to programmably connect one or more of the plurality of adaptive analog blocks by connecting a plurality of digital wrappers integrated with the one or more of the plurality of adaptive analog blocks. The plurality of adaptive analog blocks that are programmably connected using the programmable digital fabric to provide one or more programmable analog functions. The above and other preferred features, including various novel details of implementation and combination of events, will now be more particularly described with reference to the accompanying figures and pointed out in the claims. It will be understood that the particular systems and methods described herein are shown by way of illustration only and not as limitations. As will be understood by those skilled in the art, the principles and features described herein may be employed in various and numerous embodiments without departing from the scope of the present disclosure.",
  "patent_number": "None",
  "abstract": "An integrated analog and digital adaptive platform includes: a plurality of adaptive analog blocks, each of the plurality of adaptive analog blocks being integrated with a respective digital wrapper; and a programmable digital fabric configured to programmably connect one or more of the plurality of adaptive analog blocks by connecting a plurality of digital wrappers integrated with the one or more of the plurality of adaptive analog blocks. The plurality of adaptive analog blocks that are programmably connected using the programmable digital fabric provide one or more programmable analog functions.",
  "publication_number": "US20170115718A1-20170427",
  "_processing_info": {
    "original_size": 60970,
    "optimized_size": 2829,
    "reduction_percent": 95.36
  }
}