{
  "decision": "PENDING",
  "application_number": "15335752",
  "date_published": "20170504",
  "date_produced": "20170419",
  "title": "Photographic Image Extraction Apparatus, Photographic Image Extraction Method, and Program",
  "filing_date": "20161027",
  "inventor_list": [
    {
      "inventor_name_last": "Fujimori",
      "inventor_name_first": "Yukimitsu",
      "inventor_city": "Matsumoto-shi",
      "inventor_state": "",
      "inventor_country": "JP"
    }
  ],
  "ipcr_labels": [
    "G06K900",
    "H04N132",
    "H04N100"
  ],
  "main_ipcr_label": "G06K900",
  "summary": "<SOH> SUMMARY <EOH>An advantage of some aspects of the invention is that it is possible to provide a photographic image extraction apparatus, a photographic image extraction method, and a program which allow a desired photograph to be found quickly from among a large number of photographs posted on a wall or the like without using a network such as the Internet. A photographic image extraction apparatus according to an aspect of the invention includes: an image capture unit that captures images of a plurality of photographs; a photographic image extraction unit that analyzes a plurality of photographic images that are the captured images of the plurality of photographs and extracts, from the plurality of photographic images, one or more photographic images having a high likelihood of containing an image of a specific person; and an extraction result display unit that displays a result of extraction by the photographic image extraction unit. A photographic image extraction method according to an aspect of the invention is the method including causing a computer to execute: capturing images of a plurality of photographs; analyzing a plurality of photographic images that are the captured images of the plurality of photographs and extracting, from the plurality of photographic images, one or more photographic images having a high likelihood of containing an image of a specific person; and displaying a result of the extracting. With the configuration according to the aspects of the invention, one or more photographic images having a high likelihood of containing an image of a specific person are extracted from a plurality of photographic images captured by the image capture unit, and the result of the extraction is displayed. This allows a desired photograph to be found quickly even from among photographs posted on a wall or the like. Furthermore, it is possible to browse the photographic images offline without being connected to the Internet, and thus, there is no secur...",
  "patent_number": "None",
  "abstract": "A photographic image extraction apparatus according to the invention is applied to a smartphone. The smartphone includes an image capture unit that captures images of a plurality of photographs, a photographic image extraction unit that analyzes a plurality of photographic images that are the captured images of the plurality of photographs and extracts, from the plurality of photographic images, one or more photographic images having a high likelihood of containing an image of a specific person, and an extraction result display unit that displays a result of extraction by the photographic image extraction unit.",
  "publication_number": "US20170124397A1-20170504",
  "_processing_info": {
    "original_size": 61678,
    "optimized_size": 3226,
    "reduction_percent": 94.77
  }
}