{
  "date_produced": "20180411",
  "publication_number": "US20180114135A1-20180426",
  "main_ipcr_label": "G06N700",
  "decision": "PENDING",
  "application_number": "15333745",
  "inventor_list": [
    {
      "inventor_name_last": "Schmidt-Karaca",
      "inventor_name_first": "Markus",
      "inventor_city": "Heidelberg",
      "inventor_state": "",
      "inventor_country": "DE"
    }
  ],
  "abstract": "A specification of the process model is received. The process model includes a plurality of process components. A relationship between a first process component and another process component of the plurality of process components is determined using a predictive model. A process rule for the first process component is determined. The process rule specified a second process component to be executed. The process rule includes the relationship determined using the predictive model or a heuristic rule. The second process component is executed according to the process rule.",
  "filing_date": "20161025",
  "patent_number": "None",
  "summary": "<SOH> SUMMARY <EOH>This Summary is provided to introduce a selection of concepts in a simplified form that are further described below in the Detailed Description. This Summary is not intended to identify key features or essential features of the claimed subject matter, nor is it intended to be used to limit the scope of the claimed subject matter. Techniques and solutions are described for facilitating the execution of a process, such as a process specified by a process model specification. According to a particular method, a specification of the process model is received. The process model includes a plurality of process components. A relationship between a first process component and another process component of the plurality of process components is determined using a predictive model. A process rule for the first process component is determined. The process rule specifies a second process component to be executed. The process rule includes the relationship determined using the predictive model or a heuristic rule. The second process component is executed according to the process rule. According to another method, a ruleset is defined for a process using a plurality of heuristic rules. The process includes a plurality of process components. A predictive model is defined for at least a portion of the plurality of process components. The process is executed according to the ruleset. The predictive model is trained using data obtained during the executing. A rule for the process model specification is determined using the predictive model. The ruleset is revised to include the determined rule. The process is executed according to the revised ruleset. In another aspect, the present disclosure provides a system that implements a process control engine. The system includes one or more memories, one or more processing units coupled to at least one memory of the one or more memories, and one or more non-transitory computer readable storage media. The storage media inclu...",
  "date_published": "20180426",
  "title": "PROCESS EXECUTION USING RULES FRAMEWORK FLEXIBLY INCORPORATING PREDICTIVE MODELING",
  "ipcr_labels": [
    "G06N700",
    "G06N502"
  ],
  "_processing_info": {
    "original_size": 71468,
    "optimized_size": 3164,
    "reduction_percent": 95.57
  }
}