{
  "date_produced": "20170419",
  "publication_number": "US20170124484A1-20170504",
  "main_ipcr_label": "G06N9900",
  "decision": "PENDING",
  "application_number": "15335010",
  "inventor_list": [
    {
      "inventor_name_last": "Thompson",
      "inventor_name_first": "John Paul",
      "inventor_city": "Bentonville",
      "inventor_state": "AR",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Letson",
      "inventor_name_first": "Eric Anthony",
      "inventor_city": "Bentonville",
      "inventor_state": "AR",
      "inventor_country": "US"
    }
  ],
  "abstract": "Machine learning methods and systems are provided. A machine learning system receives item-descriptive data corresponding to a plurality of uncategorized items and programmatically associates, based on the item-descriptive data, each of the uncategorized items with a user account. The system compares, by a machine learning algorithm, the item-descriptive data with existing item-descriptive data corresponding to a number of previously categorized items and automatically decides to which of one or more item categories the uncategorized data should be assigned based on dynamically learned behavior, the one or more item categories being defined in the user account. The system automatically assigns, based on the comparison and decision, each of the plurality of uncategorized items to the one or more item categories to generate a plurality of newly categorized items and adds the automatic item category assignments and corresponding newly categorized items to the number of previously categori...",
  "filing_date": "20161026",
  "patent_number": "None",
  "summary": "<SOH> BRIEF DESCRIPTION OF THE DRAWINGS <EOH>The accompanying drawings are not intended to be drawn to scale. In the drawings, each identical or nearly identical component that is illustrated in various figures is represented by a like numeral. For purposes of clarity, not every component may be labeled in every drawing. In the drawings: FIG. 1 is a block diagram showing a machine learning system in accordance with various embodiments. FIG. 2 is a flow diagram illustrating a method performed by a machine learning system in accordance with various embodiments. FIG. 3 is a flow diagram illustrating an example training process performed by the machine learning system in accordance with various embodiments. FIG. 4 is a flow diagram illustrating an example prediction process performed by the machine learning system in accordance with various embodiments. FIG. 5 is an example computational device block diagram depicting various components which can be used to implement various of the disclosed embodiments. FIG. 6 is an example computational device block diagram depicting various components which can be used to implement various of the disclosed embodiments in a distributed system. detailed-description description=\"Detailed Description\" end=\"lead\"?",
  "date_published": "20170504",
  "title": "Machine Learning System",
  "ipcr_labels": [
    "G06N9900",
    "G06F30484",
    "G06N502"
  ],
  "_processing_info": {
    "original_size": 53724,
    "optimized_size": 2965,
    "reduction_percent": 94.48
  }
}