{
  "date_produced": "20170510",
  "publication_number": "US20170147947A1-20170525",
  "main_ipcr_label": "G06N9900",
  "decision": "PENDING",
  "application_number": "15338050",
  "inventor_list": [
    {
      "inventor_name_last": "Shotton",
      "inventor_name_first": "Jamie Daniel Joseph",
      "inventor_city": "Cambridge",
      "inventor_state": "",
      "inventor_country": "GB"
    },
    {
      "inventor_name_last": "Sharp",
      "inventor_name_first": "Toby",
      "inventor_city": "Cambridge",
      "inventor_state": "",
      "inventor_country": "GB"
    },
    {
      "inventor_name_last": "Kohli",
      "inventor_name_first": "Pushmeet",
      "inventor_city": "Cambridge",
      "inventor_state": "",
      "inventor_country": "GB"
    },
    {
      "inventor_name_last": "Nowozin",
      "inventor_name_first": "Reinhard Sebastian Bernhard",
      "inventor_city": "Cambridge",
      "inventor_state": "",
      "inventor_country": "GB"
    },
    {
      "inventor_name_last": "Winn",
      "inventor_name_first": "John Michael",
      "inventor_city": "Cambridge",
      "inventor_state": "",
      "inventor_country": "GB"
    },
    {
      "inventor_name_last": "Criminisi",
      "inventor_name_first": "Antonio",
      "inventor_city": "Cambridge",
      "inventor_state": "",
      "inventor_country": "GB"
    }
  ],
  "abstract": "Memory facilitation using directed acyclic graphs is described, for example, where a plurality of directed acyclic graphs are trained for gesture recognition from human skeletal data, or to estimate human body joint positions from depth images for gesture detection. In various examples directed acyclic graphs are grown during training using a training objective which takes into account both connection patterns between nodes and split function parameter values. For example, a layer of child nodes is grown and connected to a parent layer of nodes using an initialization strategy. In examples, various local search processes are used to find good combinations of connection patterns and split function parameters.",
  "filing_date": "20161028",
  "patent_number": "None",
  "summary": "<SOH> SUMMARY <EOH>The following presents a simplified summary of the disclosure in order to provide a basic understanding to the reader. This summary is not an extensive overview of the disclosure and it does not identify key/critical elements or delineate the scope of the specification. Its sole purpose is to present a selection of concepts disclosed herein in a simplified form as a prelude to the more detailed description that is presented later. Memory facilitation using directed acyclic graphs is described, for example, where a plurality of directed acyclic graphs are trained for gesture recognition from human skeletal data, or to estimate human body joint positions from depth images for gesture detection. In various examples directed acyclic graphs are grown during training using a training objective which takes into account both connection patterns between nodes and split function parameter values. For example, a layer of child nodes is grown and connected to a parent layer of nodes using an initialization strategy. In examples, various local search processes are used to find good combinations of connection patterns and split function parameters. Many of the attendant features will be more readily appreciated as the same becomes better understood by reference to the following detailed description considered in connection with the accompanying drawings.",
  "date_published": "20170525",
  "title": "MEMORY FACILITATION USING DIRECTED ACYCLIC GRAPHS",
  "ipcr_labels": [
    "G06N9900",
    "G06K962",
    "G06K900",
    "G06F1730",
    "G06N700"
  ],
  "_processing_info": {
    "original_size": 55392,
    "optimized_size": 3445,
    "reduction_percent": 93.78
  }
}