{
  "decision": "PENDING",
  "application_number": "15331212",
  "date_published": "20180426",
  "date_produced": "20180411",
  "title": "CLOUD-ENABLED GENERATION OF CONSTRUCTION METRICS AND DOCUMENTATION",
  "filing_date": "20161021",
  "inventor_list": [
    {
      "inventor_name_last": "Tierney",
      "inventor_name_first": "Patrick Liam Colm",
      "inventor_city": "Berkeley",
      "inventor_state": "CA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Oak",
      "inventor_name_first": "Abhijit",
      "inventor_city": "Orinda",
      "inventor_state": "CA",
      "inventor_country": "US"
    }
  ],
  "ipcr_labels": [
    "G06F1750",
    "G06Q5008"
  ],
  "main_ipcr_label": "G06F1750",
  "summary": "<SOH> SUMMARY OF THE INVENTION <EOH>Embodiments of the invention solve two construction metrics-related problems: the limited spectrum of estimates, and the latency between generating a BIM and receiving an estimate from the contractor. Three components provide such advantages—(1) an interface used to gather construction information from individual construction companies; (2) a set of plugins that extract detailed information from a BIM; and (3) a cloud-based estimator that processes the extracted detailed information and combines such information with the individual construction company information to generate construction metrics. In addition, embodiments of the invention address the problem of construction process documentation. In particular, construction process documentation for a BIM is automatically generated using information captured about the fabrication process (e.g., from the individual construction companies). This gives the particular construction process documentation for the geometry and materials of the BIM.",
  "patent_number": "None",
  "abstract": "A method, apparatus, system, and computer program product generates construction metrics. Building means, methods, and limitations of construction for one or more companies are gathered in a computer. A digital building information model (BIM) is acquired. Fabrication and construction parameters are extracted from the BIM. Construction metrics (for the BIM) are generated by combining the building means, methods, and limitations with the extracted fabrication and construction parameters. The construction metrics are then visualized in a modeling application and/or used to output construction process documentation.",
  "publication_number": "US20180113959A1-20180426",
  "_processing_info": {
    "original_size": 56689,
    "optimized_size": 2385,
    "reduction_percent": 95.79
  }
}