{
  "decision": "PENDING",
  "application_number": "15337954",
  "date_published": "20170504",
  "date_produced": "20170419",
  "title": "SYSTEMS AND METHODS FOR PROVIDING A PERSONALIZED PREPAID CARD",
  "filing_date": "20161028",
  "inventor_list": [
    {
      "inventor_name_last": "Tepper",
      "inventor_name_first": "Mark",
      "inventor_city": "Woodridge",
      "inventor_state": "IL",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Boldebuck",
      "inventor_name_first": "John",
      "inventor_city": "Woodridge",
      "inventor_state": "IL",
      "inventor_country": "US"
    }
  ],
  "ipcr_labels": [
    "G06Q3002",
    "G06Q3006",
    "G06Q2034"
  ],
  "main_ipcr_label": "G06Q3002",
  "summary": "<SOH> SUMMARY OF THE INVENTION <EOH>The invention is intended to resolve the above-noted needs with systems and methods for providing a personalized prepaid card that is designed to, among other things: (1) promote a user-configured product that has been customized by the card recipient using an online product customization tool, (2) display an image of the user-configured product on a face of the personalized prepaid card, (3) encourage an in-store visit to a retail establishment that may sell the user-configured product, and (4) obtain personal information about the card recipient for future marketing and/or targeted advertising purposes. For example, one embodiment includes a method of providing a personalized prepaid card, the method comprising the steps of receiving one or more user selections for designing a user-customized product and, based on the received user selections, generating (using a processor) a first image of a personalized prepaid card with a second image of the user-customized product. The method further includes the step of sending, as a display on the client device, the first image and a user-selectable option for accepting an offer to receive the personalized prepaid card in exchange for satisfying one or more conditions associated with the offer. Upon receiving a user selection of the user-selectable option, providing to the user, a unique identifier code associated with the offer, and instructions to present the unique identifier code to a retail establishment selling the product upon satisfying the one or more conditions. Upon receiving the unique identifier code from a retail device associated with the retail establishment, a personalized prepaid card is made available, if the received unique identifier code is valid. Another example embodiment provides a system for providing a personalized prepaid card, the system comprising: a remote server comprising a build-a-product module for enabling a user to select customizable options for design...",
  "patent_number": "None",
  "abstract": "Systems and methods are provided for providing a personalized prepaid card by receiving a user selection for designing a user-customized product and generating a first image of a personalized prepaid card having an image of the user-customized product, whereby the personalized prepaid card image is delivered to the user with an offer to receive the card in exchange for satisfying one or more conditions associated with the offer and providing the user with a unique identifier code associated with the offer to present the code to a retail establishment selling the user-customized product for activating the personalized prepaid card.",
  "publication_number": "US20170124586A1-20170504",
  "_processing_info": {
    "original_size": 70876,
    "optimized_size": 3360,
    "reduction_percent": 95.26
  }
}