{
  "decision": "PENDING",
  "application_number": "15333690",
  "date_published": "20171123",
  "date_produced": "20171108",
  "title": "DYNAMIC CONTENT MANAGEMENT OF A VEHICLE DISPLAY",
  "filing_date": "20161025",
  "inventor_list": [
    {
      "inventor_name_last": "Chan",
      "inventor_name_first": "Victor",
      "inventor_city": "Fremont",
      "inventor_state": "CA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Kimbembe",
      "inventor_name_first": "Andrews-junior",
      "inventor_city": "Mountain View",
      "inventor_state": "CA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Stewart",
      "inventor_name_first": "Andrew",
      "inventor_city": "San Francisco",
      "inventor_state": "CA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Malahy",
      "inventor_name_first": "Evan Nicklas Wu",
      "inventor_city": "Sunnyvale",
      "inventor_state": "CA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Iyer",
      "inventor_name_first": "Rakesh Narayan",
      "inventor_city": "Santa Clara",
      "inventor_state": "CA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Beukelman",
      "inventor_name_first": "Joel Roger",
      "inventor_city": "Costa Mesa",
      "inventor_state": "CA",
      "inventor_country": "US"
    }
  ],
  "ipcr_labels": [
    "G06F314",
    "G06F30481",
    "G09G538"
  ],
  "main_ipcr_label": "G06F314",
  "summary": "<SOH> SUMMARY <EOH>In one example, the disclosure is directed to a method that includes outputting, by an information system of a vehicle, for display at a first portion of a display device located at a center console of the information system, a first graphical user interface (GUI) associated with an active application from a plurality of applications; determining, by the information system, respective relevancy scores of two or more applications from the plurality of applications other than the active application, wherein each respective relevancy scores indicates a probability that the application will be of interest to a driver of the vehicle while the first GUI is being output for display; determining, by the information system, based on the respective relevancy scores, a highest ranked application from the two or more applications; and outputting, by the information system, for display at a second portion of the display device, a second GUI associated with the highest ranked application. In another example, the disclosure is directed to a vehicle information system comprising a computing device. The computing device includes a display device located at a center console of the vehicle information system, at least one processor; and a memory. The memory includes instructions that, when executed by the at least one processor, cause the at least one processor to: output, for display at a first portion of the display device, a first graphical user interface (GUI) associated with an active application from a plurality of applications; determine respective relevancy scores of two or more applications from the plurality of applications other than the active application, wherein each respective relevancy scores indicates a probability that the application will be of interest to a driver of the vehicle while the first GUI is being output for display; determine, based on the respective relevancy scores, a highest ranked application from the two or more applications; and ...",
  "patent_number": "None",
  "abstract": "A method includes outputting, by an information system of a vehicle, for display at a first portion of a display device located at a center console of the information system, a first graphical user interface (GUI) associated with an active application from a plurality of applications. The method includes determining, by the information system, respective relevancy scores of two or more applications from the plurality of applications other than the active application. Each respective relevancy scores indicates a probability that the application will be of interest to a driver of the vehicle while the first GUI is being output for display. The method includes determining, by the information system, based on the respective relevancy scores, a highest ranked application from the two or more applications, and outputting, by the information system, for display at a second portion of the display device, a second GUI associated with the highest ranked application.",
  "publication_number": "US20170337027A1-20171123",
  "_processing_info": {
    "original_size": 109561,
    "optimized_size": 4305,
    "reduction_percent": 96.07
  }
}