{
  "date_produced": "20171129",
  "publication_number": "US20170357893A1-20171214",
  "main_ipcr_label": "G06N308",
  "decision": "PENDING",
  "application_number": "15334682",
  "inventor_list": [
    {
      "inventor_name_last": "Dexter",
      "inventor_name_first": "Ross R.",
      "inventor_city": "Cupertino",
      "inventor_state": "CA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Brennan",
      "inventor_name_first": "Michael R.",
      "inventor_city": "Cupertino",
      "inventor_state": "CA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Sommer",
      "inventor_name_first": "Bruno M.",
      "inventor_city": "Cupertino",
      "inventor_state": "CA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Wang",
      "inventor_name_first": "Norman N.",
      "inventor_city": "Cupertino",
      "inventor_state": "CA",
      "inventor_country": "US"
    }
  ],
  "abstract": "A method may include receiving a communication from a device at an artificial intelligence controller including state information for a software application component running on the device, the state information including information corresponding to at least one potential state change available to the software application component, and metrics associated with at least one end condition, interpreting the state information using the artificial intelligence controller, and selecting an artificial intelligence algorithm from a plurality of artificial intelligence algorithms for use by the software application component based on the interpreted state information; and transmitting, to the device, an artificial intelligence algorithm communication, the artificial intelligence algorithm communication indicating the selected artificial intelligence algorithm for use in the software application component on the device.",
  "filing_date": "20161026",
  "patent_number": "None",
  "summary": "<SOH> BRIEF DESCRIPTION OF THE DRAWINGS <EOH>In the drawings, which are not necessarily drawn to scale, like numerals may describe similar components in different views. Like numerals having different letter suffixes may represent different instances of similar components. Some embodiments are illustrated by way of example, and not limitation, in the figures of the accompanying drawings in which: FIG. 1 illustrates an artificial intelligence (AI) algorithm selection system, according to various embodiments; FIGS. 2A-2B illustrate various views of a software application, according to various embodiments; FIG. 3 illustrates an AI controller, according to various embodiments; FIG. 4 illustrates a flowchart of a method to select an AI algorithm for use in a software application component, according to various embodiments; FIG. 5 illustrates a flowchart of a method to use a selected AI algorithm in a software application component, according to various embodiments; and FIG. 6 is a block diagram illustrating an example machine upon which any one or more of the techniques (e.g., methodologies) discussed herein may be performed, according to an example embodiment. detailed-description description=\"Detailed Description\" end=\"lead\"?",
  "date_published": "20171214",
  "title": "ARTIFICIAL INTELLIGENCE CONTROLLER THAT PROCEDURALLY TAILORS ITSELF TO AN APPLICATION",
  "ipcr_labels": [
    "G06N308"
  ],
  "_processing_info": {
    "original_size": 37266,
    "optimized_size": 3191,
    "reduction_percent": 91.44
  }
}