{
  "date_produced": "20171129",
  "publication_number": "US20170357910A1-20171214",
  "main_ipcr_label": "G06N9900",
  "decision": "PENDING",
  "application_number": "15334692",
  "inventor_list": [
    {
      "inventor_name_last": "Sommer",
      "inventor_name_first": "Bruno M.",
      "inventor_city": "Cupertino",
      "inventor_state": "CA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Brennan",
      "inventor_name_first": "Michael R.",
      "inventor_city": "Cupertino",
      "inventor_state": "CA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Wang",
      "inventor_name_first": "Norman N.",
      "inventor_city": "Cupertino",
      "inventor_state": "CA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Dexter",
      "inventor_name_first": "Ross R.",
      "inventor_city": "Cupertino",
      "inventor_state": "CA",
      "inventor_country": "US"
    }
  ],
  "abstract": "A method may include receiving, at an artificial intelligence cloud service, a plurality of artificial intelligence feedback communications from a plurality of devices, wherein each artificial intelligence feedback communication of the plurality of artificial intelligence feedback communications includes data generated by software application components running on respective ones of the plurality of devices, the software application components including respective current artificial intelligence models, deriving, from the data included with each artificial intelligence feedback communication, an associated artificial intelligence model update for each of the respective current artificial intelligence models on the plurality of devices, and transmitting, to the plurality of devices, a plurality of artificial intelligence model update communications, wherein each artificial intelligence model update communication of the plurality of artificial intelligence model update communications inc...",
  "filing_date": "20161026",
  "patent_number": "None",
  "summary": "<SOH> BRIEF DESCRIPTION OF THE DRAWINGS <EOH>In the drawings, which are not necessarily drawn to scale, like numerals may describe similar components in different views. Like numerals having different letter suffixes may represent different instances of similar components. Some embodiments are illustrated by way of example, and not limitation, in the figures of the accompanying drawings in which: FIG. 1 illustrates a system for updating an Artificial Intelligence (AI) model, according to various embodiments; FIG. 2 illustrates an AI cloud service, according to various embodiments; FIG. 3 illustrates a flowchart of a method to update an Artificial Intelligence (AI) model, according to various embodiments; FIG. 4 illustrates a flowchart of a method to use an updated an Artificial Intelligence (AI) model, according to various embodiments; and FIG. 5 is a block diagram illustrating an example machine upon which any one or more of the techniques (e.g., methodologies) discussed herein may be performed, according to an example embodiment. detailed-description description=\"Detailed Description\" end=\"lead\"?",
  "date_published": "20171214",
  "title": "SYSTEM FOR ITERATIVELY TRAINING AN ARTIFICIAL INTELLIGENCE USING CLOUD-BASED METRICS",
  "ipcr_labels": [
    "G06N9900"
  ],
  "_processing_info": {
    "original_size": 45713,
    "optimized_size": 3144,
    "reduction_percent": 93.12
  }
}