{
  "date_produced": "20180418",
  "publication_number": "US20180121813A1-20180503",
  "main_ipcr_label": "G06N504",
  "decision": "PENDING",
  "application_number": "15337124",
  "inventor_list": [
    {
      "inventor_name_last": "Sati",
      "inventor_name_first": "Marwan",
      "inventor_city": "Ontario",
      "inventor_state": "",
      "inventor_country": "CA"
    }
  ],
  "abstract": "An illustrative embodiment of a computer-implemented process for non-leading computer aided detection of features of interest in a dataset, designates a particular formation using a computer recognizable gesture to identify a gestured location in an analyzed view of the dataset in response to a user identifying the particular formation in the analyzed view. The dataset is generated by a computer and representative of a portion of an object characterized by the dataset. Responsive to identifying the gestured location, the particular formation is displayed to the user, and a composition is revealed including additional structural imagery, functional imagery and findings resulting from machine learning and analysis. Responsive to revealing the composition to the user, the user is prompted to select performance of accept selection, reject selection or modify selection with regard to the particular formation displayed.",
  "filing_date": "20161028",
  "patent_number": "None",
  "summary": "<SOH> SUMMARY <EOH>According to an embodiment of the present invention, a computer-implemented process for non-leading computer aided detection of features of interest in a dataset, designates a particular formation using a computer recognizable gesture to identify a gestured location in an analyzed view of the dataset in response to a user identifying the particular formation in the analyzed view of the dataset generated by the computer using machine learning and analysis and representative of a portion of an object characterized by the dataset. In response to identifying the gestured location, the computer displays the particular formation to the user, revealing a composition including additional structural imagery, functional imagery and findings resulting from the machine learning and analysis. The user is prompted by the computer to perform one of accept selection, reject selection or modify selection with regard to the composition revealed in response to revealing the composition to the user, including the additional structural imagery, functional imagery and findings from the machine learning and analysis associated with the particular formation displayed.",
  "date_published": "20180503",
  "title": "NON-LEADING COMPUTER AIDED DETECTION OF FEATURES OF INTEREST IN IMAGERY",
  "ipcr_labels": [
    "G06N504",
    "G06N9900",
    "G06F30484"
  ],
  "_processing_info": {
    "original_size": 71278,
    "optimized_size": 2684,
    "reduction_percent": 96.23
  }
}