{
  "decision": "PENDING",
  "application_number": "15339049",
  "date_published": "20170302",
  "date_produced": "20170214",
  "title": "Software Application and Zones",
  "filing_date": "20161031",
  "inventor_list": [
    {
      "inventor_name_last": "Triplett",
      "inventor_name_first": "Mark",
      "inventor_city": "St. Charles",
      "inventor_state": "IL",
      "inventor_country": "US"
    }
  ],
  "ipcr_labels": [
    "G06F316",
    "G06F30488",
    "H04R2700"
  ],
  "main_ipcr_label": "G06F316",
  "summary": "<SOH> BRIEF DESCRIPTION OF THE DRAWINGS <EOH>Features, aspects, and advantages of the presently disclosed technology may be better understood with regard to the following description, appended claims, and accompanying drawings where: FIG. 1 shows an example configuration in which certain embodiments may be practiced; FIG. 2A shows an illustration of an example playback device having a built-in amplifier and transducers; FIG. 2B shows an illustration of an example playback device having a built-in amplifier and connected to external speakers; FIG. 2C shows an illustration of an example playback device connected to an A/V receiver and speakers; FIG. 3 shows an illustration of an example controller; FIG. 4 shows an internal functional block diagram of an example playback device; FIG. 5 shows an internal functional block diagram of an example controller; FIG. 6 shows an example playback queue configuration for a network media system; FIG. 7 shows an example ad-hoc playback network; FIG. 8 shows a system including a plurality of networks including a cloud-based network and at least one local playback network; FIG. 9 shows an example flow diagram for displaying an application identifier on a controller of a media playback system. FIG. 10A shows an example graphical display provided by a controller. FIG. 10B shows another example graphical display provided by a controller. FIGS. 11A and 11B show further example graphical displays provided by a controller. FIG. 12 shows an example flow diagram for assigning a software application to a playback device of a media playback system. FIG. 13 shows another example graphical display provided by a controller. detailed-description description=\"Detailed Description\" end=\"lead\"? In addition, the drawings are for the purpose of illustrating example embodiments, but it is understood that the inventions are not limited to the arrangements and instrumentality shown in the drawings.",
  "patent_number": "None",
  "abstract": "Embodiments described herein relate to a software application that is configured to operate as an add-on software component to audio-playback software on a playback device of a media playback system. One embodiment may involve displaying, on a user interface of a controller of a media playback system, a zone identifier that identifies a zone of the media playback system, where the zone comprises a playback device that has audio-playback software installed thereon; and displaying, on the user interface of the controller, an application identifier in association with the zone identifier, where the application identifier indicates that a software application installed on the playback device is configured to operate as an add-on software component to the audio-playback software.",
  "publication_number": "US20170060528A1-20170302",
  "_processing_info": {
    "original_size": 120122,
    "optimized_size": 3273,
    "reduction_percent": 97.28
  }
}