{
  "decision": "PENDING",
  "application_number": "15335343",
  "date_published": "20170216",
  "date_produced": "20170201",
  "title": "CAPACITY RISK MANAGEMENT FOR VIRTUAL MACHINES",
  "filing_date": "20161026",
  "inventor_list": [
    {
      "inventor_name_last": "SIVASUBRAMANIAN",
      "inventor_name_first": "Jeyashree",
      "inventor_city": "Wayland",
      "inventor_state": "MA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "APTE",
      "inventor_name_first": "Sudheer",
      "inventor_city": "Walpole",
      "inventor_state": "MA",
      "inventor_country": "US"
    }
  ],
  "ipcr_labels": [
    "G06F9455",
    "G06F1134",
    "G06F1130"
  ],
  "main_ipcr_label": "G06F9455",
  "summary": "<SOH> SUMMARY <EOH>According to one general aspect, a system includes instructions stored on a non-transitory computer readable storage medium and executable by at least one semiconductor processor. The system includes an access data collector configured to cause the at least one semiconductor processor to collect access assignment data characterizing active access assignment operations of a hypervisor in assigning host computing resources among virtual machines for use in execution of the virtual machines. The system also includes a capacity risk indicator calculator configured to cause the at least one semiconductor processor to calculate a capacity risk indicator characterizing a capacity risk of the host computing resources with respect to meeting a prospective capacity demand of the virtual machines, based on the access assignment data. According to another general aspect, a method includes collecting, using at least one semiconductor processor, access assignment data characterizing active access assignment operations of a hypervisor in assigning host computing resources among virtual machines for use in execution of the virtual machines. The method further includes calculating, using at least one semiconductor processor, a capacity risk indicator characterizing a capacity risk of the host computing resources with respect to meeting a prospective capacity demand of the virtual machines, based on the access assignment data. According to another general aspect, a computer program product includes instructions recorded on a non-transitory computer readable storage medium and configured, when executed by at least one semiconductor processor, to cause the at least one semiconductor processor to collect access assignment data characterizing active access assignment operations of a hypervisor in assigning host computing resources among virtual machines for use in execution of the virtual machines. The instructions, when executed by the at least one semiconductor proce...",
  "patent_number": "None",
  "abstract": "An access data collector collects access assignment data characterizing active access assignment operations of a hypervisor in assigning host computing resources among virtual machines for use in execution of the virtual machines. Then, a capacity risk indicator calculator calculates a capacity risk indicator characterizing a capacity risk of the host computing resources with respect to meeting a prospective capacity demand of the virtual machines, based on the access assignment data",
  "publication_number": "US20170046190A1-20170216",
  "_processing_info": {
    "original_size": 86525,
    "optimized_size": 3202,
    "reduction_percent": 96.3
  }
}