{
  "date_produced": "20180411",
  "publication_number": "US20180114119A1-20180426",
  "main_ipcr_label": "G06N502",
  "decision": "PENDING",
  "application_number": "15331253",
  "inventor_list": [
    {
      "inventor_name_last": "BERLANDIER",
      "inventor_name_first": "Pierre C.",
      "inventor_city": "San Diego",
      "inventor_state": "CA",
      "inventor_country": "US"
    }
  ],
  "abstract": "Methods, computer program products, and systems are presented. The methods computer program products, and systems can include, for instance: determining an insertion interval of a row for insertion into a decision table; and guiding insertion of the row for insertion into the decision table based on a result of the determining.",
  "filing_date": "20161021",
  "patent_number": "None",
  "summary": "<SOH> SUMMARY <EOH>Shortcomings of the prior art are overcome, and additional advantages are provided, through the provision, in one aspect, of a method including for example: determining, by the one or more processor, an insertion interval of a row for insertion into a decision table; and guiding, by the one or more processor, insertion of the row in the decision table based on a result of the determining. In another aspect, a computer program product can be provided. The computer program product can include a computer readable storage medium readable by one or more processing unit and storing instructions for execution by one or more processor for performing a method. The method can include, for example: determining, an insertion interval of a row for insertion into a decision table; and guiding, insertion of the row in the decision table based on a result of the determining. In a further aspect, a system can be provided. The system can include, for example a memory. In addition, the system can include one or more processor in communication with the memory. Further, the system can include program instructions executable by the one or more processor via the memory to perform a method. The method can include, for example: determining, an insertion interval of a row for insertion into a decision table; and guiding, insertion of the row in the decision table based on a result of the determining. Additional features are realized through the techniques set forth herein. Other embodiments and aspects, including but not limited to computer program product and system, are described in detail herein and are considered a part of the claimed invention.",
  "date_published": "20180426",
  "title": "GUIDED ROW INSERTION",
  "ipcr_labels": [
    "G06N502",
    "G06F1730"
  ],
  "_processing_info": {
    "original_size": 55818,
    "optimized_size": 2524,
    "reduction_percent": 95.48
  }
}