{
  "date_produced": "20180411",
  "publication_number": "US20180114120A1-20180426",
  "main_ipcr_label": "G06N502",
  "decision": "PENDING",
  "application_number": "15333628",
  "inventor_list": [
    {
      "inventor_name_last": "Bostick",
      "inventor_name_first": "James E.",
      "inventor_city": "Cedar Park",
      "inventor_state": "TX",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Ganci, JR.",
      "inventor_name_first": "John M.",
      "inventor_city": "Cary",
      "inventor_state": "NC",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Keen",
      "inventor_name_first": "Martin G.",
      "inventor_city": "Cary",
      "inventor_state": "NC",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Rakshit",
      "inventor_name_first": "Sarbajit K.",
      "inventor_city": "Kolkata",
      "inventor_state": "IN",
      "inventor_country": "US"
    }
  ],
  "abstract": "A data item in a dataset related to a past event is analyzed to identify an anomaly in the data item. A set of data characteristics is determined in the dataset, the set of data characteristics forming a root cause of an undesirable outcome related to the past event. An incident insight logic is constructed using the set of data characteristics. An evaluation is made that a second dataset related to a future event satisfies the incident insight logic. In response to the evaluating, a confidence value is computed of a predicted undesirable outcome related to the future event. A corrective action that has been configured to avoid an occurrence of the predicted undesirable outcome is selected.",
  "filing_date": "20161025",
  "patent_number": "None",
  "summary": "<SOH> SUMMARY <EOH>The illustrative embodiments provide a method, system, and computer program product. An embodiment includes a method that analyzes, using a processor and a memory, a data item in a dataset related to a past event, to identify an anomaly in the data item. The embodiment determines a set of data characteristics in the dataset, the set of data characteristics forming a root cause of an undesirable outcome related to the past event. The embodiment constructs an incident insight logic using the set of data characteristics. The embodiment evaluates, using the processor and the memory, that a second dataset related to a future event satisfies the incident insight logic. The embodiment computes, responsive to the evaluating, a confidence value of a predicted undesirable outcome related to the future event. The embodiment selects a corrective action that has been configured to avoid an occurrence of the predicted undesirable outcome. An embodiment includes a computer usable program product. The computer usable program product includes one or more computer-readable storage devices, and program instructions stored on at least one of the one or more storage devices. An embodiment includes a computer system. The computer system includes one or more processors, one or more computer-readable memories, and one or more computer-readable storage devices, and program instructions stored on at least one of the one or more storage devices for execution by at least one of the one or more processors via at least one of the one or more memories.",
  "date_published": "20180426",
  "title": "COGNITIVE INCIDENT ANALYSIS AND PREDICTIVE NOTIFICATION",
  "ipcr_labels": [
    "G06N502"
  ],
  "_processing_info": {
    "original_size": 63547,
    "optimized_size": 3251,
    "reduction_percent": 94.88
  }
}