{
  "date_produced": "20180418",
  "publication_number": "US20180121826A1-20180503",
  "main_ipcr_label": "G06N9900",
  "decision": "PENDING",
  "application_number": "15337408",
  "inventor_list": [
    {
      "inventor_name_last": "Nugent",
      "inventor_name_first": "Michael Alexander",
      "inventor_city": "Santa Fe",
      "inventor_state": "NM",
      "inventor_country": "US"
    }
  ],
  "abstract": "A communication protocol is disclosed that enables multiple decision tree forest modules arranged in a compositional network to grow in a coordinated way so as to reduce error as measured by an arbitrary classification process utilizing spike encodings from any of the decision trees forest modules. The disclosed solution to compositional machine learning is agnostic to both the hardware methodology used to implement it, as well as the local decision processes that power nodes in the decision trees. Any number of computing systems based on different technologies and physical arrangements can be built that will coordinate in solving arbitrary compositional learning problems, so long as the communication protocol is enforced.",
  "filing_date": "20161028",
  "patent_number": "None",
  "summary": "<SOH> BRIEF SUMMARY <EOH>The following summary is provided to facilitate an understanding of some of the innovative features unique to the disclosed embodiment and is not intended to be a full description. A full appreciation of the various aspects of the embodiments disclosed herein can be gained by taking the entire specification, claims, drawings, and abstract as a whole. It is one aspect of the present invention to provide for a growth communication protocol between modules formed of decision tree forest arranged in a compositional manner. It is another aspect of the disclosed embodiments to provide for a computing substrate composed of a number of units arranged in multiple physical configurations that each obey a growth communications protocol. It is a further aspect of the present invention to provide liquid and/or air cooling mechanisms to an artificial intelligence system that obeys a communications protocol. The aforementioned aspects and other objectives and advantages can now be achieved as described herein. A learning system is disclosed formed of connected modules, where each module contains one or more decision trees. Each decision tree is capable of growth. A growth communication protocol is used to assure that decision trees in different modules can coordinate their growth so as to learn a compositional transfer function.",
  "date_published": "20180503",
  "title": "Compositional Learning Through Decision Tree Growth Processes and A Communication Protocol",
  "ipcr_labels": [
    "G06N9900",
    "G06N3063"
  ],
  "_processing_info": {
    "original_size": 79656,
    "optimized_size": 2692,
    "reduction_percent": 96.62
  }
}