{
  "decision": "PENDING",
  "application_number": "15332469",
  "date_published": "20170427",
  "date_produced": "20170412",
  "title": "Methods And Systems For Searching Using A Progress Engine",
  "filing_date": "20161024",
  "inventor_list": [
    {
      "inventor_name_last": "Cameron",
      "inventor_name_first": "John",
      "inventor_city": "Studio City",
      "inventor_state": "CA",
      "inventor_country": "US"
    }
  ],
  "ipcr_labels": [
    "G06F1730"
  ],
  "main_ipcr_label": "G06F1730",
  "summary": "<SOH> BRIEF SUMMARY <EOH>In some embodiments, a method may include receiving a search term, accessing a state of being construct wherein the state of being construct comprises user data in a plurality of domains, determining a relevance of a search result to the search term, determining an applicability of a domain of the group of domains to the search result, and/or assigning a search result position to the search result based on the relevance and the applicability. Additional advantages will be set forth in part in the description which follows or may be learned by practice. The advantages will be realized and attained by means of the elements and combinations particularly pointed out in the appended claims. It is to be understood that both the foregoing general description and the following detailed description are exemplary and explanatory only and are not restrictive.",
  "patent_number": "None",
  "abstract": "In some embodiments, a method may include receiving a search term, accessing a state of being construct wherein the state of being construct comprises user data in a plurality of domains, determining a relevance of a search result to the search term, determining an applicability of a domain of the group of domains to the search result, and/or assigning a search result position to the search result based on the relevance and the applicability.",
  "publication_number": "US20170116196A1-20170427",
  "_processing_info": {
    "original_size": 112816,
    "optimized_size": 1877,
    "reduction_percent": 98.34
  }
}