{
  "date_produced": "20170201",
  "publication_number": "US20170046617A1-20170216",
  "main_ipcr_label": "G06N502",
  "decision": "PENDING",
  "application_number": "15333182",
  "inventor_list": [
    {
      "inventor_name_last": "Knight",
      "inventor_name_first": "William C.",
      "inventor_city": "Bainbridge Island",
      "inventor_state": "WA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Nussbaum",
      "inventor_name_first": "Nicholas I.",
      "inventor_city": "Seattle",
      "inventor_state": "WA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Conwell",
      "inventor_name_first": "John W.",
      "inventor_city": "Tukwila",
      "inventor_state": "WA",
      "inventor_country": "US"
    }
  ],
  "abstract": "A computer-implemented system and method for providing classification suggestions via concept injection is provided. Clusters of uncoded concepts are accessed. Each uncoded concept represents one or more documents including that concept. One or more uncoded concepts in one of the clusters is compared to a set of reference concepts. Each reference concept is associated with a classification code. One or more of the reference concepts most similar to the one or more uncoded concepts is placed into the cluster. A neighborhood is generated for one of the uncoded concepts in the cluster. The neighborhood includes at least one of the reference concepts placed in the cluster. One of the classification codes representative of the neighborhood of reference concepts is determined and provided as a suggestion for classification of the uncoded concept.",
  "filing_date": "20161024",
  "patent_number": "None",
  "summary": "<SOH> SUMMARY <EOH>Document review efficiency can be increased by identifying relationships between reference concepts and uncoded concepts and providing a suggestion for classification based on the relationships. A set of clusters including uncoded concepts is obtained. Each of the uncoded concepts represented one or more uncoded documents to be classified. The uncoded concepts for a cluster are compared to a set of reference concepts. Those reference concepts most similar to the uncoded concepts are identified and inserted into the cluster. The relationship between the inserted reference concepts and uncoded concepts for the cluster are visually depicted and provide a suggestion regarding classification of the uncoded concepts. The classified concepts can then be used to classify the documents associated with the concepts. An embodiment provides a computer-implemented system and method for providing classification suggestions via concept injection. Clusters of uncoded concepts are accessed. Each uncoded concept represents one or more documents including that concept. One or more uncoded concepts in one of the clusters is compared to a set of reference concepts. Each reference concept is associated with a classification code. One or more of the reference concepts most similar to the one or more uncoded concepts is placed into the cluster. A neighborhood is generated for one of the uncoded concepts in the cluster. The neighborhood includes at least one of the reference concepts placed in the cluster. One of the classification codes representative of the neighborhood of reference concepts is determined and provided as a suggestion for classification of the uncoded concept. Still other embodiments of the present invention will become readily apparent to those skilled in the art from the following detailed description, wherein are described embodiments by way of illustrating the best mode contemplated for carrying out the invention. As will be realized, the invention i...",
  "date_published": "20170216",
  "title": "Computer-Implemented System and Method for Providing Classification Suggestions via Concept Injection",
  "ipcr_labels": [
    "G06N502",
    "G06F1730",
    "G06N504"
  ],
  "_processing_info": {
    "original_size": 77101,
    "optimized_size": 3776,
    "reduction_percent": 95.1
  }
}