{
  "date_produced": "20170214",
  "publication_number": "US20170061277A1-20170302",
  "main_ipcr_label": "G06N304",
  "decision": "PENDING",
  "application_number": "15349812",
  "inventor_list": [
    {
      "inventor_name_last": "Esser",
      "inventor_name_first": "Steven K.",
      "inventor_city": "San Jose",
      "inventor_state": "CA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Modha",
      "inventor_name_first": "Dharmendra S.",
      "inventor_city": "San Jose",
      "inventor_state": "CA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Ndirango",
      "inventor_name_first": "Anthony",
      "inventor_city": "Berkeley",
      "inventor_state": "CA",
      "inventor_country": "US"
    }
  ],
  "abstract": "Embodiments of the invention relate to canonical spiking neurons for spatiotemporal associative memory. An aspect of the invention provides a spatiotemporal associative memory including a plurality of electronic neurons having a layered neural net relationship with directional synaptic connectivity. The plurality of electronic neurons configured to detect the presence of a spatiotemporal pattern in a real-time data stream, and extract the spatiotemporal pattern. The plurality of electronic neurons are further configured to, based on learning rules, store the spatiotemporal pattern in the plurality of electronic neurons, and upon being presented with a version of the spatiotemporal pattern, retrieve the stored spatiotemporal pattern.",
  "filing_date": "20161111",
  "patent_number": "None",
  "summary": "<SOH> BRIEF SUMMARY <EOH>Embodiments of the invention provide canonical spiking neurons for spatiotemporal associative memory. An aspect of the invention includes a method and system for spatiotemporal associative memory including a plurality of electronic neurons having a layered neural net relationship with directional synaptic connectivity. The plurality of electronic neurons are configured to detect the presence of a spatiotemporal pattern in a data stream, and extract the spatiotemporal pattern. Based on learning rules, the plurality of electronic neurons store the spatiotemporal pattern, and upon being presented with a version of the spatiotemporal pattern, retrieve the stored spatiotemporal pattern. Another aspect of the invention includes a method for detecting the presence of a spatiotemporal pattern in a real-time data stream, extracting the spatiotemporal pattern, and based on learning rules, storing the spatiotemporal pattern in an associative memory comprising plurality of electronic neurons having a layered relationship with directional connectivity. Upon being presented with a version of the spatiotemporal pattern, the invention includes a method to retrieve the stored spatiotemporal pattern from the associative memory. These and other features, aspects and advantages of the present invention will become understood with reference to the following description, appended claims and accompanying figures.",
  "date_published": "20170302",
  "title": "CANONICAL SPIKING NEURON NETWORK FOR SPATIOTEMPORAL ASSOCIATIVE MEMORY",
  "ipcr_labels": [
    "G06N304",
    "G06N308",
    "G06N3063"
  ],
  "_processing_info": {
    "original_size": 65314,
    "optimized_size": 3061,
    "reduction_percent": 95.31
  }
}