{
  "date_produced": "20180503",
  "publication_number": "US20180137419A1-20180517",
  "main_ipcr_label": "G06N502",
  "decision": "PENDING",
  "application_number": "15349041",
  "inventor_list": [
    {
      "inventor_name_last": "Byron",
      "inventor_name_first": "Donna K.",
      "inventor_city": "Petersham",
      "inventor_state": "MA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Johnson",
      "inventor_name_first": "Benjamin L.",
      "inventor_city": "Baltimore",
      "inventor_state": "MD",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Tecuci",
      "inventor_name_first": "Dan G.",
      "inventor_city": "Austin",
      "inventor_state": "TX",
      "inventor_country": "US"
    }
  ],
  "abstract": "Mechanisms for bootstrapping knowledge acquisition from a limited knowledge domain are presented. Natural language content is received and a primary and secondary portion of natural language content are identified within the natural language content. The secondary portion of natural language content is analyzed to identify indications of meaning directed to elements of the primary portion of natural language content. Features related to the secondary portion of the natural language content indicate meaning directed to the primary portion of the natural language content. A collection of domain knowledge is generated from an analysis of the primary and secondary portions of the natural language content and stored to provide meaningful responses to requests.",
  "filing_date": "20161111",
  "patent_number": "None",
  "summary": "<SOH> SUMMARY <EOH>In one illustrative embodiment, a method in a data processing system includes a processor and a memory accessible by the processor, for acquiring knowledge from natural language content. The method further includes receiving, by the data processing system, natural language content from a corpus of information and identifying, by the data processing system, a primary portion of natural language content that references an object of the natural language content. Moreover, the method also includes identifying, by the data processing system, a secondary portion of natural language content that references an action for the object. In addition, the method includes analyzing, by the data processing system, the secondary portion of natural language content to identify at least one feature of the action for the object, such that the feature indicates meaning directed to the primary portion of natural language content. The method also includes generating, by the data processing system, a collection of domain knowledge from the analysis of the primary portion and the secondary portion of the natural language content, and storing the collection of domain knowledge in a storage facility accessible by the processor of the data processing system for use in processing other natural language content. In other illustrative embodiments, a computer program product comprising a computer useable or readable medium having a computer readable program is provided. The computer readable program, when executed on a computing device, causes the computing device to perform various ones of, and combinations of, the operations outlined above with regard to the method illustrative embodiment. In yet another illustrative embodiment, a system/apparatus is provided. The system/apparatus may comprise one or more processors and a memory coupled to the one or more processors. The memory may comprise instructions which, when executed by the one or more processors, cause the one or more ...",
  "date_published": "20180517",
  "title": "Bootstrapping Knowledge Acquisition from a Limited Knowledge Domain",
  "ipcr_labels": [
    "G06N502",
    "G06F1728"
  ],
  "_processing_info": {
    "original_size": 197700,
    "optimized_size": 3631,
    "reduction_percent": 98.16
  }
}