{
  "decision": "ACCEPTED",
  "application_number": "15345446",
  "date_published": "20170427",
  "date_produced": "20170412",
  "title": "Monitoring Digital Images",
  "filing_date": "20161107",
  "inventor_list": [
    {
      "inventor_name_last": "Tessman",
      "inventor_name_first": "Gary",
      "inventor_city": "Charles Town",
      "inventor_state": "WV",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Lippert",
      "inventor_name_first": "Patrick D.",
      "inventor_city": "Santa Ana",
      "inventor_state": "CA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Hayman",
      "inventor_name_first": "Timothy B.",
      "inventor_city": "Irvine",
      "inventor_state": "CA",
      "inventor_country": "US"
    }
  ],
  "ipcr_labels": [
    "G06F2162",
    "H04L1258",
    "H04L2908",
    "H04L2906",
    "G06F1730"
  ],
  "main_ipcr_label": "G06F2162",
  "summary": "<SOH> SUMMARY <EOH>In one general aspect, digital images are monitored by enabling access to a digital image, receiving a notification associated with the digital image from a first user, and regulating access of the first user to the digital image based on the notification received from the first user. Implementations may include one or more of the following features. For example, access of the first user to the digital image may be regulated by identifying a storage location associated with the first user, and modifying metadata associated with the first user. The storage location may be identified based upon an application of a hashing code to account information associated with the first user. Metadata to be modified includes metadata associated with the digital image, and modifying metadata may include removing metadata corresponding to the digital image from one or more tables associated with the first user. Modifying metadata may also include removing metadata corresponding to the first subscriber from one or more tables associated with the digital image. In another implementation, access of a second user to the digital image may be regulated based on the notification received from the first user. In yet another implementation, access of an owner of the digital image to the digital image may be regulated. For example, the access of the owner of the digital image may be regulated by identifying a storage location associated with the owner and modifying metadata associated with the owner. The storage location may be identified based upon an application of a hashing code to account information associated with the owner. Modifying metadata may include modifying metadata associated with the digital image. Modifying metadata may also include removing metadata corresponding to the first user from one or more tables associated with the digital image. Moreover, modifying metadata also includes inserting metadata indicating an investigation status in one or more tables...",
  "patent_number": "9953177",
  "abstract": "Digital images are monitored by enabling access to a digital image, receiving a notification associated with the digital image from a first user, and regulating access of the first user to the digital image based on the notification received from the first user.",
  "publication_number": "US20170116429A1-20170427",
  "_processing_info": {
    "original_size": 97635,
    "optimized_size": 3132,
    "reduction_percent": 96.79
  }
}