{
  "decision": "PENDING",
  "application_number": "15341147",
  "date_published": "20170223",
  "date_produced": "20170208",
  "title": "GENERATION APPARATUS, GENERATION METHOD, AND PROGRAM",
  "filing_date": "20161102",
  "inventor_list": [
    {
      "inventor_name_last": "Takeuchi",
      "inventor_name_first": "Emiko",
      "inventor_city": "Tokyo",
      "inventor_state": "",
      "inventor_country": "JP"
    },
    {
      "inventor_name_last": "Takuma",
      "inventor_name_first": "Daisuke",
      "inventor_city": "Tokyo",
      "inventor_state": "",
      "inventor_country": "JP"
    },
    {
      "inventor_name_last": "Toyoshima",
      "inventor_name_first": "Hirobumi",
      "inventor_city": "Tokyo",
      "inventor_state": "",
      "inventor_country": "JP"
    }
  ],
  "ipcr_labels": [
    "G06F1724",
    "G06F1728",
    "G06N9900",
    "G06F1727"
  ],
  "main_ipcr_label": "G06F1724",
  "summary": "<SOH> SUMMARY <EOH>Aspects of the present invention disclose a method, computer program product, and system for generating target text based on target data. The method includes one or more processors decomposing one or more portions of text into at least one corresponding keyword and at least one corresponding template. The method further includes one or more processors learning a classification model associated with selecting a template based on a category of a keyword. The method further includes one or more processors identifying a target keyword that is represented by target data. The method further includes one or more processors selecting a target template that is used to represent the target data based on a category associated with the identified target keyword utilizing the classification model. The method further includes one or more processors generating target text that represents the target data based on the selected text template based on the selected target template and the identified target keyword.",
  "patent_number": "None",
  "abstract": "Aspects of the present invention disclose a method, computer program product, and system for generating target text based on target data. The method includes one or more processors decomposing one or more portions of text into at least one corresponding keyword and at least one corresponding template. The method further includes learning a classification model associated with selecting a template based on a category of a keyword. The method further includes identifying a target keyword that is represented by target data. The method further includes selecting a target template that is used to represent the target data based on a category associated with the identified target keyword utilizing the classification model. The method further includes generating target text that represents the target data based on the selected text template based on the selected target template and the identified target keyword.",
  "publication_number": "US20170052945A1-20170223",
  "_processing_info": {
    "original_size": 61314,
    "optimized_size": 2806,
    "reduction_percent": 95.42
  }
}