{
  "date_produced": "20180213",
  "publication_number": "US20180060720A1-20180301",
  "main_ipcr_label": "G06N304",
  "decision": "PENDING",
  "application_number": "15343882",
  "inventor_list": [
    {
      "inventor_name_last": "EL-KHAMY",
      "inventor_name_first": "Mostafa",
      "inventor_city": "San Diego",
      "inventor_state": "CA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "LEE",
      "inventor_name_first": "Jungwon",
      "inventor_city": "San Diego",
      "inventor_state": "CA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "KIM",
      "inventor_name_first": "Jaeyoung",
      "inventor_city": "San Diego",
      "inventor_state": "CA",
      "inventor_country": "US"
    }
  ],
  "abstract": "An apparatus and a method. The apparatus includes a first recurrent network in a first layer; a second recurrent network in a second layer connected to the first recurrent network; a distant input gate connected to the second recurrent network; a first highway gate connected to the distant input gate and the second recurrent network; a first elementwise product projection gate connected to the distant input gate, the highway gate, and the second recurrent network; a second highway gate connected to the first recurrent network and the second recurrent network; and a second elementwise product projection gate connected to the first recurrent network, the second highway gate, and the second recurrent network.",
  "filing_date": "20161104",
  "patent_number": "None",
  "summary": "<SOH> SUMMARY <EOH>According to one embodiment, an apparatus includes a first recurrent network in a first layer; a second recurrent network in a second layer connected to the first recurrent network; a distant input gate connected to the second recurrent network; a first highway gate connected to the distant input gate and the second recurrent network; a first elementwise product projection gate connected to the distant input gate, the first highway gate, and the second recurrent network; a second highway gate connected to the first recurrent network and the second recurrent network; and a second elementwise product projection gate connected to the first recurrent network, the second highway gate, and the second recurrent network. According to one embodiment, a method of a hybrid recurrent network with a highway connection includes feeding an output from a first recurrent network in a first layer to a second recurrent network in a second layer via a first highway gate for the highway connection; and receiving a distant input in the second recurrent network via a distant input gate and a second highway gate. According to one embodiment, an apparatus includes a first recurrent network in a first layer; a second recurrent network in a second layer connected to the first recurrent network; a third recurrent network in a second layer connected to the second recurrent network; a distant input gate in the third recurrent network connected to the first recurrent network; a first highway gate in the third recurrent network connected to the distant input gate; a second highway gate in the third recurrent network connected to the second recurrent network; and a first elementwise product projection gate in the third recurrent network connected to the second recurrent network and the second highway gate. According to one embodiment, a method of a hybrid recurrent network with multiple highway connections includes feeding an output from a second recurrent network in a second lay...",
  "date_published": "20180301",
  "title": "SYSTEM AND METHOD FOR INFORMATION HIGHWAYS IN A HYBRID FEEDFORWARD-RECURRENT DEEP NETWORK",
  "ipcr_labels": [
    "G06N304",
    "G06N308"
  ],
  "_processing_info": {
    "original_size": 120772,
    "optimized_size": 3598,
    "reduction_percent": 97.02
  }
}