{
  "decision": "ACCEPTED",
  "application_number": "15340490",
  "date_published": "20170504",
  "date_produced": "20170419",
  "title": "METHOD AND APPARATUS OF ASSESSMENT OF ACCESS FLOW IN HEMODIALYSIS PATIENTS BY VIDEO IMAGING PROCESSING",
  "filing_date": "20161101",
  "inventor_list": [
    {
      "inventor_name_last": "Kotanko",
      "inventor_name_first": "Peter",
      "inventor_city": "New York",
      "inventor_state": "NY",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Zhu",
      "inventor_name_first": "Fansan",
      "inventor_city": "Flushing",
      "inventor_state": "NY",
      "inventor_country": "US"
    }
  ],
  "ipcr_labels": [
    "A61B5026",
    "A61M114",
    "A61B500",
    "G06T700",
    "G06T720"
  ],
  "main_ipcr_label": "A61B5026",
  "summary": "<SOH> SUMMARY OF INVENTION <EOH>Aspects and examples are directed to various non-invasive techniques for assessing blood flow characteristics in patients using video image processing. The blood flow characteristics may be determined by analyzing the small motion exhibited by the skin of a patient as fluid (e.g., blood) circulates through an area of interest on the patient. The small motion may be analyzed to determine, for example, the rate of blood flow in various regions of the patient. These non-invasive techniques may be readily employed to, for example, assess the health of a vascular access in a hemodialysis patient. For example, video capturing the small motions exhibited by an arterio-venous (AV) fistula of a hemodialysis patient may be analyzed to estimate the blood flow in the vascular access of the patient. Further, the captured video may be analyzed to identify thrombosis in the patient and/or predict the onset of thrombosis. The information regarding the health of the vascular access in hemodialysis patients may be employed by physicians to intervene before the vascular access fails thereby extending the useful life of the vascular access. According to at least one aspect, a method of analyzing at least one blood flow characteristic of a patient is provided. The method includes capturing a video including a plurality of frames of an arterio-venous (AV) fistula on the patient, amplifying motion in the video to produce a motion-amplified video, determining a difference in intensity between consecutive frames in the motion-amplified video to produce a time-function of an amplitude of optic flow representing movement in an area of interest on the patient, and determining the at least one blood flow characteristic of the patient based on the time-function. In some examples, the act of capturing the video includes capturing monochrome video. For example, the monochrome video may be captured by a monochrome image sensor. In some examples, the act of capturing ...",
  "patent_number": "9993169",
  "abstract": "Systems and methods are provided for assessing patient blood flow using video image processing. According to one aspect, a method of analyzing at least one blood flow characteristic of a patient includes capturing a video including a plurality of frames of an arterio-venous (AV) fistula on the patient; amplifying motion in the video to produce a motion-amplified video; determining a difference in intensity between consecutive frames in the motion-amplified video to produce a time-function of an amplitude of the optic flow representing movement in an area of interest on the patient; and determining the at least one blood flow characteristic of the patient based on the time-function.",
  "publication_number": "US20170119258A1-20170504",
  "_processing_info": {
    "original_size": 77261,
    "optimized_size": 3473,
    "reduction_percent": 95.5
  }
}