{
  "date_produced": "20170208",
  "publication_number": "US20170053205A1-20170223",
  "main_ipcr_label": "G06N502",
  "decision": "PENDING",
  "application_number": "15346576",
  "inventor_list": [
    {
      "inventor_name_last": "SALIBA",
      "inventor_name_first": "Toufic",
      "inventor_city": "Mountain View",
      "inventor_state": "CA",
      "inventor_country": "US"
    }
  ],
  "abstract": "Various embodiments of the present invention relating to a knowledge expertise platform for tracking, analyzing, and sharing knowledge expertise among group member clients are disclosed. In particular, the knowledge expertise platform enables categorizing and ranking a broad universe of human learning to generate expertise categories, processing the expertise categories to accurately identify and link user consumption content to expertise information, and automatically monitoring and interpreting user content consumption to share the expertise information among member clients within a group.",
  "filing_date": "20161108",
  "patent_number": "None",
  "summary": "<SOH> BRIEF DESCRIPTION OF THE DRAWINGS <EOH>FIG. 1 is a diagram illustrating an example environment in which one or more embodiments of the present invention may be implemented. FIG. 2 is a block diagram of an example set of components that may be used in a knowledge expertise platform system in accordance with one or more embodiments of the present invention. FIG. 3 is a diagram illustrating an example set of components that may be used in an interpretation module in accordance with one or more embodiments of the present invention. FIG. 4 is a flow diagram illustrating an example process utilized by the interpretation module in accordance with one or more embodiments of the present invention. FIG. 5 is an example illustrating a knowledge expertise platform 500 on which a client device may connect to the expertise server in accordance with one or more embodiments of the present invention. detailed-description description=\"Detailed Description\" end=\"lead\"?",
  "date_published": "20170223",
  "title": "SYSTEM AND METHOD FOR TRACKING KNOWLEDGE AND EXPERTISE",
  "ipcr_labels": [
    "G06N502",
    "G06N9900"
  ],
  "_processing_info": {
    "original_size": 50745,
    "optimized_size": 2128,
    "reduction_percent": 95.81
  }
}