{
  "date_produced": "20180418",
  "publication_number": "US20180121828A1-20180503",
  "main_ipcr_label": "G06N9900",
  "decision": "PENDING",
  "application_number": "15340284",
  "inventor_list": [
    {
      "inventor_name_last": "Keysers",
      "inventor_name_first": "Daniel M.",
      "inventor_city": "Stallikon",
      "inventor_state": "",
      "inventor_country": "CH"
    },
    {
      "inventor_name_last": "Carbune",
      "inventor_name_first": "Victor",
      "inventor_city": "Basel",
      "inventor_state": "",
      "inventor_country": "CH"
    },
    {
      "inventor_name_last": "Deselaers",
      "inventor_name_first": "Thomas",
      "inventor_city": "Zurich",
      "inventor_state": "",
      "inventor_country": "CH"
    }
  ],
  "abstract": "Methods, systems, and apparatus, including computer programs encoded on a computer storage medium, for providing actionable suggestions are disclosed. In one aspect, a method includes receiving (i) an indication that an event detection module has determined that a shared event of a particular type is presently occurring or has occurred, and (ii) data referencing an attribute associated with the shared event. The method includes selecting, from among multiple output templates that are each associated with a different type of shared event, a particular output template associated with the particular type of shared event detected by the module. The method generates a notification for output using at least (i) the selected particular output template, and (ii) the data referencing the attribute associated with the shared event. The method then provides, for output to a user device, the notification that is generated.",
  "filing_date": "20161101",
  "patent_number": "None",
  "summary": "<SOH> SUMMARY <EOH>A computing system is described that automatically detects that a particular event, such as a shared event, is taking place or took place. This specification describes processes for receiving and analyzing data signals from user devices associated with individual users within a user group to detect the occurrence of a shared event. In response to automatically detecting the occurrence of a shared event, the computing system suggests one or more activities that are, at least in part, related to or associated with the shared event. Suggesting the one or more activities can include, for example, the computing system analyzing data signals provided by devices of the users to determine an attribute associated with the shared event. Values of the data signals can indicate that the one or more users are participating in, or at least are associated with, a shared event of a particular type. Accordingly, actionable suggestions for one or more activities associated with the determined shared event type can be provided to the users. In one innovative aspect of the specification, a computer-implemented method is described, that includes receiving (i) an indication that an event detection module has determined that a shared event of a particular type is presently occurring or has occurred, and (ii) data referencing an attribute associated with the shared event. The method includes, selecting, by a computing system, from among multiple output templates that are each associated with a different type of shared event, a particular output template associated with the particular type of shared event that the event detection module has determined is presently occurring or has occurred, and generating, by the computing system, a notification for output using at least (i) the particular output template associated with the particular type of shared event determined to be presently occurring or determined to have already occurred, and (ii) the data referencing the attrib...",
  "date_published": "20180503",
  "title": "ACTIONABLE SUGGESTIONS FOR ACTIVITIES",
  "ipcr_labels": [
    "G06N9900"
  ],
  "_processing_info": {
    "original_size": 120328,
    "optimized_size": 3741,
    "reduction_percent": 96.89
  }
}