{
  "date_produced": "20170214",
  "publication_number": "US20170061300A1-20170302",
  "main_ipcr_label": "G06N504",
  "decision": "PENDING",
  "application_number": "15349241",
  "inventor_list": [
    {
      "inventor_name_last": "YAHIA",
      "inventor_name_first": "Sihem Amer",
      "inventor_city": "New York",
      "inventor_state": "NY",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "BRODER",
      "inventor_name_first": "Andrei Z.",
      "inventor_city": "Menlo Park",
      "inventor_state": "CA",
      "inventor_country": "US"
    }
  ],
  "abstract": "The present invention is directed towards methods and computer readable media for annotating and ranking user reviews on social review systems with inferred analytics. A reference framework is provided by creating context according to previous activity, bias, or background information of a given reviewer. The method of the present invention comprises receiving a first query identifying a given content item, generating a collection of content items based on one or more identical objective attributes associated with the given content item, identifying one or more subjective attributes associated with a given item in the collection of items, and providing a reference framework to interpret the subjective attributes associated with each item in the collection.",
  "filing_date": "20161111",
  "patent_number": "None",
  "summary": "<SOH> SUMMARY OF THE INVENTION <EOH>The present invention is directed towards methods and computer readable media comprising program code for annotating and ranking a user review with automatically inferred analytics. The method of the present invention comprises generating a collection of content items on the basis of one or more objective attributes associated with a given content item. A content item may comprise an item that is typically reviewed by an individual and an objective attribute may comprise a short description that defines the given content item. One or more subjective attributes associated with a given item in the collection of items are identified, and a reference framework is provided to interpret the subjective attributes associated with each item in the collection. According to one embodiment of the present invention, the reference framework is created by analyzing previously generated subjective attributes. The previously generated subjective attributes may comprise one or more reviews of content items entered by a user into a social review system. The subjective attributes are analyzed to define one or more socially meaningful interpretation contexts. According to one embodiment of the present invention, analyzing is performed manually by an editor. According to an alternate embodiment, analyzing is performed automatically via statistical analysis. According to another embodiment of the invention, annotating a user review with automatically inferred analytics comprises generating an initial collection of content items on the basis of one or more objective attributes associated with a given content item, assigning a value to one or more of the one or more objective attributes, and identifying one or more subjective attributes associated with a given item in the initial collection of content items. The method further comprises generating a socially meaningful collection of content items by culling down the initial collection of items on the basi...",
  "date_published": "20170302",
  "title": "SYSTEM AND METHOD FOR ANNOTATING AND RANKING REVIEWS WITH INFERRED ANALYTICS",
  "ipcr_labels": [
    "G06N504",
    "G06N502",
    "G06F1730"
  ],
  "_processing_info": {
    "original_size": 70437,
    "optimized_size": 3507,
    "reduction_percent": 95.02
  }
}