{
  "decision": "PENDING",
  "application_number": "15345411",
  "date_published": "20170511",
  "date_produced": "20170427",
  "title": "BLOCKCHAINING FOR MEDIA DISTRIBUTION",
  "filing_date": "20161107",
  "inventor_list": [
    {
      "inventor_name_last": "Goeringer",
      "inventor_name_first": "Steven John",
      "inventor_city": "Westminster",
      "inventor_state": "CO",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Lund",
      "inventor_name_first": "Robert Michael",
      "inventor_city": "Boulder",
      "inventor_state": "CO",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Scriber",
      "inventor_name_first": "Brian Alexander",
      "inventor_city": "Denver",
      "inventor_state": "CO",
      "inventor_country": "US"
    }
  ],
  "ipcr_labels": [
    "H04L906",
    "H04L914",
    "H04L932",
    "G06Q5018",
    "H04W1202",
    "H04W1204",
    "G06Q2038",
    "H04L930",
    "H04L2906"
  ],
  "main_ipcr_label": "H04L906",
  "summary": "<SOH> BRIEF SUMMARY <EOH>In an aspect, a system for distributing content over an electronic communications network includes a first electronic device including a first processor and a first memory, and a second electronic device including a second processor and a second memory. The second electronic device is configured to communicate with the first electronic device over the electronic communications network. The system further includes a blockchain and a blockchain processor in operable communication with each of the first electronic device and the second electronic device over the electronic communications network. The blockchain processor is configured to verify a transfer of content between the first electronic device and the second electronic device, and to update the blockchain with information regarding the verified transfer of content. In another aspect, a method of verifying a transaction between a first party and a second party using a blockchain includes the steps of initiating a transaction regarding a transfer of electronic content from the first party to the second party, compiling, by the first party, a body of electronic information regarding the electronic content into an envelope, submitting, by the first party, the envelope to a blockchain node, validating, by the blockchain node, the transaction, and adding, by the blockchain node, details of the transaction to a pending block of the blockchain.",
  "patent_number": "None",
  "abstract": "A system for distributing content over an electronic communications network includes a first electronic device including a first processor and a first memory, and a second electronic device including a second processor and a second memory. The second electronic device is configured to communicate with the first electronic device over the electronic communications network. The system further includes a blockchain and a blockchain processor in operable communication with each of the first electronic device and the second electronic device over the electronic communications network. The blockchain processor is configured to verify a transfer of content between the first electronic device and the second electronic device, and to update the blockchain with information regarding the verified transfer of content.",
  "publication_number": "US20170134161A1-20170511",
  "_processing_info": {
    "original_size": 85342,
    "optimized_size": 3186,
    "reduction_percent": 96.27
  }
}