{
  "date_produced": "20170510",
  "publication_number": "US20170147932A1-20170525",
  "main_ipcr_label": "G06N504",
  "decision": "PENDING",
  "application_number": "15348141",
  "inventor_list": [
    {
      "inventor_name_last": "SOHN",
      "inventor_name_first": "Hoon",
      "inventor_city": "Daejeon",
      "inventor_state": "",
      "inventor_country": "KR"
    },
    {
      "inventor_name_last": "KIM",
      "inventor_name_first": "Min-Koo",
      "inventor_city": "Daegu",
      "inventor_state": "",
      "inventor_country": "KR"
    },
    {
      "inventor_name_last": "YOON",
      "inventor_name_first": "Seong-Heum",
      "inventor_city": "Daejeon",
      "inventor_state": "",
      "inventor_country": "KR"
    }
  ],
  "abstract": "Disclosed are a method for predicting collapse of a structure using throw-type sensors and a system for the same. The system includes at least one throw-type sensor for measuring a collapse characteristic of a structure on fire after having been thrown into the structure in a fireplace and wirelessly transmitting measured data, and a computer for receiving the measured data transmitted from the at least one throw-type sensor and predicting whether or not the structure on fire will collapse by analyzing the measured data.",
  "filing_date": "20161110",
  "patent_number": "None",
  "summary": "<SOH> SUMMARY <EOH>In order to solve these problems of the above-mentioned conventional technologies, embodiments of the present inventive concept provide a throw-type sensor based structure collapse prediction method and a system for the same that can collect collapse characteristic data of the structure from the throw-type sensors by directly throwing the sensors to collapse vulnerable positions in the fireplace. In addition, some embodiments of the present inventive concept provide a throw-type sensor based structure collapse prediction method and a system for the same that can allow the accurate measurement of the displacement of the structure by removing the bias errors from the double integral using the accelerometer. Some other embodiments of the present inventive concept further provide a throw-type sensor based structure collapse prediction method and a system for the same that can allow the further accurate prediction of structure collapse by synthesizing measurement signals and structural analysis results in accordance with temperature. Furthermore, some other embodiments of the present inventive concept provide a throw-type sensor based structure collapse prediction method and a system for the same that can analyze an estimated collapse time and provide early warning to the firefighters in the fireplace in real time based on the analysis result. However, the problems to be solved by the present inventive concept are not limited to the above, and it may be variously extended without departing from the spirit and scope of the present inventive concept. According to exemplary embodiments of the present inventive concept, there is provided a structure collapse prediction system which includes at least one throw-type sensor for measuring a collapse characteristic of a structure on fire after having been thrown into the structure in a fireplace and wirelessly transmitting measured data, and a computer for receiving the measured data transmitted from the at lea...",
  "date_published": "20170525",
  "title": "SYSTEM AND METHOD FOR PREDICTING COLLAPSE OF STRUCTURE USING THROW-TYPE SENSOR",
  "ipcr_labels": [
    "G06N504",
    "G01B1100",
    "G06F1750",
    "G01C2120",
    "A62C9900",
    "G01B5004",
    "G01C2110"
  ],
  "_processing_info": {
    "original_size": 53384,
    "optimized_size": 3441,
    "reduction_percent": 93.55
  }
}