{
  "decision": "PENDING",
  "application_number": "15349961",
  "date_published": "20180517",
  "date_produced": "20180503",
  "title": "MANAGEMENT OF BLOCK STORAGE DEVICES BASED ON ACCESS FREQUENCY",
  "filing_date": "20161111",
  "inventor_list": [
    {
      "inventor_name_last": "White",
      "inventor_name_first": "Philip Andrew",
      "inventor_city": "Renton",
      "inventor_state": "WA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Hsieh",
      "inventor_name_first": "Hank T.",
      "inventor_city": "San Francisco",
      "inventor_state": "CA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Loughmiller",
      "inventor_name_first": "Scott",
      "inventor_city": "San Francisco",
      "inventor_state": "CA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Saeed",
      "inventor_name_first": "Asad Ahmad",
      "inventor_city": "Emeryville",
      "inventor_state": "CA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Augustine St. Clair",
      "inventor_name_first": "Sumner",
      "inventor_city": "Oakland",
      "inventor_state": "CA",
      "inventor_country": "US"
    }
  ],
  "ipcr_labels": [
    "G06F306",
    "G06F1202"
  ],
  "main_ipcr_label": "G06F306",
  "summary": "<SOH> SUMMARY <EOH>A system, method, and computer program product are provided for allocating blocks of memory in a virtual storage device based on access frequency. The method includes the steps of tracking access frequency for a plurality of blocks of memory in a virtual storage device utilizing a heat map and reallocating the plurality of blocks of memory in the virtual storage device among a plurality of blocks of memory in two or more real storage devices based on the heat map. The heat map includes at least one data structure that maps block identifiers corresponding to the plurality of blocks of memory in the virtual storage device to heat values that represent the access frequency of a corresponding block of memory.",
  "patent_number": "None",
  "abstract": "A system, method, and computer program product are provided for allocating blocks of memory in a virtual storage device based on access frequency. The method includes the steps of tracking access frequency for a plurality of blocks of memory in a virtual storage device utilizing a heat map and reallocating the plurality of blocks of memory in the virtual storage device among a plurality of blocks of memory in two or more real storage devices based on the heat map. The heat map includes at least one data structure that maps block identifiers corresponding to the plurality of blocks of memory in the virtual storage device to heat values that represent the access frequency of a corresponding block of memory.",
  "publication_number": "US20180136838A1-20180517",
  "_processing_info": {
    "original_size": 107218,
    "optimized_size": 2624,
    "reduction_percent": 97.55
  }
}