{
  "date_produced": "20180418",
  "publication_number": "US20180121796A1-20180503",
  "main_ipcr_label": "G06N3063",
  "decision": "PENDING",
  "application_number": "15343036",
  "inventor_list": [
    {
      "inventor_name_last": "DEISHER",
      "inventor_name_first": "Michael E",
      "inventor_city": "Hillsboro",
      "inventor_state": "OR",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "FALIK",
      "inventor_name_first": "Ohad",
      "inventor_city": "Kfar Saba",
      "inventor_state": "",
      "inventor_country": "IL"
    }
  ],
  "abstract": "Systems, apparatus and methods are described including operations for a flexible neural network accelerator.",
  "filing_date": "20161103",
  "patent_number": "None",
  "summary": "<SOH> BRIEF DESCRIPTION OF THE DRAWINGS <EOH>The material described herein is illustrated by way of example and not by way of limitation in the accompanying figures. For simplicity and clarity of illustration, elements illustrated in the figures are not necessarily drawn to scale. For example, the dimensions of some elements may be exaggerated relative to other elements for clarity. Further, where considered appropriate, reference labels have been repeated among the figures to indicate corresponding or analogous elements. In the figures: FIG. 1 is an illustrative diagram of a speech recognition device for use according to the implementations described herein; FIG. 2 is an illustrative diagram of an example neural network system; FIG. 3 is a schematic flow diagram of another example neural network system; FIG. 4 is a diagram of a logic circuit with parallel logic blocks for processing a neural network according to the implementations herein; FIG. 5 is a diagram of further logic used for processing the neural network according to the implementations herein; FIG. 6 is a flow chart of an example method of neural network processing using parallel logic blocks; FIGS. 7A-7B is a detailed flow chart of an example method of neural network layer descriptor chain setup according to the implementations herein; FIG. 8 is a schematic diagram of a layer descriptor array; FIGS. 9A-9E is a flow chart of an example detailed method of setting up a layer descriptor chain for the neural network using flexible layer descriptor definitions; FIG. 10 is another flow chart of an example method of neural network propagation according to the implementations herein; FIGS. 10A-10B are a detailed flow chart of a process of neural network propagation according to the implementations herein; FIG. 10C is a flow chart of a process of using a piecewise linear activation function process according to the implementations herein; FIG. 8 is a flow chart of an example method of neural network setup with fl...",
  "date_published": "20180503",
  "title": "FLEXIBLE NEURAL NETWORK ACCELERATOR AND METHODS THEREFOR",
  "ipcr_labels": [
    "G06N3063",
    "G06N304",
    "G10L1516",
    "G10L1502"
  ],
  "_processing_info": {
    "original_size": 256717,
    "optimized_size": 2836,
    "reduction_percent": 98.9
  }
}