{
  "decision": "PENDING",
  "application_number": "15340886",
  "date_published": "20170504",
  "date_produced": "20170419",
  "title": "CALCULATIONS ON IMAGES WITHIN CELLS IN SPREADSHEETS",
  "filing_date": "20161101",
  "inventor_list": [
    {
      "inventor_name_last": "Canton",
      "inventor_name_first": "Christian M.",
      "inventor_city": "Bellevue",
      "inventor_state": "WA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Otero",
      "inventor_name_first": "Carlos A.",
      "inventor_city": "Seattle",
      "inventor_state": "WA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Campbell",
      "inventor_name_first": "John",
      "inventor_city": "Woodinville",
      "inventor_state": "WA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Radakovitz",
      "inventor_name_first": "Samuel C.",
      "inventor_city": "Seattle",
      "inventor_state": "WA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Fichtner",
      "inventor_name_first": "Matthew Hart",
      "inventor_city": "Playa Vista",
      "inventor_state": "CA",
      "inventor_country": "US"
    }
  ],
  "ipcr_labels": [
    "G06F1724"
  ],
  "main_ipcr_label": "G06F1724",
  "summary": "<SOH> SUMMARY <EOH>The disclosure generally relates to a system and methods for associating one or more images with one or more cells of a spreadsheet. More particularly, this disclosure generally relates to performing a calculation function on an image within the spreadsheet. In order to perform a calculation function on the image, data associated with the image is retrieved using one or more functions. A calculation function or other operation may be performed on the data. In some instances, performing a calculation function or other operation on the data associated with the image alters an appearance of the image. In aspects, when an image file is associated with one or more cells in the spreadsheet application, the image file may be treated as a new type of value. In some aspects, a plurality of images may be associated with a single cell or a single image may be associated with a range of cells. In further aspects, both an image and additional data may be associated with a single cell. In some cases, the image may be provided as a background for the cell and the additional data may be displayed over the image. In other cases, the associated image may be displayed adjacent the additional data, wrapped by the additional data, etc. Upon associating an image with a cell, various parameters associated with the image may be identified and surfaced for viewing and/or manipulation by a user. Additionally, one or more calculation functions may be performed on the parameters or on data associated with the image. For example, various spreadsheet operations, including for example, sort, filter, and various calculation functions, may be performed on the parameters and/or data of the images. In yet other examples, fit and/or resize operations may be performed on an associated image. In aspects, an associated image may move with a cell when the cell is reordered within the cell table. Alternatively, an associated image may be allowed to float over the grid but, unlike prior s...",
  "patent_number": "None",
  "abstract": "Described herein is a system and method for associating images with one or more cells in a spreadsheet application. As described, one or more images may be associated with a single cell in a spreadsheet application or it may be associated with a range of cells in the spreadsheet application. Information about the image, such as metadata, pixel information or other parameters, may be retrieved from the image. Once retrieved, a calculation engine may perform one or more calculations on the information in order to change an appearance of the image.",
  "publication_number": "US20170124057A1-20170504",
  "_processing_info": {
    "original_size": 130020,
    "optimized_size": 3703,
    "reduction_percent": 97.15
  }
}