{
  "date_produced": "20170603",
  "publication_number": "US20170169337A1-20170615",
  "main_ipcr_label": "G06N502",
  "decision": "ACCEPTED",
  "application_number": "15347777",
  "inventor_list": [
    {
      "inventor_name_last": "MATHEW",
      "inventor_name_first": "Thomas",
      "inventor_city": "Vienna",
      "inventor_state": "VA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Seaman",
      "inventor_name_first": "John William",
      "inventor_city": "Reston",
      "inventor_state": "VA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "MANOUCHEHRI",
      "inventor_name_first": "Ali Reza",
      "inventor_city": "Reston",
      "inventor_state": "VA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "VASQUEZ",
      "inventor_name_first": "Jorge Luis",
      "inventor_city": "Fairfax",
      "inventor_state": "VA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "KOHN",
      "inventor_name_first": "Lee Evan",
      "inventor_city": "Arlington",
      "inventor_state": "VA",
      "inventor_country": "US"
    }
  ],
  "abstract": "An individual having a plurality of first features and a second characteristic is identified. A plurality of second features associated with a second characteristic is determined. For each first feature among the plurality of first features, a respective probability distribution indicating, for each respective second feature, a probability that a person having the respective second feature has the first feature, is determined, thereby generating a plurality of probability distributions. A probabilistic classifier is used to combine the plurality of probability distributions, thereby generating a merged probability distribution. A Monte Carlo method is used to generate a prediction set based on the merged probability distribution, the prediction set including a plurality of prediction values for the second characteristic of the individual, each respective prediction value being associated with one of the plurality of second features. The prediction set is stored in a memory. The probabi...",
  "filing_date": "20161109",
  "patent_number": "9996800",
  "summary": "<SOH> SUMMARY <EOH>In general, one innovative aspect of the subject matter described in this specification may be embodied in methods that include the actions of filtering social media data for content resources that match one or more search terms; providing the content resources to a user interface; receiving a selection of one or more of the content resources; receiving a selection to create a new visual based on data received; creating a visualization instance; and providing the visualization instance to be displayed on the user interface. Other embodiments of these aspects include corresponding systems, apparatus, and computer-readable medium storing software comprising instructions executable by one or more computers, which cause the computers to perform the actions of the methods. Another innovative aspect of the subject matter described in this specification may be embodied in methods that include the actions of receiving visualization settings at a server visualization loader; identifying visualization data sources; creating a visualization controller from the visualization data sources, visualization structure and visualization settings; providing to a visualization instance manager the visualization controller and generated visualization style; and creating with the visualization instance manager a visualization instance based on the visualization controller and generated visualization style. Other embodiments of these aspects include corresponding systems, apparatus, and computer-readable medium storing software comprising instructions executable by one or more computers, which cause the computers to perform the actions of the methods. Another innovative aspect of the subject matter described in this specification may be embodied in methods that include the actions of selecting all elements on a webpage, by a client loader that have a first attribute and make a request to a server loader for a visualization manager, including the value of all of the attri...",
  "date_published": "20170615",
  "title": "SYSTEMS, APPARATUS, AND METHODS FOR GENERATING PREDICTION SETS BASED ON A KNOWN SET OF FEATURES",
  "ipcr_labels": [
    "G06N502",
    "G06N700"
  ],
  "_processing_info": {
    "original_size": 194275,
    "optimized_size": 4197,
    "reduction_percent": 97.84
  }
}