{
  "decision": "PENDING",
  "application_number": "15343204",
  "date_published": "20170504",
  "date_produced": "20170419",
  "title": "Systems and Methods for Automated and Remote Care Giving",
  "filing_date": "20161103",
  "inventor_list": [
    {
      "inventor_name_last": "Shlagman",
      "inventor_name_first": "Wolf",
      "inventor_city": "Miami Beach",
      "inventor_state": "FL",
      "inventor_country": "US"
    }
  ],
  "ipcr_labels": [
    "G06F1900"
  ],
  "main_ipcr_label": "G06F1900",
  "summary": "<SOH> SUMMARY OF INVENTION <EOH>A system or method for aiding a care giver is provided which allows for remote and automated care giving services to be provided to a care recipient through the use of interactive communications using interactive care giving software, at least one care recipient device for communicating with a care recipient, at least one care giver computing device having memory for storing computer-executable instructions and a processing unit for executing the instructions stored on the memory, wherein execution of the instructions results in the processing unit performing operations for running said interactive care giving software, and a central processing station for storing information related to a care giver and a care recipient, wherein said central processing station provides communications to a care recipient device, interprets communications from a care recipient device, and provides information and alerts to a computing device. Interactive care giving software is initiated on at least one care giver device and allows a care giver to setup a profile for a care recipient by entering in medical information and answering a series of interactive questions for determining a care recipient's needs. The interactive software communicates and stores the care giver profile information to a central processing station. The central processing station provides regular interactive communication, verbal or written, with a care recipient communication device based on a care recipients profile and stores the information received from the interactive communications to the central processing station. The central processing station communicates the results of the communications by reporting the status of the care recipient on a care giver device, or provides an alert or emergency notification to a care giver device in the event that a care recipient needs assistance, or fails to communicate with an interactive communications from the central processing station...",
  "patent_number": "None",
  "abstract": "Disclosed are various embodiments for systems and methods for assisting in providing care giving by one or more care givers in a care circle to a care recipient. The system has at least a central processing station, a network, at least one electronic care giver computing or mobile device, at least one care recipient communication device including of at least a wired telephone, and an interactive software package to be executed on said care giver device to facilitate monitoring of a care recipient and to communicate between a care giver device and a central processing station. A care giver provides a profile including medical history and other related care giving information to a central processing station from a care giver device and sets up interactive communications to be performed between the central processing station and the care recipient communication device.",
  "publication_number": "US20170124277A1-20170504",
  "_processing_info": {
    "original_size": 80827,
    "optimized_size": 3427,
    "reduction_percent": 95.76
  }
}