{
  "decision": "PENDING",
  "application_number": "15348223",
  "date_published": "20171207",
  "date_produced": "20171121",
  "title": "AUTHENTICATION CONTROL APPARATUS, IMAGE READING APPARATUS, AND NON-TRANSITORY COMPUTER READABLE MEDIUM",
  "filing_date": "20161110",
  "inventor_list": [
    {
      "inventor_name_last": "HAYASHI",
      "inventor_name_first": "Mitsuo",
      "inventor_city": "Kanagawa",
      "inventor_state": "",
      "inventor_country": "JP"
    },
    {
      "inventor_name_last": "OMORI",
      "inventor_name_first": "Toshihide",
      "inventor_city": "Kanagawa",
      "inventor_state": "",
      "inventor_country": "JP"
    },
    {
      "inventor_name_last": "SUGII",
      "inventor_name_first": "Masato",
      "inventor_city": "Kanagawa",
      "inventor_state": "",
      "inventor_country": "JP"
    },
    {
      "inventor_name_last": "HOSHINO",
      "inventor_name_first": "Haruhisa",
      "inventor_city": "Kanagawa",
      "inventor_state": "",
      "inventor_country": "JP"
    },
    {
      "inventor_name_last": "YAMAGISHI",
      "inventor_name_first": "Daigo",
      "inventor_city": "Kanagawa",
      "inventor_state": "",
      "inventor_country": "JP"
    }
  ],
  "ipcr_labels": [
    "H04N100",
    "G06F2131",
    "H04N144"
  ],
  "main_ipcr_label": "H04N100",
  "summary": "<SOH> SUMMARY <EOH>According to an aspect of the invention, there is provided an authentication control apparatus including a first authenticating unit, a second authenticating unit, a controller, and an outputting unit. The first authenticating unit performs first authentication using authentication information stored in association with a memory area. The second authenticating unit performs second authentication using authentication information stored in association with a user. The controller performs control to perform one of authentication operations that are the first authentication and the second authentication when the user uses the memory area. The outputting unit outputs information if the one of the authentication operations performed under the control of the controller does not succeed. The information prompts the user to input authentication information to be used in an authentication operation performed when the user uses the memory area.",
  "patent_number": "None",
  "abstract": "An authentication control apparatus includes a first authenticating unit, a second authenticating unit, a controller, and an outputting unit. The first authenticating unit performs first authentication using authentication information stored in association with a memory area. The second authenticating unit performs second authentication using authentication information stored in association with a user. The controller performs control to perform one of authentication operations that are the first authentication and the second authentication when the user uses the memory area. The outputting unit outputs information if the one of the authentication operations performed under the control of the controller does not succeed. The information prompts the user to input authentication information to be used in an authentication operation performed when the user uses the memory area.",
  "publication_number": "US20170353616A1-20171207",
  "_processing_info": {
    "original_size": 73685,
    "optimized_size": 3044,
    "reduction_percent": 95.87
  }
}