{
  "decision": "REJECTED",
  "application_number": "15343592",
  "date_published": "20170223",
  "date_produced": "20170208",
  "title": "METHODS FOR USING A SPEECH TO OBTAIN ADDITIONAL INFORMATION",
  "filing_date": "20161104",
  "inventor_list": [
    {
      "inventor_name_last": "Fish",
      "inventor_name_first": "Robert D.",
      "inventor_city": "Tustin",
      "inventor_state": "CA",
      "inventor_country": "US"
    }
  ],
  "ipcr_labels": [
    "G06F1728",
    "H04M127"
  ],
  "main_ipcr_label": "G06F1728",
  "summary": "<SOH> SUMMARY OF THE INVENTION <EOH>The present invention provides systems and methods in which an item of information is transmitted to a distal computer, translated to a different sense modality and/or language, and in substantially real time, and the translation is transmitted back to the location from which the item was sent. The device sending the item is preferably a wireless device, and more preferably a cellular or other telephone. The device receiving the translation is also preferably a wireless device, and more preferably a cellular or other telephone, and may advantageously be the same device as the sending device. The item of information preferably comprises a sentence of human speech having at least ten words, and the translation is a written expression of the sentence. All of the steps of transmitting the item of information, executing the program code, and transmitting the translated information preferably occurs in less than 60 seconds of elapsed time, and more preferably less than 30 seconds. Various objects, features, aspects and advantages of the present invention will become more apparent from the following detailed description of preferred embodiments of the invention, along with the accompanying drawing.",
  "patent_number": "None",
  "abstract": "An item of information (212) is transmitted to a distal computer (220), translated to a different sense modality and/or language (222), and in substantially real time, and the translation (222) is transmitted back to the location (211) from which the item was sent. The device sending the item is preferably a wireless device, and more preferably a cellular or other telephone (210). The device receiving the translation is also preferably a wireless device, and more preferably a cellular or other telephone, and may advantageously be the same device as the sending device. The item of information (212) preferably comprises a sentence of human of speech having at least ten words, and the translation is a written expression of the sentence. All of the steps of transmitting the item of information, executing the program code, and transmitting the translated information preferably occurs in less than 60 seconds of elapsed time.",
  "publication_number": "US20170052951A1-20170223",
  "_processing_info": {
    "original_size": 39131,
    "optimized_size": 2735,
    "reduction_percent": 93.01
  }
}