{
  "date_produced": "20180503",
  "publication_number": "US20180137420A1-20180517",
  "main_ipcr_label": "G06N502",
  "decision": "PENDING",
  "application_number": "15349119",
  "inventor_list": [
    {
      "inventor_name_last": "Byron",
      "inventor_name_first": "Donna K.",
      "inventor_city": "Petersham",
      "inventor_state": "MA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Johnson",
      "inventor_name_first": "Benjamin L.",
      "inventor_city": "Baltimore",
      "inventor_state": "MD",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Tecuci",
      "inventor_name_first": "Dan G.",
      "inventor_city": "Austin",
      "inventor_state": "TX",
      "inventor_country": "US"
    }
  ],
  "abstract": "Mechanisms for automatically modifying a set of instructions based on an expanded domain specific knowledge base is provided. The mechanisms generate a domain specific knowledge base comprising a set of entities and corresponding domain specific attributes and expand the domain specific knowledge base to include values for the domain specific attributes through an automated bootstrap learning process that performs natural language processing and analysis of natural language content using a set of pre-condition annotated action terms. The mechanisms receive electronic content comprising an initial set of instructions to perform an operation and evaluate the initial set of instructions based on the expanded domain specific knowledge base to identify a missing instruction. The mechanisms modify the initial set of instructions to include an additional instruction based on the missing instruction and thereby generate a modified set of instructions.",
  "filing_date": "20161111",
  "patent_number": "None",
  "summary": "<SOH> SUMMARY <EOH>This Summary is provided to introduce a selection of concepts in a simplified form that are further described herein in the Detailed Description. This Summary is not intended to identify key factors or essential features of the claimed subject matter, nor is it intended to be used to limit the scope of the claimed subject matter. In one illustrative embodiment, a method in a data processing system includes a processor and a memory accessible by the processor, for automatically modifying a set of instructions based on an expanded domain specific knowledge base is provided. The method comprises generating, by the data processing system, a domain specific knowledge base comprising a set of entities and corresponding domain specific attributes. The method also comprises expanding, by the data processing system, the domain specific knowledge base to include values for the domain specific attributes through an automated bootstrap learning process that performs natural language processing and analysis of natural language content using a set of pre-condition annotated action terms, thereby generating an expanded domain specific knowledge base. Moreover, the method comprises receiving, by the data processing system, electronic content comprising an initial set of instructions to perform an operation and evaluating, by the data processing system, the initial set of instructions, based on the expanded domain specific knowledge base, to identify at least one missing instruction that should be present in the initial set of instructions but is not present. In addition, the method comprises identifying, by the data processing system, one or more additional instructions for insertion into the initial set of instructions to perform actions to satisfy a requirement of the at least one missing instruction. Furthermore, the method comprises modifying, by the data processing system, the initial set of instructions to include the one or more additional instructions and...",
  "date_published": "20180517",
  "title": "Modifying a Set of Instructions Based on Bootstrapped Knowledge Acquisition from a Limited Knowledge Domain",
  "ipcr_labels": [
    "G06N502",
    "G06F1728"
  ],
  "_processing_info": {
    "original_size": 205413,
    "optimized_size": 3863,
    "reduction_percent": 98.12
  }
}