{
  "date_produced": "20170427",
  "publication_number": "US20170132512A1-20170511",
  "main_ipcr_label": "G06N308",
  "decision": "PENDING",
  "application_number": "15343458",
  "inventor_list": [
    {
      "inventor_name_last": "Ioffe",
      "inventor_name_first": "Sergey",
      "inventor_city": "Mountain View",
      "inventor_state": "CA",
      "inventor_country": "US"
    }
  ],
  "abstract": "Methods, systems, and apparatus, including computer programs encoded on computer storage medium, for training a neural network, wherein the neural network is configured to receive an input data item and to process the input data item to generate a respective score for each label in a predetermined set of multiple labels. The method includes actions of obtaining a set of training data that includes a plurality of training items, wherein each training item is associated with a respective label from the predetermined set of multiple labels; and modifying the training data to generate regularizing training data, comprising: for each training item, determining whether to modify the label associated with the training item, and changing the label associated with the training item to a different label from the predetermined set of labels, and training the neural network on the regularizing data.",
  "filing_date": "20161104",
  "patent_number": "None",
  "summary": "<SOH> SUMMARY <EOH>Aspects of the present disclosure are directed towards improving the performance of a trained neural network by reducing overfitting. According to one innovative aspect of the present disclosure, a method of training a neural network is described, wherein the neural network is configured to receive an input data item and to process the input data item to generate a respective score for each label in a predetermined set of multiple labels. The method may include the actions of obtaining a set of training data that includes a plurality of training items, wherein each training item is associated with a respective label from the predetermined set of multiple labels and modifying the training data to generate regularizing training data that regularizes the training of the neural network. The action of modifying may include, for each training item, determining whether or not to modify the label associated with the training item, and in response to determining to modify the label associated with the training item, changing the label associated with the training item to a different label from the predetermined set of labels, and training the neural network on the regularizing data. In accordance with various innovative aspects of the disclosure, overfitting may be reduced by using a regularizing data set to train the neural network, thereby to improve the performance of the trained neural network. The regularizing data set may be generated by introducing a predetermined amount of noise into the labels of a training data set, for example, by modifying one or more labels associated with training data items in the training data set. The training data items may comprise training images. Other aspects include corresponding systems, apparatus, and computer programs to perform the actions of methods, encoded on computer storage devices. For a system of one or more computers to be configured to perform particular operations or actions means that the system has in...",
  "date_published": "20170511",
  "title": "REGULARIZING MACHINE LEARNING MODELS",
  "ipcr_labels": [
    "G06N308",
    "G06N304"
  ],
  "_processing_info": {
    "original_size": 62896,
    "optimized_size": 3439,
    "reduction_percent": 94.53
  }
}