{
  "decision": "PENDING",
  "application_number": "15345153",
  "date_published": "20170223",
  "date_produced": "20170208",
  "title": "Input Device Attachment",
  "filing_date": "20161107",
  "inventor_list": [
    {
      "inventor_name_last": "Longo",
      "inventor_name_first": "Thomas J.",
      "inventor_city": "Redmond",
      "inventor_state": "WA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Hill",
      "inventor_name_first": "Andrew William",
      "inventor_city": "Redmond",
      "inventor_state": "WA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Lee",
      "inventor_name_first": "Eugene",
      "inventor_city": "Seattle",
      "inventor_state": "WA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Wise",
      "inventor_name_first": "James H.",
      "inventor_city": "Valparaiso",
      "inventor_state": "IN",
      "inventor_country": "US"
    }
  ],
  "ipcr_labels": [
    "H04M102",
    "G06F116"
  ],
  "main_ipcr_label": "H04M102",
  "summary": "<SOH> SUMMARY <EOH>Input device attachment techniques are described. In one or more implementations, a device includes a portion (e.g., an input portion or cover) is configured to be positioned over a display device of a computing device to cover the display device. The device also includes a spine (e.g., a mid-spine) that is physically attached to the portion in a manner that supports rotational movement of the portion in relation to the display device. The physical attachment of the spine is configured to be removable using a magnetic coupling between the spine and a surface of the computing device that includes the display device. In one or more implementations, an input device includes an input portion configured to generate signals to be processed by a computing device and a mid-spine that is physically attached to the input portion and configured to form a removable physical coupling to be secured to a first side of the computing device that includes a display device. The input device also includes a connection portion that is physically attached the mid-spine and is configured to form a removable physical coupling to be secured to a second side of the computing device that is different than the first side and form a communicative coupling to the computing device to communicate the generated signals from the input portion. In one or more implementations, an input device includes an input portion configured to generate signals to be processed by a computing device, a mid-spine that is physically attached to the input portion using a flexible hinge and configured to form a removable physical coupling to be secured to a first side of the computing device, and a connection portion that is physically attached the mid-spine using a flexible hinge. The connection portion is configured to form a removable physical coupling to be secured to a second side of the computing device and form a communicative coupling to the computing device to communicate the generated signa...",
  "patent_number": "None",
  "abstract": "Input device attachment techniques are described. In one or more implementations, a device includes a portion (e.g., an input portion or cover) is configured to be positioned over a display device of a computing device to cover the display device. The device also includes a spine (e.g., a mid-spine) that is physically attached to the portion in a manner that supports rotational movement of the portion in relation to the display device. The physical attachment of the spine is configured to be removable using a magnetic coupling between the spine and a surface of the computing device that includes the display device.",
  "publication_number": "US20170054834A1-20170223",
  "_processing_info": {
    "original_size": 65957,
    "optimized_size": 3586,
    "reduction_percent": 94.56
  }
}