{
  "date_produced": "20180411",
  "publication_number": "US20180114141A1-20180426",
  "main_ipcr_label": "G06N9900",
  "decision": "PENDING",
  "application_number": "15347801",
  "inventor_list": [
    {
      "inventor_name_last": "TSENG",
      "inventor_name_first": "Hsiao-Chien",
      "inventor_city": "Yilan County",
      "inventor_state": "",
      "inventor_country": "TW"
    },
    {
      "inventor_name_last": "CHIANG",
      "inventor_name_first": "Chieh-Feng",
      "inventor_city": "Taoyuan City",
      "inventor_state": "",
      "inventor_country": "TW"
    },
    {
      "inventor_name_last": "SU",
      "inventor_name_first": "Jun-Ming",
      "inventor_city": "Hsinchu County",
      "inventor_state": "",
      "inventor_country": "TW"
    }
  ],
  "abstract": "The present disclosure provides a planning method for learning applied to a planning system for learning, and the planning system for learning includes a storage, a monitor and a processor. The planning method for learning includes the following steps: recording learning information of a plurality of subjects and storing the learning information in the storage via the monitor; calculating weighting parameters of the subjects according to the learning information and calculating weighting scores of the subjects according to the weighting parameters via the processor; and performing a fuzzy process to the weighting scores via the processor to transform the weighting scores into score levels of the subjects, so as to establish a learning sequence of the subjects to establish a learning plan.",
  "filing_date": "20161110",
  "patent_number": "None",
  "summary": "<SOH> SUMMARY <EOH>A planning method for learning applied to a planning system for learning is provided, and the planning system for learning comprises a storage, a monitor, and a processor. The planning method for learning comprises the following steps: recording learning information of a plurality of subjects and storing the learning information in the storage via the monitor; calculating weighting parameters of the subjects according to the learning information and calculating weighting scores of the subjects according to the weighting parameters via the processor; and performing a fuzzy process to the weighing scores via the processor to transform the weighting scores into score levels of the subjects so as to establish a learning sequence of the subjects to establish a learning plan. The disclosure provides a planning system for learning. The planning system for learning comprises a storage, a monitor, and a processor. The monitor is configured to record learning information of a plurality of subjects and store the learning information in the storage. The processor is configured to calculate weighting parameters of the subjects according to the learning information and calculate weighting scores of the subjects according to the weighting parameters. The processor performs a fuzzy process to the weighing scores to transform the weighting scores into score levels of the subjects so as to establish a learning sequence of the subjects to establish a learning plan. In summary, the technical solution of the present disclosure has obvious advantages and beneficial effects as compared with the prior art. Through the above technical solution, considerable advances in technology and extensive industrial applicability can be achieved. The planning method for learning and planning system for learning according to the present disclosure calculate the weighing parameters and the weighting scores according to the learning information, and perform a fuzzy process to transform ...",
  "date_published": "20180426",
  "title": "PLANNING METHOD FOR LEARNING AND PLANNING SYSTEM FOR LEARNING WITH AUTOMATIC MECHANISM OF GENERATING PERSONALIZED LEARNING PATH",
  "ipcr_labels": [
    "G06N9900",
    "G06N702"
  ],
  "_processing_info": {
    "original_size": 34684,
    "optimized_size": 3733,
    "reduction_percent": 89.24
  }
}