{
  "decision": "PENDING",
  "application_number": "15349936",
  "date_published": "20170511",
  "date_produced": "20170427",
  "title": "DASHBOARD INTERFACE FOR ACCOUNT MANAGEMENT",
  "filing_date": "20161111",
  "inventor_list": [
    {
      "inventor_name_last": "Rogers",
      "inventor_name_first": "Paul",
      "inventor_city": "Los Angeles",
      "inventor_state": "CA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Woolner",
      "inventor_name_first": "Kurt",
      "inventor_city": "Los Angeles",
      "inventor_state": "CA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Aarts",
      "inventor_name_first": "Robbert",
      "inventor_city": "Leiden",
      "inventor_state": "",
      "inventor_country": "NL"
    }
  ],
  "ipcr_labels": [
    "G06Q4000",
    "G06F1730",
    "G06Q2010"
  ],
  "main_ipcr_label": "G06Q4000",
  "summary": "<SOH> BRIEF DESCRIPTION OF THE DRAWINGS <EOH>The invention may be better understood by reference to the detailed description when considered in connection with the accompanying drawings. The components in the figures are not necessarily to scale, emphasis instead being placed upon illustrating the principles of the invention. In the figures, like reference numerals designate corresponding parts throughout the different views. FIG. 1 illustrates a block diagram of a system in accordance with example embodiments. FIG. 2 depicts an a dashboard graphical user interface in accordance with example embodiments. FIG. 3 depicts a new virtual subaccount creation screen in accordance with example embodiments. FIG. 4 depicts an updated new virtual subaccount creation screen in accordance with example embodiments. FIG. 5 depicts a virtual subaccount details message in accordance with example embodiments. FIG. 6 illustrates a flow diagram of a method in accordance with example embodiments. detailed-description description=\"Detailed Description\" end=\"lead\"? Persons of ordinary skill in the art may appreciate that elements in the figures are illustrated for simplicity and clarity so not all connections and options have been shown to avoid obscuring the inventive aspects. For example, common but well-understood elements that are useful or necessary in a commercially feasible embodiment are not often depicted in order to facilitate a less obstructed view of these various embodiments of the present disclosure. It may be further appreciated that certain actions and/or steps may be described or depicted in a particular order of occurrence while those skilled in the art may understand that such specificity with respect to sequence is not actually required. It may also be understood that the terms and expressions used herein are to be defined with respect to their corresponding respective areas of inquiry and study except where specific meanings have otherwise been set forth herein.",
  "patent_number": "None",
  "abstract": "A system for generating a flexible business-to-business virtual subaccount structure for a primary account. A dashboard server receives information of a primary account and generates a GUI to a user for monitoring expenditures. The dashboard server receives input from the user for creating two or more virtual subaccounts of the primary account. Information of the virtual subaccounts is stored in an account record database. The GUI displays information from the virtual subaccounts. The dashboard server monitors the virtual subaccounts based on rules established or assigned by the user. The dashboard server provides alerts to the user if any threshold of the rules is met or exceeded and may disable the virtual subaccounts if permitted.",
  "publication_number": "US20170132719A1-20170511",
  "_processing_info": {
    "original_size": 48680,
    "optimized_size": 3585,
    "reduction_percent": 92.64
  }
}