{
  "decision": "PENDING",
  "application_number": "15342911",
  "date_published": "20170504",
  "date_produced": "20170419",
  "title": "SYSTEMS AND METHODS FOR CONTROLLING ACCESS TO PHYSICAL SPACE",
  "filing_date": "20161103",
  "inventor_list": [
    {
      "inventor_name_last": "SCHOENFELDER",
      "inventor_name_first": "Luke Andrew",
      "inventor_city": "Willow Street",
      "inventor_state": "PA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "JONES",
      "inventor_name_first": "Michael Brian",
      "inventor_city": "Pittsburgh",
      "inventor_state": "PA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "MEYERHOFFER",
      "inventor_name_first": "Thomas",
      "inventor_city": "Montara",
      "inventor_state": "CA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "HUSSAIN",
      "inventor_name_first": "Ali Akbar",
      "inventor_city": "Plymouth",
      "inventor_state": "MN",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "SOLE",
      "inventor_name_first": "Ivan Almaral",
      "inventor_city": "New York",
      "inventor_state": "NY",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "HOLT",
      "inventor_name_first": "Travis",
      "inventor_city": "Brooklyn",
      "inventor_state": "NY",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "GRISZBACHER",
      "inventor_name_first": "James",
      "inventor_city": "Brooklyn",
      "inventor_state": "NY",
      "inventor_country": "US"
    }
  ],
  "ipcr_labels": [
    "G07C900",
    "G06F2134",
    "G06K708",
    "G06F2131"
  ],
  "main_ipcr_label": "G07C900",
  "summary": "<SOH> SUMMARY <EOH>Systems and methods for an access control system are provided. According to embodiments, a method for using a smart access control reader in an access control system can include installing the smart access control reader to the access control system, by connecting the smart access control reader to the access control system via wiring of the access control system. The method can also include receiving, by the smart access control reader, one or more first credentials for authenticating one or more users by the access control system. The method can also include determining, by the smart access control reader, that the one or more first credentials are authorized. The method can also include transmitting, by the smart access control reader, a second credential to an access control panel of the access control system, in response to a request by a first user to access an area monitored by the access control system. According to embodiments, the one or more first credentials can include the second credential. According to embodiments, the second credential can be different from the one or more first credentials. According to embodiments, the method can further include transmitting, by the access control panel, instructions to an electronic locking mechanism to activate a relay to provide access to the first user, in response to receiving the second credential. According to embodiments, the one or more first credentials can be received using at least one of a magnetic stripe reader system, a proximity reader system, an radio-frequency identification (RFID) system, an access code system, and a biometric verification system. According to embodiments, the determining, by the smart access control reader, that the one or more first credentials are authorized can include comparing the one or more first credentials against a list of authorized credentials stored in a database. The determining, by the smart access control reader, that the one or more first cred...",
  "patent_number": "None",
  "abstract": "Disclosed systems and methods relate to a smart access control reader for an access control system. According to embodiments, a method can include installing the smart access control reader to the access control system by connecting the smart access control reader to the access control system via wiring of the access control system. The method can also include receiving, by the smart access control reader, one or more first credentials for authenticating one or more users by the access control system. The method can further include determining, by the smart access control reader, that the one or more first credentials are authorized. Moreover, the method can include transmitting, by the smart access control reader, a second credential to an access control panel of the access control system, in response to a request by a first user to access an area monitored by the access control system.",
  "publication_number": "US20170124792A1-20170504",
  "_processing_info": {
    "original_size": 77611,
    "optimized_size": 4397,
    "reduction_percent": 94.33
  }
}