{
  "date_produced": "20180425",
  "publication_number": "US20180129941A1-20180510",
  "main_ipcr_label": "G06N502",
  "decision": "PENDING",
  "application_number": "15347887",
  "inventor_list": [
    {
      "inventor_name_last": "Gustafson",
      "inventor_name_first": "Steven Matt",
      "inventor_city": "Niskayuna",
      "inventor_state": "NY",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Aggour",
      "inventor_name_first": "Kareem Sherif",
      "inventor_city": "Niskayuna",
      "inventor_state": "NY",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Cuddihy",
      "inventor_name_first": "Paul Edward",
      "inventor_city": "Ballston Lake",
      "inventor_state": "NY",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Gabaldon Royval",
      "inventor_name_first": "Alfredo",
      "inventor_city": "Clifton Park",
      "inventor_state": "NY",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "McHugh",
      "inventor_name_first": "Justin DeSpenza",
      "inventor_city": "Latham",
      "inventor_state": "NY",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Ng Tari",
      "inventor_name_first": "Luis Babaji",
      "inventor_city": "Nashua",
      "inventor_state": "NH",
      "inventor_country": "US"
    }
  ],
  "abstract": "Some embodiments are directed to systems for authoring predictive models. An embodiment includes a computer system implementing a development environment for generating predictive models. The predictive model authoring tool is configured to perform a modeling operation based on one or more user inputs provided to interface controls of the predictive model authoring tool, determine a modeling context for the modeling operation, log the one or more user inputs, generate a predictive model based on one or more model parameters defined during the modeling operation, link the predictive model to an asset, such that one or more sets of data received from the asset are provided to the predictive model during execution of the predictive model, cause the predictive model to be executed such that the predictive model receives data from the asset, and provide the modeling context, the one or more user inputs, and the one or more model parameters.",
  "filing_date": "20161110",
  "patent_number": "None",
  "summary": "<SOH> SUMMARY <EOH>Some embodiments generally relate to methods and systems for providing improved capture and usage of knowledge during predictive model authoring operations. Embodiments include authoring tools that capture information related to the type of asset being modeled, components and subcomponents of that asset, features of the sensor data, particular data analysis and modeling techniques applied to those features, and other aspects of a predictive model authoring process. This captured information is mapped to particular tasks of a predictive model authoring process such that knowledge about the authoring of that predictive model is captured. This knowledge is indexed in a manner so as to facilitate further predictive modeling authoring operations. An embodiment provides a computer system implementing a development environment for generating predictive models using model parameters provided by a predictive model authoring tool. The system includes the predictive model authoring tool. The predictive model authoring tool is configured to perform a modeling operation based on one or more user inputs provided to interface controls of the predictive model authoring tool, determine a modeling context for the modeling operation, log the one or more user inputs, generate a predictive model based on one or more model parameters defined during the modeling operation, link the predictive model to an asset, such that one or more sets of data received from the asset are provided to the predictive model during execution of the predictive model, cause the predictive model to be executed such that the predictive model receives data from the asset, provide the modeling context, the one or more user inputs, and the one or more model parameters to a model development context analyzer, receiving, from the model development context analyzer, derived modeling knowledge, the derived modeling knowledge based at least in part on the provided modeling context, the one or more use...",
  "date_published": "20180510",
  "title": "METHODS AND SYSTEMS FOR CAPTURING ANALYTIC MODEL AUTHORING KNOWLEDGE",
  "ipcr_labels": [
    "G06N502",
    "G06F1730"
  ],
  "_processing_info": {
    "original_size": 122500,
    "optimized_size": 4300,
    "reduction_percent": 96.49
  }
}