{
  "date_produced": "20170214",
  "publication_number": "US20170061299A1-20170302",
  "main_ipcr_label": "G06N504",
  "decision": "PENDING",
  "application_number": "15345843",
  "inventor_list": [
    {
      "inventor_name_last": "MEWES",
      "inventor_name_first": "JOHN J.",
      "inventor_city": "MAYVILLE",
      "inventor_state": "ND",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "SALENTINY",
      "inventor_name_first": "DUSTIN M.",
      "inventor_city": "GRAND FORKS",
      "inventor_state": "ND",
      "inventor_country": "US"
    }
  ],
  "abstract": "A modeling framework for evaluating the impact of weather conditions on farming and harvest operations applies real-time, field-level weather data and forecasts of meteorological and climatological conditions together with user-provided and/or observed feedback of a present state of a harvest-related condition to agronomic models and to generate a plurality of harvest advisory outputs for precision agriculture. A harvest advisory model simulates and predicts the impacts of this weather information and user-provided and/or observed feedback in one or more physical, empirical, or artificial intelligence models of precision agriculture to analyze crops, plants, soils, and resulting agricultural commodities, and provides harvest advisory outputs to a diagnostic support tool for users to enhance farming and harvest decision-making, whether by providing pre-, post-, or in situ-harvest operations and crop analyses.",
  "filing_date": "20161108",
  "patent_number": "None",
  "summary": "<SOH> BRIEF SUMMARY OF THE INVENTION <EOH>It is therefore one objective of the present invention to provide a system and method of applying real-time assessments of weather conditions to precision agriculture models for enhancing harvest operations. It is another objective to combine real-time and location-tagged data communication in farm operations with such real-time assessments of weather conditions for generating harvest advisory information in precision agriculture. It is still another objective of the present invention to combine user-provided and/or observed feedback of a present state of a harvest-related condition with real-time assessments of weather conditions for generating harvest advisory information in precision agriculture. It is yet another objective of the present invention to provide a diagnostic support tool for enhanced decision-making in harvest operations. There are many other specific objectives of the present invention. One such objective is to provide a system and method of predicting dry-down of a crop over time, such as a mature small grain, coarse grain, or oilseed crop, for planning the timing of harvest operations. It is another such objective of the present invention to provide a system and method of predicting the time-varying unit costs, per percent moisture per unit of mass or volume, associated with fuel-based or forced-air mechanical drying of crops resulting from changing weather conditions and the characteristics of the drying facility. Yet another objective of the present invention is to provide a system and method of predicting the time-varying unit costs, per unit of mass or volume, associated with the combined impacts of time-varying grain moisture levels of a crop to be harvested and the time-varying unit costs per percent moisture per unit of mass or volume of forced-air or fuel-based mechanical drying. It is another objective to provide tools for assessing a risk of delayed harvest operations to achieve favorable crop m...",
  "date_published": "20170302",
  "title": "PREDICTION OF IN-FIELD DRY-DOWN OF A MATURE SMALL GRAIN, COARSE GRAIN, OR OILSEED CROP USING FIELD-LEVEL ANALYSIS AND FORECASTING OF WEATHER CONDITIONS AND CROP CHARACTERISTICS INCLUDING SAMPLED MOISTURE CONTENT",
  "ipcr_labels": [
    "G06N504",
    "A01G2516",
    "A01D9100",
    "A01G100",
    "G01W110",
    "G06F1750"
  ],
  "_processing_info": {
    "original_size": 104955,
    "optimized_size": 3833,
    "reduction_percent": 96.35
  }
}