{
  "decision": "PENDING",
  "application_number": "15346285",
  "date_published": "20180510",
  "date_produced": "20180425",
  "title": "DETERMINING THE SIGNIFICANCE OF AN EVENT IN THE CONTEXT OF A NATURAL LANGUAGE QUERY",
  "filing_date": "20161108",
  "inventor_list": [
    {
      "inventor_name_last": "Chandrasekaran",
      "inventor_name_first": "Swaminathan",
      "inventor_city": "Coppell",
      "inventor_state": "TX",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Kozhaya",
      "inventor_name_first": "Joseph N.",
      "inventor_city": "Morrisville",
      "inventor_state": "NC",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Krishnamurthy",
      "inventor_name_first": "Lakshminarayanan",
      "inventor_city": "Round Rock",
      "inventor_state": "TX",
      "inventor_country": "US"
    }
  ],
  "ipcr_labels": [
    "G06F1730"
  ],
  "main_ipcr_label": "G06F1730",
  "summary": "<SOH> BRIEF SUMMARY <EOH>According to this disclosure, a method, apparatus and computer program product for searching for a set of significant events in a corpus. A knowledge graph is built based on a selected corpus stored in the computer system. The selected corpus is comprised of a set of events and each event includes a respective set of entities. A natural language query (NLQ) is input into the search system. A first set of entities is identified in the NLQ. The first set of entities is used to identify a first set of significant events in the selected corpus in a first search depth. A second set of entities is identified in the first set of significant events. The knowledge graph is used to determine which ones of the second set of entities are related to the entities in the first set of entities to produce a filtered second set of entities. The filtered second set of entities is used to identify a second set of significant events in the selected corpus in a second search depth. Members of the first and second set of significant events are presented to a user. The foregoing has outlined some of the more pertinent features of the disclosed subject matter. These features should be construed to be merely illustrative. Many other beneficial results can be attained by applying the disclosed subject matter in a different manner or by modifying the invention as will be described.",
  "patent_number": "None",
  "abstract": "A knowledge graph is built based on a corpus stored in the computer system. The corpus includes a set of events and each event includes a respective set of entities. A first set of entities is identified in the NLQ. The first set of entities is used to identify a first set of significant events in the selected corpus in a first search depth. A second set of entities is identified in the first set of significant events. The knowledge graph determines which ones of the second set of entities are related to the entities in the first set of entities to produce a filtered second set of entities. The filtered second set of entities is used to identify a second set of significant events in the selected corpus in a second search depth. Members of the first and second set of significant events are presented to a user.",
  "publication_number": "US20180129704A1-20180510",
  "_processing_info": {
    "original_size": 69439,
    "optimized_size": 3121,
    "reduction_percent": 95.51
  }
}