{
  "decision": "PENDING",
  "application_number": "15348798",
  "date_published": "20180510",
  "date_produced": "20180425",
  "title": "SYSTEM, METHOD AND APPARATUS FOR DIRECTED LED DISPLAY",
  "filing_date": "20161110",
  "inventor_list": [
    {
      "inventor_name_last": "Qian",
      "inventor_name_first": "Cheng",
      "inventor_city": "Oakville",
      "inventor_state": "",
      "inventor_country": "CA"
    },
    {
      "inventor_name_last": "Murdoch",
      "inventor_name_first": "Graham",
      "inventor_city": "Mississauga",
      "inventor_state": "",
      "inventor_country": "CA"
    }
  ],
  "ipcr_labels": [
    "G09F933",
    "F21V1106",
    "G06F1750"
  ],
  "main_ipcr_label": "G09F933",
  "summary": "<SOH> SUMMARY OF THE INVENTION <EOH>In one aspect, the present disclosure relates to a LED light display apparatus comprising: a printed circuit board (PCB) positioned; one or more LED diodes connected to the PCB; one or more blocking elements, each of the one or more blocking elements being positioned proximate to at least one of the one or more LED diodes, whereby light emitted from one or more LED diodes is blocked in at least one direction; and whereby light emitted from the LED light display apparatus is blocked in at least one direction at a range of angles from the front of the LED light display apparatus in such direction, and said light being viewable as one or more images providing information to a viewer. The LED light display apparatus further comprising three or more viewing regions in the area surrounding the LED light display apparatus, including at least the following: a first viewing region that is in front of the LED light display apparatus and within a range of angles from the front of the LED light display apparatus wherein light emission from the LED light display apparatus is visible by a viewer; a second viewing region that is within a range of angles from the front of the LED light display apparatus that is farther from the front of LED light display apparatus than the first viewing region, wherein light emission from the LED light display apparatus is diminished; and a third viewing region that is within a range of angles from the front of the LED light display apparatus that is farther from the front of the LED light display apparatus than the second viewing region, wherein light emission from the LED light display apparatus is eradicated or nearly-eradicated. The LED light display apparatus further comprising at least one of the one or more blocking elements being horizontally light blocking louvers. The LED light display apparatus further comprising the one or more blocking elements configured to incorporate a section attachable to the PC...",
  "patent_number": "None",
  "abstract": "The present invention is an optical LED light display incorporating one or more louvers operable to limit the light emission in a specified direction from a LED diode within the LED light display, each louvers being positioned in relation to each LED light element in the LED light display. The specified direction of the light emission may be towards a target audience or a target direction. A method of the present invention that may be implemented by a software program processed by computer processors of a computer device, may be operable to enable the design of the LED display louver for installation in a specific area to enable simultaneous elimination of light trespass and preservation of image quality for the target audience. A LED light display can be manufactured, configured and installed in accordance with the method.",
  "publication_number": "US20180130385A1-20180510",
  "_processing_info": {
    "original_size": 158378,
    "optimized_size": 3543,
    "reduction_percent": 97.76
  }
}