{
  "decision": "PENDING",
  "application_number": "15342803",
  "date_published": "20180503",
  "date_produced": "20180418",
  "title": "System and Method for Recommending Products to Bridge Gaps Between Desired and Actual Personal Branding",
  "filing_date": "20161103",
  "inventor_list": [
    {
      "inventor_name_last": "Akkiraju",
      "inventor_name_first": "Rama K.",
      "inventor_city": "Cupertino",
      "inventor_state": "CA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Liu",
      "inventor_name_first": "Haibin",
      "inventor_city": "San Jose",
      "inventor_state": "CA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Mahmud",
      "inventor_name_first": "Jalal U.",
      "inventor_city": "San Jose",
      "inventor_state": "CA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Sinha",
      "inventor_name_first": "Vibha S.",
      "inventor_city": "Santa Clara",
      "inventor_state": "CA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Xu",
      "inventor_name_first": "Anbang",
      "inventor_city": "San Jose",
      "inventor_state": "CA",
      "inventor_country": "US"
    }
  ],
  "ipcr_labels": [
    "G06Q3006",
    "G06F1730"
  ],
  "main_ipcr_label": "G06Q3006",
  "summary": "<SOH> SUMMARY <EOH>Broadly speaking, selected embodiments of the present disclosure provide a recommendation system, method, and apparatus for enabling personal branding by obtaining actual personal brand information input for a user (in terms of how the user is actually perceived by others) and desired personal brand information input from the user (in terms of how the user wishes to be perceived by others) which is then manipulated in vector form to identify any gaps between the actual and desired brand information and to recommend one or more products which bridge the identified personal brand gaps. In selected embodiments, the user's desired personal brand information may be quantified in a data structure defining a hierarchical structure of multiple main goals, each of which consists of one or more sub-goals. With this data structure for the user's desired personal brand information, the recommendation system can consider the relationship among different goals to generate more meaningful product recommendations that help users build and maintain a more consistent personal image (e.g., when a user's goals contradict each other). This data structure for the user's desired personal brand information may also enable users to act on a representative image level (as opposed to the individual goals level) to help users to reduce the cognitive load and make more accurate decisions. In selected embodiments, the recommendation system may be implemented with a computational model which computes the gaps between a user's desired and actual brand imagery and which uses brand imagery for individual products to identify individual product candidates which correlate to the gaps in the user's desired personal brand imagery, where combinations of the product candidates may be optimized for recommendation to the user based on the interaction effects among brand imagery for the individual products. In addition or in the alternative, a browser-based product recommendation interface...",
  "patent_number": "None",
  "abstract": "A method, system and a computer program product are provided for making product recommendations to improve a user's personal brand by using the symbolic meanings and utilities of products and a user's brand perceptions along with users input of a desired personal brand imagery to output a set of products that are optimized to help users bridge the gaps between their desired and actual self-brand, thereby enabling a user to navigate products that shape their personal imagery.",
  "publication_number": "US20180121986A1-20180503",
  "_processing_info": {
    "original_size": 99690,
    "optimized_size": 3671,
    "reduction_percent": 96.32
  }
}