{
  "date_produced": "20170214",
  "publication_number": "US20170061317A1-20170302",
  "main_ipcr_label": "G06N9900",
  "decision": "PENDING",
  "application_number": "15347160",
  "inventor_list": [
    {
      "inventor_name_last": "Chow",
      "inventor_name_first": "Jerry M.",
      "inventor_city": "White Plains",
      "inventor_state": "NY",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Gambetta",
      "inventor_name_first": "Jay M.",
      "inventor_city": "Yorktown Heights",
      "inventor_state": "NY",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Rothwell",
      "inventor_name_first": "Mary B.",
      "inventor_city": "Ridgefield",
      "inventor_state": "CT",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Rozen",
      "inventor_name_first": "James R.",
      "inventor_city": "Peekskill",
      "inventor_state": "NY",
      "inventor_country": "US"
    }
  ],
  "abstract": "A technique relates to an assembly for a quantum computing device. A quantum bus plane includes a first set of recesses. A readout plane includes a second set of recesses. A block is positioned to hold the readout plane opposite the quantum bus plane, such that the first set of recesses opposes the second set of recesses. A plurality of qubit chips are included where each has a first end positioned in the first set of recesses and has a second end positioned in the second set of recesses.",
  "filing_date": "20161109",
  "patent_number": "None",
  "summary": "<SOH> SUMMARY <EOH>According to one embodiment, an assembly for a quantum computing device is provided. The assembly includes a quantum bus plane including a first set of recesses, a readout plane including a second set of recesses, and a block positioned to hold the readout plane opposite the quantum bus plane, such that the first set of recesses opposes the second set of recesses. Also, the assembly includes a plurality of qubit chips where each has a first end positioned in the first set of recesses and has a second end positioned in the second set of recesses. According to one embodiment, an assembly for a quantum computing device is provided. The assembly includes a housing configured as an enclosure having a bottom part, a top part, and a block, in which the block connects the top and bottom parts. The assembly includes a quantum bus plane including a first set of recesses, and a readout plane including a second set of recesses. The block is configured to position the readout plane opposite the quantum bus plane, such that the first set of recesses opposes the second set of recesses. Also, the assembly includes a plurality of qubit chips where each has a first end positioned in the first set of recesses and has a second end positioned in the second set of recesses. According to one embodiment, a method of configuring an assembly for a quantum computing device is provided. The method includes providing a housing configured as an enclosure having a bottom part, a top part, and a block, in which the block connects the top and bottom parts. The method includes providing a readout plane having a first set of recesses and a quantum bus plane having a second set of recesses, and assembling the readout plane opposite the quantum bus plane in a block, such that the first set of recesses opposes the second set of recesses. Also, the method includes installing a plurality of qubit chips in the block, where each of the plurality of qubit chips has a first end positioned i...",
  "date_published": "20170302",
  "title": "MODULAR ARRAY OF VERTICALLY INTEGRATED SUPERCONDUCTING QUBIT DEVICES FOR SCALABLE QUANTUM COMPUTING",
  "ipcr_labels": [
    "G06N9900",
    "H01L3924",
    "H01L2504",
    "H01L3922",
    "H01L3904"
  ],
  "_processing_info": {
    "original_size": 68143,
    "optimized_size": 3589,
    "reduction_percent": 94.73
  }
}