{
  "decision": "PENDING",
  "application_number": "15344200",
  "date_published": "20170413",
  "date_produced": "20170329",
  "title": "METHOD AND SYSTEM FOR IDENTIFYING KEYWORDS FOR USE IN PLACING KEYWORD-TARGETED ADVERTISEMENTS",
  "filing_date": "20161104",
  "inventor_list": [
    {
      "inventor_name_last": "Scholl",
      "inventor_name_first": "Nathaniel B.",
      "inventor_city": "Issaquah",
      "inventor_state": "WA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "DeNeui",
      "inventor_name_first": "Alexander W.",
      "inventor_city": "Seattle",
      "inventor_state": "WA",
      "inventor_country": "US"
    }
  ],
  "ipcr_labels": [
    "G06F1730",
    "G06Q3002"
  ],
  "main_ipcr_label": "G06F1730",
  "summary": "<SOH> BRIEF DESCRIPTION OF THE DRAWINGS <EOH>FIG. 1 is a block diagram that illustrates components of the advertisement system in one embodiment. FIG. 2 is a flow diagram that illustrates the processing of the create advertisement sets component in one embodiment. FIG. 3 is a flow diagram that illustrates the processing of the score words component in one embodiment. FIG. 4 is a flow diagram that illustrates the processing of the identify best phrases component in one embodiment. FIG. 5 is a flow diagram that illustrates the processing of the find phrases component in one embodiment. FIG. 6 is a flow diagram that illustrates the processing of the score common phrases component in one embodiment. detailed-description description=\"Detailed Description\" end=\"lead\"?",
  "patent_number": "None",
  "abstract": "A method and system for identifying search terms for placing advertisements along with search results is provided. The advertisement system selects a description of an item that is to be advertised. The advertisement system then retrieves documents that match the selected description. The advertisement system generates a score for each word of the retrieved documents that indicates relatedness of the word to the item to be advertised. After generating the scores for the words, the advertisement system identifies phrases of the words within the documents that are related to the item. The advertisement system then generates search terms for the item to be advertised from the identified phrases. The advertisement system submits the search terms and an advertisement to a search engines service for placement of a paid-for advertisement for the item.",
  "publication_number": "US20170103122A1-20170413",
  "_processing_info": {
    "original_size": 41524,
    "optimized_size": 2381,
    "reduction_percent": 94.27
  }
}