{
  "date_produced": "20180425",
  "publication_number": "US20180129940A1-20180510",
  "main_ipcr_label": "G06N502",
  "decision": "PENDING",
  "application_number": "15346720",
  "inventor_list": [
    {
      "inventor_name_last": "Qian",
      "inventor_name_first": "Zhenghao",
      "inventor_city": "Redwood City",
      "inventor_state": "CA",
      "inventor_country": "US"
    }
  ],
  "abstract": "Systems, methods, and non-transitory computer-readable media can receive an indication that a user of a social networking system has interacted with a first account of the social networking system. A set of potential accounts is compiled based on account similarity criteria indicative of a similarity of each potential account to the first account. The set of potential accounts is ranked based on a machine learning model, and filtered based on filtering criteria. One or more similar account recommendations are presented to the user via a graphical user interface, the one or more similar account recommendations based on the ranking and the filtering.",
  "filing_date": "20161108",
  "patent_number": "None",
  "summary": "<SOH> SUMMARY <EOH>Various embodiments of the present disclosure can include systems, methods, and non-transitory computer readable media configured to receive an indication that a user of a social networking system has interacted with a first account of the social networking system. A set of potential accounts is compiled based on account similarity criteria indicative of a similarity of each potential account to the first account. The set of potential accounts is ranked based on a machine learning model, and filtered based on filtering criteria. One or more similar account recommendations are presented to the user via a graphical user interface, the one or more similar account recommendations based on the ranking and the filtering. In an embodiment, the compiling a set of potential accounts comprises applying an account similarity criteria relating to determination of a historical follow-through rate. In an embodiment, the compiling a set of potential accounts comprises applying an account similarity criteria relating to determination of a historical follow-through rate. In an embodiment, the compiling a set of potential accounts comprises applying an account similarity criteria relating to determination of a historical search co-visitation rate. In an embodiment, each account similarity criterion of the account similarity criteria is associated with a subset of the set of potential accounts. In an embodiment, the machine learning model produces a likelihood that the user will interact with a potential account based on user characteristics of the user. In an embodiment, the filtering criteria comprise a criterion relating to a celebrity account designation. In an embodiment, the filtering criteria comprise a criterion relating to filtering out accounts that the user has already interacted with. In an embodiment, the filtering criteria comprise a criterion relating to filtering out accounts previously recommended to the user as a similar account. In an embodiment, ...",
  "date_published": "20180510",
  "title": "SYSTEMS AND METHODS FOR SIMILAR ACCOUNT DETERMINATION",
  "ipcr_labels": [
    "G06N502",
    "H04L2908",
    "G06F1730"
  ],
  "_processing_info": {
    "original_size": 84318,
    "optimized_size": 3225,
    "reduction_percent": 96.18
  }
}