{
  "date_produced": "20180418",
  "publication_number": "US20180121829A1-20180503",
  "main_ipcr_label": "G06N9900",
  "decision": "PENDING",
  "application_number": "15340548",
  "inventor_list": [
    {
      "inventor_name_last": "Chowdhary",
      "inventor_name_first": "Pawan R.",
      "inventor_city": "San Jose",
      "inventor_state": "CA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Ettl",
      "inventor_name_first": "Markus R.",
      "inventor_city": "Ossining",
      "inventor_state": "NY",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Lederman",
      "inventor_name_first": "Roger D.",
      "inventor_city": "Briarcliff Manor",
      "inventor_state": "NY",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Nonner",
      "inventor_name_first": "Tim",
      "inventor_city": "Zurich",
      "inventor_state": "",
      "inventor_country": "CH"
    },
    {
      "inventor_name_last": "Schimpel",
      "inventor_name_first": "Ulrich B.",
      "inventor_city": "Hirzel",
      "inventor_state": "",
      "inventor_country": "CH"
    },
    {
      "inventor_name_last": "Xue",
      "inventor_name_first": "Zhengliang",
      "inventor_city": "Yorktown Heights",
      "inventor_state": "NY",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Yang",
      "inventor_name_first": "Hongxia",
      "inventor_city": "Sunnyvale",
      "inventor_state": "CA",
      "inventor_country": "US"
    }
  ],
  "abstract": "A machine learning algorithm is trained to learn to cluster a plurality of original-destination routes in a network for transporting cargo into a plurality of clusters based on similarities of the original-destination routes, and to learn to cluster the plurality of clusters into a plurality of subgroups based on customer behavior. Influencing criteria associated with each of the subgroups may be determined and based on the influencing criteria, a price elasticity curve for each of the subgroups may be generated. Based on the price elasticity curve and current network traffic, cargo transportation price associated with each of the subgroups may be determined.",
  "filing_date": "20161101",
  "patent_number": "None",
  "summary": "<SOH> BRIEF SUMMARY <EOH>A method and system of training a machine to automate spot pricing of logistics services may be provided. The method, in one aspect, may include receiving a plurality of original-destination routes in a network for transporting cargo. The method may also include clustering the plurality of original-destination routes into a plurality of clusters based on similarities of the original-destination routes. The method may further include clustering the plurality of clusters into a plurality of subgroups based on customer behavior, wherein a machine learning algorithm is trained to learn to perform the clustering and the steps of clustering are performed by executing the machine learning algorithm. The method may also include determining influencing criteria associated with each of the subgroups. The method may further include, based on the influencing criteria, generating a price elasticity curve for each of the subgroups. The method may also include, based on the price elasticity curve and current network traffic, determining cargo transportation price associated with each of the subgroups. A system of training a machine to automate spot pricing of logistics services, in one aspect, may include at least one hardware processor. A display device may be coupled to the hardware processor. The hardware processor may be operable to receive a plurality of original-destination routes in a network for transporting cargo. The hardware processor may be further operable to learn to train itself to cluster the plurality of original-destination routes into a plurality of clusters based on similarities of the original-destination routes. The hardware processor may be further operable to learn to train itself to cluster the plurality of clusters into a plurality of subgroups based on customer behavior. The hardware processor may be further operable to determine influencing criteria associated with each of the subgroups, and based on the influencing criteria, ge...",
  "date_published": "20180503",
  "title": "TRAINING A MACHINE TO AUTOMATE SPOT PRICING OF LOGISTICS SERVICES IN A LARGE-SCALE NETWORK",
  "ipcr_labels": [
    "G06N9900"
  ],
  "_processing_info": {
    "original_size": 53533,
    "optimized_size": 4144,
    "reduction_percent": 92.26
  }
}