{
  "date_produced": "20180425",
  "publication_number": "US20180129929A1-20180510",
  "main_ipcr_label": "G06N302",
  "decision": "PENDING",
  "application_number": "15347060",
  "inventor_list": [
    {
      "inventor_name_last": "Shigenaka",
      "inventor_name_first": "Ryosuke",
      "inventor_city": "Yokohama",
      "inventor_state": "",
      "inventor_country": "JP"
    },
    {
      "inventor_name_last": "Chen",
      "inventor_name_first": "Yin-Ying",
      "inventor_city": "Sunnyvale",
      "inventor_state": "CA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Chen",
      "inventor_name_first": "Francine",
      "inventor_city": "Menlo Park",
      "inventor_state": "CA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Joshi",
      "inventor_name_first": "Dhiraj",
      "inventor_city": "Ossining",
      "inventor_state": "NY",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Tsuboshita",
      "inventor_name_first": "Yukihiro",
      "inventor_city": "Yokahama",
      "inventor_state": "",
      "inventor_country": "JP"
    }
  ],
  "abstract": "A method of generating a predictive model of categories of venues visited by a user is provided. The method may include extracting a first content feature from a first digital post to an online social media platform selected from a plurality of digital posts, extracting a second content feature from a second digital post to an online social media platform selected from the plurality of social media posts, aggregating the first and second content features, inferring at least one of a frequency and a regularity of visits to a venue category associated with the plurality of digital posts based on the aggregated first and second content features using a neural network, and determining at least one of a frequently visited venue category and a regularly visited venue category based on the inferred frequency and a regularity of visits associated with the plurality of digital posts.",
  "filing_date": "20161109",
  "patent_number": "None",
  "summary": "<SOH> SUMMARY OF THE DISCLOSURE <EOH>Aspects of the present disclosure include a method of generating a predictive model of categories of venues visited by a user. The method includes extracting a first content feature from a first digital post to an online social media platform selected from a plurality of digital posts, extracting a second content feature from a second digital post to an online social media platform selected from the plurality of social media posts, aggregating the first and second content features, inferring at least one of a frequency and a regularity of visits to a venue category associated with the plurality of digital posts based on the aggregated first and second content features using a neural network, and determining at least one of a frequently visited venue category and a regularly visited venue category based on the inferred frequency and a regularity of visits associated with the plurality of digital posts. Additional aspects of the present disclosure include a non-transitory computer readable medium having stored therein a program for making a computer execute a method of generating a predictive model of categories of venues visited by a user. The method includes extracting a first content feature from a first digital post to an online social media platform selected from a plurality of digital posts, extracting a second content feature from a second digital post to an online social media platform selected from the plurality of social media posts, aggregating the first and second content features, inferring at least one of a frequency and a regularity of visits to a venue category associated with the plurality of digital posts based on the aggregated first and second content features using a neural network, and determining at least one of a frequently visited venue category and a regularly visited venue category based on the inferred frequency and a regularity of visits associated with the plurality of digital posts. Additional aspects...",
  "date_published": "20180510",
  "title": "METHOD AND SYSTEM FOR INFERRING USER VISIT BEHAVIOR OF A USER BASED ON SOCIAL MEDIA CONTENT POSTED ONLINE",
  "ipcr_labels": [
    "G06N302",
    "G06F1730"
  ],
  "_processing_info": {
    "original_size": 77399,
    "optimized_size": 4084,
    "reduction_percent": 94.72
  }
}