{
  "decision": "PENDING",
  "application_number": "15359961",
  "date_published": "20180524",
  "date_produced": "20180509",
  "title": "OLED DISPLAY PANEL WITH TOUCH SENSING ELECTRODES",
  "filing_date": "20161123",
  "inventor_list": [
    {
      "inventor_name_last": "LEE",
      "inventor_name_first": "Hsiang-Yu",
      "inventor_city": "New Taipei City",
      "inventor_state": "",
      "inventor_country": "TW"
    },
    {
      "inventor_name_last": "CHIN",
      "inventor_name_first": "Shang",
      "inventor_city": "New Taipei City",
      "inventor_state": "",
      "inventor_country": "TW"
    },
    {
      "inventor_name_last": "LIN",
      "inventor_name_first": "Ping-Tsun",
      "inventor_city": "New Taipei City",
      "inventor_state": "",
      "inventor_country": "TW"
    }
  ],
  "ipcr_labels": [
    "G06F3041",
    "G06F3044",
    "H01L2732",
    "H01L5152"
  ],
  "main_ipcr_label": "G06F3041",
  "summary": "<SOH> SUMMARY OF THE INVENTION <EOH>The object of the present invention is to provide an OLED display panel with touch sensing electrodes capable of significantly increasing the yield rate for integration of the in-cell self-capacitance touch sensing technique into the OLED display, and accurately detecting the touch position, so as to be more suitable for the design of touch panel of OLED display in comparison with the prior art. To achieve the object, there is provided an OLED display panel with touch sensing electrodes, which includes: a common electrode layer having a plurality of through holes defined therein; a display pixel electrode and touch sensing electrode layer including a plurality of display pixel electrodes and a plurality of touch sensing electrodes, wherein each touch sensing electrode has a mesh type pattern; an OLED layer configured between the common electrode layer and the display pixel electrode and touch sensing electrode layer; a lower substrate; a thin film transistor layer disposed at one side of the lower substrate facing the OLED layer; and an encapsulation layer disposed at the other side of the common electrode layer facing the OLED layer, wherein a first power circuit for the touch sensing electrodes is independent to a second power circuit for the OLED display panel.",
  "patent_number": "None",
  "abstract": "An OLED display panel includes a common electrode layer, a display pixel electrode and touch sensing electrode layer, an OLED layer, a lower substrate, a thin film transistor layer, and an encapsulation layer. The common electrode layer has plural through holes defined therein. The display pixel electrode and touch sensing electrode layer includes plural display pixel electrodes and plural touch sensing electrodes, wherein each touch sensing electrode has a mesh type pattern. The OLED layer is configured between the common electrode layer and the display pixel electrode and touch sensing electrode layer. The thin film transistor layer is disposed at one side of the lower substrate facing the OLED layer. The encapsulation layer is disposed at the other side of the common electrode layer facing the OLED layer. A first power circuit for the touch sensing electrodes is independent to a second power circuit for the OLED display panel.",
  "publication_number": "US20180143729A1-20180524",
  "_processing_info": {
    "original_size": 35641,
    "optimized_size": 3138,
    "reduction_percent": 91.2
  }
}