{
  "decision": "PENDING",
  "application_number": "15355016",
  "date_published": "20180517",
  "date_produced": "20180503",
  "title": "CODE-BASED FOOD PROCESSING MACHINE",
  "filing_date": "20161117",
  "inventor_list": [
    {
      "inventor_name_last": "Sedlacek",
      "inventor_name_first": "Matthew",
      "inventor_city": "Gilbert",
      "inventor_state": "AZ",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Velasquez",
      "inventor_name_first": "Joseph",
      "inventor_city": "Scottsdale",
      "inventor_state": "AZ",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Nguyen",
      "inventor_name_first": "Angie",
      "inventor_city": "Tempe",
      "inventor_state": "AZ",
      "inventor_country": "US"
    }
  ],
  "ipcr_labels": [
    "A23L500",
    "G06K714",
    "G06K710"
  ],
  "main_ipcr_label": "A23L500",
  "summary": "<SOH> SUMMARY <EOH>In general, in one aspect, the invention relates to a code-based food processing machine. The food processing machine can include: a code sensor for obtaining a food-pack code from a food-pack containing a set of ingredients for the food processing machine; and a code handler for applying a set of processing parameters to a set of food processing mechanisms of the food processing machine in response to the food-pack code. In general, in another aspect, the invention relates to a method for code-based food processing. The method can include: obtaining a food-pack code from a food-pack containing a set of ingredients for a food processing machine; and applying a set of processing parameters to a set of food processing mechanisms of the food processing machine in response to the food-pack code. In general, in another aspect, the invention relates to a method for reordering a supply of food-packs for a code-based food processing machine. The method can include: obtaining a food-pack code from a food-pack containing a set of ingredients for a food processing machine; determining a current inventory of the supplies in response to the food-pack code; and displaying a user interface element that enables a user to trigger a reorder of the supplies if the current inventory is below a threshold. Other aspects of the invention will be apparent from the following description and the appended claims.",
  "patent_number": "None",
  "abstract": "Food processing can include obtaining a food-pack code from a food-pack containing a set of ingredients for a food processing machine; and applying a set of processing parameters to a set of food processing mechanisms of the food processing machine in response to the food-pack code.",
  "publication_number": "US20180132510A1-20180517",
  "_processing_info": {
    "original_size": 40676,
    "optimized_size": 2547,
    "reduction_percent": 93.74
  }
}