{
  "date_produced": "20170510",
  "publication_number": "US20170147931A1-20170525",
  "main_ipcr_label": "G06N504",
  "decision": "PENDING",
  "application_number": "15357095",
  "inventor_list": [
    {
      "inventor_name_last": "DESAI",
      "inventor_name_first": "Krishnaji",
      "inventor_city": "Bangalore",
      "inventor_state": "",
      "inventor_country": "IN"
    },
    {
      "inventor_name_last": "VERMA",
      "inventor_name_first": "Pranay",
      "inventor_city": "Bangalore",
      "inventor_state": "",
      "inventor_country": "IN"
    },
    {
      "inventor_name_last": "CHITRANSHI",
      "inventor_name_first": "Shubham",
      "inventor_city": "Bangalore",
      "inventor_state": "",
      "inventor_country": "IN"
    }
  ],
  "abstract": "The present disclosure relates to a method and a system for verifying one or more rules of a root cause analysis system in a cloud environment. In one embodiment, the method receives an input comprising predefined set of the one or more rules from a cloud database. The method further receives dynamically, information associated with one or more topologies of the cloud environment from the cloud database and one or more user inputs on the input. The method further verifies the input with the information associated with the one or more topologies of the cloud environment and the one or more user inputs, for determining compliance of one of the input and the information associated with the one or more topologies of the cloud environment with one or more property parameters. Upon verifying, the method generates a verification report.",
  "filing_date": "20161121",
  "patent_number": "None",
  "summary": "<SOH> SUMMARY <EOH>One or more shortcomings of the prior art are overcome and additional advantages are provided through the present disclosure. Additional features and advantages are realized through the techniques of the present disclosure. Other embodiments and aspects of the disclosure are described in detail herein and are considered a part of the claimed disclosure. Accordingly, the present disclosure relates to a method for verifying one or more rules of a root cause analysis system in a cloud environment. The method comprises of receiving by a rules verification system, an input comprising predefined set of the one or more rules from a cloud database. Upon receiving the input, the method comprises receiving dynamically by the rules verification system, information associated with one or more topologies of the cloud environment from the cloud database and one or more user inputs on the input comprising predefined set of the one or more rules. The method further comprises verifying by the rules verification system, the input comprising predefined set of the one or more rules with the information associated with the one or more topologies of the cloud environment and the one or more user inputs, for determining compliance of one of the input comprising predefined set of the one or more rules and the information associated with the one or more topologies of the cloud environment with one or more property parameters. Upon verifying, the method comprises generating by the rules verification system, a verification report comprising output verified result set of the one or more rules, a corresponding verification status information of each of the one or more rules of the output verified result set and a verification score determined for the output verified result set. Further, the present disclosure relates to a rules verification system for verifying one or more rules of a root cause analysis system in a cloud environment. The system comprises a processing unit and...",
  "date_published": "20170525",
  "title": "METHOD AND SYSTEM FOR VERIFYING RULES OF A ROOT CAUSE ANALYSIS SYSTEM IN CLOUD ENVIRONMENT",
  "ipcr_labels": [
    "G06N504"
  ],
  "_processing_info": {
    "original_size": 68154,
    "optimized_size": 3714,
    "reduction_percent": 94.55
  }
}