{
  "date_produced": "20170603",
  "publication_number": "US20170169342A1-20170615",
  "main_ipcr_label": "G06N504",
  "decision": "PENDING",
  "application_number": "15358808",
  "inventor_list": [
    {
      "inventor_name_last": "Waltinger",
      "inventor_name_first": "Ulli",
      "inventor_city": "Neuburg",
      "inventor_state": "",
      "inventor_country": "DE"
    }
  ],
  "abstract": "A system for diagnosing at least one component requiring maintenance in an appliance and/or installation, having a) a device, designed for data and/or message interchange with regard to states of one or more components with an analysis unit, b) a device, designed to receive historic data from the one or more components with regard to their life in collective form, c) a device, designed for data and/or message interchange with a learning machine unit that is designed to deliver a predictive model for identifying at least one component requiring maintenance to the device, d) an evaluation device that is designed to use the data and/or messages coming from the analysis unit, e) a device, designed for data and/or message interchange with a monitoring device that is designed to take the one or more identified components requiring maintenance, which can prompt a visual and/or audible display is provided.",
  "filing_date": "20161122",
  "patent_number": "None",
  "summary": "<SOH> SUMMARY <EOH>An aspect relates to providing a machine-assisted fault analysis system that makes evaluation and diagnosis of log data faster and reliable. Embodiments of the invention claim a system for diagnosing at least one component requiring maintenance in an appliance and/or installation, having a) a device, designed for data and/or message interchange with regard to states of one or more components with an analysis unit that is designed to monitor the states of the one or more components and/or events arising thereon and to output them to the device in a systematized form, b) a device, designed to receive historic data from one or more components with regard to their life in collective form, c) a device, designed for data and/or message interchange with a learning machine unit that is designed to deliver a predictive model for identifying at least one component requiring maintenance to the device, d) an evaluation device that is designed to use the data and/or messages coming from the analysis unit in systematic form, the historic data in collective form and to use the predictive model to identify the one or more components requiring maintenance, e) a device, designed for data and/or message interchange with a monitoring device that is designed to take the one or more identified components requiring maintenance as a basis for outputting an error message to the monitoring device, which can prompt a visual and/or audible display. In this case, the display of the error message can be prompted by the monitoring device and forwarded to a further appliance at the customer end. In other words, there is provision for a learning-based approach to be used in order to put specific faults pertaining to system components into context such that faulty components lead to the most reliable possible spare part predictions or identification. The system according to embodiments of the invention is preferably intended to be installed on the product or at the customer end in...",
  "date_published": "20170615",
  "title": "SYSTEM AND METHOD FOR DIAGNOSING AT LEAST ONE COMPONENT REQUIRING MAINTENANCE IN AN APPLIANCE AND/OR INSTALLATION",
  "ipcr_labels": [
    "G06N504",
    "G06N9900"
  ],
  "_processing_info": {
    "original_size": 43114,
    "optimized_size": 3522,
    "reduction_percent": 91.83
  }
}