{
  "date_produced": "20180509",
  "publication_number": "US20180144260A1-20180524",
  "main_ipcr_label": "G06N700",
  "decision": "PENDING",
  "application_number": "15356662",
  "inventor_list": [
    {
      "inventor_name_last": "Santos-Gomez",
      "inventor_name_first": "Lucinio",
      "inventor_city": "Durham",
      "inventor_state": "NC",
      "inventor_country": "US"
    }
  ],
  "abstract": "Embodiments of the invention provide a method, system and computer program product for high risk road location prediction. In an embodiment of the invention, a method for high risk road location prediction includes characterizing different portions of different roadways and computing a risk probability for each of the different portions based upon observed accident rates occurring at the different portions. The method additionally includes selecting a new portion of the different roadways for which a risk probability has not been computed, and characterizing the new portion. Finally, the method includes matching the new portion to one of the different portions based upon a common characterization and assigning a risk probability to the new portion based upon a computed risk probability for the one of the different portions matched to the new portion.",
  "filing_date": "20161121",
  "patent_number": "None",
  "summary": "<SOH> BRIEF SUMMARY OF THE INVENTION <EOH>Embodiments of the present invention address deficiencies of the art in respect to high risk location determination of a roadway and provide a novel and non-obvious method, system and computer program product for high risk road location prediction. In an embodiment of the invention, a method for high risk road location prediction includes characterizing different portions of different roadways and computing a risk probability for each of the different portions based upon observed accident rates occurring at the different portions. The method additionally includes selecting a new portion of the different roadways for which a risk probability has not been computed, and characterizing the new portion. Finally, the method includes matching the new portion to one of the different portions based upon a common characterization and assigning a risk probability to the new portion based upon a computed risk probability for the one of the different portions matched to the new portion. In one aspect of the embodiment, each corresponding one of the different portions of the different roadways is characterized based upon an average speed of vehicles traversing the corresponding one of the different portions. In another aspect of the embodiment, each corresponding one of the different portions of the different roadways is characterized based upon an observed traffic density of each corresponding one of the different portions. In a further aspect of the embodiment, each corresponding one of the different portions of the different roadways is characterized based upon an observed average vehicle distance between vehicles traversing the corresponding one of the different portions. In a yet further aspect of the embodiment, each corresponding one of the different portions of the different roadways is characterized based upon observed weather for the corresponding one of the different portions. In even yet another aspect of the embodiment, each ...",
  "date_published": "20180524",
  "title": "HIGH-RISK ROAD LOCATION PREDICTION",
  "ipcr_labels": [
    "G06N700",
    "G01C2134"
  ],
  "_processing_info": {
    "original_size": 37956,
    "optimized_size": 3401,
    "reduction_percent": 91.04
  }
}