{
  "decision": "PENDING",
  "application_number": "15359473",
  "date_published": "20170601",
  "date_produced": "20170517",
  "title": "DISPLAY DEVICE AND TOUCH DETECTION METHOD OF DISPLAY DEVICE",
  "filing_date": "20161122",
  "inventor_list": [
    {
      "inventor_name_last": "Kurasawa",
      "inventor_name_first": "Hayato",
      "inventor_city": "Tokyo",
      "inventor_state": "",
      "inventor_country": "JP"
    },
    {
      "inventor_name_last": "Mizuhashi",
      "inventor_name_first": "Hiroshi",
      "inventor_city": "Tokyo",
      "inventor_state": "",
      "inventor_country": "JP"
    },
    {
      "inventor_name_last": "Noguchi",
      "inventor_name_first": "Koji",
      "inventor_city": "Tokyo",
      "inventor_state": "",
      "inventor_country": "JP"
    },
    {
      "inventor_name_last": "Suzuki",
      "inventor_name_first": "Takafumi",
      "inventor_city": "Tokyo",
      "inventor_state": "",
      "inventor_country": "JP"
    }
  ],
  "ipcr_labels": [
    "G06F3041",
    "G09G336",
    "G02F11339",
    "G02F1137",
    "G02F11362",
    "G02F11368",
    "G02F11335",
    "G02F11343",
    "G06F3044",
    "G02F11333"
  ],
  "main_ipcr_label": "G06F3041",
  "summary": "<SOH> BRIEF DESCRIPTION OF THE DRAWINGS <EOH>FIG. 1 schematically shows touch detection by a self-capacitive system. FIG. 2 is a graph showing change in capacitance when a touch is detected by a self-capacitive system. FIG. 3 is a plan view schematically showing the structure of a liquid crystal display device having a touch detection function according to a first embodiment. FIG. 4 is a plan view showing the pixel structure of the liquid crystal display device having a touch detection function according to the first embodiment. FIG. 5 is a cross-sectional view showing the layer structure of the liquid crystal display device having a touch detection function along dashed line X-X′ of FIG. 4 according to the first embodiment. FIG. 6 is a plan view schematically showing the structure of a controller provided in the liquid crystal display device having a touch detection function according to the first embodiment. FIG. 7 is a plan view schematically showing the circuit structure of a sensor drive controller provided in the liquid crystal display device having a touch detection function according to the first embodiment. FIG. 8 is a plan view schematically showing an enlarged view of some structures of the liquid crystal display device having a touch detection function according to the first embodiment. FIG. 9 is another plan view schematically showing an enlarged view of some structures of the liquid crystal display device having a touch detection function according to the first embodiment. FIG. 10 is a timing chart showing the sequence of driving the liquid crystal display device having a touch detection function according to the first embodiment. FIG. 11 is a plan view schematically showing an enlarged view of some structures of a liquid crystal display device having a touch detection function according to a second embodiment. FIG. 12 is a plan view schematically showing an enlarged view of some structures of a liquid crystal display device having a touch detection fu...",
  "patent_number": "None",
  "abstract": "According to one embodiment, a display device includes a plurality of gate lines, a plurality of data lines intersecting with the gate lines, a plurality of pixel electrodes provided in areas defined by the gate lines and the data lines, and a sensor drive controller which includes a plurality of common electrodes facing the pixel electrodes and detects a touch by using the common electrodes. The sensor drive controller selects at least one of the common electrodes as a sensor electrode, detects a touch by using the sensor electrode, and inputs, to the other common electrodes, a guard signal for reducing generation of capacitance between the other common electrodes and the sensor electrode.",
  "publication_number": "US20170153752A1-20170601",
  "_processing_info": {
    "original_size": 76579,
    "optimized_size": 3791,
    "reduction_percent": 95.05
  }
}