{
  "decision": "PENDING",
  "application_number": "15354938",
  "date_published": "20170525",
  "date_produced": "20170510",
  "title": "USER-SPECIFIC SCALE-BASED ENTERPRISE METHODS AND SYSTEMS",
  "filing_date": "20161117",
  "inventor_list": [
    {
      "inventor_name_last": "Kovacs",
      "inventor_name_first": "Gregory T.",
      "inventor_city": "Palo Alto",
      "inventor_state": "CA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Wiard",
      "inventor_name_first": "Richard M.",
      "inventor_city": "Campbell",
      "inventor_state": "CA",
      "inventor_country": "US"
    }
  ],
  "ipcr_labels": [
    "A61B500",
    "G06F1900",
    "A61B5145",
    "A61B50402",
    "A61B50476",
    "A61B501",
    "G01G1950",
    "A61B5024"
  ],
  "main_ipcr_label": "A61B500",
  "summary": "<SOH> BRIEF DESCRIPTION OF THE DRAWINGS <EOH>Various example embodiments may be more completely understood in consideration of the following detailed description in connection with the accompanying drawings, in which: FIG. 1 a shows an apparatus consistent with aspects of the present disclosure; FIG. 1 b shows an example of a user-specific scale-based enterprise system consistent with aspects of the present disclosure; FIG. 1 c shows an example of a scale aggregating and communicating user data from various user devices, consistent with aspects of the present disclosure; FIG. 1 d shows an example of filtering data from a user-specific scale-based enterprise system, consistent with aspects of the present disclosure; FIG. 1 e shows current paths through the body for the IPG trigger pulse and Foot IPG, consistent with various aspects of the present disclosure; FIG. 1 f is a flow chart illustrating an example manner in which a user-specific physiologic meter/scale may be programmed to provide features consistent with aspects of the present disclosure; FIG. 2 a shows an example of the insensitivity to foot placement on scale electrodes with multiple excitation and sensing current paths, consistent with various aspects of the present disclosure; FIGS. 2 b -2 c show examples of electrode configurations, consistent with various aspects of the disclosure; FIGS. 3 a -3 b show example block diagrams depicting circuitry for sensing and measuring the cardiovascular time-varying IPG raw signals and steps to obtain a filtered IPG waveform, consistent with various aspects of the present disclosure; FIG. 3 c depicts an example block diagram of circuitry for operating core circuits and modules, including for example those of FIGS. 3 a -3 b , used in various specific embodiments of the present disclosure; FIG. 3 d shows an exemplary block diagram depicting the circuitry for interpreting signals received from electrodes; FIG. 4 shows an example block diagram depicting signal processing...",
  "patent_number": "None",
  "abstract": "Certain aspects of the disclosure are directed an apparatus including a weighing scale and external circuitry. The weighing scale includes a platform in which a plurality of electrodes and force sensor circuitry are integrated and processing circuitry. The processing circuitry is configured to collect physiological data from the user while the user is standing on the platform, identify a risk that the user has a health condition using trigger data indicative of risks for a plurality of health conditions, wherein the trigger data includes values of the physiological data that are indicative of the risks for the plurality of health conditions, and output at least portions of the physiological data as user data in response to the identified risk. The external circuitry filters data from the Internet using the user data, and identifies data related to the health condition based on the filter of the data from the Internet.",
  "publication_number": "US20170143267A1-20170525",
  "_processing_info": {
    "original_size": 263406,
    "optimized_size": 3714,
    "reduction_percent": 98.59
  }
}