{
  "date_produced": "20170503",
  "publication_number": "US20170140301A1-20170518",
  "main_ipcr_label": "G06N9900",
  "decision": "PENDING",
  "application_number": "15353601",
  "inventor_list": [
    {
      "inventor_name_last": "Ye",
      "inventor_name_first": "Zhou",
      "inventor_city": "Hangzhou",
      "inventor_state": "",
      "inventor_country": "CN"
    },
    {
      "inventor_name_last": "Wang",
      "inventor_name_first": "Yu",
      "inventor_city": "Hangzhou",
      "inventor_state": "",
      "inventor_country": "CN"
    },
    {
      "inventor_name_last": "Chen",
      "inventor_name_first": "Fan",
      "inventor_city": "Hangzhou",
      "inventor_state": "",
      "inventor_country": "CN"
    },
    {
      "inventor_name_last": "Yang",
      "inventor_name_first": "Yang",
      "inventor_city": "Hangzhou",
      "inventor_state": "",
      "inventor_country": "CN"
    },
    {
      "inventor_name_last": "Mao",
      "inventor_name_first": "Qingkai",
      "inventor_city": "Hangzhou",
      "inventor_state": "",
      "inventor_country": "CN"
    },
    {
      "inventor_name_last": "Du",
      "inventor_name_first": "Nannan",
      "inventor_city": "Hangzhou",
      "inventor_state": "",
      "inventor_country": "CN"
    },
    {
      "inventor_name_last": "Wang",
      "inventor_name_first": "Hui",
      "inventor_city": "Hangzhou",
      "inventor_state": "",
      "inventor_country": "CN"
    },
    {
      "inventor_name_last": "Du",
      "inventor_name_first": "Fangxue",
      "inventor_city": "Hangzhou",
      "inventor_state": "",
      "inventor_country": "CN"
    },
    {
      "inventor_name_last": "Yuan",
      "inventor_name_first": "Fei",
      "inventor_city": "Hangzhou",
      "inventor_state": "",
      "inventor_country": "CN"
    }
  ],
  "abstract": "A method includes acquiring user data of candidate users; mining a social business characteristic user in some of the candidate users according to the first social attribute data; training a classifier by using second social attribute data and second business object attribute data of the social business characteristic user; and inputting first social attribute data and first business object attribute data of a neighboring user to the classifier, and outputting a result of whether the neighboring user, in a period of time after the first period of time, is a social business characteristic user, wherein the neighboring user is a candidate user other than the social business characteristic user. The present disclosure increases the volume of associated data, and improves the accuracy of the classifier, thus improving the accuracy of identification, so that potential social business characteristic users in the first period of time can be identified.",
  "filing_date": "20161116",
  "patent_number": "None",
  "summary": "<SOH> SUMMARY <EOH>This Summary is provided to introduce a selection of concepts in a simplified form that are further described below in the Detailed Description. This Summary is not intended to identify all key features or essential features of the claimed subject matter, nor is it intended to be used alone as an aid in determining the scope of the claimed subject matter. The term “technique(s) or technical solution(s)” for instance, may refer to apparatus(s), system(s), method(s) and/or computer-readable instructions as permitted by the context above and throughout the present disclosure. In view of the above problems, the example embodiments of the present disclosure provide a method for identifying a social business characteristic user and a corresponding device for identifying a social business characteristic user, to overcome the above problems or at least partially overcome the above problems. To solve the above problems, the example embodiments of the present disclosure disclose a method for identifying a social business characteristic user, which includes: acquiring user data of candidate users, wherein the user data includes first social attribute data and first business object attribute data associated in a first period of time, and second social attribute data and second business object attribute data associated in a second period of time, and the second period of time is in a period of time prior to the first period of time; mining a social business characteristic user in at least some of the candidate users according to the first social attribute data; training a classifier by using the second social attribute data and the second business object attribute data of the social business characteristic user; and inputting first social attribute data and first business object attribute data of a neighboring user to the classifier, and outputting a result of whether the neighboring user, in a period of time after the first period of time, is a social busines...",
  "date_published": "20170518",
  "title": "IDENTIFYING SOCIAL BUSINESS CHARACTERISTIC USER",
  "ipcr_labels": [
    "G06N9900",
    "G06Q5000",
    "G06F1730"
  ],
  "_processing_info": {
    "original_size": 80509,
    "optimized_size": 4640,
    "reduction_percent": 94.24
  }
}