{
  "decision": "PENDING",
  "application_number": "15355295",
  "date_published": "20180524",
  "date_produced": "20180509",
  "title": "SUPPLEMENTAL ELECTRONIC NOTE DATA MESSAGE DISTRIBUTION IN NEAR REAL-TIME",
  "filing_date": "20161118",
  "inventor_list": [
    {
      "inventor_name_last": "Pajor",
      "inventor_name_first": "Jaclyn E.",
      "inventor_city": "Glastonbury",
      "inventor_state": "CT",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Patrikar",
      "inventor_name_first": "Gaurav Chandrashekhar",
      "inventor_city": "Concord",
      "inventor_state": "NC",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Rogers",
      "inventor_name_first": "James S.",
      "inventor_city": "Willington",
      "inventor_state": "CT",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Thorpe",
      "inventor_name_first": "Justin J",
      "inventor_city": "Charlotte",
      "inventor_state": "NC",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Weiss",
      "inventor_name_first": "Karen B.",
      "inventor_city": "Scottsdale",
      "inventor_state": "AZ",
      "inventor_country": "US"
    }
  ],
  "ipcr_labels": [
    "G06Q4008"
  ],
  "main_ipcr_label": "G06Q4008",
  "summary": "<SOH> SUMMARY OF THE INVENTION <EOH>According to some embodiments, systems, methods, apparatus, computer program code and means may be provided to automatically make supplemental electronic note data messages available via remote management system terminals in a timely and accurate fashion. In some embodiments, a data store may contain electronic data records each representing an event associated with an existing risk association between an enterprise and an entity. Each electronic data record may be associated with a record identifier and a set of record characteristic values. Moreover, at least some of the electronic data records may be linked to supplemental electronic note data messages. A back-end application computer server, coupled to the data store, may automatically queue new supplemental electronic note data messages in accordance with at least one trigger rule. The computer server may also automatically transmit batches of information about the queued new supplemental electronic note data messages in near real-time. According to some embodiments, information may be exchanged with a plurality of remote management system terminals, via a distributed communication network, to support an interactive user interface display including the supplemental electronic note data messages. According to some embodiments, the back-end application computer server may automatically generate a message in response to an electronic data record and a message trigger rule, wherein the automatically generated message may be a first message type triggered by a first message trigger rule or a second message type triggered by a second message trigger rule, different than the first message trigger rule. In some cases, messages of the first type can include supplemental electronic note data messages while messages of the second type cannot include supplemental electronic note data messages. Some embodiments comprise: means for receiving, at a back-end application computer server from ...",
  "patent_number": "None",
  "abstract": "According to some embodiments, a data store may contain electronic data records each representing an event associated with an existing risk association between an enterprise and an entity. Each electronic data record may be associated with a record identifier and a set of record characteristic values. Moreover, at least some of the electronic data records may be linked to supplemental electronic note data messages. A back-end application computer server, coupled to the data store, may automatically queue new supplemental electronic note data messages in accordance with at least one trigger rule. The computer server may also automatically transmit batches of information about the queued new supplemental electronic note data messages in near real-time. According to some embodiments, information may be exchanged with a plurality of remote management system terminals, via a distributed communication network, to support an interactive user interface display including the supplemental electr...",
  "publication_number": "US20180144407A1-20180524",
  "_processing_info": {
    "original_size": 62636,
    "optimized_size": 4180,
    "reduction_percent": 93.33
  }
}