{
  "date_produced": "20170503",
  "publication_number": "US20170140260A1-20170518",
  "main_ipcr_label": "G06N304",
  "decision": "PENDING",
  "application_number": "15354377",
  "inventor_list": [
    {
      "inventor_name_last": "Manning",
      "inventor_name_first": "Damian Franken",
      "inventor_city": "New York",
      "inventor_state": "NY",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Shams",
      "inventor_name_first": "Omar Emad",
      "inventor_city": "Brooklyn",
      "inventor_state": "NY",
      "inventor_country": "US"
    }
  ],
  "abstract": "Systems and techniques are provided for content filtering with convolutional neural networks. A spectrogram generated from audio data may be received. A convolution may be applied to the spectrogram to generate a feature map. Values for a hidden layer of a neural network may be determined based on the feature map. A label for the audio data may be determined based on the determined values for the hidden layer of the neural network. The hidden layer may include a vector including the values for the hidden layer. The vector may be stored as a vector representation of the audio data.",
  "filing_date": "20161117",
  "patent_number": "None",
  "summary": "<SOH> BRIEF SUMMARY <EOH>According to an implementation of the disclosed subject matter, Systems and techniques are provided for content filtering with convolutional neural networks. A spectrogram generated from audio data may be received. A convolution may be applied to the spectrogram to generate a feature map. Values for a hidden layer of a neural network may be determined based on the feature map. A label for the audio data may be determined based on the determined values for the hidden layer of the neural network. The hidden layer may include a vector including the values for the hidden layer. The vector may be stored as a vector representation of the audio data. Additional features, advantages, and implementations of the disclosed subject matter may be set forth or apparent from consideration of the following detailed description, drawings, and claims. Moreover, it is to be understood that both the foregoing summary and the following detailed description provide examples of implementations and are intended to provide further explanation without limiting the scope of the claims.",
  "date_published": "20170518",
  "title": "CONTENT FILTERING WITH CONVOLUTIONAL NEURAL NETWORKS",
  "ipcr_labels": [
    "G06N304",
    "G10L2551",
    "G06F1730",
    "G10L2530"
  ],
  "_processing_info": {
    "original_size": 55158,
    "optimized_size": 2417,
    "reduction_percent": 95.62
  }
}