{
  "decision": "PENDING",
  "application_number": "15350701",
  "date_published": "20170302",
  "date_produced": "20170214",
  "title": "RANDOM NUMBER GENERATING DEVICE, CIPHER PROCESSING DEVICE, STORAGE DEVICE, AND INFORMATION PROCESSING SYSTEM",
  "filing_date": "20161114",
  "inventor_list": [
    {
      "inventor_name_last": "SUGAHARA",
      "inventor_name_first": "Takahiko",
      "inventor_city": "Nishinomiya-shi",
      "inventor_state": "",
      "inventor_country": "JP"
    }
  ],
  "ipcr_labels": [
    "H04L908",
    "G09C100",
    "H04L906",
    "G06F758"
  ],
  "main_ipcr_label": "H04L908",
  "summary": "<SOH> SUMMARY OF THE INVENTION <EOH>As described in Japanese Patent Application Laid-Open No. 2004-234153, generation of random numbers and cipher processing are performed in the same device in some cases. Such a device or other devices are desired to perform processing with a simple configuration, that is, at low cost. The present invention has been made in view of the above, and an object thereof is to provide a technique in which processing can be performed with a simple configuration, that is, at low cost. A random number generating device according to a first aspect of the present invention includes: an uncertain circuit which outputs uncertain data; and a cipher processing device, wherein the cipher processing device encrypts input data using a cipher function of the cipher processing device, and generates a random number having higher uniformity than data outputted from said uncertain circuit using the cipher function of the cipher processing device and the data outputted from the uncertain circuit. The random number generating device according to a second aspect of the present invention is based on the first aspect of the present invention, wherein the random number is used as a key used in cipher or as an authentication code used in authentication. The random number generating device according to a third aspect of the present invention is based on the second aspect of the present invention, wherein the random number is inputted as the key to the cipher processing device. A storage device according to a fourth aspect of the present invention includes: a random number generating device and a storage unit, wherein the random number generating device includes an uncertain circuit which outputs uncertain data, and a cipher processing device, and the cipher processing device encrypts data read from the storage unit using a cipher function of the cipher processing device, and generates a random number having higher uniformity than data outputted from said uncertai...",
  "patent_number": "None",
  "abstract": "A random number generating device includes an uncertain circuit which outputs uncertain data, and a cipher processing device. The cipher processing device encrypts input data using a cipher function of the cipher processing device, and generates a random number including higher uniformity than data outputted from said uncertain circuit using the cipher function of the cipher processing device and the data outputted from the uncertain circuit.",
  "publication_number": "US20170063545A1-20170302",
  "_processing_info": {
    "original_size": 46540,
    "optimized_size": 3084,
    "reduction_percent": 93.37
  }
}