{
  "date_produced": "20170503",
  "publication_number": "US20170140259A1-20170518",
  "main_ipcr_label": "G06N304",
  "decision": "PENDING",
  "application_number": "15353492",
  "inventor_list": [
    {
      "inventor_name_last": "Bergstra",
      "inventor_name_first": "James Sterling",
      "inventor_city": "Toronto",
      "inventor_state": "",
      "inventor_country": "CA"
    }
  ],
  "abstract": "Robots and robotic systems and methods can employ artificial neural networks (ANNs) to significantly improve performance. The ANNs can operate alternatingly in forward and backward directions in interleaved fashion. The ANNs can employ visible units and hidden units. Various objective functions can be optimized. Robots and robotic systems and methods can execute applications including a plurality of agents in a distributed system, for instance with a number of hosts executing respective agents, at least some of the agents in communications with one another. The hosts can execute agents in response to occurrence of defined events or trigger expressions, and can operate with a maximum latency guarantee and/or data quality guarantee.",
  "filing_date": "20161116",
  "patent_number": "None",
  "summary": "<SOH> BRIEF SUMMARY <EOH>A computing system including back propagation substantially as described and illustrated herein. A system including a computer and a robot substantially as described and illustrated herein. A robotic apparatus substantially as described and illustrated herein. A method of operation of a computing system substantially as described and illustrated herein. A method of operation of an artificial neural network, including a plurality of variables and a plurality of parameters, may be summarized as including computing, by at least one hardware processor, a first plurality of values for the plurality of variables in the artificial neural network based on a first plurality of values for the plurality of parameters over a first period; calculating, by the at least one hardware processor, a first plurality of incremental errors for the artificial neural network over the first period; generating, by the at least one hardware processor, a second plurality of values for the plurality of parameters; storing, by the at least one hardware processor, the second plurality of values for the plurality of parameters; interleaved with calculating the first plurality of incremental errors for the artificial neural network over the first period, computing, over a second period, by the at least one hardware processor, a second plurality of values for the plurality of variables for the artificial neural network based on the first plurality of values for the plurality of parameters; and returning, by the at least one hardware processor, the second plurality of values for the plurality of parameters. The method may further include computing, by the at least one hardware processor, over a third period, a third plurality of values for the plurality of variables in the artificial neural network based on the second plurality of values for the plurality of parameters; calculating, by the at least one hardware processor, a second plurality of incremental errors for the artif...",
  "date_published": "20170518",
  "title": "SYSTEMS, DEVICES, AND METHODS FOR DISTRIBUTED ARTIFICIAL NEURAL NETWORK COMPUTATION",
  "ipcr_labels": [
    "G06N304",
    "B25J916"
  ],
  "_processing_info": {
    "original_size": 167002,
    "optimized_size": 3329,
    "reduction_percent": 98.01
  }
}