{
  "decision": "ACCEPTED",
  "application_number": "15358736",
  "date_published": "20170316",
  "date_produced": "20170301",
  "title": "SECURING PRODUCT STORAGE TANKS AGAINST UNAUTHORIZED DELIVERY",
  "filing_date": "20161122",
  "inventor_list": [
    {
      "inventor_name_last": "Lichtash",
      "inventor_name_first": "Avraham Shmuel",
      "inventor_city": "N. Bethesda",
      "inventor_state": "MD",
      "inventor_country": "US"
    }
  ],
  "ipcr_labels": [
    "G05D706",
    "B67D736",
    "B67D734",
    "G05B19042",
    "G06Q1008"
  ],
  "main_ipcr_label": "G05D706",
  "summary": "<SOH> BRIEF SUMMARY OF THE INVENTION <EOH>The described embodiments overcome the shortcomings of existing delivery systems by (a) providing automatic, real-time prevention of unauthorized deliveries, (b) eliminating post factum investigations, (c) minimizing the size of the professional control team, and (d) ensuring the quality of the delivered product by preventing contamination. The described embodiments are independent of the delivered product type and are applicable for any industrial product (liquid or otherwise flowable, e.g., granular) for which unauthorized delivery or contamination by improper mixing of product types can occur. For convenience, the Detailed Description is provided in terms of fuel distribution, which is a highly applicable market for the described embodiments. The challenges faced by distributors in the fuel market are also the same as in other markets, e.g., milk, juice or hazardous agricultural liquids such as fertilizers and pesticides. In an exemplary embodiment, a remote controlled valve is cooperable with a product entry port. The remote controlled valve includes a disk flap that is displaceable between an opened position and a closed position, and a disk displacement assembly including a motor coupled with the disk flap. The disk displacement assembly includes a lock feature that locks the disk flap in the opened position and the closed position. A controller is cooperable with the disk displacement assembly and controls activation of the motor. The disk displacement assembly includes a spring transmission assembly interposed between the motor and an axle of the disk flap. The spring transmission assembly permits displacement of the motor when the disk flap is blocked in the opened position or the closed position. In one embodiment, the disk flap is sized relative to the product entry port such that the disk flap does not completely seal the product entry port. The disk displacement assembly may include a cam plate to which the axle...",
  "patent_number": "9964962",
  "abstract": "A system and method prevent product-type contamination in a bulk liquid storage tank. A control unit receives an indication of a storage product type in the bulk storage and a delivery product type in the tanker truck. The control unit compares the delivery product type with the storage product type and controls delivery based on a result of the comparison.",
  "publication_number": "US20170075362A1-20170316",
  "_processing_info": {
    "original_size": 40950,
    "optimized_size": 2971,
    "reduction_percent": 92.74
  }
}