{
  "decision": "PENDING",
  "application_number": "15351055",
  "date_published": "20170518",
  "date_produced": "20170503",
  "title": "ELECTRONIC DEVICE HAVING UNIBODY HOUSING AND METHOD OF MANUFACTURING THE SAME",
  "filing_date": "20161114",
  "inventor_list": [
    {
      "inventor_name_last": "BAE",
      "inventor_name_first": "Seungjae",
      "inventor_city": "Gyeonggi-do",
      "inventor_state": "",
      "inventor_country": "KR"
    },
    {
      "inventor_name_last": "CHOUNG",
      "inventor_name_first": "Taedoo",
      "inventor_city": "Gyeonggi-do",
      "inventor_state": "",
      "inventor_country": "KR"
    }
  ],
  "ipcr_labels": [
    "H04M102",
    "G06F116"
  ],
  "main_ipcr_label": "H04M102",
  "summary": "<SOH> SUMMARY <EOH>The present disclosure has been made to address the above problems and provides an electronic device having a unibody housing and a method of manufacturing the same. In accordance with an aspect of the present disclosure, there is provided an electronic device including a display and configured for use in a communication network. The electronic device includes a first plate facing in a first direction, a second plate having a flat surface facing in a second direction opposite to the first direction and being at least partially formed of a polymer material, wherein a peripheral portion encloses the flat surface, a housing, which encloses a space between the first plate and the second plate, is at least partially formed of a metal material, and includes a side member that is integrally formed with the second plate, wherein the side member has a first portion adjacent to a peripheral portion of the second plate, and the first portion has a first surface substantially facing in the second direction, contacts the peripheral portion of the second plate, and has a second surface facing in a third direction different from the first direction and the second direction. In accordance with another aspect of the present disclosure, there is provided an electronic device. The electronic device includes a housing having a housing space therein, wherein the housing comprises, a rear surface; and a side surface coupled to an outer circumferential surface of the rear surface, wherein the side surface includes a first surface coupled to an end surface of the rear surface thereby forming a straight line segment in a horizontal direction and a second surface formed in a vertical direction at an inside of the first surface to be bonded to an end surface of the rear surface. In accordance with yet another aspect of the present disclosure, there is provided a method of manufacturing a housing of an electronic device. The method includes forming a side surface of the hous...",
  "patent_number": "None",
  "abstract": "An electronic device is provided. The electronic device includes a first plate, a second plate having a flat surface and being at least partially formed of a polymer material, a housing, which encloses a space between the first plate and the second plate, is at least partially formed of a metal material, and includes a side member that is integrally formed with the second plate, wherein the side member has a first portion adjacent to a peripheral portion of the second plate, and the first portion has a first surface substantially facing in the second direction, contacts the peripheral portion of the second plate, and has a second surface facing in a third direction different from the first direction and the second direction.",
  "publication_number": "US20170142239A1-20170518",
  "_processing_info": {
    "original_size": 71817,
    "optimized_size": 3457,
    "reduction_percent": 95.19
  }
}