{
  "date_produced": "20170301",
  "publication_number": "US20170076204A1-20170316",
  "main_ipcr_label": "G06N502",
  "decision": "PENDING",
  "application_number": "15358381",
  "inventor_list": [
    {
      "inventor_name_last": "Baughman",
      "inventor_name_first": "Aaron K.",
      "inventor_city": "Silver Spring",
      "inventor_state": "MD",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Boyer",
      "inventor_name_first": "Linda M.",
      "inventor_city": "Ossining",
      "inventor_state": "NY",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Chuang",
      "inventor_name_first": "Wesley T.",
      "inventor_city": "Vienna",
      "inventor_state": "VA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Ding",
      "inventor_name_first": "Meilan",
      "inventor_city": "Mclean",
      "inventor_state": "VA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Gee",
      "inventor_name_first": "William R.",
      "inventor_city": "Ashburn",
      "inventor_state": "VA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Sakthi",
      "inventor_name_first": "Palani",
      "inventor_city": "Palatine",
      "inventor_state": "IL",
      "inventor_country": "US"
    }
  ],
  "abstract": "Methods, computer program products and systems for generating at least one factual question from a set of seed questions and answer pairs. One method includes: obtaining at least one seed question and answer pair from the set of seed question and answer pairs; extracting a set of features associated with the at least one seed question and answer pair using at least one common analysis system (CAS) in a set of CASs and a specific knowledge base; generating a set of candidate questions from the extracted set of features using a logistic regression algorithm and the specific knowledge base; and ranking each candidate question relative to a remainder of candidate questions in the set of candidate questions based on the extracted set of features and the at least one seed question and answer pair.",
  "filing_date": "20161122",
  "patent_number": "None",
  "summary": "<SOH> BRIEF SUMMARY <EOH>Methods, computer program products and systems for generating at least one candidate question from a set of seed questions are disclosed. In some embodiments, a computer-implemented method for generating at least one candidate question from a set of seed questions and answer pairs is disclosed. The method can include: obtaining at least one seed question and answer pair from the set of seed question and answer pairs; extracting a set of features associated with the at least one seed question and answer pair using at least one common analysis system (CAS) in a set of CASs and a specific knowledge base; generating a set of candidate questions from the extracted set of features using a logistic regression algorithm and the specific knowledge base, wherein each candidate question includes an expansion of each of the extracted set of features; and ranking each candidate question relative to a remainder of candidate questions in the set of candidate questions based on the extracted set of features and the at least one seed question and answer pair Some particular embodiments include a computer-implemented method for generating at least one candidate question from a set of seed questions and answer pairs is disclosed. The method can include: obtaining at least one seed question and answer pair from the set of seed question and answer pairs; extracting a set of features associated with the at least one seed question and answer pair using at least one common analysis system (CAS) in a set of CASs and a specific knowledge base; generating a set of candidate questions from the extracted set of features using a logistic regression algorithm and the specific knowledge base, wherein each candidate question includes an expansion of each of the extracted set of features; and ranking each candidate question relative to a remainder of candidate questions in the set of candidate questions based on the extracted set of features and the at least one seed questio...",
  "date_published": "20170316",
  "title": "NATURAL LANGUAGE QUESTION EXPANSION AND EXTRACTION",
  "ipcr_labels": [
    "G06N502",
    "G06F1727"
  ],
  "_processing_info": {
    "original_size": 58663,
    "optimized_size": 4089,
    "reduction_percent": 93.03
  }
}