{
  "date_produced": "20180503",
  "publication_number": "US20180137425A1-20180517",
  "main_ipcr_label": "G06N504",
  "decision": "PENDING",
  "application_number": "15354363",
  "inventor_list": [
    {
      "inventor_name_last": "D'Alo'",
      "inventor_name_first": "Salvatore",
      "inventor_city": "Roma",
      "inventor_state": "",
      "inventor_country": "IT"
    },
    {
      "inventor_name_last": "Lerro",
      "inventor_name_first": "Marco",
      "inventor_city": "Roma",
      "inventor_state": "",
      "inventor_country": "IT"
    },
    {
      "inventor_name_last": "Noioso",
      "inventor_name_first": "Mario",
      "inventor_city": "Roma",
      "inventor_state": "",
      "inventor_country": "IT"
    },
    {
      "inventor_name_last": "Piazza",
      "inventor_name_first": "Nicola",
      "inventor_city": "Roma",
      "inventor_state": "",
      "inventor_country": "IT"
    }
  ],
  "abstract": "A method and associated systems for real-time analysis of a musical performance using analytics. A performance-analysis system receives feedback from which may be inferred an audience's reaction to the performance. This feedback may be derived from sensors embedded in instruments or microphones, from video-input devices that visually represent the audience's body language and facial expressions, and from performance ratings and natural-language comments submitted by audience members to a social-media network or performance-rating application. An analytics engine of the performance-analysis system uses methods of artificial intelligence to infer the audience's emotional state from the received feedback and to determine whether certain characteristics of the performance are undesirable. The system represents these inferences as a value of a performance index and represents the index value to the performers. The system may also make specific recommendations deemed likely to reduce undesir...",
  "filing_date": "20161117",
  "patent_number": "None",
  "summary": "<SOH> BRIEF SUMMARY <EOH>An embodiment of the present invention provides a real-time performance-analysis system comprising a processor, a memory coupled to the processor, one or more sensors coupled to the processor and embedded into musical instruments used by performers of a musical performance, a network interface that connects the processor to a computer network, and a computer-readable hardware storage device coupled to the processor, the storage device containing program code configured to be run by the processor via the memory to implement a method for real-time analysis of a musical performance using analytics, the method comprising: the processor electronically receiving real-time feedback characterizing an ongoing musical performance by one or more performers; the processor inferring a characteristic of the performance by using an artificially intelligent analytics procedure to analyze the real-time feedback, where the analytics procedure is a function of a repository of archived information about past performances by the one or more performers and of a knowledgebase from which the feedback may be given semantic meaning, and where the inferred characteristic is considered undesirable by the one or more performers; and the processor communicating the inferred characteristic to the one or more performers for the purpose of allowing the one or more performers to alter their ongoing performance in order to mitigate undesirability of the inferred characteristic. Another embodiment of the present invention provides method for real-time analysis of a musical performance using analytics, the method comprising: a processor of a real-time performance-analysis system electronically receiving real-time feedback characterizing an ongoing musical performance by one or more performers; the processor inferring a characteristic of the performance by using an artificially intelligent analytics procedure to analyze the real-time feedback, where the analytics procedure is a ...",
  "date_published": "20180517",
  "title": "REAL-TIME ANALYSIS OF A MUSICAL PERFORMANCE USING ANALYTICS",
  "ipcr_labels": [
    "G06N504",
    "G06K900"
  ],
  "_processing_info": {
    "original_size": 85830,
    "optimized_size": 3975,
    "reduction_percent": 95.37
  }
}