{
  "date_produced": "20170419",
  "publication_number": "US20170124453A1-20170504",
  "main_ipcr_label": "G06N308",
  "decision": "PENDING",
  "application_number": "15357703",
  "inventor_list": [
    {
      "inventor_name_last": "Noyes",
      "inventor_name_first": "Harold B.",
      "inventor_city": "Boise",
      "inventor_state": "ID",
      "inventor_country": "US"
    }
  ],
  "abstract": "A device includes a state machine. The state machine includes a plurality of blocks, where each of the blocks includes a plurality of rows. Each of these rows includes a plurality of programmable elements. Furthermore, each of the programmable elements are configured to analyze at least a portion of a data stream and to selectively output a result of the analysis. Each of the plurality of blocks also has corresponding block activation logic configured to dynamically power-up the block.",
  "filing_date": "20161121",
  "patent_number": "None",
  "summary": "<SOH> BRIEF DESCRIPTION OF DRAWINGS <EOH>FIG. 1 illustrates an example of system having a state machine engine, according to various embodiments of the invention. FIG. 2 illustrates an example of an FSM lattice of the state machine engine of FIG. 1 , according to various embodiments of the invention. FIG. 3 illustrates an example of a block of the FSM lattice of FIG. 2 , according to various embodiments of the invention. FIG. 4 illustrates an example of a row of the block of FIG. 3 , according to various embodiments of the invention. FIG. 5 illustrates an example of a Group of Two of the row of FIG. 4 , according to various embodiments of the invention. FIG. 6 illustrates an example of a finite state machine graph, according to various embodiments of the invention. FIG. 7 illustrates an example of two-level hierarchy implemented with FSM lattices, according to various embodiments of the invention. FIG. 8 illustrates an example of a method for a compiler to convert source code into a binary file for programming of the FSM lattice of FIG. 2 , according to various embodiments of the invention. FIG. 9 illustrates a state machine engine, according to various embodiments of the invention. FIG. 10 illustrates an a second example of a row of the block of FIG. 3 , according to various embodiments of the invention. FIG. 11 illustrates the intra-block switch of FIG. 10 , according to various embodiments of the invention. FIG. 12 illustrates block activation logic for a block of FIG. 2 , according to various embodiments of the invention. FIG. 13 is a state diagram illustrating an operation of the block activation logic of FIG. 12 , according to various embodiments of the invention. detailed-description description=\"Detailed Description\" end=\"lead\"?",
  "date_published": "20170504",
  "title": "METHODS AND SYSTEMS FOR POWER MANAGEMENT IN A PATTERN RECOGNITION PROCESSING SYSTEM",
  "ipcr_labels": [
    "G06N308",
    "G06F132"
  ],
  "_processing_info": {
    "original_size": 102109,
    "optimized_size": 2838,
    "reduction_percent": 97.22
  }
}