{
  "date_produced": "20170223",
  "publication_number": "US20170068892A1-20170309",
  "main_ipcr_label": "G06N500",
  "decision": "ACCEPTED",
  "application_number": "15354122",
  "inventor_list": [
    {
      "inventor_name_last": "Husain",
      "inventor_name_first": "Syed Mohammad Amir",
      "inventor_city": "Round Rock",
      "inventor_state": "TX",
      "inventor_country": "US"
    }
  ],
  "abstract": "A system and method for generating a heuristic is provided. A heuristic is capable of identifying data patterns. The method includes: extracting a data set from multiple input sources; creating a set of unique elements used across the data set; organizing the data set into a geometric structure; grouping portions of the data in the geometric structure into a plurality sub geometric structures; determining base attributes for each sub geometric structure using the set of unique elements; identifying trends in the base attributes among the sub geometric structures; and outputting the heuristic as a combination of the base attributes and the trends.",
  "filing_date": "20161117",
  "patent_number": "9818060",
  "summary": "<SOH> SUMMARY OF THE INVENTION <EOH>Aspects of the present invention address at least the above-mentioned problems and/or disadvantages and provide at least the advantages described below. Accordingly, an aspect of the present invention is to generate a heuristic that is capable of identifying data patterns. Another aspect of the present invention is to provide a heuristic to be used in conjunction with a cognitive fingerprinting method. A core cognitive fingerprint is used to identify and respond to a predetermined goal state by analyzing system data through the use of pattern recognizers which implement heuristics. Response actions can be executed if a core fingerprint falls within the threshold of a target goal (where a goal can be an event such as whether malware is detected or unauthorized data theft is detected). In contrast to an approach that would capture a single system state, a core cognitive fingerprint can represent the temporal evolution of a system over time. In accordance with another aspect of the present invention, a method for generating a heuristic is provided. The method includes: extracting a data set from multiple input sources; creating a set of unique elements used across the data set; organizing the data set into a geometric structure; grouping portions of the data in the geometric structure into a plurality of sub geometric structures; determining base attributes for each sub geometric structure using the set of unique elements; identifying trends in the base attributes among the sub geometric structures; and outputting the heuristic as a combination of the base attributes and the trends. In accordance with another aspect of the present invention, a computer system for creating a heuristic is provided.",
  "date_published": "20170309",
  "title": "SYSTEM AND METHOD FOR GENERATION OF A HEURISTIC",
  "ipcr_labels": [
    "G06N500",
    "G06N504"
  ],
  "_processing_info": {
    "original_size": 49533,
    "optimized_size": 2973,
    "reduction_percent": 94.0
  }
}