{
  "date_produced": "20170214",
  "publication_number": "US20170061303A1-20170302",
  "main_ipcr_label": "G06N504",
  "decision": "PENDING",
  "application_number": "15352532",
  "inventor_list": [
    {
      "inventor_name_last": "Soon-Shiong",
      "inventor_name_first": "Patrick",
      "inventor_city": "Los Angeles",
      "inventor_state": "CA",
      "inventor_country": "US"
    }
  ],
  "abstract": "A reasoning engine is disclosed. Contemplated reasoning engines acquire data relating to one or more aspects of various environments. Inference engines within the reasoning engines review the acquire data, historical or current, to generate one or more hypotheses about how the aspects of the environments might be correlated, if at all. The reasoning engine can attempt to validate the hypotheses through controlling acquisition of the environment data.",
  "filing_date": "20161115",
  "patent_number": "None",
  "summary": "<SOH> SUMMARY OF THE INVENTION <EOH>The inventive subject matter provides apparatus, systems and methods in which one can utilize a reasoning engine to generate a hypothesis representing an assertion that one or more aspects of an environment might have a correlation. Reasoning engines include a data interface through which the reasoning engine can acquire environment data representing aspects of the environment. Aspects can include various modalities of data (e.g., visual, audible, tactical, etc.) or even data beyond the perception of humans. In some embodiments, data from the environment can be represented as a manageable data object capable of being transported through a networking fabric and having one or more attributes describing the object. Objects can also include recognized or identified real-world object having one or more attributes. The collected data can be aggregated at or passed through one or more inference engines configured to generate a hypothesis according to various reasoning techniques. When a hypothesis is formulated, the reasoning engine can utilize a validation module to determine validity of the hypothesis by influencing acquisition of the environment data. Various objects, features, aspects and advantages of the inventive subject matter will become more apparent from the following detailed description of preferred embodiments, along with the accompanying drawing figures in which like numerals represent like components.",
  "date_published": "20170302",
  "title": "REASONING ENGINE SERVICES",
  "ipcr_labels": [
    "G06N504",
    "G06F1730",
    "G06F1900"
  ],
  "_processing_info": {
    "original_size": 81903,
    "optimized_size": 2466,
    "reduction_percent": 96.99
  }
}