{
  "decision": "PENDING",
  "application_number": "15354257",
  "date_published": "20170309",
  "date_produced": "20170223",
  "title": "ACTIVE ODOR CANCELLATION",
  "filing_date": "20161117",
  "inventor_list": [
    {
      "inventor_name_last": "Varshney",
      "inventor_name_first": "Kush R.",
      "inventor_city": "Yorktown Heights",
      "inventor_state": "NY",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Varshney",
      "inventor_name_first": "Lav R.",
      "inventor_city": "Champaign",
      "inventor_state": "IL",
      "inventor_country": "US"
    }
  ],
  "ipcr_labels": [
    "G01N3088",
    "B01F1500",
    "A61L216",
    "G06F1711",
    "G06F1716"
  ],
  "main_ipcr_label": "G01N3088",
  "summary": "<SOH> SUMMARY OF THE DISCLOSURE <EOH>In one embodiment, the present disclosure is a method for calculating a first set of chemical compounds for an odor additive. For example, the method includes identifying a second set of chemical compounds present in a sample and intensities of individual chemical compounds in the second set of chemical compounds, and calculating the first set of chemical compounds for the odor additive such that an olfactory perception of a mixture of the sample and the odor additive is an olfactory white. In another embodiment, the present disclosure is a device for calculating a first set of chemical compounds for an odor additive, where the device includes a processor and a computer-readable medium storing instructions, which when executed by the processor, cause the processor to perform operations. The operations include identifying a second set of chemical compounds present in a sample and intensities of individual chemical compounds in the second set of chemical compounds, and calculating the first set of chemical compounds for the odor additive such that an olfactory perception of a mixture of the sample and the odor additive is an olfactory white. In another embodiment, the present disclosure is an additional method for selecting a first set of chemical compounds for an odor additive. The method includes identifying a second set of chemical compounds present in a sample, determining a set of physicochemical properties of chemical compounds present in the second set of chemical compounds and calculating physicochemical properties for the odor additive such that an olfactory perception of a mixture of the sample and the odor additive is an olfactory white. The method further includes selecting the first set of chemical compounds for the odor additive, where, when the first set of chemical compounds that are selected are mixed to form the odor additive, the odor additive comprises the physicochemical properties that are calculated for the o...",
  "patent_number": "None",
  "abstract": "The present disclosure relates to methods, devices and systems for calculating or selecting a first set of chemical compounds for an odor additive. For example, a method identifies a second set of chemical compounds present in a sample and intensities of individual chemical compounds in the second set of chemical compounds, and calculates the first set of chemical compounds for the odor additive such that an olfactory perception of a mixture of the sample and the odor additive is an olfactory white.",
  "publication_number": "US20170067866A1-20170309",
  "_processing_info": {
    "original_size": 72853,
    "optimized_size": 3225,
    "reduction_percent": 95.57
  }
}