{
  "date_produced": "20180509",
  "publication_number": "US20180144263A1-20180524",
  "main_ipcr_label": "G06N9900",
  "decision": "PENDING",
  "application_number": "15355857",
  "inventor_list": [
    {
      "inventor_name_last": "Saxena",
      "inventor_name_first": "Priya",
      "inventor_city": "Essex",
      "inventor_state": "",
      "inventor_country": "GB"
    },
    {
      "inventor_name_last": "Clothier",
      "inventor_name_first": "Matthew Philip",
      "inventor_city": "Chedzoy",
      "inventor_state": "",
      "inventor_country": "GB"
    }
  ],
  "abstract": "A technique for executing a containerized stateful application that is deployed on a stateless computing platform is disclosed. The technique involves deploying a containerized stateful application on a stateless computing platform and executing the stateful application on the stateless computing platform. The technique also involves during execution of the stateful application, evaluating, in an application virtualization layer, events that are generated during execution of the stateful application to identify events that may trigger a change in state of the stateful application and during execution of the stateful application, updating a set of storage objects in response to the evaluations, and during execution of the stateful application, comparing events that are generated by the stateful application to the set of storage objects and redirecting a storage object that corresponds to an event to a persistent data store if the storage object matches a storage object in the set of sto...",
  "filing_date": "20161118",
  "patent_number": "None",
  "summary": "<SOH> BRIEF DESCRIPTION OF THE DRAWINGS <EOH>FIG. 1 illustrates an example high-level workflow related to a containerized stateful application that is executed on a stateless platform in a manner that maintains the state of the containerized stateful application. FIG. 2 is a process flow diagram of a state capturing workflow for a containerized stateful application that corresponds to the workflow illustrated in FIG. 1 and includes a containerization phase and a deployment phase. FIG. 3 illustrates an example of a conventional technique for capturing the state of a containerized application executing on a stateless computing platform during the deployment phase. FIG. 4 depicts an example of a static set of storage objects that can be monitored by an application virtualization layer to redirect state information to a persistent data store. FIG. 5 illustrates an example of a technique for executing a containerized stateful application that is deployed on a stateless computing platform in which the capturing of state information is primarily implemented within the application virtualization layer. FIGS. 6A-6D depict a time sequence of a set of storage objects as the set of storage objects is updated on-the-fly as the containerized application executes on the stateless computing platform. FIGS. 7A and 7B are process flow diagrams of an example embodiment of operations that occur during the deployment phase of a containerized stateful application. FIG. 8 is a timing diagram of the workflow described above with reference to FIGS. 1, 2, and 5-7B . FIG. 9 illustrates an example of a technique for executing a containerized stateful application that is deployed on a stateless computing platform in which a portion of the state capturing workload is offloaded to a state capturing service. FIG. 10 illustrates operations corresponding to the technique illustrated in FIG. 9 that are performed by the application virtualization layer during the deployment phase. FIGS. 11A-11D illust...",
  "date_published": "20180524",
  "title": "METHOD AND SYSTEM FOR EXECUTING A CONTAINERIZED STATEFUL APPLICATION ON A STATELESS COMPUTING PLATFORM USING MACHINE LEARNING",
  "ipcr_labels": [
    "G06N9900",
    "G06F948"
  ],
  "_processing_info": {
    "original_size": 107641,
    "optimized_size": 3776,
    "reduction_percent": 96.49
  }
}