{
  "decision": "PENDING",
  "application_number": "15356728",
  "date_published": "20170525",
  "date_produced": "20170510",
  "title": "FLEXIBLE IMAGE DISPLAY DEVICE",
  "filing_date": "20161121",
  "inventor_list": [
    {
      "inventor_name_last": "SONG",
      "inventor_name_first": "Byung Hoon",
      "inventor_city": "Gyeonggi-do",
      "inventor_state": "",
      "inventor_country": "KR"
    },
    {
      "inventor_name_last": "SONG",
      "inventor_name_first": "In Kyu",
      "inventor_city": "Gyeonggi-do",
      "inventor_state": "",
      "inventor_country": "KR"
    }
  ],
  "ipcr_labels": [
    "G06F3041",
    "H01L5100",
    "H01L5152",
    "H01L2732"
  ],
  "main_ipcr_label": "G06F3041",
  "summary": "<SOH> SUMMARY <EOH>It is an aspect of the present invention to provide a flexible image display device capable of preventing an occurrence of curved cracks in a touch panel. The above aspect of the present invention will be achieved by the following characteristics: (1) A flexible image display device including: a window substrate, a polarizing plate, and a touch panel, wherein a distance between a neutral plane and a lower surface of the touch panel based on a visible side during bending is 34% or less to an entire thickness of the flexible image display device. (2) The flexible image display device according to the above (1), further including a display panel disposed on a side opposite to the window substrate based on the polarizing plate and the touch panel. (3) The flexible image display device according to the above (2), wherein a thickness between an upper surface of the window substrate and a lower surface of the display panel is 500 μm or less. (4) The flexible image display device according to the above (2), wherein the window substrate has a thickness thicker than a total thickness of the polarizing plate, the touch panel and the display panel, and an elastic modulus larger than an elastic modulus of a laminate of the polarizing plate, the touch panel and the display panel. (5) The flexible image display device according to the above (2), wherein the window substrate, the touch panel and the display panel have an elastic modulus of 2 GPa to 7 GPa, respectively, and the polarizing plate has an elastic modulus of 7 GPa or less. (6) The flexible image display device according to the above (2), wherein optical clear adhesive layers are located between the window substrate and the polarizing plate, and between the touch panel and the display panel. (7) The flexible image display device according to the above (1), wherein a substrate of the touch panel has a toughness of 2,000 Mpa % or more. (8) The flexible image display device according to the above (1), wher...",
  "patent_number": "None",
  "abstract": "A flexible image display device includes a window substrate, a polarizing plate, and a touch panel, wherein a distance between a neutral plane and a lower surface of the touch panel based on a visible side during bending is 34% or less to an entire thickness of the flexible image display device. The flexible image display device has excellent flexibility and may significantly reduce a defect rate due to a damage of the touch panel by minimizing the damage of the touch panel even if repeatedly applying bending fatigue thereto.",
  "publication_number": "US20170147117A1-20170525",
  "_processing_info": {
    "original_size": 45197,
    "optimized_size": 3239,
    "reduction_percent": 92.83
  }
}