{
  "decision": "REJECTED",
  "application_number": "15359520",
  "date_published": "20170316",
  "date_produced": "20170301",
  "title": "METHOD FOR PREVENTING SELECTED PIXELS IN A BACKGROUND IMAGE FROM SHOWING THROUGH CORRESPONDING PIXELS IN A TRANSPARENCY LAYER",
  "filing_date": "20161122",
  "inventor_list": [
    {
      "inventor_name_last": "Vlahos",
      "inventor_name_first": "Paul E.",
      "inventor_city": "Tarzana",
      "inventor_state": "CA",
      "inventor_country": "US"
    }
  ],
  "ipcr_labels": [
    "G06T1160",
    "H04N975",
    "G06K962",
    "G06T700",
    "G06K946"
  ],
  "main_ipcr_label": "G06T1160",
  "summary": "<SOH> SUMMARY OF THE INVENTION <EOH>The invention provides an improved method to integrate the presenter with his presentation material by using the presentation image as the foreground with both opaque areas and transparent areas through which the presenter can be seen as though standing behind it, and do this in a way that does not obscure nor degrade the readability of the text or other detail shown in the presentation material. In addition, any video source, either live or recorded, can be shown as the background instead of the presenter. These can be, for example, live images of the participants, collectively, like in a classroom, or individually, or of another presenter whose image is received from a distant location. If the graphics foreground layer is composited over the distant participant, it can be sent back to the participant so he can see himself behind the graphics facilitating his interaction. The present invention converts an image into a variable density transparency, or “foreground image with matte”, on which the readability of text and other detail is preserved after compositing with a background, and which allows the background to be seen through areas in the foreground while maintaining some of the color of the foreground areas.",
  "patent_number": "None",
  "abstract": "The present invention converts an image into a transparency, or “foreground image layer”, on which the readability of text and other detail is preserved after compositing with a background, while maintaining color information of broad areas of the image. In an embodiment, a matte is determined for the background image to reduce transparencies in the foreground layer, so as to prevent irrelevant parts of the background image from showing through. This is in distinction to only using the original foreground image data (prior to its transformation to a layer) to compute a matte (or mask, or alpha channel) to form a foreground layer.",
  "publication_number": "US20170076483A1-20170316",
  "_processing_info": {
    "original_size": 26273,
    "optimized_size": 2583,
    "reduction_percent": 90.17
  }
}