{
  "date_produced": "20171011",
  "publication_number": "US20170308803A1-20171026",
  "main_ipcr_label": "G06N9900",
  "decision": "PENDING",
  "application_number": "15357775",
  "inventor_list": [
    {
      "inventor_name_last": "Wallman",
      "inventor_name_first": "Joel J.",
      "inventor_city": "Kitchener",
      "inventor_state": "",
      "inventor_country": "CA"
    },
    {
      "inventor_name_last": "Emerson",
      "inventor_name_first": "Joseph",
      "inventor_city": "Kitchener",
      "inventor_state": "",
      "inventor_country": "CA"
    }
  ],
  "abstract": "In a general aspect, randomized compiling techniques for quantum computing are described. In some aspects, an initial quantum-logic gate sequence is received. A modified quantum-logic gate sequence is generated by applying virtual random gates to the initial quantum-logic gate sequence, such that the initial quantum-logic gate sequence is logically equivalent to the modified quantum-logic gate sequence. The modified quantum-logic gate sequence can be provided to a quantum information processor for execution.",
  "filing_date": "20161121",
  "patent_number": "None",
  "summary": "<SOH> BRIEF DESCRIPTION OF DRAWINGS <EOH>FIG. 1 is a schematic diagram showing aspects of an example system that includes a compiler system and a quantum device. FIG. 2 is a flow chart showing an example quantum computation process. FIG. 3A shows an example of an initial quantum-logic gate sequence. FIG. 3B shows an example of a modified quantum-logic gate sequence. FIG. 3C shows another example of a modified quantum-logic gate sequence 300 C. FIG. 4A shows an example of an initial quantum-logic circuit. FIG. 4B shows an example of a modified quantum-logic circuit FIG. 4C shows another example of a modified quantum-logic circuit FIG. 4D shows another example of a modified quantum-logic circuit. FIG. 4E shows a noise-tailored quantum-logic circuit. FIG. 5 is a plot showing an upper bound on worst-case errors in simulated executions of an example quantum-logic circuit. FIG. 6 is a plot showing errors in simulated executions of an example quantum-logic circuit. FIG. 7 is a plot showing errors in simulated executions of an example quantum-logic circuit. detailed-description description=\"Detailed Description\" end=\"lead\"?",
  "date_published": "20171026",
  "title": "Randomized Compiling for Quantum Computation",
  "ipcr_labels": [
    "G06N9900",
    "G06F1711",
    "B82Y1000"
  ],
  "_processing_info": {
    "original_size": 99036,
    "optimized_size": 2352,
    "reduction_percent": 97.63
  }
}