{
  "date_produced": "20180509",
  "publication_number": "US20180144235A1-20180524",
  "main_ipcr_label": "G06N300",
  "decision": "PENDING",
  "application_number": "15356826",
  "inventor_list": [
    {
      "inventor_name_last": "GROUND, Jr.",
      "inventor_name_first": "James C.",
      "inventor_city": "Wappingers Falls",
      "inventor_state": "NY",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "HANS",
      "inventor_name_first": "David F.",
      "inventor_city": "Castleton",
      "inventor_state": "NY",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "McDONALD",
      "inventor_name_first": "Kirsten B.",
      "inventor_city": "Poughkeepsie",
      "inventor_state": "NY",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "VAN BUSKIRK, II",
      "inventor_name_first": "Ronald E.",
      "inventor_city": "Nederland",
      "inventor_state": "CO",
      "inventor_country": "US"
    }
  ],
  "abstract": "A cognitive meeting assistant facility is provided for assisting a moderator in an online meeting. The cognitive meeting assistant facility automatically categorizes chat questions of participants of the online meeting based on content into multiple categories of chat questions. One or more categories of chat questions of the multiple categories of chat questions include multiple questions of different participants of the online meeting. Further, the cognitive meeting assistant facility deploys the multiple categories of chat questions for display to the participants of the online meeting. The deploying includes, for each category of the at least one category of chat questions, providing a category-applicable answer for display to the participants of the online meeting in association with that category of chat questions.",
  "filing_date": "20161121",
  "patent_number": "None",
  "summary": "<SOH> SUMMARY <EOH>Shortcomings of the prior art are overcome and additional advantages are provided through the provision of a computer-implemented method which includes, for instance, categorizing chat questions of participants of the online meeting based on content into multiple categories of chat questions. At least one category of chat questions of the multiple categories of chat questions includes multiple questions of different participants of the online meeting. The method further includes deploying the multiple categories of chat questions for display to the participants of the online meeting. The deploying includes, for each category of the at least one category of chat questions of the multiple categories of chat questions, providing a category-applicable answer for display to the participants of the online meeting in association with that category of chat questions. Systems and computer program products relating to one or more aspects are also described and claimed herein. Further, services relating to one or more aspects are also described and may be claimed herein. Additional features and advantages are realized through the techniques of the present invention. Other embodiments and aspects of the invention are described in detail herein and are considered a part of the claimed invention.",
  "date_published": "20180524",
  "title": "COGNITIVE ONLINE MEETING ASSISTANT FACILITY",
  "ipcr_labels": [
    "G06N300",
    "G06Q1010",
    "G06N9900",
    "G06N504",
    "G06F1730"
  ],
  "_processing_info": {
    "original_size": 70860,
    "optimized_size": 3206,
    "reduction_percent": 95.48
  }
}