{
  "decision": "ACCEPTED",
  "application_number": "15353253",
  "date_published": "20170309",
  "date_produced": "20170223",
  "title": "ELECTRONIC DEVICE HAVING TOUCH SCREEN AND METHOD FOR CHANGING DATA DISPLAYED ON THE TOUCH SCREEN",
  "filing_date": "20161116",
  "inventor_list": [
    {
      "inventor_name_last": "KIM",
      "inventor_name_first": "Eun Sun",
      "inventor_city": "Seoul",
      "inventor_state": "",
      "inventor_country": "KR"
    },
    {
      "inventor_name_last": "PARK",
      "inventor_name_first": "Kyung Dae",
      "inventor_city": "Seoul",
      "inventor_state": "",
      "inventor_country": "KR"
    },
    {
      "inventor_name_last": "KWAG",
      "inventor_name_first": "Mi Na",
      "inventor_city": "Seoul",
      "inventor_state": "",
      "inventor_country": "KR"
    },
    {
      "inventor_name_last": "KIM",
      "inventor_name_first": "Byung Joo",
      "inventor_city": "Seoul",
      "inventor_state": "",
      "inventor_country": "KR"
    },
    {
      "inventor_name_last": "UM",
      "inventor_name_first": "Tae Won",
      "inventor_city": "Seoul",
      "inventor_state": "",
      "inventor_country": "KR"
    },
    {
      "inventor_name_last": "YOOK",
      "inventor_name_first": "Hyung Min",
      "inventor_city": "Seoul",
      "inventor_state": "",
      "inventor_country": "KR"
    },
    {
      "inventor_name_last": "LEE",
      "inventor_name_first": "Eun Soo",
      "inventor_city": "Seoul",
      "inventor_state": "",
      "inventor_country": "KR"
    }
  ],
  "ipcr_labels": [
    "G06F30488",
    "G06F30484",
    "G04G2108",
    "G04G902",
    "G04G504",
    "G06F3041",
    "G06F30482"
  ],
  "main_ipcr_label": "G06F30488",
  "summary": "<SOH> SUMMARY OF THE INVENTION <EOH>Exemplary embodiments of the present invention provide a device having a touch screen and a method for changing data displayed on the touch screen of the device. Additional features of the invention will be set forth in the description which follows, and in part will be apparent from the description, or may be learned by practice of the invention. Exemplary embodiments of the present invention disclose a method for changing data displayed on a device. The method includes displaying a time data in a display block. And the display block is arranged on a touch screen. The method also includes detecting a touch gesture or a drag gesture on the display block. The method includes replacing the time data with a second time data according to the touch gesture or the drag gesture. Exemplary embodiments of the present invention disclose a device including a display unit including a display block to display a time data. The device also includes a touch sensor configured to detect a touch gesture or a drag gesture. And the touch sensor is arranged in the display block. The device further includes a control unit configured to control the display unit to display the time data, and configured to replace the time data in the display block with a second time data in response to detection of the touch gesture or the drag gesture. Exemplary embodiments of the present invention disclose a method for receiving time data currently being indicated from a display block in time data display mode and the display block may be arranged to a screen. The method also includes determining a value of a touch gesture or a drag gesture applied to the display block. And the value corresponds to a speed, a distance, a direction and a duration of the respective gesture and a coordinated gesture based on the touch gesture and the drag gesture. The method also includes replacing the time data with new time data according to the value determined by the touch gesture, the...",
  "patent_number": "10031665",
  "abstract": "In a time data display mode, a time data is displayed in at least one display block partially assigned to a touch screen of an electronic device. After the touch gesture or the drag gesture is detected in one of the display block, the current time data in the display block can be replaced with a new time data according to the touch gesture or the drag gesture. The new time data may be a following time data or a previous time data which can be determined according to a location of the touch gesture, or a direction and a distance of the drag gesture. In addition, the extent of a change in the time data may be determined according to duration of the touch gesture or a speed of the drag gesture.",
  "publication_number": "US20170068441A1-20170309",
  "_processing_info": {
    "original_size": 57305,
    "optimized_size": 4198,
    "reduction_percent": 92.67
  }
}