{
  "decision": "PENDING",
  "application_number": "15359598",
  "date_published": "20180524",
  "date_produced": "20180509",
  "title": "Electronic Personal Signature Generation And Distribution For Personal Communication",
  "filing_date": "20161122",
  "inventor_list": [
    {
      "inventor_name_last": "Bartkiewicz",
      "inventor_name_first": "Drew Charles",
      "inventor_city": "Canton",
      "inventor_state": "CT",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Bartkiewicz",
      "inventor_name_first": "Dane Alfred",
      "inventor_city": "Canton",
      "inventor_state": "CT",
      "inventor_country": "US"
    }
  ],
  "ipcr_labels": [
    "G06F1721",
    "H04L1258",
    "G06F1730",
    "H04L2906",
    "G06F30484"
  ],
  "main_ipcr_label": "G06F1721",
  "summary": "<SOH> SUMMARY OF THE INVENTION <EOH>This summary is provided to introduce a selection of concepts in a simplified form that are further disclosed in the detailed description of the invention. This summary is not intended to identify key or essential inventive concepts of the claimed subject matter, nor is it intended for determining the scope of the claimed subject matter. The computer implemented method and system disclosed herein addresses the above mentioned need for generating and delivering an electronically signed and authenticated personalized communication such as a personalized message. That is, the computer implemented method and system disclosed herein generates and delivers a well-crafted personalized communication such as a personal letter, a personal text, a personal message, an image, etc., embedded with an authenticated electronic personal signature. The computer implemented method and system disclosed herein dynamically configures a personal signature based on a theme of the personalized communication and/or sender preferences, while maintaining the integrity and originality of the personal signature. Furthermore, the computer implemented method and system disclosed herein authenticates a personal signature as an autograph of a sender of the personalized communication. The computer implemented method disclosed herein employs a personal communication system comprising at least one processor configured to execute computer program instructions for generating and delivering an electronically signed and authenticated personalized communication. The personal communication system provides a graphical user interface (GUI) to enable a sender of the personalized communication to digitally create a personal signature or digitally compose a personal signature, provide media content for the personalized communication, and position the personal signature on the media content. The personal communication system receives media content and a personal signature compos...",
  "patent_number": "None",
  "abstract": "A computer implemented method and a personal communication system (PCS) for generating and delivering an electronically signed personalized communication are provided. The PCS receives a sender composed personal signature and media content from a sender device. The PCS configures one or more parameters of the received personal signature based on sender preferences, while maintaining integrity and originality of the received personal signature. The PCS positions the personal signature with the configured parameters in a predefined section of the received media content. The PCS generates the personalized communication including the received media content with the positioned personal signature and delivers the generated personalized communication to one or more recipients via one or more delivery modes.",
  "publication_number": "US20180143948A1-20180524",
  "_processing_info": {
    "original_size": 125159,
    "optimized_size": 3597,
    "reduction_percent": 97.13
  }
}