{
  "date_produced": "20180509",
  "publication_number": "US20180144258A1-20180524",
  "main_ipcr_label": "G06N504",
  "decision": "PENDING",
  "application_number": "15357474",
  "inventor_list": [
    {
      "inventor_name_last": "Rahamim",
      "inventor_name_first": "Hezi",
      "inventor_city": "Ranat Gan",
      "inventor_state": "",
      "inventor_country": "IL"
    },
    {
      "inventor_name_last": "Alali",
      "inventor_name_first": "Ohad",
      "inventor_city": "Yavne",
      "inventor_state": "",
      "inventor_country": "IL"
    },
    {
      "inventor_name_last": "Katz",
      "inventor_name_first": "Adi",
      "inventor_city": "Ramat Gan",
      "inventor_state": "",
      "inventor_country": "IL"
    }
  ],
  "abstract": "A processor is configured to process information according to attribute value criteria organized as a decision tree, wherein an attribute value criterion of the attribute value criteria is a range of attribute values, wherein a portion of the attribute value criteria lead to a matching target value among target values of the decision tree, wherein each of the target values, including the matching target value, is assigned a respective priority value, wherein the processor is configured to count, for each specific attribute value, a respective number of particular attribute value appearances in a set of rules and a respective number of attribute value matches comprising range based matches based on range based appearances for the each specific attribute value, wherein the processor determines the decision tree based on information entropy values and information gain values.",
  "filing_date": "20161121",
  "patent_number": "None",
  "summary": "<SOH> BRIEF DESCRIPTION OF THE DRAWINGS <EOH>The present disclosure may be better understood, and its numerous features and advantages made apparent to those skilled in the art by referencing the accompanying drawings. FIG. 1 is a block diagram illustrating an apparatus in accordance with at least one embodiment. FIG. 2 is a flow diagram illustrating a method in accordance with at least one embodiment. FIG. 3 is a block diagram illustrating a decision tree in accordance with at least one embodiment. detailed-description description=\"Detailed Description\" end=\"lead\"? The use of the same reference symbols in different drawings indicates similar or identical items.",
  "date_published": "20180524",
  "title": "NETWORK NODE, INTEGRATED CIRCUIT, AND METHOD FOR CREATING AND PROCESSING INFORMATION ACCORDING TO AN N-ARY MULTI OUTPUT DECISION TREE",
  "ipcr_labels": [
    "G06N504"
  ],
  "_processing_info": {
    "original_size": 50398,
    "optimized_size": 2453,
    "reduction_percent": 95.13
  }
}