{
  "date_produced": "20180207",
  "publication_number": "US20180053101A1-20180222",
  "main_ipcr_label": "G06N504",
  "decision": "PENDING",
  "application_number": "15358633",
  "inventor_list": [
    {
      "inventor_name_last": "Cudworth",
      "inventor_name_first": "Adam John",
      "inventor_city": "London",
      "inventor_state": "",
      "inventor_country": "GB"
    },
    {
      "inventor_name_last": "Primavesi",
      "inventor_name_first": "Alexander Gautam",
      "inventor_city": "London",
      "inventor_state": "",
      "inventor_country": "GB"
    },
    {
      "inventor_name_last": "Holc",
      "inventor_name_first": "Piotr Jerzy",
      "inventor_city": "London",
      "inventor_state": "",
      "inventor_country": "GB"
    },
    {
      "inventor_name_last": "Woodward",
      "inventor_name_first": "Joseph Charles",
      "inventor_city": "London",
      "inventor_state": "",
      "inventor_country": "GB"
    }
  ],
  "abstract": "The description relates to predicting terms based on text inputted by a user. One example includes a computing device comprising a processor configured to send, over a communications network, the text to a remote prediction engine. The processor is configured to send the text to a local prediction engine stored at the computing device, and to monitor for a local predicted term from the local prediction engine and a remote predicted term from the remote prediction engine, in response to the sent text. The computing device includes a user interface configured to present a final predicted term to the user such that the user is able to select the final term. The processor is configured to form the final predicted term using either the remote predicted term or the local predicted term on the basis of a time interval running from the time at which the user input the text.",
  "filing_date": "20161122",
  "patent_number": "None",
  "summary": "<SOH> SUMMARY <EOH>The following presents a simplified summary of the disclosure in order to provide a basic understanding to the reader. This summary is not intended to identify key features or essential features of the claimed subject matter nor is it intended to be used to limit the scope of the claimed subject matter. Its sole purpose is to present a selection of concepts disclosed herein in a simplified form as a prelude to the more detailed description that is presented later. The description relates to predicting terms based on text inputted by a user. One example can include a computing device comprising a memory storing text that the user has inputted to the computing device. The computing device also includes a processor configured to send, over a communications network, the text to a remote prediction engine having been trained to predict terms from text. The processor is also configured to send the text to a local prediction engine stored at the computing device. The processor is configured to monitor for a local predicted term from the local prediction engine and to monitor for a remote predicted term from the remote prediction engine, in response to the sent text. The computing device also includes a user interface configured to present a final predicted term to a user of the computing device such that the user is able to select the final term to enter the final predicted term into the computing device. The processor is configured to form the final predicted term using either the remote predicted term or the local predicted term on the basis of a time interval running from the time at which the user input the text. Many of the attendant features will be more readily appreciated as the same becomes better understood by reference to the following detailed description considered in connection with the accompanying drawings.",
  "date_published": "20180222",
  "title": "REMOTE AND LOCAL PREDICTIONS",
  "ipcr_labels": [
    "G06N504",
    "G06N9900",
    "H04L2908"
  ],
  "_processing_info": {
    "original_size": 31120,
    "optimized_size": 3734,
    "reduction_percent": 88.0
  }
}