{
  "decision": "PENDING",
  "application_number": "15353316",
  "date_published": "20170518",
  "date_produced": "20170503",
  "title": "Apparatus To Provide A 3-D Simulation-Experience For a Non-Point-of-Sale Logistics and Supply Chain Challenge",
  "filing_date": "20161116",
  "inventor_list": [
    {
      "inventor_name_last": "High",
      "inventor_name_first": "Donald R.",
      "inventor_city": "Noel",
      "inventor_state": "MO",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Natarajan",
      "inventor_name_first": "Chandrashekar",
      "inventor_city": "San Ramon",
      "inventor_state": "CA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Gat",
      "inventor_name_first": "Dhaval",
      "inventor_city": "Bangalore",
      "inventor_state": "",
      "inventor_country": "IN"
    }
  ],
  "ipcr_labels": [
    "G06Q1008",
    "G06F300",
    "G06F30481",
    "G06F316",
    "G06F301"
  ],
  "main_ipcr_label": "G06Q1008",
  "summary": "<SOH> BRIEF DESCRIPTION OF THE DRAWINGS <EOH>The above needs are at least partially met through provision of an apparatus to provide a 3-D simulation-experience for a non-point-of-sale logistics and supply chain challenge described in the following detailed description, particularly when studied in conjunction with the drawings, wherein: FIG. 1 comprises a flow diagram as configured in accordance with various embodiments of these teachings; and FIG. 2 comprises a block diagram as configured in accordance with various embodiments of these teachings. detailed-description description=\"Detailed Description\" end=\"lead\"? Elements in the figures are illustrated for simplicity and clarity and have not necessarily been drawn to scale. For example, the dimensions and/or relative positioning of some of the elements in the figures may be exaggerated relative to other elements to help to improve understanding of various embodiments of the present teachings. Also, common but well-understood elements that are useful or necessary in a commercially feasible embodiment are often not depicted in order to facilitate a less obstructed view of these various embodiments of the present teachings. Certain actions and/or steps may be described or depicted in a particular order of occurrence while those skilled in the art will understand that such specificity with respect to sequence is not actually required. The terms and expressions used herein have the ordinary technical meaning as is accorded to such terms and expressions by persons skilled in the technical field as set forth above except where different specific meanings have otherwise been set forth herein.",
  "patent_number": "None",
  "abstract": "A memory stores a plurality of selected non-point-of-sale (POS) retail sales logistics and supply chain locales and a virtual reality visual interface provides a three-dimensional simulation experience using those locales. At least one camera in the three-dimensional simulation-experience area provides images of a user experiencing the simulation and at least one microphone receives verbalized input from the user during such an experience. By one approach, a computer operably couples to the foregoing elements and serves to present these user with at least one retail sales non-POS logistics and supply chain challenge that features a selected one of the non-POS retail sales logistics and supply chain locales. That computer then monitors the user's response to the challenge via at least the camera and the microphone and advances the simulation experience based upon the user's responses by selectively presenting at least one additional retail sales non-POS logistics and supply chain challe...",
  "publication_number": "US20170140334A1-20170518",
  "_processing_info": {
    "original_size": 37156,
    "optimized_size": 3609,
    "reduction_percent": 90.29
  }
}