{
  "decision": "ACCEPTED",
  "application_number": "15352157",
  "date_published": "20170302",
  "date_produced": "20170214",
  "title": "AUDIENCE MIGRATION INFORMATION",
  "filing_date": "20161115",
  "inventor_list": [
    {
      "inventor_name_last": "Kirkendall-Rodriguez",
      "inventor_name_first": "Brice",
      "inventor_city": "New York",
      "inventor_state": "NY",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Generali",
      "inventor_name_first": "Philippe",
      "inventor_city": "Scarsdale",
      "inventor_state": "NY",
      "inventor_country": "US"
    }
  ],
  "ipcr_labels": [
    "G06Q3002",
    "H04N2124",
    "H04H6033",
    "H04H6046",
    "H04H6044",
    "H04H6031"
  ],
  "main_ipcr_label": "G06Q3002",
  "summary": "<SOH> SUMMARY <EOH>Audience migration information can include information about audience members who tuned to, or away from, a station at particular times, and can suggest or indicate an average number of audience members over a first time period, a rate of change in the average number of audience members over a first time period, a number of audience members over a second period, and a rate of change in the number of audience members over a second period. Normalized audience migration information, which can indicate a difference between the two rates of change, can be generated and used as one of multiple graph plots. A graphical user interface (GUI) can be used to present the audience migration information in various forms. A method according to at least one embodiment includes obtaining first audience migration information suggesting a rate of change in a number of audience members over an first interval of time; obtaining second audience migration information indicating a rate of change in an average number of audience members over a second interval of time; and generating normalized audience migration information indicating a difference between the first audience migration information and the second audience migration information. In some embodiments, the normalized audience migration information can be generated at a data server, a web server, or another suitable server or computer system. In other embodiments, first audience migration information and the second audience migration information can be transmitted to a networked computer system, where the normalized audience migration information can be generated using, for example, a browser program. A method according to some embodiments includes obtaining audience migration information, and displaying a graphical representation of at least a portion of the audience migration information. The audience migration information in some such embodiments includes first information indicating a number of audience membe...",
  "patent_number": "9679302",
  "abstract": "Event records can include session data representing a particular consumer and a particular standard period of time, and can include station identification information indicating a media station to which the consumer was tuned during standard period of time. Records can be designated as overlapping event records if multiple event records represent the same consumer and the same period of time, but identify different media stations, and at least some overlapping event records can be eliminated from consideration before determining audience migration information. Audience migration information, including tune-ins and tune-outs, can be determined based on whether or not a consumer has multiple event records showing different media stations at adjacent times. The audience migration information can then be transmitted to an end-user machine for display.",
  "publication_number": "US20170061451A1-20170302",
  "_processing_info": {
    "original_size": 86732,
    "optimized_size": 3607,
    "reduction_percent": 95.84
  }
}