{
  "decision": "PENDING",
  "application_number": "15358809",
  "date_published": "20180503",
  "date_produced": "20180418",
  "title": "SYSTEMS AND METHODS FOR OPTIMIZING NORMALIZATION OF PRODUCT ATTRIBUTES FOR A WEBPAGE OF AN ONLINE RETAILER",
  "filing_date": "20161122",
  "inventor_list": [
    {
      "inventor_name_last": "Yang",
      "inventor_name_first": "Binwei",
      "inventor_city": "Sunnyvale",
      "inventor_state": "CA",
      "inventor_country": "US"
    }
  ],
  "ipcr_labels": [
    "G06Q3006",
    "G06F1730"
  ],
  "main_ipcr_label": "G06Q3006",
  "summary": "<SOH> BRIEF DESCRIPTION OF THE DRAWINGS <EOH>To facilitate further description of the embodiments, the following drawings are provided in which: FIG. 1 illustrates a front elevational view of a computer system that is suitable for implementing various embodiments of the systems disclosed in FIGS. 3 and 5 ; FIG. 2 illustrates a representative block diagram of an example of the elements included in the circuit boards inside a chassis of the computer system of FIG. 1 ; FIG. 3 illustrates a representative block diagram of a system, according to an embodiment; FIG. 4 is a first flowchart for a method, according to certain embodiments; FIG. 5 illustrates a representative block diagram of a portion of the system of FIG. 3 , according to an embodiment; FIG. 6A illustrates a display of values on a webpage according to conventional system and methods; FIG. 6B illustrates a display of final normalized values on a webpage, according to an embodiment; and FIG. 7 is a second flowchart for a method, according to certain embodiments. detailed-description description=\"Detailed Description\" end=\"lead\"? For simplicity and clarity of illustration, the drawing figures illustrate the general manner of construction, and descriptions and details of well-known features and techniques may be omitted to avoid unnecessarily obscuring the present disclosure. Additionally, elements in the drawing figures are not necessarily drawn to scale. For example, the dimensions of some of the elements in the figures may be exaggerated relative to other elements to help improve understanding of embodiments of the present disclosure. The same reference numerals in different figures denote the same elements. The terms “first,” “second,” “third,” “fourth,” and the like in the description and in the claims, if any, are used for distinguishing between similar elements and not necessarily for describing a particular sequential or chronological order. It is to be understood that the terms so used are interchangeab...",
  "patent_number": "None",
  "abstract": "Systems and methods including one or more processing modules and one or more non-transitory storage modules storing computing instructions configured to run on the one or more processing modules and perform acts of receiving a plurality of normalization rules, using the plurality of normalization rules and a multi-class classification algorithm to train a classification model for one or more product attributes of a plurality of products, determining additional normalization rules for transforming additional structured values to additional final normalized values based on a classification of un-normalized additional raw source values with the classification model, validating the additional normalization rules, and adding the additional normalization rules to the classification model if the additional normalization rules are validated.",
  "publication_number": "US20180121979A1-20180503",
  "_processing_info": {
    "original_size": 110955,
    "optimized_size": 3496,
    "reduction_percent": 96.85
  }
}