{
  "date_produced": "20180509",
  "publication_number": "US20180144267A1-20180524",
  "main_ipcr_label": "G06N9900",
  "decision": "PENDING",
  "application_number": "15359971",
  "inventor_list": [
    {
      "inventor_name_last": "Sheppard",
      "inventor_name_first": "Michael",
      "inventor_city": "Holland",
      "inventor_state": "MI",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Daemen",
      "inventor_name_first": "Ludo",
      "inventor_city": "Duffel",
      "inventor_state": "",
      "inventor_country": "BE"
    },
    {
      "inventor_name_last": "Cui",
      "inventor_name_first": "Xiaoqi",
      "inventor_city": "Darien",
      "inventor_state": "IL",
      "inventor_country": "US"
    }
  ],
  "abstract": "Methods, apparatus, systems and articles of manufacture are disclosed to improve multi-demographic modeling efficiency. An example apparatus includes a feature set aggregator to segregate training data based on feature sets of interest, and to identify households that participate in at least one of the feature sets of interest, a class enumerator to reduce multi-demographic model iterations by enumerating demographic combinations for the identified households, the enumerated demographic combinations including a single identifier to represent a combination of two or more demographic categories, and a modeling engine to generate training coefficients associated with respective ones of the enumerated demographic combinations.",
  "filing_date": "20161123",
  "patent_number": "None",
  "summary": "<SOH> BRIEF DESCRIPTION OF THE DRAWINGS <EOH>FIG. 1 is a schematic illustration of a demographic modeling system constructed in accordance with the teachings of this disclosure to improve multi-demographic modeling efficiency. FIG. 2 is an example training data set analyzed by the example demographic modeling system of FIG. 1 to estimate household demographic information with binary demographic indicators. FIG. 3 is an example training data set analyzed by the example demographic modeling system of FIG. 1 to estimate household demographic information with household member count demographic indicators. FIG. 4 is an example training data set analyzed by the example demographic modeling system of FIG. 1 to estimate household demographic information in connection with third party models. FIGS. 5-8 are flowcharts representative of example machine readable instructions that may be executed to implement the example demographic modeling system and/or the example demographic modeling manager of FIG. 1 to improve multi-demographic modeling efficiency. FIG. 9 is a block diagram of an example processor platform structured to execute the example machine readable instructions of FIGS. 5-8 to implement the example demographic modeling system of FIG. 1 . detailed-description description=\"Detailed Description\" end=\"lead\"?",
  "date_published": "20180524",
  "title": "METHODS, SYSTEMS AND APPARATUS TO IMPROVE MULTI-DEMOGRAPHIC MODELING EFFICIENCY",
  "ipcr_labels": [
    "G06N9900",
    "G06N700"
  ],
  "_processing_info": {
    "original_size": 64692,
    "optimized_size": 2922,
    "reduction_percent": 95.48
  }
}