{
  "date_produced": "20180503",
  "publication_number": "US20180137404A1-20180517",
  "main_ipcr_label": "G06N304",
  "decision": "PENDING",
  "application_number": "15351897",
  "inventor_list": [
    {
      "inventor_name_last": "Fauceglia",
      "inventor_name_first": "Nicolas R.",
      "inventor_city": "Buenos Aires",
      "inventor_state": "",
      "inventor_country": "AR"
    },
    {
      "inventor_name_last": "Gliozzo",
      "inventor_name_first": "Alfio M.",
      "inventor_city": "Brooklyn",
      "inventor_state": "NY",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Hassanzadeh",
      "inventor_name_first": "Oktie",
      "inventor_city": "Port Chester",
      "inventor_state": "NY",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Nguyen",
      "inventor_name_first": "Thien H.",
      "inventor_city": "Brookly",
      "inventor_state": "NY",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Rodriguez Muro",
      "inventor_name_first": "Mariano",
      "inventor_city": "New York",
      "inventor_state": "NY",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Sadoghi Hamedani",
      "inventor_name_first": "Mohammad",
      "inventor_city": "West Lafayette",
      "inventor_state": "IN",
      "inventor_country": "US"
    }
  ],
  "abstract": "A system, method and computer program product for disambiguating one or more entity mentions in one or more documents. The method facilitates the simultaneous linking entity mentions in a document based on convolution neural networks and recurrent neural networks that model both the local and global features for entity linking. The framework uses the capacity of convolution neural networks to induce the underlying representations for local contexts and the advantage of recurrent neural networks to adaptively compress variable length sequences of predictions for global constraints. The RNN functions to accumulate information about the previous entity mentions and/or target entities, and provide them as the global constraints for the linking process of a current entity mention.",
  "filing_date": "20161115",
  "patent_number": "None",
  "summary": "<SOH> SUMMARY <EOH>According to a first aspect, there is provided a use of neural networks to model both the local mention-to-entity similarities and the global relatedness among target entities in a unified architecture. According to an aspect of the present disclosure, there is provided a computer-implemented method for disambiguating one or more entity mentions in one or more documents. The method comprises: receiving, at at least one processor, a set of one or more entity mentions in a document and context data associated with each entity mention; receiving, at the at least one processor, a set of one or more target candidate entities that potentially refers to or describes the entity mentions in the document; running, by the at least one processor, convolutional neural network (CNN) models for identifying and learning local representations associated with each entity mention and target candidate entity and associated context; running recurrent neural networks (RNN) model operations on the at least one processor over the representations of the entity mentions and target candidate entities of the document to capture a topical coherence between the entity mentions and the target candidate entities; and providing a link for each entity mention to link to a respective the target candidates entity in the document based on the identified local features and the topical coherence from the convolutional neural networks and recurrent neural networks. According to another aspect of the present disclosure, there is provided a computer system for disambiguating one or more entity mentions in one or more documents. The computer system comprises: at least one processor; a memory storing instructions to be run at the at least one processor; the instructions configuring the at least one processor to perform a method to: receive a set of one or more entity mentions in a document and context data associated with each entity mention; receive a set of one or more target candidate en...",
  "date_published": "20180517",
  "title": "JOINT LEARNING OF LOCAL AND GLOBAL FEATURES FOR ENTITY LINKING VIA NEURAL NETWORKS",
  "ipcr_labels": [
    "G06N304",
    "G06N308"
  ],
  "_processing_info": {
    "original_size": 76523,
    "optimized_size": 4145,
    "reduction_percent": 94.58
  }
}