{
  "decision": "PENDING",
  "application_number": "15351813",
  "date_published": "20171005",
  "date_produced": "20170920",
  "title": "System and Method for Defining Care Areas in Repeating Structures of Design Data",
  "filing_date": "20161115",
  "inventor_list": [
    {
      "inventor_name_last": "Huang",
      "inventor_name_first": "Junqing",
      "inventor_city": "Fremont",
      "inventor_state": "CA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Konecky",
      "inventor_name_first": "Soren",
      "inventor_city": "Alameda",
      "inventor_state": "CA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Lee",
      "inventor_name_first": "Hucheng",
      "inventor_city": "Cupertino",
      "inventor_state": "CA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Wu",
      "inventor_name_first": "Kenong",
      "inventor_city": "Davis",
      "inventor_state": "CA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Gao",
      "inventor_name_first": "Lisheng",
      "inventor_city": "Morgan Hill",
      "inventor_state": "CA",
      "inventor_country": "US"
    }
  ],
  "ipcr_labels": [
    "G06F1750"
  ],
  "main_ipcr_label": "G06F1750",
  "summary": "<SOH> SUMMARY <EOH>A system is disclosed, in accordance with one or more embodiments of the present disclosure. In one illustrative embodiment, the system includes an inspection tool. In another illustrative embodiment, the system includes a user interface. In another illustrative embodiment, the system includes a controller including one or more processors configured to execute a set of program instructions stored in memory. In another illustrative embodiment, the program instructions are configured to cause the one or more processors to receive design data. In another illustrative embodiment, the design data includes a block of repeating cells. In another illustrative embodiment, the program instructions are configured to cause the one or more processors to present, on the user interface, a particular cell of the block of repeating cells. In another illustrative embodiment, the program instructions are configured to cause the one or more processors to define a first care area associated with a first design of interest in the particular cell. In another illustrated embodiment, the first care area has a first sensitivity threshold. In another illustrative embodiment, the program instructions are configured to cause the one or more processors to define an additional care area associated with an additional design of interest in the particular cell. In another illustrative embodiment, the additional care area has an additional sensitivity threshold. In another illustrative embodiment, the program instructions are configured to cause the one or more processors to identify a set of first care areas within the block of repeating cells by performing a search function to identify additional occurrences of the first design of interest within the block of repeating cells. In another illustrative embodiment, the program instructions are configured to cause the one or more processors to identify a set of additional care areas within the block of repeating cells by performing a ...",
  "patent_number": "None",
  "abstract": "A method includes identifying a first set of a first care area with a first sensitivity threshold, the first care area associated with a first design of interest within a block of repeating cells in design data; identifying an additional set of an additional care area with an additional sensitivity threshold, the additional care area associated with an additional design of interest within the block of repeating cells in design data; identifying one or more defects within the first set of the first care areas in one or more images of a selected region of a sample based on the first sensitivity threshold; and identifying one or more defects within the additional set of the additional care areas in the one or more images of the selected region of the sample based on the additional sensitivity threshold.",
  "publication_number": "US20170286589A1-20171005",
  "_processing_info": {
    "original_size": 85879,
    "optimized_size": 3956,
    "reduction_percent": 95.39
  }
}