{
  "decision": "PENDING",
  "application_number": "15356401",
  "date_published": "20170525",
  "date_produced": "20170510",
  "title": "INPUT/OUTPUT MODE CONTROL FOR AUDIO PROCESSING",
  "filing_date": "20161118",
  "inventor_list": [
    {
      "inventor_name_last": "Deetz",
      "inventor_name_first": "Randall",
      "inventor_city": "Las Vegas",
      "inventor_state": "NV",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Thormundsson",
      "inventor_name_first": "Trausti",
      "inventor_city": "Irvine",
      "inventor_state": "CA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Hutson",
      "inventor_name_first": "Stuart Whitfield",
      "inventor_city": "Austin",
      "inventor_state": "TX",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Sveinsson",
      "inventor_name_first": "Thorarinn",
      "inventor_city": "Irvine",
      "inventor_state": "TX",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Kerner",
      "inventor_name_first": "Yair",
      "inventor_city": "Kiryat Ono",
      "inventor_state": "IL",
      "inventor_country": "US"
    }
  ],
  "ipcr_labels": [
    "G10L1522",
    "H04L2906",
    "H04M700",
    "G10L1518",
    "G06F316"
  ],
  "main_ipcr_label": "G10L1522",
  "summary": "<SOH> SUMMARY <EOH>The present disclosure provides methods and systems that address a need in the art of for configuring and optimizing audio processing. Embodiments of the present disclosure include an analysis of media content and context information available from a user device that is then used to determine the source and context of the audio signal being processed and for which control and optimization of the audio processing configuration may be desired. In one embodiment, audio processing may be configured by monitoring audio activity on a device having at least one microphone and a digital audio processing unit, collecting information from the monitoring of the activity, including an identification of at least one application utilizing audio processing and any associated audio media, and determining a context for the audio processing. In one embodiment, the context may include at least one context resource having associated metadata. An audio configuration is determined based on the application and determined context, and an action is performed to control the audio processing mode. User controls providing addition mode control may be displayed automatically based on a current application and determined context. In another embodiment, a system includes an audio input/output system, including an audio driver and an audio codec, that interfaces with an audio input device, such as one or more microphones, and an audio output device, such as one or more loudspeakers. An audio processing module provides input and/or output audio processing between the audio input/output system and at least one application. In one embodiment, the audio processing module may include acoustic echo cancellation, target source separation, noise reduction and other audio processing modules. An audio processing control module monitors the audio systems and may automatically configure the audio processing. In one embodiment, the audio processing control module includes an audio monitor, a...",
  "patent_number": "None",
  "abstract": "Systems and methods provide input and output mode control for audio processing on a user device. Audio processing may be configured by monitoring audio activity on a device having at least one microphone and a digital audio processing unit, collecting information from the monitoring of the activity, including an identification of at least one application utilizing audio processing, and determining a context for the audio processing, the context including at least one context resource having associated metadata. An audio configuration is determined based on the application and determined context, and an action is performed to control the audio processing mode. User controls providing addition mode control may be displayed automatically based on a current application and determined context.",
  "publication_number": "US20170148438A1-20170525",
  "_processing_info": {
    "original_size": 53684,
    "optimized_size": 3983,
    "reduction_percent": 92.58
  }
}