{
  "date_produced": "20180503",
  "publication_number": "US20180137412A1-20180517",
  "main_ipcr_label": "G06N308",
  "decision": "PENDING",
  "application_number": "15352938",
  "inventor_list": [
    {
      "inventor_name_last": "Nikkhah",
      "inventor_name_first": "Mehdi",
      "inventor_city": "San Jose",
      "inventor_state": "CA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Natarajan",
      "inventor_name_first": "Preethi",
      "inventor_city": "Los Gatos",
      "inventor_state": "CA",
      "inventor_country": "US"
    }
  ],
  "abstract": "A server uses an LSTM neural network to predict a bandwidth value for a computer network element using past traffic data. The server receives a time series of bandwidth utilization of the computer network element. The time series includes bandwidth values associated with a respective time values. The LSTM neural network is trained with a training set selected from at least a portion of the time series. The server generates a predicted bandwidth value associated with a future time value based on the LSTM neural network. The provisioned bandwidth for the computer network element is adjusted based on the predicted bandwidth value.",
  "filing_date": "20161116",
  "patent_number": "None",
  "summary": "<SOH> BRIEF DESCRIPTION OF THE DRAWINGS <EOH>FIG. 1 is a simplified block diagram of a system to predict network utilization in a computer network, according to an example embodiment. FIG. 2 is a simplified block diagram of a prediction engine that forecasts a future bandwidth value, according to an example embodiment. FIG. 3 is a simplified block diagram of a Long Short Term Memory (LSTM) block used in the prediction engine, according to an example embodiment. FIG. 4 is a diagram illustrating the window of past data used to predict a future data point, according to an example embodiment. FIGS. 5A, 5B, and 5C are graphs of predictions of bandwidth utilization for different datasets and usage, according to an example embodiment. FIG. 6 is a flow chart illustrating the operations performed by a server to generate a predicted bandwidth value for a future time, according to an example embodiment. FIG. 7 is a flow chart illustrating the operations performed by a server to generate multiple bandwidth values for future time values, according to an example embodiment. FIG. 8 is a simplified block diagram of a device that that may be configured to perform methods presented herein, according to an example embodiment. detailed-description description=\"Detailed Description\" end=\"lead\"?",
  "date_published": "20180517",
  "title": "NETWORK TRAFFIC PREDICTION USING LONG SHORT TERM MEMORY NEURAL NETWORKS",
  "ipcr_labels": [
    "G06N308",
    "H04L1224"
  ],
  "_processing_info": {
    "original_size": 46738,
    "optimized_size": 2652,
    "reduction_percent": 94.33
  }
}