{
  "date_produced": "20180509",
  "publication_number": "US20180144265A1-20180524",
  "main_ipcr_label": "G06N9900",
  "decision": "PENDING",
  "application_number": "15357559",
  "inventor_list": [
    {
      "inventor_name_last": "Bonawitz",
      "inventor_name_first": "Keith",
      "inventor_city": "Watchung",
      "inventor_state": "NJ",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Ramage",
      "inventor_name_first": "Daniel",
      "inventor_city": "Seattle",
      "inventor_state": "WA",
      "inventor_country": "US"
    }
  ],
  "abstract": "The present disclosure provides systems and methods for the management and/or evaluation of machine-learned models based on locally logged data. In one example, a user computing device can obtain a machine-learned model (e.g., from a server computing device) and can evaluate at least one performance metric for the machine-learned model. In particular, the at least one performance metric for the machine-learned model can be evaluated relative to data that is stored locally at the user computing device. The user computing device and/or the server computing device can determine whether to activate the machine-learned model on the user computing device based at least in part on the at least one performance metric. In another example, the user computing device can evaluate a plurality of machine-learned models against locally stored data. At least one of the models can be selected based on the evaluated performance metrics.",
  "filing_date": "20161121",
  "patent_number": "None",
  "summary": "<SOH> SUMMARY <EOH>Aspects and advantages of embodiments of the present disclosure will be set forth in part in the following description, or can be learned from the description, or can be learned through practice of the embodiments. One example aspect of the present disclosure is directed to a computer-implemented method to manage machine-learned models. The method includes obtaining, by a user computing device, a plurality of machine-learned models. The method includes evaluating, by the user computing device, at least one performance metric for each of the plurality of machine-learned models. The at least one performance metric for each machine-learned model is evaluated relative to data that is stored locally at the user computing device. The method includes determining, by the user computing device, a selection of a first machine-learned model from the plurality of machine-learned models based at least in part on the performance metrics respectively evaluated for the plurality of machine-learned models. The method includes using, by the user computing device, the selected first machine-learned model to obtain one or more predictions. Another example aspect of the present disclosure is directed to a computing device. The computing device includes one or more processors and one or more non-transitory computer-readable media that collectively store instructions that, when executed by the one or more processors, cause the computing device to perform operations. Execution of the instructions causes the computing device to obtain a machine-learned model. Execution of the instructions causes the computing device to evaluate at least one performance metric for the machine-learned model. The at least one performance metric for the machine-learned model is evaluated relative to data that is stored locally at the computing device. Execution of the instructions causes the computing device to determine whether to activate the machine-learned model based at least in part on ...",
  "date_published": "20180524",
  "title": "Management and Evaluation of Machine-Learned Models Based on Locally Logged Data",
  "ipcr_labels": [
    "G06N9900",
    "G06N502"
  ],
  "_processing_info": {
    "original_size": 80266,
    "optimized_size": 3659,
    "reduction_percent": 95.44
  }
}