{
  "decision": "PENDING",
  "application_number": "15358018",
  "date_published": "20170615",
  "date_produced": "20170603",
  "title": "SYSTEMS AND METHODS OF CLASSIFYING CONTENT ITEMS",
  "filing_date": "20161121",
  "inventor_list": [
    {
      "inventor_name_last": "Bernhardsson",
      "inventor_name_first": "Erik",
      "inventor_city": "New York",
      "inventor_state": "NY",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Faaborg",
      "inventor_name_first": "Kevin",
      "inventor_city": "New York",
      "inventor_state": "NY",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Li",
      "inventor_name_first": "Yinghao",
      "inventor_city": "New York",
      "inventor_state": "NY",
      "inventor_country": "US"
    }
  ],
  "ipcr_labels": [
    "G06F1730"
  ],
  "main_ipcr_label": "G06F1730",
  "summary": "<SOH> SUMMARY <EOH>Some implementations of the present invention address these and other problems. Some implementation offer a streaming music service based on search, play, and playlists. For instance, a user can type the name of an artist or track and search for it to find it. The user can then click the found track to play it. The user can repeat this process, finding and playing new tracks they recall. Some implementations provide for the creation of playlists. Instead of playing an individual track right now, a user can include it in a playlist (e.g., by dragging it into a playlist in a user interface). This allows users to organize tracks, and play them later. Users frequently create multiple playlists, and can give each playlist a text name. Users create playlists to group together music that holds some common meaning to them. Some implementations offer an online radio feature. This radio feature plays an endless sequence of songs. The user does not know which song will play next. If the user doesn't like the song currently playing, a “Skip” of “Skip Forward” button moves to the next song immediately. To create a new radio station, a user first identifies a “seed.” This seed can be one or more individual tracks, one or more artists, one or more albums, one or more playlists, a music genre, or combinations of these. A software system “programs” the radio station, choosing which tracks to play dynamically. In some implementations, an Internet radio station is associated with a single user or user ID. In some implementations, Internet radio stations can be shared with other users. In some implementations, the selection criteria for an Internet radio station are based on input from two or more users. The techniques described above with respect to audio tracks can also be applied more generally to other content items, such as video, animations, and even some online games. The success of an Internet radio station can be measured based on a number of quantitative fa...",
  "patent_number": "None",
  "abstract": "A method of classifying content items utilizes user-generated playlists. A content item is included in playlists from a plurality of distinct users. A server system receives, from respective users of the plurality of distinct users, respective playlist titles for the playlists. In accordance with a determination that the respective playlist titles from a threshold number of the plurality of distinct users specify a first attribute, the server system assigns the first attribute to the content item. The server system receives a request, from a first user via an application that is executing on a client device that is distinct from the server system, for content having the first attribute. In response to receiving the request, the server system selects the content item according to the first attribute and delivers the selected content item for playback to the first user.",
  "publication_number": "US20170169107A1-20170615",
  "_processing_info": {
    "original_size": 89681,
    "optimized_size": 3751,
    "reduction_percent": 95.82
  }
}