{
  "decision": "PENDING",
  "application_number": "15355000",
  "date_published": "20170518",
  "date_produced": "20170503",
  "title": "DEVICE FOR PROVIDING HEALTH MANAGEMENT SERVICE AND METHOD THEREOF",
  "filing_date": "20161117",
  "inventor_list": [
    {
      "inventor_name_last": "Lee",
      "inventor_name_first": "Kyung Hee",
      "inventor_city": "Gyeonggi-do",
      "inventor_state": "",
      "inventor_country": "KR"
    },
    {
      "inventor_name_last": "Lee",
      "inventor_name_first": "Hae Dong",
      "inventor_city": "Daegu",
      "inventor_state": "",
      "inventor_country": "KR"
    },
    {
      "inventor_name_last": "Chun",
      "inventor_name_first": "Jae Woong",
      "inventor_city": "Gyeonggi-do",
      "inventor_state": "",
      "inventor_country": "KR"
    },
    {
      "inventor_name_last": "Choi",
      "inventor_name_first": "Won Suk",
      "inventor_city": "Seoul",
      "inventor_state": "",
      "inventor_country": "KR"
    }
  ],
  "ipcr_labels": [
    "G06F1900",
    "G06F30482"
  ],
  "main_ipcr_label": "G06F1900",
  "summary": "<SOH> SUMMARY <EOH>To address the above-discussed deficiencies, it is a primary object to provide an electronic device that provides a health management UI for determining health information that is necessary to provide an application and a method of operating the same. In accordance with various embodiments of the present disclosure, a method performed in an electronic device may include displaying a service indication, which corresponds to a service to be provided through an application, through a display operatively connected with the electronic device in connection with a first health information indication corresponding to first health information and a second health information indication corresponding to second health information, obtaining an input to the displayed service indication, and allowing an access of the application to the first health information and the second health information based at least on the input. In accordance with an aspect of the present disclosure, an electronic device includes a memory configured to store a service indication corresponding to a service to be provided through an application and a processor. The processor is configured to display the service indication and a first health information indication corresponding to first health information and a second health information indication corresponding to second health information through a display operatively connected with the processor in connection with the service indication, to obtain an input to the displayed service indication and to allow an access of the application to the first health information and the second health information based at least on the input. In accordance with an aspect of the present disclosure, an electronic device includes a display circuit configured to display a health management user interface (UI), a user input circuit configured to obtain a user input from a user, and at least one processor electrically connected with the display circuit and t...",
  "patent_number": "None",
  "abstract": "A method performed in an electronic device includes displaying, on a display operatively connected to the electronic device, a service indication corresponding to a service to be provided through an application. The service indication including a first health information indication corresponding to first health information and a second health information indication corresponding to second health information. The method further includes obtaining an input to the displayed service indication, and allowing the application access to the first health information and the second health information based on the input. Another embodiment is an electronic device including a display circuit configured to display a health management UI, a user input circuit configured to obtain a user input, and a processor connected with the display circuit and the user input circuit. The processor configured to group at least one health information item corresponding to a service that a health management applica...",
  "publication_number": "US20170140108A1-20170518",
  "_processing_info": {
    "original_size": 145567,
    "optimized_size": 4000,
    "reduction_percent": 97.25
  }
}