{
  "decision": "PENDING",
  "application_number": "15356456",
  "date_published": "20170309",
  "date_produced": "20170223",
  "title": "SCALABLE DISPLAY OF INTERNET CONTENT ON MOBILE DEVICES",
  "filing_date": "20161118",
  "inventor_list": [
    {
      "inventor_name_last": "Rohrabaugh",
      "inventor_name_first": "Gary B.",
      "inventor_city": "Bellingham",
      "inventor_state": "WA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Sherman",
      "inventor_name_first": "Scott A.",
      "inventor_city": "Seattle",
      "inventor_state": "WA",
      "inventor_country": "US"
    }
  ],
  "ipcr_labels": [
    "G06F1721",
    "G06F1722",
    "G06F30488",
    "G06F1730"
  ],
  "main_ipcr_label": "G06F1721",
  "summary": "<SOH> BRIEF SUMMARY OF THE INVENTION <EOH>In accordance with aspects of the invention, mobile devices are enabled to support resolution-independent scalable display of Internet (Web) content to allow Web pages to be scaled (zoomed) and panned for better viewing on smaller screen sizes are disclosed. The mobile devices employ novel processing of original Web content, including HTML-based content, XML, cascade style sheets, etc. to generate scalable content. The scalable content and/or data derived therefrom are then employed to enable the Web content to be rapidly rendered, zoomed, and panned. Display lists may also be employed to provide further enhancements in rendering speed. According to further aspects, the mobile devices employ touch-sensitive display screens that enable users to provide various inputs to control display of content within Web pages. Exemplary user inputs include tap-based inputs to selectively zoom in on columns, images, and paragraphs. Users can also define a window to zoom in on via the touch-sensitive display. Other features of the present invention will be apparent from the accompanying drawings and from the detailed description that follows.",
  "patent_number": "None",
  "abstract": "Mobile devices enabled to support resolution-independent scalable display of Internet (Web) content to allow Web pages to be scaled (zoomed) and panned for better viewing on smaller screen sizes. The mobile devices employ software-based processing of original Web content, including HTML-based content, XML, cascade style sheets, etc. to generate scalable content. The scalable content and/or data derived therefrom are then employed to enable the Web content to be rapidly rendered, zoomed, and panned. Display lists may also be employed to provide further enhancements in rendering speed. Context zooms, including tap-based zooms on columns, images, and paragraphs are also enabled.",
  "publication_number": "US20170068642A1-20170309",
  "_processing_info": {
    "original_size": 78833,
    "optimized_size": 2603,
    "reduction_percent": 96.7
  }
}