{
  "date_produced": "20180509",
  "publication_number": "US20180144238A1-20180524",
  "main_ipcr_label": "G06N304",
  "decision": "PENDING",
  "application_number": "15361068",
  "inventor_list": [
    {
      "inventor_name_last": "CHEN",
      "inventor_name_first": "ELLEN T.",
      "inventor_city": "ROCKVILLE",
      "inventor_state": "MD",
      "inventor_country": "US"
    }
  ],
  "abstract": "An electromagnetic MEM-transformer includes arrays of nanometer sized first toroidal made by self-assembling organic polymer conductive membrane on top of the first electrode, a vertical solenoid was inserted in the cavity of the first toroid, made by second nano “donuts” cyclodextrin toroids, in the hollow cavity comprising of different electronegativity functional groups; an organic laminate agent forms a linen lining the first cavity of the arrayed toroids in cross bars that is perpendicular to the first and second toroid and leave nanometer space air gap between them, upon applied a DC voltage or a current cross the first electrode with membrane and the second electrode without a membrane, changing currents flow in the bipolar toroids in electron-relay circular forms provide electromagnetism flux and air gaps exists as dielectric substance providing meminductance to the toroids and the changing memcapacitance is also in a hysteresis wave form with on-off switches. Herein, a method ...",
  "filing_date": "20161124",
  "patent_number": "None",
  "summary": "<SOH> SUMMARY OF THE INVENTION <EOH>It is an object of the present invention to provide a new generation of mem-transformer that embodiments with memresistive/memcapacitive/meminductive characteristics that closely linked to neuroscience in particular, they are memory devices which can conduct memory retrieve and storage in biological fluid. It is an object of the present invention to provide a new generation of mem-transformer that was not made by metal oxide, but of biomimetic organic polymer membrane that mimics a normal cylindrical confined acetylecholenesterase (ACHE) eternal gorge as a “normal brain” prosthesis model with a “biomimetic linen” attached in the gorge thereto. It is an object of the present invention to provide a new generation of mem-transformer with new method of making multiple-layers membrane with cross-bridge and bars. It is an object of the present invention to provide a new generation of mem-transformers that are comprising of an biomimetic organic polymer membrane that mimics a mutated acetylecholenesterase (ACHE) eternal gorge with 14 hydrophobic residues groups knocked out, serves as a “damaged brain” prosthesis model. It is an object of the present invention to provide a new generation mem-transformer that mimics a normal brain circuitry integrity from the “normal brain” device and the “mutated ACHE” device mimics damaged brain circuitry, in particular, the neocortex-hyppocampus circuitries with and without the presence of Aβ. It is a still further object of the present invention to provide the mem-transformer having an application in an Energy-Sensory brain circuitry image that dynamically displays the circuitry synapse change and the circuitry surface conformation change over frequencies from SWS to 300 Hz in 3D; and in contour color map and in optical image in the presence of an intruder or analyte, such as Aβ, cancer cells, ACH and viral with 10 −3 to 10 −5 s temporal resolution and sub μm 3 special resolution. The primary group syn...",
  "date_published": "20180524",
  "title": "Nanobiomimetic Memtransformer Apparatus and an Application in Energy-Sensory Images Thereto",
  "ipcr_labels": [
    "G06N304"
  ],
  "_processing_info": {
    "original_size": 112453,
    "optimized_size": 3668,
    "reduction_percent": 96.74
  }
}