{
  "date_produced": "20170809",
  "publication_number": "US20170243119A1-20170824",
  "main_ipcr_label": "G06N502",
  "decision": "PENDING",
  "application_number": "15369550",
  "inventor_list": [
    {
      "inventor_name_last": "Petersen",
      "inventor_name_first": "Chris",
      "inventor_city": "Boulder",
      "inventor_state": "CO",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Villella",
      "inventor_name_first": "Phillip",
      "inventor_city": "Boulder",
      "inventor_state": "CO",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Aisa",
      "inventor_name_first": "Brad",
      "inventor_city": "Lafayette",
      "inventor_state": "CO",
      "inventor_country": "US"
    }
  ],
  "abstract": "An advanced intelligence engine (AIE) for use in identifying what may be complex events or developments on one or more data platforms or networks from various types of structured or normalized data generated by one or more disparate data sources. The AIE may conduct one or more types of quantitative, correlative, behavioral and corroborative analyses to detect events from what may otherwise be considered unimportant or non-relevant information spanning one or more time periods. Events generated by the AIE may be passed to an event manager to determine whether further action is required such as reporting, remediation, and the like.",
  "filing_date": "20161205",
  "patent_number": "None",
  "summary": "<SOH> SUMMARY OF THE INVENTION <EOH>The inventors have determined that traditional SEM solutions have a number of fundamental failings when it comes to detecting sophisticated intrusions, insider threats, and the like. In one regard, these traditional SEM solutions are often limited to logs that are already designated as “events.” For instance, some traditional SEM solutions depend upon a monitored device pre-filtering log messages for allegedly important logs messages and then passing such messages to a processing engine implementing the traditional SEM solutions. Traditional SEM solutions have not been architected or designed to collect and analyze all log data regardless of source. Stated differently, these solutions have generally been designed with a limited scope in mind which has inherently limited their current and future analysis capabilities. In another regard, traditional SEMs have confined themselves to the once thought “holy grail” of security—“correlation” (i.e., processing log messages against rules defining a known pattern of activity, where that pattern of activity may span multiple log messages from different devices). While correlation has at times proved useful, only things well known and understood can be correlated (e.g., knowing any attempted access of a network by a particular IP address is always cause for concern); thus, correlation is often limited based on analysis scope and complexity. Furthermore, each of researching, understanding, and developing these pattern-based rules is inherently complex which further limits overall usefulness. With these shortcomings of traditional SEM solutions in mind, the inventors have determined that systems, apparatuses, processes, methods, etc. (“utilities”) are needed that can collect and analyze most or all log or other types of structured or normalized data (e.g., transactional, activity, etc.) spread across multiple systems, devices, applications and databases and spanning any number of time periods b...",
  "date_published": "20170824",
  "title": "ADVANCED INTELLIGENCE ENGINE",
  "ipcr_labels": [
    "G06N502",
    "G06F1730"
  ],
  "_processing_info": {
    "original_size": 180455,
    "optimized_size": 3502,
    "reduction_percent": 98.06
  }
}