{
  "date_produced": "20180322",
  "publication_number": "US20180096244A1-20180405",
  "main_ipcr_label": "G06N308",
  "decision": "PENDING",
  "application_number": "15366624",
  "inventor_list": [
    {
      "inventor_name_last": "Mallinson",
      "inventor_name_first": "Dominic S.",
      "inventor_city": "Redwood City",
      "inventor_state": "CA",
      "inventor_country": "US"
    }
  ],
  "abstract": "A method for method for classification of virtual reality (VR) content for use in head mounted displays (HMDs). The method includes accessing a model that identifies a plurality of learned patterns associated with the generation of corresponding baseline VR content that is likely to cause discomfort. The method includes executing a first application to generate first VR content. The method includes extracting data associated with simulated user interactions with the first VR content, the extracted data generated during execution of the first application. The method includes comparing the extracted data to the model to identify one or more patterns in the extracted data matching at least one of the learned patterns from the model such that the one or more patterns are likely to cause discomfort.",
  "filing_date": "20161201",
  "patent_number": "None",
  "summary": "<SOH> SUMMARY <EOH>Embodiments of the present disclosure relate to systems and methods for building a model through a deep learning engine that is configured for predicting discomfort of a user when interacting with VR content, and for classifying VR content based on predicted discomfort of a user as determined by the model, and for using the model or a corresponding form of the model to classify users based on experienced discomfort when tested. Several inventive embodiments of the present disclosure are described below. In one embodiment, a method for classification of virtual reality (VR) content for use in head mounted displays (HMDs) is disclosed. The method includes accessing a model that identifies a plurality of learned patterns associated with the generation of corresponding baseline VR content that is likely to cause discomfort. The method includes executing a first application to generate first VR content. The method includes extracting data associated with simulated user interactions with the first VR content, the extracted data generated during execution of the first application. The method includes comparing the extracted data to the model to identify one or more patterns in the extracted data matching at least one of the learned patterns from the model such that the one or more patterns are likely to cause discomfort Further, the model is generated by applying deep learning techniques. In one embodiment, the deep learning technique disclosed includes executing a plurality of testing applications for interaction by a plurality of testers to generate a plurality of baseline VR content. The deep learning technique includes extracting testing data associated with tester interactions with the baseline VR content, the extracted data generated during execution of the plurality of testing applications. The deep learning technique includes monitoring physiological measurements of the plurality of testers when interacting with the plurality of baseline VR conte...",
  "date_published": "20180405",
  "title": "METHOD AND SYSTEM FOR CLASSIFYING VIRTUAL REALITY (VR) CONTENT BASED ON MODELED DISCOMFORT OF A USER",
  "ipcr_labels": [
    "G06N308",
    "G06T1900",
    "G06K966",
    "G06K962",
    "H04N1304"
  ],
  "_processing_info": {
    "original_size": 150497,
    "optimized_size": 3450,
    "reduction_percent": 97.71
  }
}