{
  "date_produced": "20180516",
  "publication_number": "US20180150752A1-20180531",
  "main_ipcr_label": "G06N502",
  "decision": "PENDING",
  "application_number": "15365059",
  "inventor_list": [
    {
      "inventor_name_last": "Henderson",
      "inventor_name_first": "Charles W.",
      "inventor_city": "Atlanta",
      "inventor_state": "GA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Henderson",
      "inventor_name_first": "Alan D.",
      "inventor_city": "Watkinsville",
      "inventor_state": "GA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Jones",
      "inventor_name_first": "Chantay P.",
      "inventor_city": "Marietta",
      "inventor_state": "GA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Rosell",
      "inventor_name_first": "Kalani K.",
      "inventor_city": "New Haven",
      "inventor_state": "CT",
      "inventor_country": "US"
    }
  ],
  "abstract": "Technologies are described herein for identifying artificial intelligence content. According to some examples, content received is analyzed to determine if the content was generated by an artificial intelligence source. Upon identifying that the content was generated by an artificial intelligence source, the content is displayed in a manner that indicates the determination.",
  "filing_date": "20161130",
  "patent_number": "None",
  "summary": "<SOH> SUMMARY <EOH>Technologies are described herein for identifying artificial intelligence content. Generally described, an artificial intelligence (“AI”) content identification system receives content from one or more content providers. Content can be information such as text from web pages, video, documents, speech or aural input, and the like. The AI content identification system analyzes at least a portion of the content received from the one or more content providers to determine if the portion of the content is content generated by an artificial intelligence source. If the portion analyzed is determined to have been generated by an artificial intelligence source, the content as displayed on a content viewer application is modified to indicate the determination that the portion analyzed was generated by an artificial intelligence source. If determined to be content generated from an artificial intelligence source, the source of the content can be added to an artificial intelligence source list. In some examples, the content identification system can be trained to detect misidentified or misconstrued content. For example, the content identification system can retrieve multiple instances of content provided by a content provider (such as a news reporter or individual), analyze the content to determine patterns, and then apply those patterns to other content identified as being from the content provider. If the patterns do not match or are substantially similar, the content identification system can provide an output that identifies the content as possibly being from a different content provider than the content provider listed. In further examples, the content identification system can receive content from a content provider, scrub the content to determine one or more facts, then use those facts to search for content from other content providers that have provided content that matches or is substantially similar to the facts of the original content. If the fact...",
  "date_published": "20180531",
  "title": "IDENTIFYING ARTIFICIAL INTELLIGENCE CONTENT",
  "ipcr_labels": [
    "G06N502"
  ],
  "_processing_info": {
    "original_size": 54969,
    "optimized_size": 3376,
    "reduction_percent": 93.86
  }
}