{
  "decision": "PENDING",
  "application_number": "15365273",
  "date_published": "20170323",
  "date_produced": "20170309",
  "title": "Footwear Products Including Data Transmission Capabilities",
  "filing_date": "20161130",
  "inventor_list": [
    {
      "inventor_name_last": "Case, JR.",
      "inventor_name_first": "Charles W.",
      "inventor_city": "Lake Oswego",
      "inventor_state": "OR",
      "inventor_country": "US"
    }
  ],
  "ipcr_labels": [
    "H04Q900",
    "A43B500",
    "G06Q3002",
    "A43B300"
  ],
  "main_ipcr_label": "H04Q900",
  "summary": "<SOH> SUMMARY <EOH>The following presents a general summary of aspects of this invention in order to provide a basic understanding of at least some aspects of the invention. This summary is not intended as an extensive overview of the invention. It is not intended to identify key or critical elements of the invention or to delineate the scope of the invention. The following summary merely presents some concepts of the invention in a general form as a prelude to the more detailed description provided below. Aspects of this invention relate to generally to footwear systems (e.g., including athletic footwear, etc.) that include data transmission capabilities. Such systems may include, for example: (a) an article of footwear including an upper member and a sole member engaged with the upper member; and (b) a data transmission system engaged with the article of footwear, wherein the data transmission system transmits data from the article of footwear for receipt by a remote system. The data transmission systems in accordance with at least some examples of this invention may be used in conjunction with systems and methods for monitoring athletic performance and/or systems for providing advertising and/or product information relating to the article of footwear and/or products useful in athletic activities engaged in while wearing the article of footwear. The data transmitted by the data transmission system may be useful in such systems and methods. Optionally, footwear systems in accordance with at least some examples of this invention further may include an activation system engaged with the article of footwear for activating the data transmission system and/or a display device in communication with the data transmission system for displaying information based, at least in part, on the data transmitted by the data transmission system. Additional aspects of this invention relate to data transfer systems. Such systems may include: (a) an article of footwear; (b) a data tran...",
  "patent_number": "None",
  "abstract": "Footwear systems include an article of footwear and a data transmission system engaged with the article of footwear. The transmission system transmits data to a remote system, such as a display system, another data transmission system, a processing system, etc. Such footwear systems further may include activation systems for activating the transmission and/or display systems. The transmitted data may be used for various purposes, such as: (a) identifying a user of the article of footwear; (b) activating targeted advertising or product information; (c) confirming the user's presence at a specific location and/or at a specific time; (d) determining start, finish, and/or intermediate split times for specific user; (e) confirming athletic equipment usage; (f) providing data for a game or reward program; (g) registering the user for an event or competition; or the like.",
  "publication_number": "US20170085967A1-20170323",
  "_processing_info": {
    "original_size": 100210,
    "optimized_size": 3467,
    "reduction_percent": 96.54
  }
}