{
  "decision": "PENDING",
  "application_number": "15365623",
  "date_published": "20180531",
  "date_produced": "20180516",
  "title": "SYSTEMS AND METHODS FOR PRELOADING CONTENT",
  "filing_date": "20161130",
  "inventor_list": [
    {
      "inventor_name_last": "Cunningham",
      "inventor_name_first": "Benjamin Grady",
      "inventor_city": "New York",
      "inventor_state": "NY",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Ma",
      "inventor_name_first": "Shannon",
      "inventor_city": "San Francisco",
      "inventor_state": "CA",
      "inventor_country": "US"
    }
  ],
  "ipcr_labels": [
    "G06F1722",
    "G06F1730"
  ],
  "main_ipcr_label": "G06F1722",
  "summary": "<SOH> SUMMARY <EOH>Various embodiments of the present disclosure can include systems, methods, and non-transitory computer readable media configured to present a content feed through a display screen, the content feed including one or more content items. At least one content item in the content feed for which a layout is to be generated can be determined. The layout for the content item can be generated prior to the content item being accessed. In some embodiments, the systems, methods, and non-transitory computer readable media are configured to determine that at least a portion of the content item included in the content feed is positioned within a predetermined region of the display screen. In some embodiments, the content feed is provided using a main execution thread and wherein the layout for the content item is determined using one or more background threads. In some embodiments, the systems, methods, and non-transitory computer readable media are configured to determine that the content item has been accessed and render the content item for presentation on the display screen, the rendering being performed based at least in part on the layout that was determined prior to the content item being accessed. In some embodiments, the systems, methods, and non-transitory computer readable media are configured to obtain structured data corresponding to the content item from a content provider, obtain one or more view blocks corresponding to the structured data, where each view block corresponds to at least a portion of content included in the content item, and determine the layout based at least in part on the one or more view blocks. In some embodiments, a view block corresponds to at least one of a title of the content item, a portion of text in the content item, an image in the content item, or a video in the content item. In some embodiments, the systems, methods, and non-transitory computer readable media are configured to determine a respective size for at leas...",
  "patent_number": "None",
  "abstract": "Systems, methods, and non-transitory computer-readable media can present a content feed through a display screen, the content feed including one or more content items. At least one content item in the content feed for which a layout is to be generated can be determined. The layout for the content item can be generated prior to the content item being accessed.",
  "publication_number": "US20180150441A1-20180531",
  "_processing_info": {
    "original_size": 80405,
    "optimized_size": 3065,
    "reduction_percent": 96.19
  }
}