{
  "date_produced": "20180207",
  "publication_number": "US20180053108A1-20180222",
  "main_ipcr_label": "G06N700",
  "decision": "PENDING",
  "application_number": "15362720",
  "inventor_list": [
    {
      "inventor_name_last": "Olabiyi",
      "inventor_name_first": "Oluwatobi",
      "inventor_city": "Mountain View",
      "inventor_state": "CA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Martinson",
      "inventor_name_first": "Eric",
      "inventor_city": "Sunnyvale",
      "inventor_state": "CA",
      "inventor_country": "US"
    }
  ],
  "abstract": "By way of example, the technology disclosed by this document may be implemented in a method that includes receiving stored sensor data describing characteristics of a vehicle in motion at a past time and extracting features for prediction and features for recognition from the stored sensor data. The features for prediction may be input into a prediction network, which may generate a predicted label for a past driver action based on the features for prediction. The features for recognition may be input into a recognition network, which may generate a recognized label for the past driver action based on the features for recognition. In some instances, the method may include training prediction network weights of the prediction network using the recognized label and the predicted label.",
  "filing_date": "20161128",
  "patent_number": "None",
  "summary": "<SOH> SUMMARY <EOH>The specification overcomes the deficiencies and limitations of the approaches described in the background section at least in part by providing novel technology for an efficient driver action prediction system based on temporal fusion of sensor data using a deep (bidirectional) recurrent neural network. According to one innovative aspect of the subject matter described in this disclosure, a method may include receiving, by one or more computing devices, stored sensor data, the stored sensor data describing characteristics of a vehicle in motion at a past time; extracting, by the one or more computing devices, features for prediction and features for recognition from the stored sensor data; inputting, by the one or more computing devices, the features for prediction into a prediction network; and generating, by the one or more computing devices, a predicted label for a past driver action based on the features for prediction using the prediction network. The method may further include inputting, by the one or more computing devices, the features for recognition into a recognition network; generating, by the one or more computing devices, a recognized label for the past driver action based on the features for recognition using the recognition network; and training, by the one or more computing devices, one or more prediction network weights of the prediction network using the recognized label and the predicted label. According to another innovative aspect of the subject matter described in this disclose, a system includes one or more computer processors; and one or more non-transitory memories storing instructions that, when executed by the one or more computer processors, cause the computer system to perform operations comprising: receiving stored sensor data, the stored sensor data describing characteristics of a vehicle in motion at a past time; extracting features for prediction and features for recognition from the stored sensor data; inputting...",
  "date_published": "20180222",
  "title": "Efficient Driver Action Prediction System Based on Temporal Fusion of Sensor Data Using Deep (Bidirectional) Recurrent Neural Network",
  "ipcr_labels": [
    "G06N700",
    "G06N9900"
  ],
  "_processing_info": {
    "original_size": 133605,
    "optimized_size": 3584,
    "reduction_percent": 97.32
  }
}