{
  "decision": "PENDING",
  "application_number": "15363132",
  "date_published": "20170608",
  "date_produced": "20170524",
  "title": "DEVICE-BASED SENSOR TRACKING FOR OPTIMIZING A CARDIOVASCULAR MEDICATION ADMINISTRATION PROTOCOL",
  "filing_date": "20161129",
  "inventor_list": [
    {
      "inventor_name_last": "Saha",
      "inventor_name_first": "Sunipa",
      "inventor_city": "Shoreview",
      "inventor_state": "MN",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Thakur",
      "inventor_name_first": "Pramodsingh Hirasingh",
      "inventor_city": "Woodbury",
      "inventor_state": "MN",
      "inventor_country": "US"
    }
  ],
  "ipcr_labels": [
    "A61M5172",
    "A61N1365",
    "G06F1900",
    "A61N139"
  ],
  "main_ipcr_label": "A61M5172",
  "summary": "<SOH> BRIEF DESCRIPTION OF THE DRAWINGS <EOH>In the drawings, which are not necessarily drawn to scale, like numerals may describe similar components in different views. Like numerals having different letter suffixes may represent different instances of similar components. The drawings illustrate generally, by way of example, but not by way of limitation, various embodiments discussed in the present document. FIG. 1 is an illustration of portions of an example drug titration system that can use an implantable medical device and one or more implantable sensors to monitor and/or adjust a cardiovascular medication administration protocol for a subject, in accordance with various techniques of this disclosure. FIG. 2 is a block diagram of an example of an IMD and implantable sensors that may be implemented in a drug titration system that can be used to implement various techniques of this disclosure. FIG. 3 is a flow diagram of an example of a method for monitoring and/or adjusting a cardiovascular medication administration protocol for a subject, in accordance with various techniques of this disclosure. FIG. 4 is a flow diagram of another example of a method for monitoring and/or adjusting a cardiovascular medication administration protocol for a subject, in accordance with various techniques of this disclosure. FIG. 5 is an example of another method of adjusting a therapy protocol for a subject, in accordance with this disclosure. FIG. 6 is an illustration of a system that includes an external device used to program parameters of an IMD. detailed-description description=\"Detailed Description\" end=\"lead\"?",
  "patent_number": "None",
  "abstract": "In some examples, a method of adjusting a cardiovascular medication administration protocol for a subject includes receiving heart contractility surrogate information, obtained from a sensor configured to sense information about a heart of the subject, during a specified acute time period following an initiation or change in medication administration to the subject, determining, using a comparator circuit, whether the heart contractility surrogate information indicates an occurrence of at least a specified change in heart contractility during the specified acute time period following the initiation or change in medication administration to the subject, and adjusting the medication administration protocol using the determination of whether the heart contractility surrogate information indicates the occurrence of at least the specified change in heart contractility during the specified acute time period following the initiation or change in medication administration to the subject.",
  "publication_number": "US20170157323A1-20170608",
  "_processing_info": {
    "original_size": 92173,
    "optimized_size": 3404,
    "reduction_percent": 96.31
  }
}