{
  "decision": "PENDING",
  "application_number": "15360163",
  "date_published": "20170316",
  "date_produced": "20170301",
  "title": "IRREDUCIBLE MODULES",
  "filing_date": "20161123",
  "inventor_list": [
    {
      "inventor_name_last": "Lewis",
      "inventor_name_first": "William J.",
      "inventor_city": "Coraopolis",
      "inventor_state": "PA",
      "inventor_country": "US"
    }
  ],
  "ipcr_labels": [
    "G06F1730",
    "G06F710",
    "G06F708"
  ],
  "main_ipcr_label": "G06F1730",
  "summary": "<SOH> SUMMARY <EOH>In a first aspect of the invention, a method includes receiving, by at least one computing device, data associated with a specification. The method further includes defining, by the at least one computing device, a pattern based on the received data. The pattern reduces a set of rules into a single condition. The method further includes generating, by the at least one computing device, an irreducible module based on the pattern. The irreducible module has one output dependent variable and is associated with a data flow application. In another aspect of the invention, there is a computer program product for providing an irreducible module. The computer program product includes a computer usable storage medium having program code embodied in the storage medium. The program code is readable/executable by a computing device to receive data associated with a specification. The computer program product includes determining a pattern based on the received data. The computer program product includes reducing a set of rules into a single condition and determining how different irreducible modules can be combined based on the pattern. The computer program product includes generating the irreducible module which is independent of other irreducible modules. In a further aspect of the invention, a system includes a CPU, a computer readable memory and a computer readable storage medium. Additionally, the system includes one or more program instructions. Program instructions are operable to receive information associated with a specification associated with a data driven application engineering (DDAE) format. Program instructions define a pattern, based on receiving the information, with which a set of irreducible modules are created and combined into any application that includes parallel computing or data flow application. Program instructions reduce a set of rules associated with the pattern by using Boolean variables. Program instructions use a compilable la...",
  "patent_number": "None",
  "abstract": "An approach to generating irreducible modules. The approach includes a method that includes receiving, by at least one computing device, data associated with a specification. The method includes defining, by the at least one computing device, a pattern on the received data. The pattern reduces a set of rules into a single condition. The method includes generating, by the at least one computing device, an irreducible module based on the pattern. The irreducible module has one output dependent variable and is associated with a data flow application.",
  "publication_number": "US20170075961A1-20170316",
  "_processing_info": {
    "original_size": 50796,
    "optimized_size": 3089,
    "reduction_percent": 93.92
  }
}