{
  "date_produced": "20180516",
  "publication_number": "US20180150750A1-20180531",
  "main_ipcr_label": "G06N502",
  "decision": "PENDING",
  "application_number": "15365362",
  "inventor_list": [
    {
      "inventor_name_last": "VERDEJO",
      "inventor_name_first": "Dominique",
      "inventor_city": "Dublin",
      "inventor_state": "",
      "inventor_country": "IE"
    },
    {
      "inventor_name_last": "LECUE",
      "inventor_name_first": "Freddy",
      "inventor_city": "Dublin",
      "inventor_state": "",
      "inventor_country": "IE"
    },
    {
      "inventor_name_last": "ZAMAN",
      "inventor_name_first": "Md Faisal",
      "inventor_city": "Dublin",
      "inventor_state": "",
      "inventor_country": "IE"
    }
  ],
  "abstract": "A device may receive data associated with an event. The device may identify a context of the event based on receiving the data. The device may identify a similar event based on performing a comparison of the context of the event and a context of the similar event. The device may determine a set of pre-events associated with the event based on identifying a pre-event that occurred before the similar event. The set of pre-events may include at least one pre-event similar to the pre-event that occurred before the similar event. The device may determine a set of post-events associated with the event based on determining the set of pre-events and identifying a post-event that occurred after the similar event. The set of post-events may include at least one post-event similar to the post-event. The device may perform an action based on the set of post-events.",
  "filing_date": "20161130",
  "patent_number": "None",
  "summary": "<SOH> SUMMARY <EOH>According to some possible implementations, a device may include one or more processors to receive data associated with a first event. The one or more processors may identify a first context of the first event based on the data. The one or more processors may identify a plurality of second events based on the first context and a second context of the plurality of second events. The first context may be similar to the second context. The one or more processors may determine a set of pre-events associated with the first event based on a plurality of pre-events associated with the plurality of second events. One or more pre-events of the set of pre-events may be similar to the plurality of pre-events. The one or more processors may determine a set of post-events associated with the first event based on the set of pre-events and based on a plurality of post-events associated with the plurality of second events. The set of post-events may include one or more post-events predicted to occur after the first event. The one or more post-events may be similar to the plurality of post-events. The one or more processors may perform an action related to the first event based on determining the set of post-events. According to some possible implementations, a method may include receiving, by a device, data associated with an event. The method may include identifying, by the device, a context of the event based on receiving the data. The method may include identifying, by the device, a similar event based on performing a comparison of the context of the event and a context of the similar event. The method may include determining, by the device, a set of pre-events associated with the event based on identifying a pre-event that occurred before the similar event. The set of pre-events may include at least one pre-event similar to the pre-event that occurred before the similar event. The method may include determining, by the device, a set of post-events associated ...",
  "date_published": "20180531",
  "title": "AUTOMATIC PREDICTION OF AN EVENT USING DATA",
  "ipcr_labels": [
    "G06N502",
    "G06F954"
  ],
  "_processing_info": {
    "original_size": 112189,
    "optimized_size": 3692,
    "reduction_percent": 96.71
  }
}