{
  "date_produced": "20170524",
  "publication_number": "US20170161629A1-20170608",
  "main_ipcr_label": "G06N700",
  "decision": "PENDING",
  "application_number": "15367204",
  "inventor_list": [
    {
      "inventor_name_last": "Biswas",
      "inventor_name_first": "Abhishek",
      "inventor_city": "Kolkata",
      "inventor_state": "",
      "inventor_country": "IN"
    },
    {
      "inventor_name_last": "Banerjee",
      "inventor_name_first": "Kaustav",
      "inventor_city": "Kolkata",
      "inventor_state": "",
      "inventor_country": "IN"
    },
    {
      "inventor_name_last": "Saha",
      "inventor_name_first": "Samudraneel",
      "inventor_city": "Kolkata",
      "inventor_state": "",
      "inventor_country": "IN"
    }
  ],
  "abstract": "The present disclosure generally relates to analysis and detection of human emotions, and more particularly, to a method and system for detection of human emotion based on an individual's typing behavior. In one embodiment, the method comprises of receiving typing data of the individual for a specified amount of time, processing the received data to extract hand speed and key-press duration for the individual and analyzing the hand speed and key-press duration to detect probable emotional states the individual has experienced for the specified amount of time.",
  "filing_date": "20161202",
  "patent_number": "None",
  "summary": "<SOH> SUMMARY <EOH>Embodiments of the present disclosure present technological improvements as solutions to one or more of the above-mentioned technical problems recognized by the inventors in conventional systems. For example, in one embodiment, a method and system is provided for detection of human emotion based on an individual's typing behavior. In another embodiment of the present disclosure, the method comprises: receiving, by a processor, typing data of the individual for a specified amount of time; processing, by the processor, the received data to extract hand speed and key-press duration for the individual; and analyzing, by the processor, the hand speed and key-press duration to detect probable emotional states the individual has experienced for the specified amount of time. In another embodiment of the present disclosure, a system for detecting emotions based on an individual's typing behavior is disclosed. The system may comprise one or more processors and a memory coupled to the one or more processors. The one or more processors may execute a plurality of modules stored in the memory. The plurality of modules may comprise a reception module, an extraction module and a data analysis module. The reception module may be adapted for receiving typing data of the individual for a specified period of time. The extraction module may be adapted for processing the received data to extract hand speed and key-press duration for the individual. The data analysis module may be adapted for analyzing the extracted data to detect probable emotional states the individual has experienced for the specified amount of time. In another embodiment of the present disclosure, a non-transitory computer readable medium storing a program for detecting emotions based on an individual's typing behavior is disclosed. The program may comprise instructions for: receiving typing data of the individual for a specified period of time; processing the received data to extract hand speed and...",
  "date_published": "20170608",
  "title": "METHOD AND SYSTEM FOR DETECTING EMOTIONS BASED ON TYPING BEHAVIOUR",
  "ipcr_labels": [
    "G06N700",
    "G06N9900"
  ],
  "_processing_info": {
    "original_size": 28612,
    "optimized_size": 3422,
    "reduction_percent": 88.04
  }
}