{
  "decision": "PENDING",
  "application_number": "15363489",
  "date_published": "20180531",
  "date_produced": "20180516",
  "title": "MAINTAINING DATA INTEGRITY OVER MULTIPLE APPLICATIONS",
  "filing_date": "20161129",
  "inventor_list": [
    {
      "inventor_name_last": "MARKELLO",
      "inventor_name_first": "Alexandra D.",
      "inventor_city": "Fayetteville",
      "inventor_state": "NC",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "PRICE",
      "inventor_name_first": "Dana L.",
      "inventor_city": "Surf City",
      "inventor_state": "NC",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "SAUNDERS",
      "inventor_name_first": "Heather L.",
      "inventor_city": "Raleigh",
      "inventor_state": "NC",
      "inventor_country": "US"
    }
  ],
  "ipcr_labels": [
    "G06F954",
    "G06F1134",
    "G06F1130"
  ],
  "main_ipcr_label": "G06F954",
  "summary": "<SOH> SUMMARY <EOH>In an aspect of the invention, a computer-implemented method for maintaining data integrity across multiple applications includes: monitoring, by a computing device, user data across multiple computer applications to detect trackable data, the trackable data including a first data set associated with a first application and a second data set associated with a second application; tracking, by the computing device, the trackable data; determining, by the computing device, that the first data set is similar to the second data set, identifying, by the computing device, a discrepancy between the first data set and the second data set; and implementing, by the computing device, a change to the first data set based on the second data set to automatically maintain integrity of the first and second data sets across the respective first and second applications. In another aspect of the invention, there is a computer program product for maintaining data integrity across multiple applications. The computer program product comprises a computer readable storage medium having program instructions embodied therewith. The program instructions are executable by a computing device to cause the computing device to: monitor user data across multiple applications to detect trackable data, the trackable data including a first data set associated with a first application and a second data set associated with a second application; track the trackable data; determine that the first data set is similar to the second data set; identify a discrepancy between the first data set and the second data set; and provide a notification of the discrepancy to a user, the notification including data integrity options to be performed by the computing device to maintain data integrity across the first and second applications. In another aspect of the invention, there is a system for maintaining data integrity across multiple applications. The system includes a CPU, a computer readable mem...",
  "patent_number": "None",
  "abstract": "Systems and methods for maintaining data integrity across multiple applications are disclosed. A computer-implemented method comprises: monitoring, by a computing device, user data across multiple computer applications to detect trackable data, the trackable data including a first data set associated with a first application and a second data set associated with a second application; tracking, by the computing device, the trackable data; determining, by the computing device, that the first data set is similar to the second data set; identifying, by the computing device, a discrepancy between the first data set and the second data set; and implementing, by the computing device, a change to the first data set based on the second data set to automatically maintain integrity of the first and second data sets across the respective first and second applications.",
  "publication_number": "US20180150338A1-20180531",
  "_processing_info": {
    "original_size": 68017,
    "optimized_size": 3743,
    "reduction_percent": 94.5
  }
}