{
  "date_produced": "20170503",
  "publication_number": "US20170140279A1-20170518",
  "main_ipcr_label": "G06N504",
  "decision": "PENDING",
  "application_number": "15368608",
  "inventor_list": [
    {
      "inventor_name_last": "Turgeman",
      "inventor_name_first": "Avi",
      "inventor_city": "Cambridge",
      "inventor_state": "MA",
      "inventor_country": "US"
    }
  ],
  "abstract": "Device, system, and method of detecting identity of a user based on motor-control loop model. A method includes: during a first session of a user who utilizes a pointing device for interacting with a computerized service, monitoring the pointing device dynamics and gestures of the user; based on the monitored dynamics and gestures, estimating parameters that characterize a sensorimotor control loop model of the user; storing in a database a record indicating that the user is associated with the parameters that characterize the sensorimotor control loop model of the user.",
  "filing_date": "20161204",
  "patent_number": "None",
  "summary": "<SOH> SUMMARY <EOH>The present invention may include, for example, systems, devices, and methods for detecting identity of a user of an electronic device, and for determining whether or not an electronic device is being used by a fraudulent user; as well as for determining identity of a user based on motor-control loop model. In some embodiments, a method comprises: during a first session of a user who utilizes a pointing device for interacting with a computerized service, monitoring the pointing device dynamics and gestures of said user; based on the monitored dynamics and gestures, estimating parameters that characterize a sensorimotor control loop model of said user; storing in a database a record indicating that said user is associated with said parameters that characterize the sensorimotor control loop model of said user. In some embodiments, the method comprises, in a subsequent session of interaction with said computerized service: monitoring pointing device dynamics and gestures of a subsequent user; estimating current parameters that characterize a sensorimotor control loop of said subsequent user; comparing the current parameters to said record of parameters, and based on results of said comparing, determining whether said subsequent user of the second session is the same person as said user of the first session. The present invention may provide other and/or additional benefits or advantages.",
  "date_published": "20170518",
  "title": "SYSTEM, DEVICE, AND METHOD OF DETECTING USER IDENTITY BASED ON MOTOR-CONTROL LOOP MODEL",
  "ipcr_labels": [
    "G06N504",
    "G06F30488",
    "G06F30346",
    "G06F2131"
  ],
  "_processing_info": {
    "original_size": 157189,
    "optimized_size": 2613,
    "reduction_percent": 98.34
  }
}