{
  "date_produced": "20180523",
  "publication_number": "US20180157958A1-20180607",
  "main_ipcr_label": "G06N300",
  "decision": "PENDING",
  "application_number": "15368314",
  "inventor_list": [
    {
      "inventor_name_last": "FOURNEY",
      "inventor_name_first": "Adam",
      "inventor_city": "Redmond",
      "inventor_state": "WA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "BENNETT",
      "inventor_name_first": "Paul Nathan",
      "inventor_city": "Redmond",
      "inventor_state": "WA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "WHITE",
      "inventor_name_first": "Ryen",
      "inventor_city": "Woodinville",
      "inventor_state": "WA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "HORVITZ",
      "inventor_name_first": "Eric",
      "inventor_city": "Kirkland",
      "inventor_state": "WA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "RONG",
      "inventor_name_first": "Xin",
      "inventor_city": "Ann Arbor",
      "inventor_state": "MI",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "GRAUS",
      "inventor_name_first": "David",
      "inventor_city": "Amsterdam",
      "inventor_state": "",
      "inventor_country": "NL"
    }
  ],
  "abstract": "Disclosed are techniques for extracting, identifying, and consuming imprecise temporal elements (“ITEs”). A user input may be received from a client device. A prediction may be generated of one or more time intervals to which the user input refers based upon an ITE model. The user input may be associated with the prediction, and provided to the client device.",
  "filing_date": "20161202",
  "patent_number": "None",
  "summary": "<SOH> SUMMARY <EOH>In an implementation, a system is disclosed that can include a database and a processor communicatively coupled thereto. The database may store an imprecise temporal expression model. The ITE model may be generated by the processor in some instances. The processor may be configured to receive, from a client device, a user input. The user input may be received by the system in the form of a voice and/or text input. A prediction of one or more intervals of time to which the user input refers may be generated based upon the ITE model in the database. The user input may include at least one of an ITE, a contextual text, and a time of interaction. In the event the user input includes an ITE, the processor may be configured to detect the ITE. In some instances, the prediction may be presented to the client device (or a server) and a request may be generated to receive a user input to confirm the prediction. In some instances the processor may receive an indication to modify the prediction, and update the ITE model in the database based upon the indication. The prediction may be associated with the user input. The processor may provide the prediction to the client device. The processor may be configured to display the prediction on the client device at a time corresponding to the user input. The prediction may be provided to the client device in a variety of ways such as via a reminder, a notification, an auto-completion of text, a timeline, a task list, a calendar scheduling, a time interval, a ranked list of time intervals, a probability distribution, etc. According to an implementation, a method is provided in which a user input is received from a client device. A prediction can be generated based upon the ITE model. The user input may be associated with the prediction, and the prediction may be provided to the client device. In an implementation, a non-transitory computer readable medium having stored thereon computer readable instructions that are e...",
  "date_published": "20180607",
  "title": "SYSTEM FOR INTERPRETING AND MANAGING IMPRECISE TEMPORAL EXPRESSIONS",
  "ipcr_labels": [
    "G06N300",
    "G06N504"
  ],
  "_processing_info": {
    "original_size": 99602,
    "optimized_size": 3662,
    "reduction_percent": 96.32
  }
}