{
  "date_produced": "20171018",
  "publication_number": "US20170316317A1-20171102",
  "main_ipcr_label": "G06N502",
  "decision": "PENDING",
  "application_number": "15363206",
  "inventor_list": [
    {
      "inventor_name_last": "Waters",
      "inventor_name_first": "Jeff Howard",
      "inventor_city": "San Diego",
      "inventor_state": "CA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Plutchak",
      "inventor_name_first": "Bruce David",
      "inventor_city": "San Diego",
      "inventor_state": "CA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "VonColln",
      "inventor_name_first": "Eric Walter",
      "inventor_city": "San Diego",
      "inventor_state": "CA",
      "inventor_country": "US"
    }
  ],
  "abstract": "A computer implemented method comprising: inputting steps of at least two processes into the computer; storing process step input products and process step output products in a shared, non-transitory database as they are generated; establishing an input product filter for each process step with performance-triggering-criteria-defined property/value filters, where one step's output product passes the input product filter of another step; periodically searching the shared database for input products; determining whether each step in any of the processes has been executed, is in the process of being executed, or is awaiting execution; dynamically and automatically assembling or altering a set of steps composing any given process depending on the input products available in the shared database; and comparing the input/output products property values to target property values to automatically assess the status, effectiveness and efficiency of the individual steps and each process as a whole...",
  "filing_date": "20161129",
  "patent_number": "None",
  "summary": "<SOH> SUMMARY <EOH>Disclosed herein is a computer-implemented method for providing situational awareness to a computer comprising the following steps. The first step provides for inputting steps of at least two processes into the computer. The next step provides for storing each input product and each output product in a shared, non-transitory database as they are generated. The next step provides for establishing an input product filter for each step. The next step provides for periodically searching the shared database with URL queries for input products. The next step provides for determining with the computer whether each step in any of the processes has been executed, is in the process of being executed, or is awaiting execution. The next step provides for dynamically and automatically assembling or altering a set of steps composing any given process depending on the input products available in the shared database. The next step provides for comparing with a performance status monitoring engine the input/output products property values to the target property values to automatically assess the status, effectiveness and efficiency of the individual steps and of each process as a whole. Another embodiment of the computer-implemented method for providing situational awareness to a computer may be described as comprising the following steps. The first step provides for identifying a first process and a second process that have an aspect in common. Each of the first and second processes comprises a series of steps and an end goal. The next step provides for identifying an input product comprising performance-triggering criteria for each step in the first and second processes. The next step provides for generating a unique output product at the completion of each step in the first and second processes. The next step provides for storing the output products in a cloud-based, shared database. Each output product and each input product has a unique URL according to a tax...",
  "date_published": "20171102",
  "title": "Method of Using a Dynamic Agile Process Model to Increase Situational Awareness of a Computer",
  "ipcr_labels": [
    "G06N502",
    "G06F1730",
    "G06F1730"
  ],
  "_processing_info": {
    "original_size": 50519,
    "optimized_size": 3922,
    "reduction_percent": 92.24
  }
}