{
  "decision": "PENDING",
  "application_number": "15367130",
  "date_published": "20180607",
  "date_produced": "20180523",
  "title": "MANAGING ACTIVITY DATA RELATED TO COLLABORATIVELY EDITED ELECTRONIC DOCUMENTS",
  "filing_date": "20161201",
  "inventor_list": [
    {
      "inventor_name_last": "Milvaney",
      "inventor_name_first": "Douglas",
      "inventor_city": "Somerville",
      "inventor_state": "MA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Tierney",
      "inventor_name_first": "William",
      "inventor_city": "Swampscott",
      "inventor_state": "MA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Tardito",
      "inventor_name_first": "Kristen",
      "inventor_city": "Lynnfield",
      "inventor_state": "MA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Shekhel",
      "inventor_name_first": "Jerry",
      "inventor_city": "Swampscott",
      "inventor_state": "MA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Liu",
      "inventor_name_first": "Feng",
      "inventor_city": "Winchester",
      "inventor_state": "MA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Shukla",
      "inventor_name_first": "Manish",
      "inventor_city": "Lexington",
      "inventor_state": "MA",
      "inventor_country": "US"
    }
  ],
  "ipcr_labels": [
    "G06F1730",
    "H04L2908"
  ],
  "main_ipcr_label": "G06F1730",
  "summary": "<SOH> SUMMARY <EOH>This Summary is provided to introduce a selection of concepts in a simplified form that are further described below in the Detailed Description. This Summary is intended neither to identify key or essential features, nor to limit the scope, of the claimed subject matter. A computer system manages storage of activity data by implementing a protocol among the shared storage system and the end user applications which reduces the amount of data stored. With this protocol, an end user application stores activity data in a part of an electronic document. When the electronic document is stored on a shared storage system, activity data is extracted and stored in an activity store. After activity data has been successfully stored in the activity store, the end user application can remove the activity data from the electronic document. In particular, the end user application can periodically query the activity store to identify activities that have been successfully stored in the activity store. By removing the activity data from the electronic document, the electronic document can be maintained at a reasonable size. By having the end user application remove the activity data, coherency of the data file, and consistency between local copies on end user computers and copies on the shared storage system, can be maintained. In the following description, reference is made to the accompanying drawings which form a part hereof, and in which are shown, by way of illustration, specific example implementations. Other implementations may be made without departing from the scope of the disclosure.",
  "patent_number": "None",
  "abstract": "An end user application stores activity data in a part of an electronic document. When the electronic document is stored on a shared storage system, activity data is extracted and stored in an activity store. After activity data has been successfully stored in the activity store, the end user application can remove the activity data from the electronic document. In particular, the end user application can periodically query the activity store to identify activities that have been successfully stored in the activity store. By removing the activity data from the electronic document, the electronic document can be maintained at a reasonable size. By having the end user application remove the activity data, coherency of the data file, and consistency between local copies on end user computers and copies on the shared storage system, can be maintained.",
  "publication_number": "US20180157676A1-20180607",
  "_processing_info": {
    "original_size": 86644,
    "optimized_size": 3799,
    "reduction_percent": 95.62
  }
}