{
  "decision": "PENDING",
  "application_number": "15369591",
  "date_published": "20170323",
  "date_produced": "20170309",
  "title": "INTERACTIVE DISPLAY WITH TACTILE FEEDBACK",
  "filing_date": "20161205",
  "inventor_list": [
    {
      "inventor_name_last": "GRAY",
      "inventor_name_first": "R. O'Neal",
      "inventor_city": "Dallas",
      "inventor_state": "TX",
      "inventor_country": "US"
    }
  ],
  "ipcr_labels": [
    "G06F301",
    "G06F30489",
    "G06F30488",
    "G06F302",
    "G06F3041"
  ],
  "main_ipcr_label": "G06F301",
  "summary": "<SOH> SUMMARY OF THE INVENTION <EOH>An electronic device according to an exemplary embodiment of the present invention comprises: a housing comprising a first surface and a second surface; an interactive display having a keyboard-enabled mode and a keyboard-disabled mode, the interactive display comprising: a first image display device disposed at the first surface that displays image data; and a physical keypad disposed at the second surface that provides tactile feedback to a user only when the interactive display is in the keyboard-enabled mode, the physical keypad being substantially smooth when the interactive display is in the keyboard-disabled mode. In at least one embodiment, the first image display device displays an imaged keypad comprising imaged keys when the interactive display is in the keyboard-enabled mode. In at least one embodiment, the electronic device further comprises a second image display device disposed at the second surface. In at least one embodiment, the physical keypad disposed at the second surface comprises one or more physical keys that control activation of the imaged keys within the imaged keypad. In at least one embodiment, the physical keypad disposed at the second surface comprises one or more physical keys that perform a different function from the one or more imaged keys of the imaged keypad. In at least one embodiment, the electronic device further comprises a sensor that detects user interaction with the physical keypad disposed on the second surface; and an image generator that displays within the first image display device an imaged representation of the user interaction with the physical keypad disposed on the second surface. In at least one embodiment, the sensor comprises one or more of the following sensor types: a motion sensor, a thermal sensor and a pressure sensor. In at least one embodiment, the imaged representation of the user interaction comprises an imaged depiction of the user's finger or thumb interacting wit...",
  "patent_number": "None",
  "abstract": "An electronic device including a housing having a first surface and a second surface, and an interactive display having a keyboard-enabled mode and a keyboard-disabled mode. The interactive display includes a first image display device disposed at the first surface that displays image data, and a physical keypad disposed at the second surface that provides tactile feedback to a user only when the interactive display is in the keyboard-enabled mode, the physical keypad being substantially smooth when the interactive display is in the keyboard-disabled mode.",
  "publication_number": "US20170083100A1-20170323",
  "_processing_info": {
    "original_size": 77472,
    "optimized_size": 3139,
    "reduction_percent": 95.95
  }
}