{
  "decision": "PENDING",
  "application_number": "15362220",
  "date_published": "20171214",
  "date_produced": "20171129",
  "title": "SENSOR AND DISPLAY DEVICE HAVING THE SAME",
  "filing_date": "20161128",
  "inventor_list": [
    {
      "inventor_name_last": "HONG",
      "inventor_name_first": "Won Ki",
      "inventor_city": "Yongin-si",
      "inventor_state": "",
      "inventor_country": "KR"
    },
    {
      "inventor_name_last": "SEO",
      "inventor_name_first": "Young Seok",
      "inventor_city": "Yongin-si",
      "inventor_state": "",
      "inventor_country": "KR"
    },
    {
      "inventor_name_last": "HONG",
      "inventor_name_first": "Jong Ho",
      "inventor_city": "Yongin-si",
      "inventor_state": "",
      "inventor_country": "KR"
    }
  ],
  "ipcr_labels": [
    "G06F3044",
    "G06F3045"
  ],
  "main_ipcr_label": "G06F3044",
  "summary": "<SOH> SUMMARY <EOH>Exemplary embodiments provide a sensor for identifying an intensity of a touch. Exemplary embodiments also provide a sensor for complexly identifying a touch point and an intensity of the touch at the same time. Exemplary embodiments further provide a display device equipped with the aforementioned sensor and/or a touch sensor. Additional aspects will be set forth in the detailed description which follows, and, in part, will be apparent from the disclosure, or may be learned by practice of the inventive concept. An exemplary embodiment discloses a display device that includes a display panel configured to display an image, and a sensor provided on at least one surface of the display panel and configured to sense a touch location and a touch pressure. The sensor includes a sensing unit having sensing electrodes formed on a same layer, and of which a capacitance changes according to a touch, and a resistance element disposed on the sensing unit, and of which a resistance changes according to a pressure of the touch. An exemplary embodiment also discloses a touch sensor that includes a substrate, a sensing unit comprising sensing electrodes formed on a same layer on the substrate which changes capacitance according to a touch, and a resistance element provided on the sensing unit which changes resistance according to a pressure of the touch. The foregoing general description and the following detailed description are exemplary and explanatory and are intended to provide further explanation of the claimed subject matter.",
  "patent_number": "None",
  "abstract": "A display device includes a display panel configured to display an image, and a sensor provided on at least one surface of the display panel and configured to sense a touch location and a touch pressure. The sensor includes a sensing unit having sensing electrodes formed on a same layer, and of which a capacitance changes according to a touch, and a resistance element disposed on the sensing unit, and of which a resistance changes according to a pressure of the touch. Accordingly, touch and touch intensity can both be sensed.",
  "publication_number": "US20170357344A1-20171214",
  "_processing_info": {
    "original_size": 59304,
    "optimized_size": 2919,
    "reduction_percent": 95.08
  }
}