{
  "date_produced": "20170603",
  "publication_number": "US20170169359A1-20170615",
  "main_ipcr_label": "G06N9900",
  "decision": "PENDING",
  "application_number": "15366608",
  "inventor_list": [
    {
      "inventor_name_last": "Chernis",
      "inventor_name_first": "Evgeny",
      "inventor_city": "Jerusalem",
      "inventor_state": "",
      "inventor_country": "IL"
    },
    {
      "inventor_name_last": "Gorelik",
      "inventor_name_first": "Leonid",
      "inventor_city": "Petach Tikva",
      "inventor_state": "",
      "inventor_country": "IL"
    },
    {
      "inventor_name_last": "Pyasik",
      "inventor_name_first": "Alexander",
      "inventor_city": "Maaleh-Adumim",
      "inventor_state": "",
      "inventor_country": "IL"
    },
    {
      "inventor_name_last": "Ranganathan",
      "inventor_name_first": "Anand",
      "inventor_city": "Stamford",
      "inventor_state": "CT",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Shusterman",
      "inventor_name_first": "Dmitry",
      "inventor_city": "Jerusalem",
      "inventor_state": "",
      "inventor_country": "IL"
    },
    {
      "inventor_name_last": "Yulevich",
      "inventor_name_first": "Yifat",
      "inventor_city": "Bazra",
      "inventor_state": "",
      "inventor_country": "IL"
    }
  ],
  "abstract": "Examples of techniques for generating streaming analytics applications are described herein. An example computer-implemented method includes receiving, via a processor, subject matter requirements in a semi-structured format. The method includes classifying, via the processor, the subject matter requirements based on a predefined taxonomy. The method includes extracting, via the processor, a list of entities from the subject matter requirements based on grammar. The method includes generating a solution based on a glossary and the list of extracted entities. The method includes generating, via the processor, a streaming analytics application based on the solution.",
  "filing_date": "20161201",
  "patent_number": "None",
  "summary": "<SOH> SUMMARY <EOH>According to an embodiment described herein, a system can include a processor to receive subject matter requirements in a semi-structured format. The processor can also further classify the subject matter requirements based on a predefined taxonomy. The processor can also extract a list of entities from the subject matter requirements based on grammar. The processor can further also generate a solution based on a glossary. The processor, to generate the solution, can further detect an appropriate training data set in a model repository based on the classifications and the extracted entities. The processor can also generate a model based on the training data set. The processor can also further generate a streaming analytics application based on the solution. The streaming analytics application can include a model. According to another embodiment described herein, a method can include receiving, via a processor, subject matter requirements in a semi-structured format. The method can further include classifying, via the processor, the subject matter requirements based on a predefined taxonomy. The method can also further include extracting, via the processor, a list of entities from the subject matter requirements based on grammar. The method can also include generating, via the processor, a solution based on a glossary and the list of extracted entities. The method can further include generating, via the processor, a streaming analytics application based on the solution. According to another embodiment described herein, a computer program product for generating streaming analytics applications can include computer-readable storage medium having program code embodied therewith. The computer readable storage medium is not a transitory signal per se. The program code is executable by a processor to cause the processor to receive subject matter requirements in a semi-structured format. The program code can also cause the processor to classify the subjec...",
  "date_published": "20170615",
  "title": "Generating Streaming Analytics Applications Using A Glossary",
  "ipcr_labels": [
    "G06N9900",
    "G06F1727"
  ],
  "_processing_info": {
    "original_size": 95274,
    "optimized_size": 3976,
    "reduction_percent": 95.83
  }
}