{
  "decision": "PENDING",
  "application_number": "15368103",
  "date_published": "20170323",
  "date_produced": "20170309",
  "title": "OPTICAL QUALITY CONTROL METHODS",
  "filing_date": "20161202",
  "inventor_list": [
    {
      "inventor_name_last": "Riefenstein",
      "inventor_name_first": "Lutz",
      "inventor_city": "Welheim",
      "inventor_state": "",
      "inventor_country": "DE"
    }
  ],
  "ipcr_labels": [
    "A47J3600",
    "F24C708",
    "G06T700",
    "H05B668",
    "H04N5335",
    "G06K962",
    "A23L510",
    "H05B664"
  ],
  "main_ipcr_label": "A47J3600",
  "summary": "<SOH> SUMMARY <EOH>The systems disclosed in the above references are quite complex and likely subject to frequent and expensive repairs and adjustments. Also, the above references do not reflect systems or methods that can serve to confirm that a cooking cycle/program has attained the quality of cooked product that is expected. Therefore, a simple and reliable device and method to ensure that food product is subject to the correct cooking cycle/program and that can monitor the quality of the cooked state of food product(s) is still needed. According to the present disclosure, such a simple and reliable system and method are provided. It is an object of the present disclosure to provide inspection systems for a cooking device, in particular a commercial cooking device, as well as methods of operating the same that are technically simple, reliable and easy to handle for an operator. It is also an object of the present disclosure to provide inspection systems for a cooking device, in particular a commercial cooking device, as well as methods of operating the same that provide the correct cooking cycle/program to the operator for the type and/or number of food product(s) placed in the cooking device. It is further object of the present disclosure to provide inspection systems for a cooking device, in particular a commercial cooking device, as well as methods of operating the same that ensure that the operator of the cooking device is removing the correct food product from the cooking device after the cooking cycle/program has finished. It is a still further object of the present disclosure to provide inspection systems for a cooking device, in particular a commercial cooking device, as well as methods of operating the same that analyze the quality of the state of cooked food product to determine whether the cooked food product has been cooked completely and meets appropriate standards for the cooked food product. Employing a cooking device having inspection systems of t...",
  "patent_number": "None",
  "abstract": "Disclosed are cooking methods using inspection systems including: a distance sensor and a digital optical recognition device. The distance sensor detects the position of the food product placed in the cooking device and the digital optical recognition device captures a series of images for the purpose of food product recognition. Once the food product is recognized, the operator is provided with the correct cooking cycle/program for the position and type of food product placed in the cooking device. The methods also ensure that the food product has been properly cooked at the end of the cooking cycle/program. The methods ensure: (1) the food product is correctly recognized; (2) the cooking cycle/program is correctly selected; (3) the correct cooking cycle/program is followed to completion; and (4) the quality of the cooked food product meets expected standards.",
  "publication_number": "US20170079471A1-20170323",
  "_processing_info": {
    "original_size": 97659,
    "optimized_size": 3472,
    "reduction_percent": 96.44
  }
}