{
  "date_produced": "20170524",
  "publication_number": "US20170161640A1-20170608",
  "main_ipcr_label": "G06N9900",
  "decision": "PENDING",
  "application_number": "15368447",
  "inventor_list": [
    {
      "inventor_name_last": "Shamir",
      "inventor_name_first": "Gil",
      "inventor_city": "Sewickley",
      "inventor_state": "PA",
      "inventor_country": "US"
    }
  ],
  "abstract": "Methods, systems, and apparatus, including computer programs encoded on computer storage medium, for regularizing feature weights maintained by a machine learning model. The method includes actions of obtaining a set of training data that includes multiple training feature vectors, and training the machine learning model on each of the training feature vectors, comprising, for each feature vector and for each of a plurality of the features of the feature vector: determining a first loss for the feature vector with the feature, determining a second loss for the feature vector without the feature, and updating a current benefit score for the feature using the first loss and the second loss, wherein the benefit score for the feature is indicative of the usefulness of the feature in generating accurate predicted outcomes for training feature vectors.",
  "filing_date": "20161202",
  "patent_number": "None",
  "summary": "<SOH> SUMMARY <EOH>According to one innovative aspect of the present disclosure, a method for regularizing a machine learning model that is configured to receive as input a feature vector that includes a plurality of features and to generate a predicted output from the feature vector is disclosed. The method may include actions of obtaining a set of training data that includes multiple training feature vectors, and training the machine learning model on each of the training feature vectors, comprising, for each feature vector and for each of a plurality of the features of the feature vector: determining a first loss for the feature vector with the feature, determining a second loss for the feature vector without the feature, and updating a current benefit score for the feature using the first loss and the second loss, wherein the benefit score for the feature is indicative of the usefulness of the feature in generating accurate predicted outcomes for training feature vectors. In accordance with various innovative aspects of the disclosure, overfitting may be reduced by regularizing features weights maintained by a machine learning model. The regularized feature weights may be generated by modifying an existing set of feature weights associated with features of a feature vector using a benefit score. In some implementations, the method may include selecting, for each training feature vector, a set of features that are associated with a benefit score that satisfies a predetermined threshold that can be used to train a machine learning model. Selecting, for each training vector, only those features that are associated with a benefit score that satisfies a predetermined threshold to train the machine learning model also provides the advantage of reducing the size of the machine learning model and increasing the efficiency of the machine learning model. Other aspects include corresponding systems, apparatus, and computer programs to perform the actions of methods, encode...",
  "date_published": "20170608",
  "title": "REGULARIZATION OF MACHINE LEARNING MODELS",
  "ipcr_labels": [
    "G06N9900"
  ],
  "_processing_info": {
    "original_size": 69946,
    "optimized_size": 3387,
    "reduction_percent": 95.16
  }
}