{
  "decision": "ACCEPTED",
  "application_number": "15366760",
  "date_published": "20170608",
  "date_produced": "20170524",
  "title": "VEHICLE INTERIOR ILLUMINATION DEVICE",
  "filing_date": "20161201",
  "inventor_list": [
    {
      "inventor_name_last": "Ohashi",
      "inventor_name_first": "Tomonori",
      "inventor_city": "Shizuoka",
      "inventor_state": "",
      "inventor_country": "JP"
    },
    {
      "inventor_name_last": "Barasawa",
      "inventor_name_first": "Hiroko",
      "inventor_city": "Shizuoka",
      "inventor_state": "",
      "inventor_country": "JP"
    },
    {
      "inventor_name_last": "Sugimoto",
      "inventor_name_first": "Terumitsu",
      "inventor_city": "Shizuoka",
      "inventor_state": "",
      "inventor_country": "JP"
    }
  ],
  "ipcr_labels": [
    "B60Q302",
    "G06K900",
    "B60Q900",
    "H05B3308"
  ],
  "main_ipcr_label": "B60Q302",
  "summary": "<SOH> SUMMARY <EOH>In the vehicle interior illumination device provided for the purpose of decoration of the vehicle interior, for example, monochromatic lights selected by a user are allowed to be emitted so as to illuminate the vehicle interior. Thus, a decoration effect is low. The present invention has be made in view of the above-described circumstances, and an object thereof is to provide a vehicle interior illumination device which can obtain a high decoration effect. One or more embodiments of the present invention provide, for example, the vehicle interior illumination device according to the following items (1) to (5). (1) A vehicle interior illumination device including: illumination parts respectively provided in a plurality of positions in a vehicle; and a control part which controls turning on and off operations and illuminating colors of the illumination parts, wherein the control part allows the illumination parts respectively to emit lights by different colors of a same type relating to a theme selected by the control part. (2) The vehicle interior illumination device according to (1), wherein the control part selects the theme in accordance with any of an image signal from an image recording part which records an image outside the vehicle, a vehicle interior temperature detection signal from a vehicle interior temperature detection part which detects a temperature in the vehicle, and a vehicle speed detection signal from a vehicle speed detection part which detects a vehicle speed. (3) The vehicle interior illumination device according to (1) or (2), wherein at least one of the illumination parts includes a light emitting part covered with a cover having an optical part which diffuses or converges and transmits lights, and the light emitting part cannot be viewed by the cover when the illumination part is not turned on. (4) The vehicle interior illumination device according to any one of (1) to (3), wherein the control part allows at least one of t...",
  "patent_number": "9908467",
  "abstract": "A vehicle interior illumination device includes: illumination parts respectively provided in a plurality of positions in a vehicle; and a control part which controls turning on and off operations and illuminating colors of the illumination parts. The control part allows the illumination parts respectively to emit lights by different colors of a same type relating to a theme selected by the control part.",
  "publication_number": "US20170158123A1-20170608",
  "_processing_info": {
    "original_size": 43666,
    "optimized_size": 3263,
    "reduction_percent": 92.53
  }
}