{
  "decision": "PENDING",
  "application_number": "15362735",
  "date_published": "20170601",
  "date_produced": "20170517",
  "title": "AUTO FOCUS PHOTOGRAPHING SYSTEM AND ELECTRONIC DEVICE EMPLOYING THE SAME",
  "filing_date": "20161128",
  "inventor_list": [
    {
      "inventor_name_last": "CHIEN",
      "inventor_name_first": "HOW-WEN",
      "inventor_city": "New Taipei",
      "inventor_state": "",
      "inventor_country": "TW"
    }
  ],
  "ipcr_labels": [
    "H04N5232",
    "G06T700",
    "H04N718",
    "H04N5247",
    "H04N5225"
  ],
  "main_ipcr_label": "H04N5232",
  "summary": "<SOH> BRIEF DESCRIPTION OF THE DRAWINGS <EOH>Many aspects of the disclosure can be better understood with reference to the following figures. The components in the figures are not necessarily drawn to scale, the emphasis instead being placed upon clearly illustrating the principles of the disclosure. Moreover, in the drawings, like reference numerals designate corresponding parts throughout several views. FIG. 1 is a block diagram of an exemplary embodiment of an auto focus photographing system. FIG. 2 is a planar view of a first embodiment of a smart glasses. FIG. 3 is a planar view of a second embodiment of a smart glasses. detailed-description description=\"Detailed Description\" end=\"lead\"?",
  "patent_number": "None",
  "abstract": "An auto focus photographing system applied in an electronic device that is worn before eyes of a user is provided. The auto focus photographing system includes a first camera module, a second camera module, and a processor. The first camera module captures images of the eyes. The second camera module captures images of objects that the eyes focus on. The processor analyzes a distance between centers of eye pupils of the user and calculates a focusing current value corresponding to the distance, and adjusts a focus distance of the second camera module accordingly. The processor detects a capture command and the second camera module captures an image according to the adjusted focus distance. An electronic device employing the auto focus photographing system is also provided.",
  "publication_number": "US20170155830A1-20170601",
  "_processing_info": {
    "original_size": 27889,
    "optimized_size": 2093,
    "reduction_percent": 92.5
  }
}