{
  "date_produced": "20170524",
  "publication_number": "US20170161602A1-20170608",
  "main_ipcr_label": "G06N304",
  "decision": "PENDING",
  "application_number": "15367589",
  "inventor_list": [
    {
      "inventor_name_last": "Tanimura",
      "inventor_name_first": "Takahito",
      "inventor_city": "Kawasaki",
      "inventor_state": "",
      "inventor_country": "JP"
    },
    {
      "inventor_name_last": "Hoshida",
      "inventor_name_first": "Takeshi",
      "inventor_city": "Kawasaki",
      "inventor_state": "",
      "inventor_country": "JP"
    }
  ],
  "abstract": "A data collecting device includes a receiver configured to receive an optical signal; an optical-to-electrical converter configured to convert the optical signal received by the receiver into an electrical signal; an analog-to-digital converter configured to convert the electrical signal into a digital signal; a data reducing circuit configured to reduce the digital signal output from the analog-to-digital converter; and a transmitter configured to transmit, to a managing device that manages the data collecting device, a signal obtained by reducing the digital signal by the data reducing circuit.",
  "filing_date": "20161202",
  "patent_number": "None",
  "summary": "<SOH> SUMMARY <EOH>According to an aspect of the embodiments, a data collecting device includes a receiver configured to receive an optical signal; an optical-to-electrical converter configured to convert the optical signal received by the receiver into an electrical signal; an analog-to-digital converter configured to convert the electrical signal into a digital signal; a data reducing circuit configured to reduce the digital signal output from the analog-to-digital converter; and a transmitter configured to transmit, to a managing device that manages the data collecting device, a signal obtained by reducing the digital signal by the data reducing circuit. The object and advantages of the invention will be realized and attained by means of the elements and combinations particularly pointed out in the claims. It is to be understood that both the foregoing general description and the following detailed description are exemplary and explanatory and are not restrictive of the invention, as claimed.",
  "date_published": "20170608",
  "title": "DATA COLLECTING DEVICE AND OPTICAL TRANSMISSION SYSTEM",
  "ipcr_labels": [
    "G06N304",
    "H04B1060",
    "G06N308",
    "H04B1050"
  ],
  "_processing_info": {
    "original_size": 61415,
    "optimized_size": 2335,
    "reduction_percent": 96.2
  }
}