{
  "date_produced": "20170517",
  "publication_number": "US20170154269A1-20170601",
  "main_ipcr_label": "G06N504",
  "decision": "PENDING",
  "application_number": "15363603",
  "inventor_list": [
    {
      "inventor_name_last": "Guttmann",
      "inventor_name_first": "Moshe",
      "inventor_city": "Tel Aviv",
      "inventor_state": "",
      "inventor_country": "IL"
    }
  ],
  "abstract": "System and method for generating inference models are provided. Scene information may be received. Inference models may be generated based on the scene information. At least one of the generated inference models may be transmitted. A result of applying input data to the transmitted inference model may be received. Input data may be received. A result of applying the received input data to at least one of the generated inference models may be generated. A notification may be provided based on the received result and the generated result.",
  "filing_date": "20161129",
  "patent_number": "None",
  "summary": "<SOH> SUMMARY <EOH>In some embodiments, apparatuses and methods for inferring information are provided. In some embodiments, systems and methods for updating inference models are provided. In some embodiments, systems and methods for generating inference models are provided. In some embodiments, systems and methods for image classification based on Tsallis entropy are provided. In some embodiments, input data and inference model may be obtained. A result of applying the input data to the inference model may be generated. Information based on the generated result may be transmitted. Update to the inference model may be received. The updated inference model may be used to obtain additional results. In some embodiments, data request may be received. A portion of the input data may be selected, for example based on the data request. The selected portion of the input data may be transmitted. In some embodiments, information based on a result of applying input data to an inference model may be received. An update to the inference model may be generated based on the received information. The generated update may be transmitted. In some embodiments, a data request may be transmitted. A portion of the input data may be received, for example in response to the data request. In some embodiments, scene information may be generated. The scene information may be transmitted. An inference model may be received, for example in response to the transmitted scene information. Input data may be obtained. A result of applying the input data to the received inference model may be generated. The generated result may be transmitted. The input data may be transmitted. In some embodiments, scene information may be received. Inference models may be generated based on the scene information. At least one of the generated inference models may be transmitted. A result of applying input data to the transmitted inference model may be received. Input data may be received. A result of applying the re...",
  "date_published": "20170601",
  "title": "SYSTEM AND METHOD FOR GENERATING AND USING INFERENCE MODELS",
  "ipcr_labels": [
    "G06N504",
    "H04L1258",
    "H04L2908"
  ],
  "_processing_info": {
    "original_size": 212518,
    "optimized_size": 3112,
    "reduction_percent": 98.54
  }
}