{
  "decision": "ACCEPTED",
  "application_number": "15363098",
  "date_published": "20170316",
  "date_produced": "20170301",
  "title": "METHOD AND APPARATUS FOR IMAGE COLLECTION AND ANALYSIS",
  "filing_date": "20161129",
  "inventor_list": [
    {
      "inventor_name_last": "Meredith",
      "inventor_name_first": "Sheldon Kent",
      "inventor_city": "Marietta",
      "inventor_state": "GA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Fix",
      "inventor_name_first": "Jeremy",
      "inventor_city": "Acworth",
      "inventor_state": "GA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Hilliard",
      "inventor_name_first": "Brandon B.",
      "inventor_city": "Woodstock",
      "inventor_state": "GA",
      "inventor_country": "US"
    }
  ],
  "ipcr_labels": [
    "G06K946",
    "G06F1730"
  ],
  "main_ipcr_label": "G06K946",
  "summary": "<SOH> BRIEF DESCRIPTION OF THE DRAWINGS <EOH>Reference will now be made to the accompanying drawings, which are not necessarily drawn to scale, and wherein: FIGS. 1-2 depict illustrative embodiments of communication systems that provide media services including distributing image content; FIG. 3 depicts an illustrative embodiment of a method operating in portions of the systems described in FIGS. 1-2 ; FIGS. 4-5 depict illustrative embodiments of communication systems that provide media services including distributing image content; FIG. 6 depicts an illustrative embodiment of a communication device utilized in the communication systems of FIGS. 1-2 and 4-5 ; and FIG. 7 is a diagrammatic representation of a machine in the form of a computer system within which a set of instructions, when executed, may cause the machine to perform any one or more of the methods described herein. detailed-description description=\"Detailed Description\" end=\"lead\"?",
  "patent_number": "9911057",
  "abstract": "A system that incorporates teachings of the subject disclosure may include, for example, a processor that can detect an event, access location information for a group of mobile communication devices that are each automatically capturing images, and identify a subset of the group of mobile communication devices that are in proximity to the event based on the location information. The processor can provide first image analysis criteria to the subset of the group of mobile communication devices without providing the first image analysis criteria to remaining devices of the group of mobile communication devices where the first image analysis criteria includes first characteristics associated with an object. The processor can receive a first target image that includes the object from a first mobile communication device of the subset of the group of mobile communication devices. Other embodiments are disclosed.",
  "publication_number": "US20170076172A1-20170316",
  "_processing_info": {
    "original_size": 78831,
    "optimized_size": 2738,
    "reduction_percent": 96.53
  }
}