{
  "decision": "PENDING",
  "application_number": "15368011",
  "date_published": "20180607",
  "date_produced": "20180523",
  "title": "SYSTEMS AND METHODS FOR DETECTING AND RESPONDING TO USER FRUSTRATION WITH ELECTRONIC DEVICES",
  "filing_date": "20161202",
  "inventor_list": [
    {
      "inventor_name_last": "Mickelsen",
      "inventor_name_first": "Jeremy Stephen",
      "inventor_city": "Denver",
      "inventor_state": "CO",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Vigo",
      "inventor_name_first": "Frederick Gayen",
      "inventor_city": "Aurora",
      "inventor_state": "CO",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Louie",
      "inventor_name_first": "Jackson",
      "inventor_city": "Aurora",
      "inventor_state": "CO",
      "inventor_country": "US"
    }
  ],
  "ipcr_labels": [
    "G06F30346",
    "G06F944",
    "G06F316",
    "H04N214425",
    "H04N21442"
  ],
  "main_ipcr_label": "G06F30346",
  "summary": "<SOH> BRIEF SUMMARY <EOH>Some users slap, hit, or otherwise jar devices such as electrical equipment including, for example, televisions and set-top boxes, when these devices are not performing to expectations. Although it is unlikely to improve operation on most modern equipment, detecting the jarring events may be used as described herein to trigger operations in the device for diagnostics, user education and other corrective actions. In one embodiment, a user frustration monitoring and control system may be part of or otherwise operably coupled to an electronic device such as a receiving device to detect and respond to user frustration with the receiving device or with other components in communication with the receiving device. For example, the user frustration monitoring and control system may detect when, out of frustration, a user jars or hits the receiving device or other electronic devices in communication with the receiving device, such as a remote-control device or monitor, and will perform an action to address the detected user frustration. This action may be, for example, performing a diagnostic action and/or communicating a helpful message or instructions to the user. In some embodiments, there may be a plurality of user frustration monitoring and control systems affixed to respective devices that each may communicate detection of user frustration and/or diagnostic data to a remote monitoring system, content provider, program distributor or other information provider over a communications network such as the Internet. This communication may be to determine existence of a systemic problem related to a plurality of electronic devices within a particular customer premises, service area, city or geographical region.",
  "patent_number": "None",
  "abstract": "In various embodiments, a user frustration monitoring and control system may be part of or otherwise be operably coupled to a device to detect and respond to user frustration with the device or with other components in communication with the device. A user frustration monitoring and control system may detect when, out of frustration, a user jars or hits a set-top box or other device in communication with the set-top box, such as a remote-control device or monitor, and will perform an action to address the detected user frustration. This action may be, for example, performing a diagnostic action and/or communicating a helpful message or instructions to the user.",
  "publication_number": "US20180157343A1-20180607",
  "_processing_info": {
    "original_size": 94016,
    "optimized_size": 3358,
    "reduction_percent": 96.43
  }
}