{
  "date_produced": "20170309",
  "publication_number": "US20170083830A1-20170323",
  "main_ipcr_label": "G06N9900",
  "decision": "PENDING",
  "application_number": "15365607",
  "inventor_list": [
    {
      "inventor_name_last": "Bates",
      "inventor_name_first": "Alexander B.",
      "inventor_city": "San Diego",
      "inventor_state": "CA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Rahilly",
      "inventor_name_first": "Paul",
      "inventor_city": "San Diego",
      "inventor_state": "CA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Macnab",
      "inventor_name_first": "Scott",
      "inventor_city": "San Diego",
      "inventor_state": "CA",
      "inventor_country": "US"
    }
  ],
  "abstract": "A system for performing failure signature recognition training for at least one unit of equipment. The system includes a memory and a processor coupled to the memory. The processor is configured by computer code to receive sensor data relating to the unit of equipment and to receive failure information relating to equipment failures. The processor is further configured to analyze the sensor data in view of the failure information in order to develop at least one learning agent for performing failure signature recognition with respect to the at least one unit of equipment.",
  "filing_date": "20161130",
  "patent_number": "None",
  "summary": "<SOH> SUMMARY OF THE INVENTION <EOH>Exemplary embodiments of the present disclosure that are shown in the drawings are summarized below. These and other embodiments are more fully described in the Detailed Description section. It is to be understood, however, that there is no intention to limit the teachings of the disclosure to the forms described in this Summary or in the Detailed Description. One skilled in the art can recognize that there are numerous modifications, equivalents and alternative constructions that fall within the spirit and scope of the teachings of this disclosure. Aspects of the disclosure relate to failure signature recognition for learning when failures take place by analyzing historical data and identifying signatures in the data indicative of coming failure. In addition, the disclosure pertains to anomaly detection for analyzing current data and comparing the current data to past data and one or more multivariate models developed based on the past data to identify non-normal or anomalous conditions. In one aspect the disclosure relates to a computer program product including a non-transitory computer readable medium having code stored therein for causing a computer to perform failure signature recognition training for at least one unit of equipment. The code includes first code for causing the computer to receive sensor data relating to the unit of equipment and second code for causing the computer to receive failure information relating to equipment failures. Third code is provided for causing the computer to analyze the sensor data in view of the failure information in order to develop at least one learning agent for performing failure signature recognition with respect to the at least one unit of equipment. In another aspect the disclosure relates to a computer program product including a non-transitory computer readable medium having code stored therein for causing a computer to perform equipment monitoring. The code includes first code ...",
  "date_published": "20170323",
  "title": "System and Methods for Automated Plant Asset Failure Detection",
  "ipcr_labels": [
    "G06N9900"
  ],
  "_processing_info": {
    "original_size": 66560,
    "optimized_size": 3428,
    "reduction_percent": 94.85
  }
}