{
  "date_produced": "20180509",
  "publication_number": "US20180144243A1-20180524",
  "main_ipcr_label": "G06N308",
  "decision": "PENDING",
  "application_number": "15360042",
  "inventor_list": [
    {
      "inventor_name_last": "Hsieh",
      "inventor_name_first": "Jiang",
      "inventor_city": "Waukesha",
      "inventor_state": "WI",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Avinash",
      "inventor_name_first": "Gopal",
      "inventor_city": "San Ramon",
      "inventor_state": "CA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Sirohey",
      "inventor_name_first": "Saad",
      "inventor_city": "Pewaukee",
      "inventor_state": "WI",
      "inventor_country": "US"
    }
  ],
  "abstract": "Methods and apparatus for deep learning-based system design improvement are provided. An example system design engine apparatus includes a deep learning network (DLN) model associated with each component of a target system to be emulated, each DLN model to be trained using known input and known output, wherein the known input and known output simulate input and output of the associated component of the target system, and wherein each DLN model is connected as each associated component to be emulated is connected in the target system to form a digital model of the target system. The example apparatus also includes a model processor to simulate behavior of the target system and/or each component of the target system to be emulated using the digital model to generate a recommendation regarding a configuration of a component of the target system and/or a structure of the component of the target system.",
  "filing_date": "20161123",
  "patent_number": "None",
  "summary": "<SOH> BRIEF SUMMARY <EOH>Certain examples provide a system design engine apparatus including a deep learning network model associated with each component of a target system to be emulated, each deep learning network model to be trained using known input and known output, wherein the known input and known output simulate input and output of the associated component of the target system, and wherein each deep learning network model is connected as each associated component to be emulated is connected in the target system to form a digital model of the target system. The example apparatus also includes a model processor to simulate behavior of at least one of the target system or each component of the target system to be emulated using the digital model to generate a recommendation regarding at least one of a configuration of a component of the target system or a structure of the component of the target system. Certain examples provide a computer readable medium including instructions. The example instructions, when executed, cause a machine to implement at least a deep learning network model associated with each component of a target system to be emulated, each deep learning network model to be trained using known input and known output, wherein the known input and known output simulate input and output of the associated component of the target system, and wherein each deep learning network model is connected as each associated component to be emulated is connected in the target system to form a digital model of the target system. The example instructions, when executed, cause a machine to implement at least a model processor to simulate behavior of at least one of the target system or each component of the target system to be emulated using the digital model to generate a recommendation regarding at least one of a configuration of a component of the target system or a structure of the component of the target system. Certain examples provide a method including trainin...",
  "date_published": "20180524",
  "title": "HARDWARE SYSTEM DESIGN IMPROVEMENT USING DEEP LEARNING ALGORITHMS",
  "ipcr_labels": [
    "G06N308",
    "G06F1750"
  ],
  "_processing_info": {
    "original_size": 217587,
    "optimized_size": 3766,
    "reduction_percent": 98.27
  }
}