{
  "date_produced": "20180516",
  "publication_number": "US20180150748A1-20180531",
  "main_ipcr_label": "G06N502",
  "decision": "PENDING",
  "application_number": "15361447",
  "inventor_list": [
    {
      "inventor_name_last": "Bastide",
      "inventor_name_first": "Paul R.",
      "inventor_city": "Boxford",
      "inventor_state": "MA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Cohen",
      "inventor_name_first": "Aaron M.",
      "inventor_city": "Westford",
      "inventor_state": "MA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Yim",
      "inventor_name_first": "Peter C.",
      "inventor_city": "Raleigh",
      "inventor_state": "NC",
      "inventor_country": "US"
    }
  ],
  "abstract": "An approach is provided that ingests question-answer pairs from an online discussion site into a question answering (QA) system by preprocessing the online discussion site prior to ingesting the data. The preprocessing of the online discussion site is performed by identifying stale questions posted to the online discussion site, analyzing the stale question to determine an appropriate trigger post, with the trigger post is designed to instigate an answer to the stale question, with the system automatically generating and posting the trigger post to the online discussion site.",
  "filing_date": "20161127",
  "patent_number": "None",
  "summary": "<SOH> SUMMARY <EOH>An approach is provided that ingests question-answer pairs from an online discussion site into a question answering (QA) system by preprocessing the online discussion site prior to ingesting the data. The preprocessing of the online discussion site is performed by identifying stale questions posted to the online discussion site, analyzing the stale question to determine an appropriate trigger post, with the trigger post is designed to instigate an answer to the stale question, with the system automatically generating and posting the trigger post to the online discussion site. The foregoing is a summary and thus contains, by necessity, simplifications, generalizations, and omissions of detail; consequently, those skilled in the art will appreciate that the summary is illustrative only and is not intended to be in any way limiting. Other aspects, inventive features, and advantages of the present invention will be apparent in the non-limiting detailed description set forth below.",
  "date_published": "20180531",
  "title": "Enhanced Ingestion of Question-Answer Pairs into Question Answering Systems by Preprocessing Online Discussion Sites",
  "ipcr_labels": [
    "G06N502",
    "H04L1258"
  ],
  "_processing_info": {
    "original_size": 60045,
    "optimized_size": 2497,
    "reduction_percent": 95.84
  }
}