{
  "date_produced": "20180523",
  "publication_number": "US20180157979A1-20180607",
  "main_ipcr_label": "G06N504",
  "decision": "PENDING",
  "application_number": "15367784",
  "inventor_list": [
    {
      "inventor_name_last": "Dehaghani",
      "inventor_name_first": "Azar Rahimi",
      "inventor_city": "Seattle",
      "inventor_state": "WA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Wascher",
      "inventor_name_first": "Michael",
      "inventor_city": "Seattle",
      "inventor_state": "WA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Gedge",
      "inventor_name_first": "Nick",
      "inventor_city": "Redmond",
      "inventor_state": "WA",
      "inventor_country": "US"
    }
  ],
  "abstract": "An inference is made regarding whether or not an upcoming day is going to be a busy day for a user. One or more different user-specific event parameters are utilized to compute a user busyness score for the upcoming day, where these parameters are based in part on a history of events for the user and their past behavior. Then, whenever the user busyness score for the upcoming day is greater than a busy day threshold, it is inferred that the upcoming day is going to be a busy day for the user. Whenever the user busyness score for the upcoming day is less than a quiet day threshold, it is inferred that the upcoming day is going to be a quiet day for the user.",
  "filing_date": "20161202",
  "patent_number": "None",
  "summary": "<SOH> SUMMARY <EOH>Busy day inference technique implementations described herein generally infer whether or not an upcoming day is going to be a busy day for a user. In an exemplary implementation one or more different user-specific event parameters are utilized to compute a user busyness score for the upcoming day, where these parameters are based in part on a history of events for the user and their past behavior. Then, whenever the user busyness score for the upcoming day is greater than a busy day threshold, it is inferred that the upcoming day is going to be a busy day for the user. Additionally, whenever the user busyness score for the upcoming day is less than a quiet day threshold, it is inferred that the upcoming day is going to be a quiet day for the user. It should be noted that the foregoing Summary is provided to introduce a selection of concepts, in a simplified form, that are further described below in the Detailed Description. This Summary is not intended to identify key features or essential features of the claimed subject matter, nor is it intended to be used as an aid in determining the scope of the claimed subject matter. Its sole purpose is to present some concepts of the claimed subject matter in a simplified form as a prelude to the more-detailed description that is presented below.",
  "date_published": "20180607",
  "title": "BUSY DAY INFERENCE FOR USERS",
  "ipcr_labels": [
    "G06N504",
    "G06Q1010"
  ],
  "_processing_info": {
    "original_size": 79236,
    "optimized_size": 2812,
    "reduction_percent": 96.45
  }
}