{
  "date_produced": "20180516",
  "publication_number": "US20180150749A1-20180531",
  "main_ipcr_label": "G06N502",
  "decision": "PENDING",
  "application_number": "15363145",
  "inventor_list": [
    {
      "inventor_name_last": "Wu",
      "inventor_name_first": "Xianchao",
      "inventor_city": "Tokyo",
      "inventor_state": "",
      "inventor_country": "JP"
    },
    {
      "inventor_name_last": "Fujiwara",
      "inventor_name_first": "Keizo",
      "inventor_city": "Kanagawa",
      "inventor_state": "",
      "inventor_country": "JP"
    }
  ],
  "abstract": "Described herein is a system and method for providing a conversation session with an artificial intelligence entity that is associated with a business entity. In some aspects, input is provided to an artificial intelligence entity advertisement system. The input is analyzed to determine the subject matter of the input. An artificial intelligence entity associated with the subject matter is then selected and provided to the user. The artificial intelligence entity recommends products or services that are provided by the business entity to the user.",
  "filing_date": "20161129",
  "patent_number": "None",
  "summary": "<SOH> SUMMARY <EOH>This disclosure generally relates to providing an artificial intelligence entity (e.g., a chatbot) that may be used as an advertising medium. More specifically, the present disclosure enables various business entities to create their own unique artificial intelligence entity that may be used to interact with various users. The artificial intelligence entity may be configured to answer questions for the user, provide information about the business entity, provide recommendations for products and services provided by the business entity and also provide information about the artificial intelligence entity itself. For example, a user may provide a query to an artificial intelligence advertisement system. Depending on the subject matter of the query, an artificial intelligence entity that is associated with the subject matter is selected. In some implementations, the artificial intelligence entity is also associated with a business entity that offers or otherwise provides a product or service that is associated with the subject matter. The artificial intelligence entity may initiate a conversation session with the user and provide information corresponding to the query including recommendations for products or services provided by the business entity. Additionally, the artificial intelligence entity may request that the user adds the artificial entity as a “friend.” Once added, the artificial intelligence entity may be automatically selected and provided to a user when a query of the same or similar subject matter is received by the artificial intelligence entity advertisement system. Accordingly, described herein is a system comprising a processing unit and a memory storing computer executable instructions which, when executed by the processing unit, causes the system to perform a method, comprising, receiving a query and parsing the query to determine one or more keywords contained in the query. Once the keywords are determined, one or more artifici...",
  "date_published": "20180531",
  "title": "USING VARIOUS ARTIFICIAL INTELLIGENCE ENTITIES AS ADVERTISING MEDIUMS",
  "ipcr_labels": [
    "G06N502",
    "G06F1730",
    "G06Q1010"
  ],
  "_processing_info": {
    "original_size": 107681,
    "optimized_size": 3282,
    "reduction_percent": 96.95
  }
}