{
  "date_produced": "20180530",
  "publication_number": "US20180165591A1-20180614",
  "main_ipcr_label": "G06N700",
  "decision": "PENDING",
  "application_number": "15373999",
  "inventor_list": [
    {
      "inventor_name_last": "Dunik",
      "inventor_name_first": "Jindrich",
      "inventor_city": "Plzen",
      "inventor_state": "",
      "inventor_country": "CZ"
    },
    {
      "inventor_name_last": "Sotak",
      "inventor_name_first": "Milos",
      "inventor_city": "Slavkov u Brna",
      "inventor_state": "",
      "inventor_country": "CZ"
    },
    {
      "inventor_name_last": "Vesely",
      "inventor_name_first": "Milos",
      "inventor_city": "Nemcice",
      "inventor_state": "",
      "inventor_country": "CZ"
    },
    {
      "inventor_name_last": "Hawkinson",
      "inventor_name_first": "Wesley J.",
      "inventor_city": "Chanhassen",
      "inventor_state": "MN",
      "inventor_country": "US"
    }
  ],
  "abstract": "A method is provided. The method comprises: initializing a point mass filter; initializing the one or more Bayesian filters; obtaining measurement data associated with a horizontal position on a surface; obtaining measurement data of a horizontal position and a velocity; obtaining geo-mapping data; estimating, with the point mass filter, the horizontal position on the surface based upon the geo-mapping data and the measurement data; estimating, with the one or more Bayesian filters, remaining state parameters based upon an output of the point mass filter and the measurement data; predicting, with the point mass filter, an a priori horizontal position, on a surface for a future time when the next measurement data will be obtained; and predicting, with the one or more Bayesian filters, an a priori remaining state parameters for a future time when the next measurement data will be obtained.",
  "filing_date": "20161209",
  "patent_number": "None",
  "summary": "<SOH> SUMMARY <EOH>A method is provided. The method comprises: initializing a point mass filter; initializing the one or more Bayesian filters; obtaining measurement data associated with a horizontal position on a surface; obtaining measurement data of a horizontal position and a velocity; obtaining geo-mapping data; estimating, with the point mass filter, the horizontal position on the surface based upon the geo-mapping data and the measurement data; estimating, with the one or more Bayesian filters, remaining state parameters based upon an output of the point mass filter and the measurement data; predicting, with the point mass filter, an a priori horizontal position, on a surface for a future time when the next measurement data will be obtained; and predicting, with the one or more Bayesian filters, an a priori remaining state parameters for a future time when the next measurement data will be obtained.",
  "date_published": "20180614",
  "title": "APPARATUS AND METHOD FOR DATA-BASED REFERENCED NAVIGATION",
  "ipcr_labels": [
    "G06N700",
    "G01C2116"
  ],
  "_processing_info": {
    "original_size": 54343,
    "optimized_size": 2813,
    "reduction_percent": 94.82
  }
}