{
  "decision": "PENDING",
  "application_number": "15370925",
  "date_published": "20170615",
  "date_produced": "20170603",
  "title": "CALCULATION DEVICE, CALCULATION METHOD, COMMUNICATION APPARATUS, AND STORAGE MEDIUM",
  "filing_date": "20161206",
  "inventor_list": [
    {
      "inventor_name_last": "Suzuki",
      "inventor_name_first": "Motoharu",
      "inventor_city": "Yokohama-shi",
      "inventor_state": "",
      "inventor_country": "JP"
    }
  ],
  "ipcr_labels": [
    "H04L2906",
    "G06F306"
  ],
  "main_ipcr_label": "H04L2906",
  "summary": "<SOH> SUMMARY OF THE INVENTION <EOH>The aspects of the embodiments provide a calculation device that performs checksum calculation on data to be transmitted. The calculation device includes a plurality of memories, an interface configured to output data to which a checksum is added, a first transmitter configured to transmit the data between the plurality of memories and have a function of performing the checksum calculation on the data, a second transmitter configured to transmit the data between one of the plurality of memories and the interface and have a function of performing the checksum calculation on the data, and a control unit configured to control operation of the first transmitter and the second transmitter. The control unit causes the first transmitter or the second transmitter to perform the checksum calculation based on a communication method employed for the data. Further features of an aspect of the embodiments will become apparent from the following description of exemplary embodiments with reference to the attached drawings.",
  "patent_number": "None",
  "abstract": "A calculation device that performs checksum calculation on data to be communicated includes a plurality of memories, an interface configured to output data to which a checksum is added, a first transmitter configured to transmit the data between the plurality of memories and have a function of performing the checksum calculation on the data, a second transmitter configured to transmit the data between one of the plurality of memories and the interface and have a function of performing the checksum calculation on the data, and a control unit configured to control operation of the first transmitter and the second transmitter. The control unit causes the first transmitter or the second transmitter to perform the checksum calculation based on a communication method employed for the data.",
  "publication_number": "US20170171167A1-20170615",
  "_processing_info": {
    "original_size": 54927,
    "optimized_size": 2438,
    "reduction_percent": 95.56
  }
}