{
  "date_produced": "20170316",
  "publication_number": "US20170091644A1-20170330",
  "main_ipcr_label": "G06N700",
  "decision": "PENDING",
  "application_number": "15377724",
  "inventor_list": [
    {
      "inventor_name_last": "Chung",
      "inventor_name_first": "Christina Yip",
      "inventor_city": "Mountain View",
      "inventor_state": "CA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Blue",
      "inventor_name_first": "Allen J.",
      "inventor_city": "Sunnyvale",
      "inventor_state": "CA",
      "inventor_country": "US"
    }
  ],
  "abstract": "Techniques for identification of a propagator-type leader in a social network are described. According to various embodiments, a specific content item posted by a particular actor of a plurality of actors and interactions by other actors of the plurality of actors with the specific content item are identified. A leadership score associated with the particular actor is calculated, the leadership score indicating a propensity of the particular actor to spread information among the plurality of actors of the online social network service. The particular actor is then classified as an information propagator among the plurality of actors of the online social network service, based on the calculated leadership score.",
  "filing_date": "20161213",
  "patent_number": "None",
  "summary": "<SOH> BRIEF DESCRIPTION OF THE DRAWINGS <EOH>Some embodiments are illustrated by way of example and not limitation in the figures of the accompanying drawings in which: FIG. 1 is a block diagram showing the functional components of a social networking service, consistent with some embodiments of the invention; FIG. 2 illustrates an example sociograph, according to various embodiments; FIG. 3 illustrates an example sociograph, according to various embodiments; FIG. 4 illustrates an example sub-sociograph, according to various embodiments; FIG. 5 illustrates an example sub-sociograph, according to various embodiments; FIG. 6 illustrates an example sociograph, according to various embodiments; FIG. 7 illustrates an example sociograph, according to various embodiments; FIG. 8 illustrates an example sociograph, according to various embodiments; FIG. 9 illustrates a table summarizing various information about different types of leaders, according to various embodiments; FIG. 10 is a block diagram of an example system, according to various embodiments; FIG. 11 is a flowchart illustrating an example method, according to various embodiments; FIG. 12 is a flowchart illustrating an example method, according to various embodiments; FIG. 13 is a flowchart illustrating an example method, according to various embodiments; and FIG. 14 is a diagrammatic representation of a machine in the example form of a computer system within which a set of instructions, for causing the machine to perform any one or more of the methodologies discussed herein, may be executed. detailed-description description=\"Detailed Description\" end=\"lead\"?",
  "date_published": "20170330",
  "title": "IDENTIFICATION OF A PROPAGATOR-TYPE LEADER IN A SOCIAL NETWORK",
  "ipcr_labels": [
    "G06N700",
    "H04L2908",
    "G06N9900"
  ],
  "_processing_info": {
    "original_size": 132778,
    "optimized_size": 3091,
    "reduction_percent": 97.67
  }
}