{
  "decision": "PENDING",
  "application_number": "15373098",
  "date_published": "20170629",
  "date_produced": "20170614",
  "title": "IMAGE FORMING APPARATUS",
  "filing_date": "20161208",
  "inventor_list": [
    {
      "inventor_name_last": "Matsumoto",
      "inventor_name_first": "Hiroshi",
      "inventor_city": "Toride-shi",
      "inventor_state": "",
      "inventor_country": "JP"
    },
    {
      "inventor_name_last": "Sakaguchi",
      "inventor_name_first": "Ryou",
      "inventor_city": "Toride-shi",
      "inventor_state": "",
      "inventor_country": "JP"
    },
    {
      "inventor_name_last": "Iwadate",
      "inventor_name_first": "Shinnosuke",
      "inventor_city": "Toride-shi",
      "inventor_state": "",
      "inventor_country": "JP"
    },
    {
      "inventor_name_last": "Kai",
      "inventor_name_first": "Teruhito",
      "inventor_city": "Kashiwa-shi",
      "inventor_state": "",
      "inventor_country": "JP"
    },
    {
      "inventor_name_last": "Nishihara",
      "inventor_name_first": "Hiroto",
      "inventor_city": "Tsukuba-shi",
      "inventor_state": "",
      "inventor_country": "JP"
    },
    {
      "inventor_name_last": "Shimura",
      "inventor_name_first": "Hiromi",
      "inventor_city": "Toride-shi",
      "inventor_state": "",
      "inventor_country": "JP"
    },
    {
      "inventor_name_last": "Takahashi",
      "inventor_name_first": "Keita",
      "inventor_city": "Abiko-shi",
      "inventor_state": "",
      "inventor_country": "JP"
    }
  ],
  "ipcr_labels": [
    "H04N100",
    "G06K1502",
    "H04N160",
    "H04N106",
    "H04N162"
  ],
  "main_ipcr_label": "H04N100",
  "summary": "<SOH> SUMMARY OF THE INVENTION <EOH>Therefore, the present invention provides an image forming apparatus configured to change a resolution of a displayed required time based on a type of an image quality adjustment. According to one embodiment of the present invention, there is provided an image forming apparatus, comprising: an image forming unit configured to form an image on a sheet; an adjustment unit configured to select a type of adjustment processing to be executed for the image forming unit from among a plurality of types of adjustment processing, and to execute the selected type of adjustment processing for the image forming unit; a determination unit configured to determine a required time of the selected type of adjustment processing; and a display unit configured to display a remaining time to be taken until the selected type of adjustment processing finishes being executed based on the required time, wherein the display unit counts down the remaining time, and wherein the display unit controls a resolution of the remaining time based on the selected type of adjustment processing. Further features of the present invention will become apparent from the following description of exemplary embodiments with reference to the attached drawings.",
  "patent_number": "None",
  "abstract": "An image forming apparatus, including: an image forming unit configured to form an image on a sheet; an adjustment unit configured to select a type of adjustment processing to be executed for the image forming unit from among a plurality of types of adjustment processing, and to execute the selected type of adjustment processing for the image forming unit; a determination unit configured to determine a required time of the selected type of adjustment processing; and a display unit configured to display a remaining time to be taken until the selected type of adjustment processing finishes being executed based on the required time, wherein the display unit counts down the remaining time, and the display unit controls a resolution of the remaining time based on the selected type of adjustment processing.",
  "publication_number": "US20170187898A1-20170629",
  "_processing_info": {
    "original_size": 77800,
    "optimized_size": 3526,
    "reduction_percent": 95.47
  }
}