{
  "decision": "PENDING",
  "application_number": "15379600",
  "date_published": "20170406",
  "date_produced": "20170323",
  "title": "TRANSFER FILM, METHOD FOR MANUFACTURING TRANSFER FILM, LAMINATE, METHOD FOR MANUFACTURING LAMINATE, CAPACITIVE INPUT DEVICE, AND IMAGE DISPLAY DEVICE",
  "filing_date": "20161215",
  "inventor_list": [
    {
      "inventor_name_last": "KANEIWA",
      "inventor_name_first": "Hideki",
      "inventor_city": "Fujinomiya-shi",
      "inventor_state": "",
      "inventor_country": "JP"
    },
    {
      "inventor_name_last": "TOYOOKA",
      "inventor_name_first": "Kentaro",
      "inventor_city": "Fujinomiya-shi",
      "inventor_state": "",
      "inventor_country": "JP"
    }
  ],
  "ipcr_labels": [
    "B32B3700",
    "B32B2708",
    "B32B2732",
    "G06F3044",
    "B32B2742",
    "B32B2740",
    "B32B2720",
    "H03K1796",
    "B32B702",
    "B32B2730"
  ],
  "main_ipcr_label": "B32B3700",
  "summary": "<SOH> SUMMARY OF THE INVENTION <EOH>In regard to the formation of an insulating layer or a protective layer for an electrode pattern film for a touch panel, in order to extract signals, it is necessary to produce a region from which a insulating layer or a protective layer has been removed, in some portions of metal wiring sections around a transparent electrode by means of methods such as pattern developing (patterning). In this region in which the insulating layer or the protective layer is not formed, since metal is exposed, there is a risk that metal parts may be deteriorated in the middle of the subsequent steps. Prior art technologies disclose methods for forming an insulating layer, a protective layer, or the like using a transfer film; however, in non-pattern-formed areas, oxidation may occur. An object of the invention is to provide a transfer film which is used for forming an insulating layer or a protective layer, and has excellent pattern concealability and excellent protective properties in a region from which an insulating layer or a protective layer has been removed; a method for manufacturing a transfer film; a laminate; and a method for manufacturing a laminate. Furthermore, another object of the invention is to provide a capacitive input device manufactured using the transfer film; a capacitive input device including the laminate; and an image display device including such a capacitive input device as a constituent element. The objects of the invention described above are addressed by the means described in the following items <1>, <3>, <16> to <20>, <27>, <30>, or <32>. Preferred embodiments <2> to <15>, <21> to <26>, <28> to <29>, and <31> will be described together below. <1> A transfer film comprising a temporary support; and a first transparent resin layer containing a metal oxidation inhibitor, wherein the first transparent resin layer has a refractive index of 1.60 or higher. <2> The transfer film according to <1>, wherein the first transpar...",
  "patent_number": "None",
  "abstract": "A transfer film according to a first embodiment has a temporary support and a first transparent resin layer containing a metal oxidation inhibitor, in which the first transparent resin layer has a refractive index of 1.60 or higher. A transfer film according to a second embodiment has a temporary support and a first transparent resin layer, in which the first transparent resin layer contains a metal oxidation inhibitor and metal oxide particles.",
  "publication_number": "US20170095999A1-20170406",
  "_processing_info": {
    "original_size": 229549,
    "optimized_size": 3352,
    "reduction_percent": 98.54
  }
}