{
  "date_produced": "20170719",
  "publication_number": "US20170220921A1-20170803",
  "main_ipcr_label": "G06N300",
  "decision": "PENDING",
  "application_number": "15375629",
  "inventor_list": [
    {
      "inventor_name_last": "Kleinbaum",
      "inventor_name_first": "Daniel J.",
      "inventor_city": "Redwood City",
      "inventor_state": "CA",
      "inventor_country": "US"
    }
  ],
  "abstract": "A method is provided for improving a nucleic acid-based molecular computing system comprised of (i) a nucleic acid structure, (ii) at least one polynucleotide displacement molecule that can bind with the nucleic acid structure under hybridizing conditions, and (iii) a clashing polynucleotide molecule that competes with the polynucleotide displacement molecule for binding the nucleic acid structure under the hybridizing conditions The method entails incorporation of chemical modification that inhibits the binding of the clashing molecule and the nucleic acid structure or facilitates the binding of the displacement molecule and the nucleic structure.",
  "filing_date": "20161212",
  "patent_number": "None",
  "summary": "<SOH> SUMMARY OF THE INVENTION <EOH>In accordance with one aspect of the present invention, a method is provided for improving a nucleic acid-based molecular computing system. The method includes: (A) identifying a computing system comprised of (i) a nucleic acid structure that includes an incompletely base-paired duplex domain, (ii) at least one polynucleotide displacement molecule that can bind with the nucleic acid structure under hybridizing conditions, such that the nucleic acid structure undergoes a transition in energy state due to a branch migration reaction involving the duplex domain, and (iii) a clashing polynucleotide molecule that competes with the polynucleotide displacement molecule for binding the nucleic acid structure under the hybridizing conditions but that cannot produce a branch migration reaction involving the duplex domain; then (B) reconfiguring at least one of the displacement molecule and the nucleic acid structure, respectively, to incorporate a chemical modification relative to a first reference molecule that comprises natural nucleosides and has the same sequence content as the displacement molecule or the nucleic acid structure, as the case may be. The aforementioned the modification causes binding of the displacement molecule and the nucleic acid structure to have a hybridization free energy, differing from that of a first reference binding between the displacement molecule or the nucleic acid structure and the first reference molecule, such that the branch migration reaction is facilitated relative to the first reference binding. After or in place of step (B) is a step (C) of reconfiguring at least one of the clashing molecule and the nucleic acid structure, respectively, to incorporate a chemical modification relative to a second reference molecule that comprises natural nucleosides and has the same sequence content as the clashing molecule or the nucleic acid structure, as the case may be. The modification causes binding of the cla...",
  "date_published": "20170803",
  "title": "SYSTEM AND METHOD FOR PROPAGATING INFORMATION USING MODIFIED NUCLEIC ACIDS",
  "ipcr_labels": [
    "G06N300",
    "G06N312",
    "C12Q168"
  ],
  "_processing_info": {
    "original_size": 59378,
    "optimized_size": 3250,
    "reduction_percent": 94.53
  }
}