{
  "decision": "PENDING",
  "application_number": "15372689",
  "date_published": "20180614",
  "date_produced": "20180530",
  "title": "Enhanced View System",
  "filing_date": "20161208",
  "inventor_list": [
    {
      "inventor_name_last": "Chilukuri",
      "inventor_name_first": "Siva R.",
      "inventor_city": "Scottsdale",
      "inventor_state": "AZ",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Chandrasekaran",
      "inventor_name_first": "HarishKumar",
      "inventor_city": "Phoenix",
      "inventor_state": "AZ",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Chirravuri",
      "inventor_name_first": "Nageshwara R.",
      "inventor_city": "Phoenix",
      "inventor_state": "AZ",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Gopal",
      "inventor_name_first": "Sudhakar",
      "inventor_city": "Scottsdale",
      "inventor_state": "AZ",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Gottipati",
      "inventor_name_first": "Hari K.",
      "inventor_city": "Phoenix",
      "inventor_state": "AZ",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Matthews",
      "inventor_name_first": "Danielle G.",
      "inventor_city": "New York",
      "inventor_state": "NY",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Naik",
      "inventor_name_first": "Harish R.",
      "inventor_city": "Phoenix",
      "inventor_state": "AZ",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Narayan",
      "inventor_name_first": "Kishore R.",
      "inventor_city": "Phoenix",
      "inventor_state": "AZ",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Prakash",
      "inventor_name_first": "Piyashi L.",
      "inventor_city": "Phoenix",
      "inventor_state": "AZ",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Silverman",
      "inventor_name_first": "Andrew E.",
      "inventor_city": "New York",
      "inventor_state": "NY",
      "inventor_country": "US"
    }
  ],
  "ipcr_labels": [
    "G06Q3006",
    "G06Q3002",
    "G06K946"
  ],
  "main_ipcr_label": "G06Q3006",
  "summary": "<SOH> SUMMARY <EOH>A system, method, and article of manufacture (collectively, “the system”) are disclosed relating to an enhanced view system. In various embodiments, the system may be configured to perform operations including receiving, by a processor, an image of a location captured by a web client associated with the consumer; receiving, by the processor, location information associated with the location; detecting, by the processor, a site marker in the image based on the location information, wherein the site marker is associated with a site in the image; associating, by the processor, the site with a portion of the image; obtaining, by the processor, an information box, which is associated with the site; and facilitating, by the processor, a display of the image including the information box on the web client, wherein the information box is disposed over or around the portion of the image associated with the site that is associated with the information box. The information box may comprise an item directed to the consumer. In various embodiments, the item may comprise at least one of a purchase offer, site information, a site rating, a site review, reward information, a site symbol, or a site characteristic associated with the site that is associated with the information box. In various embodiments, the operations may further comprise receiving, by the processor, a selection of the information box from a consumer; and directing, by the processor, the display on the web client to an information page, wherein the information page comprises at least one of site information or a site review associated with site that is associated with the information box. In various embodiments, the operations may further comprise receiving, by the processor, a selection for an item preference from the consumer; and filtering, by the processor, a plurality of items comprised in a plurality of information boxes displayed by the web client, such that a subset of the plurality of i...",
  "patent_number": "None",
  "abstract": "The systems may include receiving an image of a location captured by a web client associated with the consumer; receiving location information associated with the location; detecting a site marker in the image based on the location information, wherein the site marker is associated with a site in the image; associating the site with a portion of the image; obtaining an information box, which is associated with the site; and facilitating a display of the image including the information box on the web client. The information box may be disposed over or around the portion of the image associated with the site that is associated with the information box. The information box may comprise an item directed to the consumer.",
  "publication_number": "US20180165738A1-20180614",
  "_processing_info": {
    "original_size": 130544,
    "optimized_size": 4637,
    "reduction_percent": 96.45
  }
}