{
  "date_produced": "20180608",
  "publication_number": "US20180174019A1-20180621",
  "main_ipcr_label": "G06N300",
  "decision": "PENDING",
  "application_number": "15379701",
  "inventor_list": [
    {
      "inventor_name_last": "Henderson",
      "inventor_name_first": "Charles W.",
      "inventor_city": "Atlanta",
      "inventor_state": "GA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Rosell",
      "inventor_name_first": "Kalani K.",
      "inventor_city": "New Haven",
      "inventor_state": "CT",
      "inventor_country": "US"
    }
  ],
  "abstract": "Technologies are described herein for providing an artificial intelligence analysis service. According to some examples, content received from an Content provider is analyzed to generate guidance instructions. The guidance instructions are transmitted to other Content providers. One or more nodes may provide feedback to the AI analysis service, wherein the feedback may be integrated with the guidance instructions.",
  "filing_date": "20161215",
  "patent_number": "None",
  "summary": "<SOH> SUMMARY <EOH>Technologies are described herein for an artificial intelligence analysis service. Generally described, the artificial intelligence (“AI”) analysis service receives artificial intelligence content from one or more artificial intelligence content sources, analyzes the AI content, and provides input to various entities. In one example, the AI analysis service establishes a learning portal for AI content. The AI analysis service receives AI content from an AI source, receives feedback as to one or more issues with the AI content, and then provides the feedback to one or more second AI sources to train the one or more second AI sources. In some examples, the AI analysis service receives AI content from one or more AI sources, analyzes the content to determine patterns associated with AI content, and then analyzes content provided by one or more second AI sources to identify AI content. As used herein, “artificial intelligence” content is content constructed, written, or otherwise created by an artificial intelligence source. “Artificial intelligence” is broadly defined to be a computing source configured to operate fully or partially autonomously to generate content. It should be appreciated that the above-described subject matter can be implemented as a computer-controlled apparatus, a computer process, a computing system, or as an article of manufacture such as a computer-readable storage medium. These and various other features will be apparent from a reading of the following Detailed Description and a review of the associated drawings. This Summary is provided to introduce a selection of technologies in a simplified form that are further described below in the Detailed Description. This Summary is not intended to identify key features or essential features of the claimed subject matter, nor is it intended that this Summary be used to limit the scope of the claimed subject matter. Furthermore, the claimed subject matter is not limited to implementa...",
  "date_published": "20180621",
  "title": "ARTIFICIAL INTELLIGENCE ANALYSIS SERVICE",
  "ipcr_labels": [
    "G06N300",
    "G06N9900"
  ],
  "_processing_info": {
    "original_size": 49862,
    "optimized_size": 3143,
    "reduction_percent": 93.7
  }
}