{
  "decision": "PENDING",
  "application_number": "15371725",
  "date_published": "20170608",
  "date_produced": "20170524",
  "title": "METHODS, SYSTEMS AND APPARATUS TO IMPROVE BAYESIAN POSTERIOR GENERATION EFFICIENCY",
  "filing_date": "20161207",
  "inventor_list": [
    {
      "inventor_name_last": "Zenor",
      "inventor_name_first": "Michael J.",
      "inventor_city": "Cedar Park",
      "inventor_state": "TX",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Mansour",
      "inventor_name_first": "John",
      "inventor_city": "North Aurora",
      "inventor_state": "IL",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Kriss",
      "inventor_name_first": "Mitchel",
      "inventor_city": "Long Grove",
      "inventor_state": "IL",
      "inventor_country": "US"
    }
  ],
  "ipcr_labels": [
    "G06Q3002"
  ],
  "main_ipcr_label": "G06Q3002",
  "summary": "<SOH> BRIEF DESCRIPTION OF THE DRAWINGS <EOH>FIG. 1 is a schematic illustration of an example Bayesian analysis system constructed in accordance with the teachings of this disclosure to improve Bayesian posterior generation efficiency. FIG. 2 is an example analysis table generated by the example Bayesian analysis system of FIG. 1 to improve Bayesian posterior generation efficiency. FIGS. 3-6 are flowcharts representative of example machine readable instructions that may be executed to implement the example Bayesian analysis system of FIGS. 1 and/or 2 . FIG. 7 is a block diagram of an example processor platform structured to execute the example machine readable instructions of FIGS. 3-6 to implement the example Bayesian analysis system of FIGS. 1 and/or 2 . detailed-description description=\"Detailed Description\" end=\"lead\"?",
  "patent_number": "None",
  "abstract": "Methods, apparatus, systems and articles of manufacture are disclosed to improve Bayesian posterior generation efficiency. An example apparatus to improve posterior calculation efficiency includes a logit model engine to generate a logit model associated with prior data, the logit model engine to assign initial logit coefficient values to products of interest for respective segments of interest, a penalty engine to improve posterior calculation efficiency by generating penalty modifiers, the penalty modifiers to balance modification of the initial logit coefficient values without merging the prior data with store conditions, and an analysis engine to calculate posterior output values of the prior data by evaluating the initial logit coefficient values with the penalty modifiers via a maximum likelihood estimation, the posterior output values indicative of modifications to the initial logit coefficient values caused by empirical store data sales activity.",
  "publication_number": "US20170161756A1-20170608",
  "_processing_info": {
    "original_size": 63403,
    "optimized_size": 2677,
    "reduction_percent": 95.78
  }
}