{
  "decision": "PENDING",
  "application_number": "15372365",
  "date_published": "20180607",
  "date_produced": "20180523",
  "title": "INITIAL ACCESS OF WIRELESS ACCESS NETWORK USING ASSISTANCE INFORMATION",
  "filing_date": "20161207",
  "inventor_list": [
    {
      "inventor_name_last": "Vutukuri",
      "inventor_name_first": "Eswar",
      "inventor_city": "Havant",
      "inventor_state": "",
      "inventor_country": "GB"
    },
    {
      "inventor_name_last": "Barrett",
      "inventor_name_first": "Stephen John",
      "inventor_city": "Haywards Heath",
      "inventor_state": "",
      "inventor_country": "GB"
    },
    {
      "inventor_name_last": "Buckley",
      "inventor_name_first": "Adrian",
      "inventor_city": "Tracy",
      "inventor_state": "CA",
      "inventor_country": "US"
    }
  ],
  "ipcr_labels": [
    "H04W402",
    "H04W4814",
    "H04W822",
    "H04W7204",
    "H04B17318",
    "H04W1206",
    "H04L2908",
    "H04W4816",
    "H04W2410",
    "H04W4818",
    "H04W5202",
    "G06F1730"
  ],
  "main_ipcr_label": "H04W402",
  "summary": "<SOH> BRIEF DESCRIPTION OF THE DRAWINGS <EOH>Some implementations of the present disclosure are described with respect to the following figures. FIG. 1 is a block diagram of an example arrangement that includes an asset tracking device and a remote service, according to some implementations. FIG. 2 is a message flow diagram depicting operations involving an asset tracking device, a wireless access network, and an asset tracking service, according to some implementations. FIG. 3 is a message flow diagram depicting operations involving an asset tracking device, a wireless access network, and an asset tracking service, according to further implementations. FIG. 4 is a message flow diagram depicting operations involving an asset tracking device and an asset tracking service, according to other implementations. FIG. 5 is a block diagram of an example system according to some implementations. detailed-description description=\"Detailed Description\" end=\"lead\"?",
  "patent_number": "None",
  "abstract": "In some examples, a device sends first information to a service, the first information comprising location information of the wireless device, and receives, from the service, assistance information that is based on the first information. The device performs initial access of a wireless access network using the assistance information to achieve power saving at the wireless device, and transmits second information to the service over the wireless access network node.",
  "publication_number": "US20180160271A1-20180607",
  "_processing_info": {
    "original_size": 75692,
    "optimized_size": 2425,
    "reduction_percent": 96.8
  }
}