{
  "date_produced": "20180530",
  "publication_number": "US20180165596A1-20180614",
  "main_ipcr_label": "G06N9900",
  "decision": "PENDING",
  "application_number": "15373352",
  "inventor_list": [
    {
      "inventor_name_last": "ABRAMS",
      "inventor_name_first": "Michael",
      "inventor_city": "Los Angeles",
      "inventor_state": "CA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "HASELTINE",
      "inventor_name_first": "Eric",
      "inventor_city": "Rancho Palos Verdes",
      "inventor_state": "CA",
      "inventor_country": "US"
    }
  ],
  "abstract": "In one embodiment, a character engine models a character that interacts with users. The character engine receives user input data from a user device, and analyzes the user input data to determine a user intent and an assessment domain. Subsequently, the character engine selects inference algorithm(s) that include machine learning capabilities based on the intent and the assessment domain. The character engine computes a response to the user input data based on the selected inference algorithm(s) and a set of personality characteristics that are associated with the character. Finally, the character engine causes the user device to output the response to the user. In this fashion, the character engine includes sensing functionality, thinking and learning functionality, and expressing functionality. By aggregating advanced sensing techniques, inference algorithms, character-specific personality characteristics, and expressing algorithms, the character engine provides a realistic illusion ...",
  "filing_date": "20161208",
  "patent_number": "None",
  "summary": "<SOH> SUMMARY OF THE INVENTION <EOH>One embodiment of the present invention sets forth a computer-implemented method for generating a character response during an interaction with a user. The method includes evaluating user input data that is associated with a user device to determine a user intent and an assessment domain; selecting at least one inference algorithm from multiple inference algorithms based on at least one of the user intent and the assessment domain, where the at least one inference algorithm implements machine learning functionality; computing a character response to the user input data based on the at least one inference algorithm, the user input data, a set of personality characteristics associated with a character, and data representing knowledge associated with the character; and causing the user device to output the character response to the user. One advantage of the disclosed techniques is that the character responses to user inputs provide a convincing illusion that the user is interacting with a “real” character instead of a machine. In particular, unlike conventional question and answer based AI systems, the character response to a question can be another question. Further, by tailoring different character responses to different user devices, the character responses realistically emulate a continuous and consistent relationship that transcends the user devices.",
  "date_published": "20180614",
  "title": "MODELING CHARACTERS THAT INTERACT WITH USERS AS PART OF A CHARACTER-AS-A-SERVICE IMPLEMENTATION",
  "ipcr_labels": [
    "G06N9900",
    "G06N502",
    "G06N504"
  ],
  "_processing_info": {
    "original_size": 76579,
    "optimized_size": 3190,
    "reduction_percent": 95.83
  }
}