{
  "decision": "PENDING",
  "application_number": "15372373",
  "date_published": "20180607",
  "date_produced": "20180523",
  "title": "VISUAL ASSIST METHOD AND VISUAL ASSIST SYSTEM",
  "filing_date": "20161207",
  "inventor_list": [
    {
      "inventor_name_last": "KAN",
      "inventor_name_first": "Chung-Wei",
      "inventor_city": "Taipei City",
      "inventor_state": "",
      "inventor_country": "TW"
    }
  ],
  "ipcr_labels": [
    "G09B2100",
    "G10L1308",
    "G06F1730",
    "G06N9900"
  ],
  "main_ipcr_label": "G09B2100",
  "summary": "<SOH> SUMMARY <EOH>An aspect of the present disclosure is a visual assist method executed by a processor. The visual assist method includes steps as follows. A captured data is received and a determination is made whether the captured data is one of a graph and a video by the processor. A determination is made whether the captured data is similar to one of a plurality of graph data in a database by the processor if the captured data is determined as the graph. A plurality of first text data that describe the graph according to a text data record corresponding to a first graph data stored in the database are generated by the processor if the processor determines that the captured data is similar to the first graph data of the graph data. The first text data are assembled to generate a descriptive text by the processor. The descriptive text comprises at least one of quantity, color, shape and size information of at least one object in the graph. The descriptive text is sent to a portable electronic device by the processor. Another aspect of the present disclosure is a visual assist system. The visual assist system includes a database and a processor. The database is coupled to the processor and configured to store a plurality of text data records and a plurality of graph data. The text data records are corresponding to the graph data. The processor is configured to receive a captured data, determine whether the captured data is one of a graph and a video, determine whether the captured data is similar to one of the graph data if the captured data is determine as the graph, and generate a plurality of first text data that describe the graph according to a text data record corresponding to a first graph data stored in the database if the processor determines that the captured data is similar to the first graph data of the graph data. The processor is configured to assemble the first text data to generate a descriptive text and send the descriptive text to a portable ele...",
  "patent_number": "None",
  "abstract": "A visual assist system includes a database and a processor. The database is coupled to the processor and configured to store text data records and graph data. The text data records are corresponding to the graph data. The processor receives a captured data and determines whether the captured data is one of a graph and a video. If the captured data is determined as the graph, the processor determines whether the captured data is similar to one of the graph data. If the processor determines that the captured data is similar to a first graph data in the graph data, the processor generates a first text data that describes the graph according to a text data record corresponding to the first graph data in the database. The processor assembles the first text data to generate a descriptive text, and sends the descriptive text to a portable electronic device.",
  "publication_number": "US20180158368A1-20180607",
  "_processing_info": {
    "original_size": 35732,
    "optimized_size": 3434,
    "reduction_percent": 90.39
  }
}