{
  "date_produced": "20180530",
  "publication_number": "US20180165600A1-20180614",
  "main_ipcr_label": "G06N9900",
  "decision": "PENDING",
  "application_number": "15378578",
  "inventor_list": [
    {
      "inventor_name_last": "Chakra",
      "inventor_name_first": "Al",
      "inventor_city": "Apex",
      "inventor_state": "NC",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Harpur",
      "inventor_name_first": "Liam",
      "inventor_city": "Dublin",
      "inventor_state": "",
      "inventor_country": "IE"
    },
    {
      "inventor_name_last": "Patel",
      "inventor_name_first": "Sumit",
      "inventor_city": "Irving",
      "inventor_state": "TX",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Sexton",
      "inventor_name_first": "Enda",
      "inventor_city": "Dublin",
      "inventor_state": "",
      "inventor_country": "IE"
    }
  ],
  "abstract": "An automated dynamic message categorization system is provided and includes first, second and third processing units. The first processing unit is configured to generate a user interface (UI) and to present the UI to a user. The second processing unit is configured to pull information from a first textual element which has been entered into the UI, to identify second textual elements that are relevant to the first textual element based on the pulled information and to extract textual element identifiers from the second textual elements. The third processing unit is configured to generate, for each extracted textual element identifier, a confidence score describing a degree of correlation between each extracted textual element identifier and the first textual element. The first processing unit is further configured to present to the user each extracted textual element identifier with a corresponding confidence score as a selectable option via the UI.",
  "filing_date": "20161214",
  "patent_number": "None",
  "summary": "<SOH> SUMMARY <EOH>According to an embodiment of the present invention, an automated dynamic message categorization system is provided and includes first, second and third processing units. The first processing unit is configured to generate a user interface (UI) and to present the UI to a user. The second processing unit is configured to pull information from a first textual element which has been entered into the UI, to identify second textual elements that are relevant to the first textual element based on the pulled information and to extract textual element identifiers from the second textual elements. The third processing unit is configured to generate for each extracted textual element identifier a confidence score describing a degree of correlation between each extracted textual element identifier and the first textual element. The first processing unit is further configured to present to the user each extracted textual element identifier with a corresponding confidence score as a selectable option via the UI. According to another embodiment of the present invention, a method of automated dynamic message categorization is provided and includes presenting a user interface (UI) to a user, pulling information from a first textual element which has been entered into the UI, identifying second textual elements that are relevant to the first textual element based on the pulled information and extracting textual element identifiers from the second textual elements. The method further includes generating for each extracted textual element identifier a confidence score describing a degree of correlation between each extracted textual element identifier and the first textual element and presenting to the user each extracted textual element identifier with a corresponding confidence score as a selectable option via the UI. According to yet another embodiment of the present invention, a computer program product for automated dynamic message categorization is provided. T...",
  "date_published": "20180614",
  "title": "DYNAMIC MESSAGE CATEGORIZATION FOR OPTIMIZED MESSAGE TARGETING",
  "ipcr_labels": [
    "G06N9900",
    "G06N504",
    "G06N700"
  ],
  "_processing_info": {
    "original_size": 45770,
    "optimized_size": 3951,
    "reduction_percent": 91.37
  }
}