{
  "decision": "PENDING",
  "application_number": "15379084",
  "date_published": "20180614",
  "date_produced": "20180530",
  "title": "Target Optimization Method For Improving Lithography Printability",
  "filing_date": "20161214",
  "inventor_list": [
    {
      "inventor_name_last": "Chang",
      "inventor_name_first": "Shih-Ming",
      "inventor_city": "Hsinchu County",
      "inventor_state": "",
      "inventor_country": "TW"
    },
    {
      "inventor_name_last": "Hsieh",
      "inventor_name_first": "Ken-Hsien",
      "inventor_city": "Taipei City",
      "inventor_state": "",
      "inventor_country": "TW"
    },
    {
      "inventor_name_last": "Chou",
      "inventor_name_first": "Shuo-Yen",
      "inventor_city": "Hualien County",
      "inventor_state": "",
      "inventor_country": "TW"
    },
    {
      "inventor_name_last": "Liu",
      "inventor_name_first": "Ru-Gun",
      "inventor_city": "Hsinchu County",
      "inventor_state": "",
      "inventor_country": "TW"
    }
  ],
  "ipcr_labels": [
    "G06F1750"
  ],
  "main_ipcr_label": "G06F1750",
  "summary": "<SOH> BRIEF DESCRIPTION OF THE DRAWINGS <EOH>The present disclosure is best understood from the following detailed description when read with the accompanying figures. It is emphasized that, in accordance with the standard practice in the industry, various features are not drawn to scale and are used for illustration purposes only. In fact, the dimensions of the various features may be arbitrarily increased or reduced for clarity of discussion FIG. 1 is a simplified block diagram of an integrated circuit (IC) manufacturing system, along with an IC manufacturing flow associated with the IC manufacturing system, according to various aspects of the present disclosure. FIG. 2 is a simplified block diagram of an optical lithography system, which can be implemented by the IC manufacturing system of FIG. 1 , according to various aspects of the present disclosure. FIG. 3 is a simplified schematic illustrating an OPC-based computational lithography process, which can be implemented by the IC manufacturing system of FIG. 1 , according to various aspects of the present disclosure. FIG. 4 illustrates different target cut contours that can a target pattern can exhibit to fabricate a same IC feature according to various aspects of the present disclosure. FIG. 5 is a flowchart of computational lithography method, which can be implemented by the IC manufacturing system of FIG. 1 for target optimization, according to various aspects of the present disclosure. FIG. 6A is a simplified schematic diagrammatic view of a target pattern defined by an IC design layout for fabricating an IC feature, such as the IC feature of FIG. 4 , according to various aspects of the present disclosure. FIG. 6B is a simplified schematic diagrammatic view of a constraint layer that can be defined for a target pattern, such as the target pattern depicted in FIG. 6A , according to various aspects of the present disclosure. FIG. 6C is a simplified schematic diagrammatic view of a cost function defined for the ...",
  "patent_number": "None",
  "abstract": "Target optimization methods are disclosed herein for enhancing lithography printability. An exemplary method includes receiving an IC design layout for a target pattern, wherein the target pattern has a corresponding target contour; modifying the target pattern, wherein the modified target pattern has a corresponding modified target contour; and generating an optimized target pattern when the modified target contour achieves functionality of the target pattern as defined by a constraint layer. The method can further include defining a cost function based on the constraint layer, where the cost function correlates a spatial relationship between a contour of the target pattern and the constraint layer.",
  "publication_number": "US20180165397A1-20180614",
  "_processing_info": {
    "original_size": 96744,
    "optimized_size": 3716,
    "reduction_percent": 96.16
  }
}