{
  "date_produced": "20170524",
  "publication_number": "US20170161632A1-20170608",
  "main_ipcr_label": "G06N9900",
  "decision": "PENDING",
  "application_number": "15376539",
  "inventor_list": [
    {
      "inventor_name_last": "Freedman",
      "inventor_name_first": "Michael",
      "inventor_city": "Redmond",
      "inventor_state": "WA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Nayak",
      "inventor_name_first": "Chetan",
      "inventor_city": "Redmond",
      "inventor_state": "WA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Bonderson",
      "inventor_name_first": "Parsa",
      "inventor_city": "Redmond",
      "inventor_state": "WA",
      "inventor_country": "US"
    }
  ],
  "abstract": "Measurement-only topological quantum computation using both projective and interferometrical measurement of topological charge is described. Various issues that would arise when realizing it in fractional quantum Hall systems are discussed.",
  "filing_date": "20161212",
  "patent_number": "None",
  "summary": "<SOH> SUMMARY <EOH>We call the approach to quantum computation based on the measurement of topological charge “measurement-only topological quantum computation” (MOTQC). There are two flavors of MOTQC. The first is to assume that there exists an observable which can be applied to the topological medium which executes precisely von Neumann orthogonal measurements projecting into topological charge sectors. The second, takes a perhaps more pragmatic view and assumes that topological charge will be measured by quasiparticle interferometers. Mathematically, this is known to amount, up to exponentially small corrections, to von Neumann projection to charge sectors together with “severing of charge lines” connecting the inside to the outside of the interferometer. The details of the MOTQC protocols, of course, depend on the topological medium doing the computation. Our background models are certain FQH states and the non-Abelian Chern-Simons field theories which are believed to underlie them. One key example is the ν=5/2 FQH state, which experimentally is found to be the most robust FQH state beyond the lowest Landau level. Here it is expected that the non-Abelian features are captured by the Ising CFT. In this special case we argue that the two types of topological charge measurement agree, because severing charge lines is immaterial, so one simply uses the simpler projective measurement version of MOTQC. In a second prominent example, where the CFT is the 3 -Parafermions, proposed to describe the ν=12/5 plateau, we will see that there are substantial changes to the protocols passing between the two flavors. Our analysis is quite general, but these two examples will be of the greatest current interest. Anyonic state “teleportation” may be achieved using “forced measurement” and it is applied to generate braiding transformations from an adaptive series of (non-demolitional) measurements. Forced measurement is an important primitive for us. It is an adaptive sequence of me...",
  "date_published": "20170608",
  "title": "MEASUREMENT-ONLY TOPOLOGICAL QUANTUM COMPUTATION",
  "ipcr_labels": [
    "G06N9900",
    "G06F1716",
    "G06F1718"
  ],
  "_processing_info": {
    "original_size": 131328,
    "optimized_size": 3145,
    "reduction_percent": 97.61
  }
}