{
  "date_produced": "20170316",
  "publication_number": "US20170091645A1-20170330",
  "main_ipcr_label": "G06N700",
  "decision": "PENDING",
  "application_number": "15379180",
  "inventor_list": [
    {
      "inventor_name_last": "Matus",
      "inventor_name_first": "Jonathan Arie",
      "inventor_city": "San Francisco",
      "inventor_state": "CA",
      "inventor_country": "US"
    }
  ],
  "abstract": "In one embodiment, a method includes sending a request for a measure of affinity associated with a first user for a particular content associated with a second user, where the measure of affinity predicts a level of interest the first user has for the particular content; sending weighting information for computing the measure of affinity, where the weighting information includes information specifying a first weight to be attributed to a first predictor function that is based on the second user and a second weight to be attributed to a second predictor function that is based on concepts associated with the particular content; receiving the measure of affinity; and sending, to the first user, the particular content, based on the received measure of affinity.",
  "filing_date": "20161214",
  "patent_number": "None",
  "summary": "<SOH> BRIEF DESCRIPTION OF THE DRAWINGS <EOH>FIG. 1 illustrates an example network environment. FIG. 2A illustrates an example mobile-computing device. FIG. 2B illustrates the exterior of an example mobile computing device. FIG. 3 illustrates an example software architecture for information and applications on an example mobile-computing device. FIG. 4 illustrates an example wireframe of an example home screen of an example mobile-computing device. FIG. 5 illustrates an example method for computing a measurement of affinity. FIG. 6 illustrates an example computer system. detailed-description description=\"Detailed Description\" end=\"lead\"?",
  "date_published": "20170330",
  "title": "MOBILE DEVICE-RELATED MEASURES OF AFFINITY",
  "ipcr_labels": [
    "G06N700",
    "H04W400",
    "H04L2908"
  ],
  "_processing_info": {
    "original_size": 71651,
    "optimized_size": 1977,
    "reduction_percent": 97.24
  }
}