{
  "date_produced": "20180523",
  "publication_number": "US20180157980A1-20180607",
  "main_ipcr_label": "G06N504",
  "decision": "PENDING",
  "application_number": "15372032",
  "inventor_list": [
    {
      "inventor_name_last": "Kochura",
      "inventor_name_first": "Nadiya",
      "inventor_city": "Bolton",
      "inventor_state": "MA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Lu",
      "inventor_name_first": "Fang",
      "inventor_city": "Billerica",
      "inventor_state": "MA",
      "inventor_country": "US"
    }
  ],
  "abstract": "The system gathers a set of biometric data for a first driver of a vehicle. The system classifies the set of biometric data as belonging in one of a plurality of biometric conditions. The plurality of biometric conditions include at least one normal biometric condition representative of a normal, attentive condition and a first abnormal biometric condition representative of an inattentive condition. The system determines a personal threshold between the normal biometric condition and the first abnormal biometric condition for the first driver for a first biometric parameter. In a driving phase, the system monitors biometric data of the first driver to determine whether the first driver has passed from the normal biometric condition to the first abnormal biometric condition according to the personal threshold. If the first driver has passed to the first abnormal biometric condition, the system presents a dialog personalized for the first user designed to return the first driver to the n...",
  "filing_date": "20161207",
  "patent_number": "None",
  "summary": "<SOH> BRIEF SUMMARY <EOH>According to this disclosure, a method, apparatus and computer program product for personalized driving safety is described. The system gathers a set of biometric data for a first driver of a vehicle. The system classifies the set of biometric data as belonging in one of a plurality of biometric conditions. The plurality of biometric conditions include at least one normal biometric condition representative of a normal, attentive condition and a first abnormal biometric condition representative of an inattentive condition. The system determines a personal threshold between the normal biometric condition and the first abnormal biometric condition for the first driver for a first biometric parameter. In a driving phase, the system monitors biometric data of the first driver to determine whether the first driver has passed from the normal biometric condition to the first abnormal biometric condition according to the personal threshold. If the first driver has passed to the first abnormal biometric condition, the system presents a dialog personalized for the first user designed to return the first driver to the normal biometric condition. The foregoing has outlined some of the more pertinent features of the disclosed subject matter. These features should be construed to be merely illustrative. Many other beneficial results can be attained by applying the disclosed subject matter in a different manner or by modifying the invention as will be described.",
  "date_published": "20180607",
  "title": "COGNITIVE DIALOG SYSTEM FOR DRIVING SAFETY",
  "ipcr_labels": [
    "G06N504",
    "G06N9900",
    "G06N300"
  ],
  "_processing_info": {
    "original_size": 96194,
    "optimized_size": 3188,
    "reduction_percent": 96.69
  }
}