{
  "date_produced": "20170614",
  "publication_number": "US20170185907A1-20170629",
  "main_ipcr_label": "G06N700",
  "decision": "PENDING",
  "application_number": "15372484",
  "inventor_list": [
    {
      "inventor_name_last": "Kudoh",
      "inventor_name_first": "Michiharu",
      "inventor_city": "Kanagawa-ken",
      "inventor_state": "",
      "inventor_country": "JP"
    },
    {
      "inventor_name_last": "Nakamura",
      "inventor_name_first": "Hiroaki",
      "inventor_city": "Kanagawa-ken",
      "inventor_state": "",
      "inventor_country": "JP"
    },
    {
      "inventor_name_last": "Osogami",
      "inventor_name_first": "Takayuki",
      "inventor_city": "Kanagawa-ken",
      "inventor_state": "",
      "inventor_country": "JP"
    }
  ],
  "abstract": "A method is known for identifying a cause and effect relationship between events of equipment by using a Bayesian network, but it has been difficult to comprehensively gather events relating to people. Additionally, there is no known method for estimating the time at which other events occur between two or more events. Provided is an information processing apparatus including a target information obtaining section that obtains known event information relating to at least one known event that has occurred for a target; an information processing apparatus that obtains statistical data relating to events; and an event information generating section that generates unknown event information relating to an unknown event of the target, based on the statistical data and the known event information.",
  "filing_date": "20161208",
  "patent_number": "None",
  "summary": "<SOH> SUMMARY OF THE INVENTION <EOH>According to a first embodiment of the present invention, provided is an information processing apparatus, including a target information obtaining section that obtains known event information relating to at least one known event that has occurred for a target; an information processing apparatus that obtains statistical data relating to events; and an event information generating section that generates unknown event information relating to an unknown event of the target, based on the statistical data and the known event information. According to second embodiment of the present invention, provided is an information processing method performed by a computer, including obtaining known event information relating to at least one known event that has occurred for a target; obtaining statistical data relating to events; and generating unknown event information relating to an unknown event of the target, based on the statistical data and the known event information. According to a third embodiment of the present invention, provided is a program that, when executed by a computer, causes the computer to function as: a target information obtaining section that obtains known event information relating to at least one known event that has occurred for a target; an information processing apparatus that obtains statistical data relating to events; and an event information generating section that generates unknown event information relating to an unknown event of the target, based on the statistical data and the known event information.",
  "date_published": "20170629",
  "title": "METHOD OF PROBABILISTIC INFERENCE USING OPEN STATISTICS",
  "ipcr_labels": [
    "G06N700"
  ],
  "_processing_info": {
    "original_size": 100276,
    "optimized_size": 3231,
    "reduction_percent": 96.78
  }
}