{
  "decision": "PENDING",
  "application_number": "15374659",
  "date_published": "20180111",
  "date_produced": "20171227",
  "title": "USER INTERFACE DEVICE, VEHICLE INCLUDING THE SAME, AND METHOD OF CONTROLLING THE VEHICLE",
  "filing_date": "20161209",
  "inventor_list": [
    {
      "inventor_name_last": "OH",
      "inventor_name_first": "Jongmin",
      "inventor_city": "Suwon-si",
      "inventor_state": "",
      "inventor_country": "KR"
    },
    {
      "inventor_name_last": "WOO",
      "inventor_name_first": "Seunghyun",
      "inventor_city": "Seoul",
      "inventor_state": "",
      "inventor_country": "KR"
    },
    {
      "inventor_name_last": "AN",
      "inventor_name_first": "Daeyun",
      "inventor_city": "Anyang-si",
      "inventor_state": "",
      "inventor_country": "KR"
    }
  ],
  "ipcr_labels": [
    "G06F301",
    "B60H100",
    "B60R100",
    "B60H134",
    "B60K3702"
  ],
  "main_ipcr_label": "G06F301",
  "summary": "<SOH> SUMMARY <EOH>An aspect of the present disclosure provides a user interface device to control output of an output device depending on the degree of shielding an output region of the output device, a vehicle including the same, and a method of controlling the vehicle. Additional aspects of the disclosure will be set forth in part in the description which follows and, in part, will be obvious from the description, or may be learned by practice of the disclosure. In accordance with an exemplary embodiment of the present disclosure, a user interface device includes: an output device having an output region predefined around an output unit; an acquisition unit acquiring information about a user's gesture performed around the output region; and a controller determining an area of a shielded region that is shielded by the gesture in the output region based on the acquired information and controlling an output of the output device. The user's gesture may comprise a gesture of shielding the output region with a user's hand. The output region may be defined in the same shape as that of the output device. The controller may determine a ratio of a shielded region to the output region and controls the output of the output device based on the determined ratio. The controller may control the output of the output device to decrease as the ratio of the shielded region to the output region increases. The controller may determine a movement direction of the gesture based on the acquired information about the gesture, and control an output direction of the output device based on information about the movement direction of the gesture. Upon determination that a size of the user's hand is less than that of the output region based on the acquired information, the controller may determine a ratio of a region of the hand shielding the output region to the entire region of the hand and controls the output of the output device based on the determined ratio. The output device may comprise...",
  "patent_number": "None",
  "abstract": "A user interface device includes: an output device having an output region predefined around an output unit; an acquisition unit acquiring information about a user's gesture performed around the output region; and a controller determining an area of a shielded region which is shielded by the user's gesture in the output region based on the acquired information and controlling output of the output device.",
  "publication_number": "US20180011542A1-20180111",
  "_processing_info": {
    "original_size": 64651,
    "optimized_size": 3305,
    "reduction_percent": 94.89
  }
}