{
  "date_produced": "20180523",
  "publication_number": "US20180157981A1-20180607",
  "main_ipcr_label": "G06N504",
  "decision": "PENDING",
  "application_number": "15372262",
  "inventor_list": [
    {
      "inventor_name_last": "Albertson",
      "inventor_name_first": "David",
      "inventor_city": "Bellevue",
      "inventor_state": "WA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Jenkins",
      "inventor_name_first": "Guillaume",
      "inventor_city": "Redmond",
      "inventor_state": "WA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Rochers-Jetté",
      "inventor_name_first": "Samuel Des",
      "inventor_city": "Redmond",
      "inventor_state": "WA",
      "inventor_country": "US"
    }
  ],
  "abstract": "Examples are disclosed that relate to recommending resources accessible via an online ecosystem. One example provides a computing system including a logic machine and a storage machine holding instructions executable by the logic machine to, for each of a plurality of users of an online ecosystem, obtain and store interaction data regarding interactions of the user with one or more digital content items accessible via the online ecosystem, and receive a request associated with a selected user for a recommendation related to resources accessible via the online ecosystem. The instructions may be further executable to retrieve, for at least a subset of users of the plurality of users, the interaction data, apply a weighted matching algorithm to determine one or more similar users that are similar to the selected user, and output a recommendation for the selected user of one or more recommended resources accessible via the online ecosystem.",
  "filing_date": "20161207",
  "patent_number": "None",
  "summary": "<SOH> SUMMARY <EOH>Examples are disclosed that relate to recommending resources accessible via an online ecosystem based upon ecosystem activities. One example provides a computing system comprising a logic machine and a storage machine holding instructions executable by the logic machine to, for each of a plurality of users of an online ecosystem, obtain and store interaction data regarding interactions of the user with one or more digital content items accessible via the online ecosystem. The instructions are further executable to receive a request associated with a selected user for a recommendation related to resources accessible via the online ecosystem, retrieve the interaction data for at least a subset of users of the plurality of users, apply a weighted matching algorithm to determine one or more similar users that are similar to the selected user, and output a recommendation for the selected user of one or more recommended resources accessible via the online ecosystem. This Summary is provided to introduce a selection of concepts in a simplified form that are further described below in the Detailed Description. This Summary is not intended to identify key features or essential features of the claimed subject matter, nor is it intended to be used to limit the scope of the claimed subject matter. Furthermore, the claimed subject matter is not limited to implementations that solve any or all disadvantages noted in any part of this disclosure.",
  "date_published": "20180607",
  "title": "ONLINE ECOSYSTEM-BASED RESOURCE RECOMMENDATIONS",
  "ipcr_labels": [
    "G06N504",
    "H04L2906",
    "H04L2908",
    "A63F13795"
  ],
  "_processing_info": {
    "original_size": 66705,
    "optimized_size": 3304,
    "reduction_percent": 95.05
  }
}