{
  "date_produced": "20180530",
  "publication_number": "US20180165598A1-20180614",
  "main_ipcr_label": "G06N9900",
  "decision": "PENDING",
  "application_number": "15374120",
  "inventor_list": [
    {
      "inventor_name_last": "Saxena",
      "inventor_name_first": "Manoj",
      "inventor_city": "Austin",
      "inventor_state": "TX",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Sanchez",
      "inventor_name_first": "Matthew",
      "inventor_city": "Austin",
      "inventor_state": "TX",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Knuszka",
      "inventor_name_first": "Richard",
      "inventor_city": "Hampshire",
      "inventor_state": "",
      "inventor_country": "GB"
    }
  ],
  "abstract": "A method, system and computer-usable medium for providing cognitive insights comprising receiving data from a plurality of data sources, at least some of the plurality of data sources comprising financial related data sources and blockchain data sources; processing the data from the plurality of data sources to provide a financial-related, blockchain-associated cognitive insight; and, providing the financial-related, blockchain-associated cognitive insight to a destination.",
  "filing_date": "20161209",
  "patent_number": "None",
  "summary": "<SOH> SUMMARY OF THE INVENTION <EOH>In one embodiment, the invention relates to a method for providing financial-related, blockchain-associated cognitive insights comprising: receiving data from a plurality of data sources, at least some of the plurality of data sources comprising financial related data sources and blockchain data sources; processing the data from the plurality of data sources to provide a financial-related, blockchain-associated cognitive insight; and, providing the financial-related, blockchain-associated cognitive insight to a destination.",
  "date_published": "20180614",
  "title": "Method for Providing Financial-Related, Blockchain-Associated Cognitive Insights Using Blockchains",
  "ipcr_labels": [
    "G06N9900",
    "G06N504",
    "G06Q4006"
  ],
  "_processing_info": {
    "original_size": 266596,
    "optimized_size": 1941,
    "reduction_percent": 99.27
  }
}