{
  "date_produced": "20170603",
  "publication_number": "US20170169332A1-20170615",
  "main_ipcr_label": "G06N308",
  "decision": "PENDING",
  "application_number": "15374974",
  "inventor_list": [
    {
      "inventor_name_last": "Graves",
      "inventor_name_first": "Alexander Benjamin",
      "inventor_city": "London",
      "inventor_state": "",
      "inventor_country": "GB"
    },
    {
      "inventor_name_last": "Danihelka",
      "inventor_name_first": "Ivo",
      "inventor_city": "London",
      "inventor_state": "",
      "inventor_country": "GB"
    },
    {
      "inventor_name_last": "Harley",
      "inventor_name_first": "Timothy James Alexander",
      "inventor_city": "London",
      "inventor_state": "",
      "inventor_country": "GB"
    },
    {
      "inventor_name_last": "Reynolds",
      "inventor_name_first": "Malcolm Kevin Campbell",
      "inventor_city": "London",
      "inventor_state": "",
      "inventor_country": "GB"
    },
    {
      "inventor_name_last": "Wayne",
      "inventor_name_first": "Gregory Duncan",
      "inventor_city": "London",
      "inventor_state": "",
      "inventor_country": "GB"
    }
  ],
  "abstract": "Methods, systems, and apparatus, including computer programs encoded on computer storage media, for augmenting neural networks with an external memory. One of the systems includes a memory interface subsystem that is configured to perform operations comprising determining a respective content-based weight for each of a plurality of locations in an external memory; determining a respective allocation weight for each of the plurality of locations in the external memory; determining a respective final writing weight for each of the plurality of locations in the external memory from the respective content-based weight for the location and the respective allocation weight for the location; and writing data defined by the write vector to the external memory in accordance with the final writing weights.",
  "filing_date": "20161209",
  "patent_number": "None",
  "summary": "<SOH> SUMMARY <EOH>This specification describes technologies that relate to augmented neural network systems. In general, an augmented neural network system includes a neural network configured to receive a neural network input and generate a neural network output, an external memory, i.e., a memory that is external to the neural network, that stores values derived from portions of the neural network output, and a memory interface subsystem that is configured to receive portions of the neural network output and erase, write, and read from the external memory using the received portions. For a system of one or more computers to be configured to perform particular operations or actions means that the system has installed on it software, firmware, hardware, or a combination of them that in operation cause the system to perform the operations or actions. For one or more computer programs to be configured to perform particular operations or actions means that the one or more programs include instructions that, when executed by data processing apparatus, cause the apparatus to perform the operations or actions. The subject matter described in this specification can be implemented in particular embodiments so as to realize one or more of the following advantages. By augmenting a neural network with an external memory, i.e., a memory that is external to the neural network, the augmented neural network can more accurately generate outputs from received inputs for a variety of machine learning tasks. In particular, in order to facilitate processing of a given input from a sequence of inputs, the augmented neural network can effectively use information generated by the augmented neural network during processing of many preceding inputs in the sequence by reading from the external memory. Similarly, in order to facilitate processing of subsequent inputs from the sequence, the augmented neural network can store information generated during processing of the current input in the ...",
  "date_published": "20170615",
  "title": "AUGMENTING NEURAL NETWORKS WITH EXTERNAL MEMORY",
  "ipcr_labels": [
    "G06N308",
    "G06N304"
  ],
  "_processing_info": {
    "original_size": 72581,
    "optimized_size": 3971,
    "reduction_percent": 94.53
  }
}