{
  "date_produced": "20180530",
  "publication_number": "US20180165583A1-20180614",
  "main_ipcr_label": "G06N504",
  "decision": "PENDING",
  "application_number": "15378361",
  "inventor_list": [
    {
      "inventor_name_last": "Guiver",
      "inventor_name_first": "John P.",
      "inventor_city": "Saffron Walden",
      "inventor_state": "",
      "inventor_country": "GB"
    },
    {
      "inventor_name_last": "Winn",
      "inventor_name_first": "John M",
      "inventor_city": "Cambridge",
      "inventor_state": "",
      "inventor_country": "GB"
    },
    {
      "inventor_name_last": "Blohm",
      "inventor_name_first": "Sebastian",
      "inventor_city": "Cambridge",
      "inventor_state": "",
      "inventor_country": "GB"
    }
  ],
  "abstract": "Time-stamped activity data, indicative of detected user activity, is received. A generative model explicitly models the rates of certain actions during certain activities and infers values based on observed data corresponding to those activities. A control system generates control signals, based on the inferred values, to control one or more different controlled systems or subsystems.",
  "filing_date": "20161214",
  "patent_number": "None",
  "summary": "<SOH> SUMMARY <EOH>Time-stamped activity data, indicative of detected user activity, is received. A generative model explicitly models the rates of certain actions during certain activities and infers values based on observed data corresponding to those activities. A control system generates control signals, based on the inferred values, to control one or more different controlled systems or subsystems. This Summary is provided to introduce a selection of concepts in a simplified form that are further described below in the Detailed Description. This Summary is not intended to identify key features or essential features of the claimed subject matter, nor is it intended to be used as an aid in determining the scope of the claimed subject matter. The claimed subject matter is not limited to implementations that solve any or all disadvantages noted in the background.",
  "date_published": "20180614",
  "title": "CONTROLLING SYSTEMS BASED ON VALUES INFERRED BY A GENERATIVE MODEL",
  "ipcr_labels": [
    "G06N504",
    "G06N700"
  ],
  "_processing_info": {
    "original_size": 72917,
    "optimized_size": 2120,
    "reduction_percent": 97.09
  }
}