{
  "decision": "ACCEPTED",
  "application_number": "15377472",
  "date_published": "20170330",
  "date_produced": "20170316",
  "title": "GUIDE PATTERN DATA CORRECTING METHOD, PATTERN FORMING METHOD, AND COMPUTER READABLE RECORD MEDIUM",
  "filing_date": "20161213",
  "inventor_list": [
    {
      "inventor_name_last": "YONEMITSU",
      "inventor_name_first": "Hiroki",
      "inventor_city": "Kawasaki-shi",
      "inventor_state": "",
      "inventor_country": "JP"
    }
  ],
  "ipcr_labels": [
    "G06F1750",
    "G03F740"
  ],
  "main_ipcr_label": "G06F1750",
  "summary": "<SOH> BRIEF DESCRIPTION OF THE DRAWINGS <EOH>FIGS. 1A to 1D are views each illustrating an example of a self-assembly pattern; FIGS. 2A to 2C are views each illustrating an example of the self-assembly pattern; FIG. 3 is a block diagram of a guide pattern data correcting device according to a first embodiment; FIG. 4 is a flowchart explaining a pattern forming method of the first embodiment; FIG. 5 is a view illustrating design data; FIG. 6 is a view illustrating a guide pattern; FIG. 7 is a view illustrating a correction guide pattern according to the first embodiment; FIG. 8 is a view illustrating a self-assembly pattern according to the first embodiment; FIG. 9 is a view illustrating design data; FIG. 10 is a view illustrating a guide pattern; FIG. 11 is a view illustrating a collecting guide pattern according to a second embodiment; FIG. 12 is a view illustrating a self-assembly pattern according to the second embodiment; FIG. 13 is a view illustrating design data; FIG. 14 is a view illustrating a guide pattern; FIG. 15 is a view illustrating a correction guide pattern according to a third embodiment; FIG. 16 is a view illustrating a self-assembly pattern according to the third embodiment; FIG. 17 is a view illustrating processing of a foundation layer according to the third embodiment; and FIG. 18 is a view illustrating a correction guide pattern according to a modified example. detailed-description description=\"Detailed Description\" end=\"lead\"?",
  "patent_number": "10019547",
  "abstract": "According to one embodiment, a guide pattern data correcting method is for correcting guide pattern data of a physical guide for formation of a polymer material to be microphase-separated. The physical guide has a plurality of concave portions in the guide pattern data, and at least two concave portions out of the plurality of concave portions are connected to each other. The guide pattern data is subjected to correction by shifting or rotation of at least either of the two connected concave portions.",
  "publication_number": "US20170091369A1-20170330",
  "_processing_info": {
    "original_size": 41730,
    "optimized_size": 2589,
    "reduction_percent": 93.8
  }
}