{
  "decision": "PENDING",
  "application_number": "15376664",
  "date_published": "20171019",
  "date_produced": "20171004",
  "title": "SYSTEM FOR PROVIDING ADVERTISEMENT, METHOD FOR PROVIDING ADVERTISEMENT USING BEACON BASED ON MOVEMENT OF USER AND APPARATUS USING THE SAME",
  "filing_date": "20161213",
  "inventor_list": [
    {
      "inventor_name_last": "MOON",
      "inventor_name_first": "Seung-Hoon",
      "inventor_city": "Seoul",
      "inventor_state": "",
      "inventor_country": "KR"
    }
  ],
  "ipcr_labels": [
    "G06Q3002",
    "G06Q3002"
  ],
  "main_ipcr_label": "G06Q3002",
  "summary": "<SOH> SUMMARY OF THE INVENTION <EOH>An object of the present invention is to provide an advertisement based on an expanded area using not only a beacon installed in a specific membership store for an advertisement but also beacons installed in multiple affiliate stores that have joined as members. Another object of the present invention is to make respective beacons installed in multiple affiliate stores provide only advertisements that satisfy preset conditions, whereby a large number of unwanted advertisements is prevented from being provided. A further object of the present invention is to provide an advertisement selected by the owner of a membership store, whereby an advertising effect for the corresponding membership store may be optimized. Yet another object of the present invention is to provide an advertisement in consideration of the characteristics of each store and the movement of target users of the store, whereby a context-based advertisement service may be provided. In order to accomplish the above objects, an advertisement provision server according to the present invention includes a beacon search unit for searching for multiple neighboring beacons located around a reference beacon installed in a membership store based on a location of the reference beacon; a target route acquisition unit for acquiring a target route corresponding to the membership store; an expanded range-based advertisement determination unit for determining whether an expanded range-based advertisement using a target beacon corresponding to the target route is capable of being provided; and an advertisement provision unit for providing an advertisement for the membership store using the target beacon when it is determined that the expanded range-based advertisement is capable of being provided. Here, the advertisement provision server may further include a beacon recommendation unit for selecting at least some of the multiple neighboring beacons as beacons to be recommended in co...",
  "patent_number": "None",
  "abstract": "Disclosed are an advertisement provision system, a method for providing an advertisement using a beacon based on the movement of users, and an apparatus using the same. In the method, multiple neighboring beacons located around a reference beacon installed in a membership store are searched for based on the location of the reference beacon, a target route corresponding to the membership store is acquired, whether an expanded range-based advertisement can be provided using a target beacon corresponding to the target route is checked, and an advertisement for the membership store may be provided when it is determined that the expanded range-based advertisement can be provided using the target beacon. Therefore, the advertisement based on an expanded area may be provided using not only a beacon installed in a specific membership store for advertisement but also beacons installed in other affiliate stores that have joined as members.",
  "publication_number": "US20170300972A1-20171019",
  "_processing_info": {
    "original_size": 91833,
    "optimized_size": 3580,
    "reduction_percent": 96.1
  }
}