{
  "decision": "REJECTED",
  "application_number": "15377864",
  "date_published": "20171102",
  "date_produced": "20171018",
  "title": "SYSTEMS AND METHODS FOR REVASCULARIZATION ASSESSMENT",
  "filing_date": "20161213",
  "inventor_list": [
    {
      "inventor_name_last": "Lee",
      "inventor_name_first": "Kijoon",
      "inventor_city": "Singapore",
      "inventor_state": "",
      "inventor_country": "SG"
    },
    {
      "inventor_name_last": "Bi",
      "inventor_name_first": "Renzhe",
      "inventor_city": "Singapore",
      "inventor_state": "",
      "inventor_country": "SG"
    },
    {
      "inventor_name_last": "Dong",
      "inventor_name_first": "Jing",
      "inventor_city": "Singapore",
      "inventor_state": "",
      "inventor_country": "SG"
    },
    {
      "inventor_name_last": "Dauwels",
      "inventor_name_first": "Justin",
      "inventor_city": "Singapore",
      "inventor_state": "",
      "inventor_country": "SG"
    }
  ],
  "ipcr_labels": [
    "A61B5026",
    "A61B500",
    "A61B502",
    "A61B500",
    "A61B500",
    "A61B500",
    "A61B500",
    "A61B500",
    "A61B500",
    "A61B50265",
    "G06F1900",
    "G06F1900",
    "A61B500"
  ],
  "main_ipcr_label": "A61B5026",
  "summary": "<SOH> SUMMARY <EOH>Disclosed herein is a system for assessment of peripheral blood flow during peripheral vascular intervention, the system including: a support structure configured to be positioned onto a patient's foot; a diffuse optical flow (DOF) sensor carried by the support structure; an analyzer configured to analyze data from the DOF sensor to determine absolute and/or relative blood flow at a location near the DOF sensor when the support structure is positioned onto a patient's foot; and a feedback device configured to provide a signal indicative of the absolute and/or relative blood flow determined by the analyzer. In some embodiments, the support structure can include a retention ring and an adhesive material, or simply an adhesive material. In some embodiments, the support structure can include a strap having the DOF sensor attached thereto. In some embodiments, the DOF sensors can be arranged such that when the support structure is positioned onto the patient's foot, at least two of the DOF sensors are over different topographical locations in the foot including different pedal angiosomes. In some embodiments, the DOF sensors can be arranged such that when the support structure is positioned onto the patient's foot, at least five of the DOF sensors are over different topographical locations in the foot including different pedal angiosomes. In some embodiments, the analyzer can include a software autocorrelator. In some embodiments, the analyzer can include a hardware autocorrelator. In some embodiments, the signal indicative of the absolute and/or relative blood flow can be visual, audible, or tactile. In some embodiments, the system can be configured to provide the signal indicative of the absolute and/or relative blood flow in substantially real-time. In some embodiments, the system can be configured to provide the signal indicative of the absolute and/or relative blood flow within 1 second from measurement. Also disclosed herein is a method for real-...",
  "patent_number": "None",
  "abstract": "Disclosed herein are systems and methods for revascularization assessment. The methods can in some cases include one or more of the steps of measuring blood perfusion as a function of time to obtain time series data, mathematically transforming the time series data into a power spectrum, calculating at least one parameter of the power spectrum within a specific frequency range, and using the at least one calculated parameter as a discriminator for the first population and the second population.",
  "publication_number": "US20170311819A1-20171102",
  "_processing_info": {
    "original_size": 168155,
    "optimized_size": 3602,
    "reduction_percent": 97.86
  }
}