{
  "date_produced": "20170316",
  "publication_number": "US20170091650A1-20170330",
  "main_ipcr_label": "G06N9900",
  "decision": "ACCEPTED",
  "application_number": "15373910",
  "inventor_list": [
    {
      "inventor_name_last": "King",
      "inventor_name_first": "Andrew Douglas",
      "inventor_city": "Vancouver",
      "inventor_state": "",
      "inventor_country": "CA"
    }
  ],
  "abstract": "Quantum processor architectures employ unit cells tiled over an area. A unit cell may include first and second sets of qubits where each qubit in the first set crosses at least one qubit in the second set. Angular deviations between qubits in one set may allow qubits in the same set to cross one another. Each unit cell is positioned proximally adjacent at least one other unit cell. Communicatively coupling between qubits is realized through respective intra-cell and inter-cell coupling devices.",
  "filing_date": "20161209",
  "patent_number": "9875444",
  "summary": "<SOH> BRIEF SUMMARY <EOH>The fixed architecture described in U.S. Pat. No. 8,421,053 is strongly coupled to qubits within each unit cell. However, the architecture offers limited interaction between unit cells. Therefore, it may very well be able to solve a certain set of problems while some other problems may benefit from altering the architecture of the qubits laid out on the quantum processor such that different qubit interconnections may be realized between adjacent unit cells of qubits. There is a growing need for new quantum processor architectures to better embed certain problem instances that may otherwise be difficult to solve using the existing architecture. A quantum processor may be summarized as including a plurality of unit cells tiled over an area such that each unit cell may be positioned adjacent at least one other unit cell, each unit cell comprising: a first set of qubits and a second set of qubits, wherein each qubit in the first set of qubits may cross at least one qubit in the second set of qubits and at least one qubit in the first set of qubits may cross at least one qubit in the same set of qubits; and a first set of intra-cell coupling devices, wherein each coupling device in the first set of intra-cell coupling devices may be positioned proximate a respective point where a qubit in the first set of qubits may cross a qubit in the second set of qubits and provides controllable communicative coupling between the qubit in the first set of qubits and the qubit in the second set of qubits; a second set of intra-cell coupling devices, wherein each coupling device in the second set of intra-cell coupling devices may be positioned proximate a respective point for each at least one qubit in the first set of qubits may cross the at least one qubit in the same set of qubits and provides controllable communicative coupling between the at least one qubit in the first set of qubits and the at least one qubit in the same set of qubits; and the quantum pr...",
  "date_published": "20170330",
  "title": "SYSTEMS AND DEVICES FOR QUANTUM PROCESSOR ARCHITECTURES",
  "ipcr_labels": [
    "G06N9900",
    "G06F1576"
  ],
  "_processing_info": {
    "original_size": 117764,
    "optimized_size": 3065,
    "reduction_percent": 97.4
  }
}