{
  "date_produced": "20180530",
  "publication_number": "US20180165580A1-20180614",
  "main_ipcr_label": "G06N502",
  "decision": "PENDING",
  "application_number": "15372476",
  "inventor_list": [
    {
      "inventor_name_last": "Boyer",
      "inventor_name_first": "John M.",
      "inventor_city": "Victoria",
      "inventor_state": "",
      "inventor_country": "CA"
    },
    {
      "inventor_name_last": "Kyle",
      "inventor_name_first": "Bryan J.",
      "inventor_city": "Victoria",
      "inventor_state": "",
      "inventor_country": "CA"
    }
  ],
  "abstract": "Mechanisms are provided for performing watched question processing. The mechanisms detect a change in content of electronic documents in a corpus of electronic documents, and retrieve a watched question from a watched question database. The mechanisms determine whether full processing of the watched question through the question answering pipeline is to be bypassed when performing watched question processing in response to the detected change in content of the electronic documents in the corpus. The mechanisms bypass one or more stages of processing of the question answering pipeline in response to determining that full processing of the watched question through the question answering pipeline is to be bypassed. The mechanisms return a result of the watched question processing indicating that no changes to the previously generated answers are caused by the change in the content of the electronic documents in the corpus.",
  "filing_date": "20161208",
  "patent_number": "None",
  "summary": "<SOH> SUMMARY <EOH>This Summary is provided to introduce a selection of concepts in a simplified form that are further described herein in the Detailed Description. This Summary is not intended to identify key factors or essential features of the claimed subject matter, nor is it intended to be used to limit the scope of the claimed subject matter. In one illustrative embodiment, a method is provided, in a data processing system comprising a processor and a memory, the memory comprising instructions which are executed by the processor to cause the processor to implement the method. The method comprises detecting, by the data processing system, a change in content of electronic documents in a corpus of electronic documents, and retrieving, by the data processing system, a watched question from a watched question database. The watched question is a question previously processed by a question answering pipeline of the data processing system and for which monitoring is performed to identify changes to previously generated answers for the watched question. The method also comprises determining, by the data processing system, whether full processing of the watched question through the question answering pipeline is to be bypassed when performing watched question processing in response to the detected change in content of the electronic documents in the corpus. In addition, the method comprises bypassing, by the data processing system, one or more stages of processing of the question answering pipeline in response to determining that full processing of the watched question through the question answering pipeline is to be bypassed. Moreover, the method comprises returning, by the data processing system, a result of the watched question processing indicating that no changes to the previously generated answers are caused by the change in the content of the electronic documents in the corpus. In other illustrative embodiments, a computer program product comprising a computer u...",
  "date_published": "20180614",
  "title": "Performance of Time Intensive Question Processing in a Cognitive System",
  "ipcr_labels": [
    "G06N502",
    "G06N702"
  ],
  "_processing_info": {
    "original_size": 141087,
    "optimized_size": 3645,
    "reduction_percent": 97.42
  }
}