{
  "decision": "PENDING",
  "application_number": "15378338",
  "date_published": "20180614",
  "date_produced": "20180530",
  "title": "METHOD AND SYSTEM FOR REAL TIME MANAGEMENT OF TRANSPORTATION SERVICES",
  "filing_date": "20161214",
  "inventor_list": [
    {
      "inventor_name_last": "Edakunni",
      "inventor_name_first": "Narayanan Unny",
      "inventor_city": "Bangalore",
      "inventor_state": "",
      "inventor_country": "IN"
    },
    {
      "inventor_name_last": "Solanki",
      "inventor_name_first": "Bhupendra Singh",
      "inventor_city": "Indore",
      "inventor_state": "",
      "inventor_country": "IN"
    },
    {
      "inventor_name_last": "Tulabandhula",
      "inventor_name_first": "Theja",
      "inventor_city": "Bangalore",
      "inventor_state": "",
      "inventor_country": "IN"
    },
    {
      "inventor_name_last": "Bhattacharya",
      "inventor_name_first": "Tuhin",
      "inventor_city": "Panihati",
      "inventor_state": "",
      "inventor_country": "IN"
    }
  ],
  "ipcr_labels": [
    "G06Q5030",
    "H04L2908",
    "H04W402",
    "G06Q3002",
    "G06Q1006",
    "B60N200"
  ],
  "main_ipcr_label": "G06Q5030",
  "summary": "<SOH> SUMMARY <EOH>According to embodiments illustrated herein, there is provided a method for data processing, by a computing device, to manage transportation services in real time. The method includes determining, by one or more processors in the computing device, a discrete control process with respect to a plurality of states of a vehicle received from a plurality of sensors. Each state in the plurality of states corresponds to a station and a count of vacant seats in the vehicle at the station. Further, the vehicle is in transit along a route comprising a plurality of stations that includes the station. The method further includes generating, by the one or more processors, a set of rules to maximize a key performance parameter of the vehicle, based on the determined discrete control process and demand distribution information received from a data acquisition device over a communication network. The method further includes determining, by the one or more processors, a valuation parameter from a plurality of valuation parameters, in real time, for one or more vacant seats in the vehicle at each of one or more subsequent stations in the plurality of stations based on the generated set of rules. The method further includes transmitting, by one or more transceivers, the determined valuation parameter for the one or more vacant seats corresponding to each of the one or more subsequent stations to a plurality of mobile computing devices, over the communication network, associated with a plurality of commuters waiting for the vehicle at the corresponding one or more subsequent stations. According to embodiments illustrated herein, there is provided a system for data processing, by a computing device, to manage transportation services in real time. The system includes one or more processors in the computing device configured to determine a discrete control process with respect to a plurality of states of a vehicle received from a plurality of sensors. Each state in the ...",
  "patent_number": "None",
  "abstract": "The disclosed embodiments illustrate a method for real time management of transportation services. The method includes determining a discrete control process with respect to a plurality of states of a vehicle. Each state in the plurality of states corresponds to a station and a count of vacant seats in the vehicle at the station. A set of rules is generated to maximize a key performance parameter of the vehicle, based on at least the determined discrete control process. A valuation parameter is determined, in real time, for one or more vacant seats in the vehicle at each of one or more subsequent stations based on the generated set of rules. The determined valuation parameter for the one or more vacant seats corresponding to each of the one or more subsequent stations is transmitted to a plurality of mobile computing devices associated with a plurality of commuters.",
  "publication_number": "US20180165783A1-20180614",
  "_processing_info": {
    "original_size": 122705,
    "optimized_size": 3955,
    "reduction_percent": 96.78
  }
}