{
  "date_produced": "20180530",
  "publication_number": "US20180165579A1-20180614",
  "main_ipcr_label": "G06N308",
  "decision": "PENDING",
  "application_number": "15374599",
  "inventor_list": [
    {
      "inventor_name_last": "Friel",
      "inventor_name_first": "Joseph T.",
      "inventor_city": "Ardmore",
      "inventor_state": "PA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Surcouf",
      "inventor_name_first": "Andre",
      "inventor_city": "Saint-Leu-la-Foret",
      "inventor_state": "",
      "inventor_country": "FR"
    },
    {
      "inventor_name_last": "Latapie",
      "inventor_name_first": "Hugo Mike",
      "inventor_city": "Long Beach",
      "inventor_state": "CA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Fenoglio",
      "inventor_name_first": "Enzo",
      "inventor_city": "Issy-les-Moulineaux",
      "inventor_state": "",
      "inventor_country": "FR"
    },
    {
      "inventor_name_last": "Thubert",
      "inventor_name_first": "Pascal",
      "inventor_city": "La-Colle-sur-Loup",
      "inventor_state": "",
      "inventor_country": "FR"
    }
  ],
  "abstract": "In one embodiment, a method includes training a deep neural network using a first set of network characteristics corresponding to a first time and a second set of network characteristics corresponding to a second time, generating, using the deep neural network, a predictive set of network characteristics corresponding to a future time, and assigning a task of a distributed application to a processing unit based on the predictive set of network characteristics.",
  "filing_date": "20161209",
  "patent_number": "None",
  "summary": "<SOH> BRIEF DESCRIPTION OF THE DRAWINGS <EOH>So that the present disclosure can be understood by those of ordinary skill in the art, a more detailed description may be had by reference to aspects of some illustrative implementations, some of which are shown in the accompanying drawings. FIG. 1 is a functional block diagram of distributed application system in accordance with some implementations. FIG. 2 illustrates a functional block diagram of a predictive monitoring system in accordance with some implementations. FIG. 3 is a functional block diagram of a scheduling system in accordance with some implementations. FIG. 4 is a flowchart representation of a method of executing a distributed application in accordance with some implementations. FIG. 5 is a block diagram of a computing device in accordance with some implementations. detailed-description description=\"Detailed Description\" end=\"lead\"? In accordance with common practice, various features shown in the drawings may not be drawn to scale, as the dimensions of various features may be arbitrarily expanded or reduced for clarity. Moreover, the drawings may not depict all of the aspects and/or variants of a given system, method or apparatus admitted by the specification. Finally, like reference numerals are used to denote like features throughout the figures.",
  "date_published": "20180614",
  "title": "Deep Learning Application Distribution",
  "ipcr_labels": [
    "G06N308",
    "G06N304"
  ],
  "_processing_info": {
    "original_size": 39834,
    "optimized_size": 2950,
    "reduction_percent": 92.59
  }
}