{
  "date_produced": "20180404",
  "publication_number": "US20180107919A1-20180419",
  "main_ipcr_label": "G06N304",
  "decision": "PENDING",
  "application_number": "15370542",
  "inventor_list": [
    {
      "inventor_name_last": "Paul",
      "inventor_name_first": "Somnath",
      "inventor_city": "Hillsboro",
      "inventor_state": "OR",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Augustine",
      "inventor_name_first": "Charles",
      "inventor_city": "Portland",
      "inventor_state": "OR",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Khellah",
      "inventor_name_first": "Muhammad M.",
      "inventor_city": "Tigard",
      "inventor_state": "OR",
      "inventor_country": "US"
    }
  ],
  "abstract": "Systems, apparatuses and methods may provide a hybrid compression scheme to store synaptic weights in neuromorphic cores. The hybrid compression scheme utilizes a run-length encoding (RLE) compression approach, a dictionary-based encode compression scheme, and a compressionless encoding scheme to store the weights for valid synaptic connections in a synaptic weight memory.",
  "filing_date": "20161206",
  "patent_number": "None",
  "summary": "<SOH> BRIEF DESCRIPTION OF THE DRAWINGS <EOH>The various advantages of the embodiments of the present invention will become apparent to one skilled in the art by reading the following specification and appended claims, and by referencing the following drawings, in which: FIG. 1 is an illustration of a neuromorphic core according to an embodiment; FIG. 2 is an illustration of a compression scheme according to an embodiment; FIG. 3 is an illustration of a neuromorphic apparatus according to an embodiment; FIG. 4 illustrates a flowchart of a hybrid compression method of storing synaptic weights according to an embodiment; FIGS. 5A-5D illustrate comparisons of related art compression approaches to the hybrid compression scheme of an exemplary embodiment; FIG. 6 illustrates another example of comparisons of related art compression approaches to the hybrid compression scheme of an exemplary embodiment; FIG. 7 is a block diagram of an example of a computing system according to an embodiment; and FIG. 8 is a block diagram of an example of a compression-enabled memory apparatus according to an embodiment. detailed-description description=\"Detailed Description\" end=\"lead\"?",
  "date_published": "20180419",
  "title": "HYBRID COMPRESSION SCHEME FOR EFFICIENT STORAGE OF SYNAPTIC WEIGHTS IN HARDWARE NEUROMORPHIC CORES",
  "ipcr_labels": [
    "G06N304",
    "G06N308"
  ],
  "_processing_info": {
    "original_size": 43576,
    "optimized_size": 2454,
    "reduction_percent": 94.37
  }
}