{
  "date_produced": "20170524",
  "publication_number": "US20170161614A1-20170608",
  "main_ipcr_label": "G06N502",
  "decision": "PENDING",
  "application_number": "15371117",
  "inventor_list": [
    {
      "inventor_name_last": "MEHTA",
      "inventor_name_first": "Anil",
      "inventor_city": "Makanda",
      "inventor_state": "IL",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "MARTIN",
      "inventor_name_first": "Michael John",
      "inventor_city": "Long Island City",
      "inventor_state": "NY",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "HORELIK",
      "inventor_name_first": "Nicholas Edward",
      "inventor_city": "Long Island City",
      "inventor_state": "NY",
      "inventor_country": "US"
    }
  ],
  "abstract": "Disclosed are systems and methods for predicting emergency situations. In some embodiments, the systems and methods may generate risk predictions for specific types of emergencies, in a geographic area within a time frame. Disclosed are systems and methods that may send warnings or messages of elevated risk of emergency to subjects and emergency service providers.",
  "filing_date": "20161206",
  "patent_number": "None",
  "summary": "<SOH> SUMMARY <EOH>The number of emergency requests made to public safety answering points, emergency dispatch centers, emergency management systems, and other such emergency response resources is subject to various factors that affect the type and frequency of such requests. Influential factors can include environmental conditions such as weather events (e.g. snow, rain, freezing temperatures, etc.) that may make road conditions more dangerous for motorists. Non-environmental events can also play a role. For example, an annual home game by the local sports team against a division rival may correlate with increased traffic around the downtown stadium and, in turn, with an increased risk of traffic accidents in that geographic area. A combination of factors may combine to produce elevated risks for certain types of emergencies. For example, triple digit temperatures during an outdoor sporting event with a large audience in attendance may correlate with an elevated risk of heat stroke for athletes and/or attendees. Because the various factors that influence the risk of an emergency will fluctuate over time, the actual number of emergencies or emergency requests for a particular geographic area during a particular time period will also vary depending on the environmental conditions and/or events in that area during that time period. Currently, emergency response personnel are staffed and assigned without the benefit of a system that accounts for these risk factors. The result is inefficient resource allocation that can lead to inadequate responses to emergencies by overstretched personnel or emergency resources sitting idle due to overstaffing. Furthermore, emergency systems and personnel lack an effective means of warning or communicating with subjects who may be at elevated risk to certain emergency situations. One major advantage of the systems, methods, and media provided herein is that they provide a means of utilizing historical data on past emergencies, environm...",
  "date_published": "20170608",
  "title": "SYSTEMS AND METHODS FOR PREDICTING EMERGENCY SITUATIONS",
  "ipcr_labels": [
    "G06N502",
    "G06F1750"
  ],
  "_processing_info": {
    "original_size": 258097,
    "optimized_size": 3241,
    "reduction_percent": 98.74
  }
}