{
  "date_produced": "20170323",
  "publication_number": "US20170098164A1-20170406",
  "main_ipcr_label": "G06N504",
  "decision": "PENDING",
  "application_number": "15378637",
  "inventor_list": [
    {
      "inventor_name_last": "IYER",
      "inventor_name_first": "Naresh Sundaram",
      "inventor_city": "Saratoga Springs",
      "inventor_state": "NY",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "VARMA",
      "inventor_name_first": "Anil",
      "inventor_city": "San Ramon",
      "inventor_state": "CA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "ARAGONES",
      "inventor_name_first": "James Kenneth",
      "inventor_city": "Clifton Park",
      "inventor_state": "NY",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "YAN",
      "inventor_name_first": "Weizhong",
      "inventor_city": "Clifton Park",
      "inventor_state": "NY",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "BONISSONE",
      "inventor_name_first": "Piero Patrone",
      "inventor_city": "Schenectady",
      "inventor_state": "NY",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "XUE",
      "inventor_name_first": "Feng",
      "inventor_city": "Clifton Park",
      "inventor_state": "NY",
      "inventor_country": "US"
    }
  ],
  "abstract": "A method for determining fleet conditions and operational management thereof, performed by a central system includes receiving fleet data from at least one distributed data repository. The fleet data is substantially representative of information associated with a fleet of physical assets. The method also includes processing the received fleet data for the fleet using at least one process of a plurality of processes. The plurality of processes assess the received fleet data into processed fleet data. The method additionally includes determining a fleet condition status using the processed fleet data and the at least one process of the plurality of processes. The method further includes generating a fleet response. The fleet response is substantially representative of a next operational step for the fleet of physical assets. The method also includes transmitting the fleet response to at least one of a plurality of fleet response recipients.",
  "filing_date": "20161214",
  "patent_number": "None",
  "summary": "<SOH> BRIEF DESCRIPTION <EOH>In one aspect, a method for determining fleet conditions and operational management thereof is provided. The method is performed by a central system. The central system has at least one computing device. The at least one computing device includes a processor and a memory device coupled to the processor. The method includes receiving fleet data at the central system from at least one distributed data repository. The fleet data is substantially representative of information associated with a fleet of physical assets. The method also includes processing the received fleet data for the fleet of physical assets using at least one process of a plurality of processes. The plurality of processes assess the received fleet data into processed fleet data. The method additionally includes determining a fleet condition status using the processed fleet data and the at least one process of the plurality of processes. The method further includes generating a fleet response. The fleet response is substantially representative of a next operational step for the fleet of physical assets. The method also includes transmitting the fleet response to at least one of a plurality of fleet response recipients. In a further aspect, a network-based system for determining fleet conditions and operational management thereof for a fleet of physical assets is provided. The system includes a central system having at least one computing device. The at least one computing device includes a processor and a memory device coupled to the processor. The system also includes a central database associated with the central system. The system additionally includes a plurality of supplier client devices associated with a plurality of fleet suppliers. The system further includes a plurality of supplier databases associated with the plurality of fleet suppliers. The system additionally includes a plurality of servicer client devices associated with a plurality of fleet servicers. The ...",
  "date_published": "20170406",
  "title": "COMPUTER IMPLEMENTED METHODS AND SYSTEMS FOR DETERMINING FLEET CONDITIONS AND OPERATIONAL MANAGEMENT THEREOF",
  "ipcr_labels": [
    "G06N504",
    "G06N9900",
    "G07C500"
  ],
  "_processing_info": {
    "original_size": 76632,
    "optimized_size": 4343,
    "reduction_percent": 94.33
  }
}