{
  "decision": "PENDING",
  "application_number": "15377167",
  "date_published": "20180614",
  "date_produced": "20180530",
  "title": "MEMORY TRANSACTION PRIORITIZATION",
  "filing_date": "20161213",
  "inventor_list": [
    {
      "inventor_name_last": "Baysah",
      "inventor_name_first": "Irving G.",
      "inventor_city": "Pflugerville",
      "inventor_state": "TX",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Jayaraman",
      "inventor_name_first": "Prasanna",
      "inventor_city": "Austin",
      "inventor_state": "TX",
      "inventor_country": "US"
    }
  ],
  "ipcr_labels": [
    "G06F306",
    "G06F1318"
  ],
  "main_ipcr_label": "G06F306",
  "summary": "<SOH> SUMMARY <EOH>According to examples of the present disclosure, techniques including methods, systems, and/or computer program products for memory transaction prioritization for a memory are provided. An example method may include allocating, by a memory controller, a reserved portion of the memory controller to process prioritized transactions. The method may further include receiving, by the memory controller, a request transaction from a processor to the memory, wherein the request transaction comprises a priority. The method may further include determining, by the memory controller, whether the priority of the request transaction is above a priority threshold. The method may further include responsive to determining that the priority of the request transaction is above the priority threshold, executing the request using the reserved portion of the memory controller. Additional features and advantages are realized through the techniques of the present disclosure. Other aspects are described in detail herein and are considered a part of the disclosure. For a better understanding of the present disclosure with the advantages and the features, refer to the following description and to the drawings.",
  "patent_number": "None",
  "abstract": "Examples of techniques for memory transaction prioritization for a memory are disclosed. In one example implementation according to aspects of the present disclosure, a computer-implemented method may include: The method may further include: allocating, by a memory controller, a reserved portion of the memory controller to process prioritized transactions; receiving, by the memory controller, a request transaction from a processor to the memory, wherein the request transaction comprises a priority; determining, by the memory controller, whether the priority of the request transaction is above a priority threshold; and responsive to determining that the priority of the request transaction is above the priority threshold, executing the request using the reserved portion of the memory controller.",
  "publication_number": "US20180165008A1-20180614",
  "_processing_info": {
    "original_size": 41471,
    "optimized_size": 2711,
    "reduction_percent": 93.46
  }
}