{
  "date_produced": "20170823",
  "publication_number": "US20170255869A1-20170907",
  "main_ipcr_label": "G06N700",
  "decision": "PENDING",
  "application_number": "15378064",
  "inventor_list": [
    {
      "inventor_name_last": "Liu",
      "inventor_name_first": "Shu-Cheng",
      "inventor_city": "New Taipei City",
      "inventor_state": "",
      "inventor_country": "TW"
    },
    {
      "inventor_name_last": "Hsu",
      "inventor_name_first": "Yin-Hsong",
      "inventor_city": "New Taipei City",
      "inventor_state": "",
      "inventor_country": "TW"
    },
    {
      "inventor_name_last": "Tsao",
      "inventor_name_first": "Ling-Fan",
      "inventor_city": "New Taipei City",
      "inventor_state": "",
      "inventor_country": "TW"
    },
    {
      "inventor_name_last": "Liao",
      "inventor_name_first": "Shu-Chun",
      "inventor_city": "New Taipei City",
      "inventor_state": "",
      "inventor_country": "TW"
    }
  ],
  "abstract": "A method of switching output interfaces for a computer system includes recording a plurality of system operation statuses of a multimedia signal corresponding to the computer system to switch from a first output interface to a second output interface and generating at least a switching condition; and switching the multimedia signal of the computer system from the first output interface to the second output interface when an operating status of the computer system matches the at least a switching condition.",
  "filing_date": "20161214",
  "patent_number": "None",
  "summary": "<SOH> SUMMARY OF THE INVENTION <EOH>To solve the above mentioned problems, the present invention provides a method and system of switching output interfaces for a computer system to enhance the conveniences. An embodiment of the present invention discloses a method of switching output interfaces for a computer system comprising recording a plurality of system operation statuses of a multimedia signal corresponding to the computer system to switch from a first output interface to a second output interface and generating at least a switching condition; and switching the multimedia signal of the computer system from the first output interface to the second output interface when an operating status of the computer system matches the at least a switching condition. An embodiment of the present invention further discloses a computer system comprising a plurality of output interfaces; a processor; a storage apparatus for storing a program code, wherein the program code causes the processor to perform a method of switching output interface, and the method of switching output interface comprises recording a plurality of system operation statuses of a multimedia signal corresponding to the computer system to switch from a first output interface to a second output interface and generating at least a switching condition; and switching the multimedia signal of the computer system from the first output interface to the second output interface when an operating status of the computer system matches the at least a switching condition. These and other objectives of the present invention will no doubt become obvious to those of ordinary skill in the art after reading the following detailed description of the preferred embodiment that is illustrated in the various figures and drawings.",
  "date_published": "20170907",
  "title": "Method and System of Switching Output Interfaces for a Computer System",
  "ipcr_labels": [
    "G06N700",
    "G06N9900"
  ],
  "_processing_info": {
    "original_size": 28713,
    "optimized_size": 3333,
    "reduction_percent": 88.39
  }
}