{
  "decision": "PENDING",
  "application_number": "15379657",
  "date_published": "20180118",
  "date_produced": "20180103",
  "title": "Holographic Technology Implemented Security Solution",
  "filing_date": "20161215",
  "inventor_list": [
    {
      "inventor_name_last": "Cianciolo",
      "inventor_name_first": "Christopher",
      "inventor_city": "Westford",
      "inventor_state": "MA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Locke",
      "inventor_name_first": "Robert B.",
      "inventor_city": "Sonoma",
      "inventor_state": "CA",
      "inventor_country": "US"
    }
  ],
  "ipcr_labels": [
    "G06T1900",
    "H04N718",
    "G06F314",
    "G06F301",
    "H04N1304",
    "G06F300",
    "H04N1302"
  ],
  "main_ipcr_label": "G06T1900",
  "summary": "<SOH> SUMMARY <EOH>According to an aspect, a system includes a server computer system that receives video feeds from plural, fixed video cameras in a facility, the server computer system including a storage device that stores a program of computing instructions for execution by server computer system, the program comprising instructions configured to cause the server computing system to control a mixed reality system comprising a processor device and a memory in communication with the processor device, and a head mounted display device including a stereoscopic 3D display, with the mixed reality system configured to send requests to the server system for specified video feeds, receive the video feeds, receive user instructions to pin a specific one of the feeds to a particular position as rendered on the display, and render using the head mounted display device, the specific one of the feeds onto the particular position. Aspects also include computer program products and computer implemented methods. One or more of the following advantages may be provided by one or more of the above aspects. Disclosed are techniques that use mixed reality and/or augmented reality and virtual reality technologies to improve the analysis of security and other situations. The disclosed techniques use computer implemented techniques that obtain information from various electronic systems/devices in the physical world, which devices are exemplified by security systems, and merge that information into a virtual world of policies and analytics that involve such security systems. The details of one or more embodiments of the invention are set forth in the accompanying drawings and the description below. Other features, objects, and advantages of the invention is apparent from the description and drawings, and from the claims.",
  "patent_number": "None",
  "abstract": "Disclosed are techniques that use mixed reality, e.g., augmented reality and virtual reality technologies to improve analysis of security situations as well as retail processes and activity in retail stores. For security these techniques merge the physical world embodied in security systems with the virtual world of policies and analytics. In the retail aspect, these techniques merge the physical world of retail items, displays, and spaces with the virtual world of policies and analytics.",
  "publication_number": "US20180018823A1-20180118",
  "_processing_info": {
    "original_size": 36866,
    "optimized_size": 3085,
    "reduction_percent": 91.63
  }
}