{
  "date_produced": "20170906",
  "publication_number": "US20170270433A1-20170921",
  "main_ipcr_label": "G06N9900",
  "decision": "PENDING",
  "application_number": "15379212",
  "inventor_list": [
    {
      "inventor_name_last": "TSUBOUCHI",
      "inventor_name_first": "Kota",
      "inventor_city": "Tokyo",
      "inventor_state": "",
      "inventor_country": "JP"
    },
    {
      "inventor_name_last": "TAJI",
      "inventor_name_first": "Masaya",
      "inventor_city": "Tokyo",
      "inventor_state": "",
      "inventor_country": "JP"
    }
  ],
  "abstract": "An information processing apparatus according to the present application includes an acquisition unit and a generation unit. The acquisition unit acquires, when a user performs one of specific behaviors respectively having a plurality of types, information on a behavior of the user performed on a terminal device and information on context associated with the user. The generation unit executes machine learning by using, as feature amounts, information on each of the specific behaviors and the information on the context, to generate a learning model of the behavior of the user performed on the terminal device.",
  "filing_date": "20161214",
  "patent_number": "None",
  "summary": "<SOH> SUMMARY OF THE INVENTION <EOH>An information processing apparatus according to an embodiment includes an acquisition unit and a generation unit. The acquisition unit acquires, when a user performs one of specific behaviors respectively having a plurality of types, information on a behavior of the user performed on a terminal device and information on context associated with the user. The generation unit executes machine learning by using, as feature amounts, information on each of the specific behaviors and the information on the context, to generate a learning model of the behavior of the user performed on the terminal device. The above and other objects, features, advantages and technical and industrial significance of this invention will be better understood by reading the following detailed description of presently preferred embodiments of the invention, when considered in connection with the accompanying drawings.",
  "date_published": "20170921",
  "title": "INFORMATION PROCESSING APPARATUS, INFORMATION PROCESSING SYSTEM, INFORMATION PROCESSING METHOD, AND COMPUTER-READABLE RECORDING MEDIUM",
  "ipcr_labels": [
    "G06N9900",
    "G06N700"
  ],
  "_processing_info": {
    "original_size": 96964,
    "optimized_size": 2320,
    "reduction_percent": 97.61
  }
}