{
  "date_produced": "20170329",
  "publication_number": "US20170103325A1-20170413",
  "main_ipcr_label": "G06N502",
  "decision": "PENDING",
  "application_number": "15385212",
  "inventor_list": [
    {
      "inventor_name_last": "Meinrenken",
      "inventor_name_first": "Christoph Johannes",
      "inventor_city": "New York",
      "inventor_state": "NY",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Lackner",
      "inventor_name_first": "Klaus S.",
      "inventor_city": "Dobbs Ferry",
      "inventor_state": "NY",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Walker",
      "inventor_name_first": "David Joseph",
      "inventor_city": "Stamford",
      "inventor_state": "CT",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Kuile",
      "inventor_name_first": "Robert Christian",
      "inventor_city": "Farmers Branch",
      "inventor_state": "TX",
      "inventor_country": "US"
    }
  ],
  "abstract": "Methods and systems for automating carbon footprinting are disclosed. In some embodiments, the methods include a plurality of steps. In some embodiments, related to predetermined resources associated with an item from predetermined data sources is obtained. Then, estimated emission factors are calculated for each of the resources. Next, a contributory uncertainty of the data and of the emission factors is determined. Then, a user is guided based on a comparison of the respective contributory uncertainty of data related to the resources or emission factors. Next, both data related to the resources and the estimated emission factors of the resources are utilized to determine a carbon footprint of the item.",
  "filing_date": "20161220",
  "patent_number": "None",
  "summary": "<SOH> SUMMARY <EOH>Methods and systems according to the disclosed subject matter embody one or more of the following three techniques. First, each CF is based on a single, uniform data framework that applies to all products/services. Rather than manually, data is entered, wherever possible, via auto-feeds from existing enterprise data, e.g., BOM (bill of materials) and energy usage at company-controlled factories. This technique minimizes the number of data items that require manual input. Second, particularly for remaining data entries, concurrent uncertainty analysis points the user to those activity data or EFs where additional data or improved accuracy would most improve the accuracy of the calculated CFs. This technique uses manual entries more efficiently. Third, a statistical model approximates EFs, thereby eliminating the manual mapping of a product/service's inventory to the vast selection of EF databases.",
  "date_published": "20170413",
  "title": "METHODS AND SYSTEMS FOR AUTOMATING CARBON FOOTPRINTING",
  "ipcr_labels": [
    "G06N502"
  ],
  "_processing_info": {
    "original_size": 46378,
    "optimized_size": 2661,
    "reduction_percent": 94.26
  }
}