{
  "date_produced": "20170621",
  "publication_number": "US20170193353A1-20170706",
  "main_ipcr_label": "G06N3063",
  "decision": "PENDING",
  "application_number": "15385309",
  "inventor_list": [
    {
      "inventor_name_last": "LEE",
      "inventor_name_first": "Hyung-Dong",
      "inventor_city": "Icheon",
      "inventor_state": "",
      "inventor_country": "KR"
    }
  ],
  "abstract": "A neuromorphic device may include: a pre-synaptic neuron; a plurality of post-synaptic neurons; and a plurality of synapses electrically connected to the pre-synaptic neuron and electrically connected to the plurality of post-synaptic neurons. Each of the post-synaptic neurons may include: an integrator; a main comparator having a first input port connected to an output port of the integrator; and a first sub comparator having a first input port connected to the output port of the integrator.",
  "filing_date": "20161220",
  "patent_number": "None",
  "summary": "<SOH> SUMMARY <EOH>Various embodiments are directed to a neuromorphic device capable of deciding quasi-learned synapses. Also, various embodiments are directed to a neuromorphic device capable of resetting quasi-learned synapses. Also, various embodiments are directed to a neuromorphic device including post-synaptic neurons having a plurality of comparators for deciding quasi-learned synapses. Also, various embodiments are directed to a method for deciding quasi-learned synapses in a neuromorphic device. Also, various embodiments are directed to a method for resetting quasi-learned synapses in a neuromorphic device. In an embodiment, a neuromorphic device may include: a pre-synaptic neuron; a plurality of post-synaptic neurons; and a plurality of synapses electrically connected to the pre-synaptic neuron and electrically connected to the plurality of post-synaptic neurons. Each of the post-synaptic neurons may include an integrator; a main comparator having a first input port connected to an output port of the integrator; and a first sub comparator having a first input port connected to the output port of the integrator. The main comparator may have a second input port receiving a main reference voltage. The first sub comparator may have a second input port receiving a first sub reference voltage. The neuromorphic device may further include a second sub comparator having a first input port connected to the output port of the integrator and a second input port receiving a second sub reference voltage. The main reference voltage may have a higher voltage level than the first and second sub reference voltage levels, and the second sub reference voltage may have lower voltage level than the first sub reference voltage level. The first input ports of the main comparator, the first sub comparator, and the second sub comparator may be non-inverting input ports, and the second input ports of the main comparator, the first sub comparator and the second sub comparator may be ...",
  "date_published": "20170706",
  "title": "NEUROMORPHIC DEVICE INCLUDING POST-SYNAPTIC NEURONS HAVING A COMPARATOR FOR DECIDING QUASI-LEARNED SYNAPSES",
  "ipcr_labels": [
    "G06N3063",
    "G06N308"
  ],
  "_processing_info": {
    "original_size": 63129,
    "optimized_size": 3102,
    "reduction_percent": 95.09
  }
}