{
  "date_produced": "20170323",
  "publication_number": "US20170098156A1-20170406",
  "main_ipcr_label": "G06N3063",
  "decision": "PENDING",
  "application_number": "15383527",
  "inventor_list": [
    {
      "inventor_name_last": "Nino",
      "inventor_name_first": "Juan Claudio",
      "inventor_city": "Gainesville",
      "inventor_state": "FL",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Kendall",
      "inventor_name_first": "Jack",
      "inventor_city": "Gainesville",
      "inventor_state": "FL",
      "inventor_country": "US"
    }
  ],
  "abstract": "Disclosed are various embodiments of memristive neural networks comprising neural nodes. Memristive nanofibers are used to form artificial synapses in the neural networks. Each memristive nanofiber may couple one or more neural nodes to one or more other neural nodes. In one case, a memristive neural network includes a first neural node, a second neural node, and a memristive fiber that couples the first neural node to the second neural node. The memristive fiber comprises a conductive core and a memristive shell, where the conductive core forms a communications path between the first neural node and the second neural node and the memristive shell forms a memristor synapse between the first neural node and the second neural node.",
  "filing_date": "20161219",
  "patent_number": "None",
  "summary": "<SOH> BRIEF DESCRIPTION OF THE DRAWINGS <EOH>FIG. 1 is a drawing of a core-shell memristive nanofiber according to various embodiments of the present disclosure. FIG. 2 is a drawing of an example of a nanofiber-based memristive neural network according to various embodiments of the present disclosure. FIG. 3 is a drawing of an example of a nanofiber-based memristive neural network according to various embodiments of the present disclosure. FIG. 4 is a drawing of an example of a simulation of a circuit layout of a nanofiber-based memristive neural network according to various embodiments of the present disclosure. FIG. 5 is a flowchart illustrating an example of a method of creating a nanofiber-based memristive neural network according to various embodiments of the present disclosure. FIG. 6 is a drawing illustrating an example of a nanofiber-based memristive neural network according to various embodiments of the present disclosure. FIG. 7 is a graph showing an example of connectivity scaling of a nanofiber-based memristive neural network according to various embodiments of the present disclosure. FIG. 8 is a graph showing an example of neural activity of a memristive neural network according to various embodiments of the present disclosure. FIG. 9 a graph showing an example of a power spectrum of a memristive neural network according to various embodiments of the present disclosure. detailed-description description=\"Detailed Description\" end=\"lead\"?",
  "date_published": "20170406",
  "title": "MEMRISTIVE NANOFIBER NEURAL NETWORKS",
  "ipcr_labels": [
    "G06N3063",
    "G06N304",
    "G06N308"
  ],
  "_processing_info": {
    "original_size": 32431,
    "optimized_size": 2916,
    "reduction_percent": 91.01
  }
}