{
  "decision": "REJECTED",
  "application_number": "15382998",
  "date_published": "20170622",
  "date_produced": "20170607",
  "title": "METHODS AND APPARATUSES FOR PROMPTING ACCORDING TO LOCATION-BASED INFORMATION",
  "filing_date": "20161219",
  "inventor_list": [
    {
      "inventor_name_last": "DING",
      "inventor_name_first": "Yi",
      "inventor_city": "Beijing",
      "inventor_state": "",
      "inventor_country": "CN"
    },
    {
      "inventor_name_last": "HOU",
      "inventor_name_first": "Enxing",
      "inventor_city": "Beijing",
      "inventor_state": "",
      "inventor_country": "CN"
    },
    {
      "inventor_name_last": "GAO",
      "inventor_name_first": "Ziguang",
      "inventor_city": "Beijing",
      "inventor_state": "",
      "inventor_country": "CN"
    }
  ],
  "ipcr_labels": [
    "H04W402",
    "G06F1730",
    "H04L2908"
  ],
  "main_ipcr_label": "H04W402",
  "summary": "<SOH> SUMMARY <EOH>According to a first aspect of the present disclosure, there is provided a method for prompting according to location-based information. The method includes: receiving a location-based information acquiring request sent by a designated terminal, in which the location-based information acquiring request at least includes a designated device identifier; acquiring designated location-based information in a location-based information database, in which the designated location-based information relates to the designated device identifier, and location-based information reported by a plurality of terminals is stored in the location-based information database at least; and sending the designated location-based information to the designated terminal, in which the designated terminal is configured to perform a prompt according to the designated location-based information. According to a second aspect of the present disclosure, there is provided a method for prompting according to location-based information. The method includes: sending a location-based information acquiring request to a server, in which the location-based information acquiring request at least includes a designated device identifier, such that the server returns designated location-based information according to the designated device identifier; receiving the designated location-based information; and performing a prompt according to the designated location-based information. According to a third aspect of the present disclosure, there is provided a method for prompting according to location-based information. The method includes: receiving a broadcast message of a device, in which the broadcast message includes a device identifier of the device; acquiring self-location information and current time information; and sending the device identifier of the device, the self-location information and the current time information to a server, in which the server stores the device identifier of the ...",
  "patent_number": "None",
  "abstract": "The present disclosure provides a method and an apparatus for prompting according to location-based information, which belong to the field of communication technology. The method includes: acquiring by a server designated location-based information matching with a designated device identifier in a location-based information database at least storing location-based information reported by a plurality of terminals after receiving a location-based information acquiring request sent by a designated terminal; sending by the server the designated location-based information to the designated terminal, in which the designated terminal is configured to perform a prompt according to the designated location-based information.",
  "publication_number": "US20170180927A1-20170622",
  "_processing_info": {
    "original_size": 80871,
    "optimized_size": 3586,
    "reduction_percent": 95.57
  }
}