{
  "date_produced": "20170621",
  "publication_number": "US20170193357A1-20170706",
  "main_ipcr_label": "G06N3063",
  "decision": "ACCEPTED",
  "application_number": "15386965",
  "inventor_list": [
    {
      "inventor_name_last": "LEE",
      "inventor_name_first": "Hyung-Dong",
      "inventor_city": "Icheon",
      "inventor_state": "",
      "inventor_country": "KR"
    }
  ],
  "abstract": "A neuromorphic device having synapses may include: a top electrode; a bottom electrode; and a variable resistive layer disposed between the top electrode and the bottom electrode. The variable resistive layer may include a plurality of carrier traps distributed at multiple energy levels.",
  "filing_date": "20161221",
  "patent_number": "9773204",
  "summary": "<SOH> SUMMARY <EOH>Various embodiments are directed to a neuromorphic device including synapses, each of the synapses including a variable resistive layer having multiple resistance levels. Also, various embodiments are directed to a neuromorphic device including synapses, each of the synapses including a variable resistive layer that has a plurality of carrier traps distributed at multiple energy levels. In an embodiment, a neuromorphic device having synapses may include: a top electrode; a bottom electrode; and a variable resistive layer disposed between the top electrode and the bottom electrode. The variable resistive layer may include a plurality of carrier traps distributed at multiple energy levels. The neuromorphic device may further include an upper blocking layer disposed between the top electrode and the variable resistive layer. The upper blocking layer may include a semiconductor material that substantially lacks carrier traps. The neuromorphic device may further include a lower blocking layer disposed between the bottom electrode and the variable resistive layer. The lower blocking layer and the variable resistive layer may include two or more of the same materials. The neuromorphic device may further include an upper barrier layer disposed between the top electrode and the variable resistive layer. The upper barrier layer may include one or more of titanium (Ti), tantalum (Ta), titanium nitride (TiN), tantalum nitride (TaN), tungsten nitride (WN) and another barrier material. The neuromorphic device may further include a lower barrier layer disposed between the bottom electrode and the variable resistive layer. The variable resistive layer may include two or more of silicon (Si), germanium (Ge), gallium (Ga), indium (In), arsenic (As), stibium (Sb), hafnium (Hf), tantalum (Ta), titanium (Ti), zirconium (Zr), lanthanum (La), vanadium (V), chrome (Cr), manganese (Mn), rubidium (Ru), strontium (Sr), yttrium (Y), niobium (Nb), molybdenum (Mo), ruthenium (...",
  "date_published": "20170706",
  "title": "NEUROMORPHIC DEVICE INCLUDING SYNAPSES HAVING CARRIER TRAPS DISTRIBUTED AT MULTIPLE ENERGY LEVELS",
  "ipcr_labels": [
    "G06N3063",
    "H01L4500"
  ],
  "_processing_info": {
    "original_size": 39988,
    "optimized_size": 2888,
    "reduction_percent": 92.78
  }
}