{
  "decision": "PENDING",
  "application_number": "15386934",
  "date_published": "20170629",
  "date_produced": "20170614",
  "title": "CONTROLLED ORDERING OF SUPPLIES FOR MEDICAL DEVICES AND SYSTEMS",
  "filing_date": "20161221",
  "inventor_list": [
    {
      "inventor_name_last": "Dalforno",
      "inventor_name_first": "Brian",
      "inventor_city": "Vista",
      "inventor_state": "CA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Hall",
      "inventor_name_first": "Thomas",
      "inventor_city": "San Diego",
      "inventor_state": "CA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Hugel",
      "inventor_name_first": "Matthew Ryan",
      "inventor_city": "San Diego",
      "inventor_state": "CA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Koehler",
      "inventor_name_first": "Katherine Yerre",
      "inventor_city": "Solana Beach",
      "inventor_state": "CA",
      "inventor_country": "US"
    }
  ],
  "ipcr_labels": [
    "G06Q1008",
    "G06F1900"
  ],
  "main_ipcr_label": "G06Q1008",
  "summary": "<SOH> SUMMARY <EOH>Methods, systems and apparatuses, including computer program products, are provided for controlled ordering. In some example embodiments, the present technology includes a method for controlling ordering of supplies for a medical device. The method includes determining, at a server, authorization of a user to submit an order for one or more supplies associated with a medical device prescribed to the user; receiving, at the server, information associated with the authorized user, wherein the information includes (i) eligible items permitted to be purchased by the user based on one or more of (a) the user's prescription for the medical device or (b) compatibility of components associated with the medical device, and (ii) pricing of the eligible items associated with the medical device based on an insurance plan of the user; determining, at the server, eligibility of the user to purchase the one or more supplies submitted in the order based on analysis the information; and determining, at the server, payment information for payers associated with purchase of the determined eligible one or more supplies submitted in the order, in which the payment information for payers include a co-payment for the user and a covered payment for a carrier of the insurance plan. In some example embodiments, the present technology includes a system for controlling ordering of supplies for a medical device. The system includes a controlled ordering software application operable on a user computing device to (i) receive user input indicative of an order for the one or more supplies associated with a medical device prescribed to a patient user, and (ii) cause transmission of the user input by the user computing device; and one or more secure computers including at least one processor and at least one memory including program code which when executed by the at least one processor causes operations of the one or more secure computers, comprising: receiving the user input, de...",
  "patent_number": "None",
  "abstract": "Disclosed are systems, methods and devices for controlling the ordering of medical device supplies. In some aspects, a method includes authorizing a user to submit an order for supplies associated with a prescribed medical device; receiving information associated with the authorized user including (i) eligible items permitted to be purchased such as the user's prescription for the medical device and/or compatibility of components associated with the medical device, and (ii) pricing of the eligible items based on an insurance plan of the user; determining eligibility of the user to purchase the one or more supplies submitted in the order based on analysis the information; and determining payment information for payers associated with purchase of the determined eligible one or more supplies submitted in the order, in which the payment information for payers include a co-payment for the user and a covered payment for a carrier of the insurance plan.",
  "publication_number": "US20170185953A1-20170629",
  "_processing_info": {
    "original_size": 139128,
    "optimized_size": 3980,
    "reduction_percent": 97.14
  }
}