{
  "date_produced": "20170614",
  "publication_number": "US20170185921A1-20170629",
  "main_ipcr_label": "G06N9900",
  "decision": "PENDING",
  "application_number": "15388899",
  "inventor_list": [
    {
      "inventor_name_last": "Zhang",
      "inventor_name_first": "Benyu",
      "inventor_city": "Mountain View",
      "inventor_state": "CA",
      "inventor_country": "US"
    }
  ],
  "abstract": "The present disclosure discloses a system and method for deploying customized machine learning services. Specifically, a computing device of a machine learning service provider maintains a meta training component and a plurality of meta data schemas. The computing device also generates a customized data schema based on customization of one of the plurality of meta data schemas by a machine learning service client. Further, the computing device can generate a training component based on the meta training component. The training component is compatible with the customized data schema. Then, the computing device deploys the customized data schema and the training component to one or more client devices to automatically generate a machine learning model.",
  "filing_date": "20161222",
  "patent_number": "None",
  "summary": "<SOH> BRIEF DESCRIPTION OF THE DRAWINGS <EOH>The present disclosure may be best understood by referring to the following description and accompanying drawings that are used to illustrate embodiments of the present disclosure. FIG. 1 is a block diagram illustrating an exemplary environment for providing machine learning services according to conventional prior arts. FIG. 2 is a block diagram illustrating an exemplary environment for providing machine learning services according to embodiments of the present disclosure. FIGS. 3A-3C are block diagrams illustrating an exemplary environment for providing machine learning services in details according to embodiments of the present disclosure. FIG. 4 is a block diagram illustrating an exemplary view of machine learning service deployment between a client and a provider according to embodiments of the present disclosure. FIG. 5 is a block diagram illustrating exemplary meta data schemas according to embodiments of the present disclosure. FIG. 6 is a block diagram illustrating an example of how meta data schemas reinforce each other during the machine learning process according to embodiments of the present disclosure. FIGS. 7A-7B are flowcharts illustrating an exemplary process for providing customized machine learning services according to embodiments of the present disclosure. FIG. 8 is a block diagram illustrating an exemplary system for providing customized machine learning services according to embodiments of the present disclosure. detailed-description description=\"Detailed Description\" end=\"lead\"?",
  "date_published": "20170629",
  "title": "SYSTEM AND METHOD FOR DEPLOYING CUSTOMIZED MACHINE LEARNING SERVICES",
  "ipcr_labels": [
    "G06N9900",
    "G06N504",
    "G06F9445"
  ],
  "_processing_info": {
    "original_size": 70223,
    "optimized_size": 2917,
    "reduction_percent": 95.85
  }
}