{
  "date_produced": "20170621",
  "publication_number": "US20170193355A1-20170706",
  "main_ipcr_label": "G06N3063",
  "decision": "PENDING",
  "application_number": "15388677",
  "inventor_list": [
    {
      "inventor_name_last": "LEE",
      "inventor_name_first": "Hyung-Dong",
      "inventor_city": "Icheon",
      "inventor_state": "",
      "inventor_country": "KR"
    }
  ],
  "abstract": "A method reads data from a synapse which includes a transistor and a variable resistor. The transistor has a gate electrode, a first electrode and a second electrode. The variable resistor has a first electrode connected to the second electrode of the transistor. The method includes applying a read voltage to the gate electrode of the transistor, applying a pre-synaptic voltage to the first electrode of the transistor, and applying a post-synaptic voltage to a second electrode of the variable resistor. The read voltage is lower than the threshold voltage of the transistor.",
  "filing_date": "20161222",
  "patent_number": "None",
  "summary": "<SOH> SUMMARY <EOH>Embodiments are directed to a method of reading data from a synapse of a neuromorphic device. Embodiments are directed to a method of reading data from a synapse in a sub-threshold voltage region. Embodiments are directed to a method of implementing an excitatory synapse and an inhibitory synapse in a reading mode. In an embodiment, there is provided a method of reading data from a synapse which includes a transistor and a variable resistor. The transistor may have a gate electrode, a first electrode and a second electrode. The variable resistor may have a first electrode connected to the second electrode of the transistor. The method may include: applying a read voltage to the gate electrode of the transistor; applying a pre-synaptic voltage to the first electrode of the transistor; and applying a post-synaptic voltage to a second electrode of the variable resistor. The read voltage may be lower than the threshold voltage of the transistor. The post-synaptic voltage may be substantially zero. An absolute value of a difference between the read voltage and the post-synaptic voltage may be smaller than the threshold voltage. The pre-synaptic voltage may be a positive (+) voltage. The read voltage may be a positive voltage. The pre-synaptic voltage may be greater than the read voltage. An absolute value of a difference between the read voltage and the pre-synaptic voltage may be smaller than the threshold voltage. The pre-synaptic voltage may be a negative (−) voltage. The read voltage may be a negative voltage. The pre-synaptic voltage may be lower than the read voltage. In an embodiment, there is provided a method of reading data from a synapse which includes a transistor and a variable resistor. The transistor may have a gate electrode, a first electrode and a second electrode. The variable resistor may have a first electrode connected to the second electrode of the transistor. The method may include: applying a positive read voltage from a gating...",
  "date_published": "20170706",
  "title": "METHOD OF READING DATA FROM SYNAPSES OF A NEUROMORPHIC DEVICE",
  "ipcr_labels": [
    "G06N3063",
    "G06N304"
  ],
  "_processing_info": {
    "original_size": 50706,
    "optimized_size": 3143,
    "reduction_percent": 93.8
  }
}