{
  "date_produced": "20180613",
  "publication_number": "US20180181870A1-20180628",
  "main_ipcr_label": "G06N502",
  "decision": "PENDING",
  "application_number": "15389532",
  "inventor_list": [
    {
      "inventor_name_last": "OSBORNE",
      "inventor_name_first": "ELIZABETH FAY",
      "inventor_city": "Kansas City",
      "inventor_state": "MO",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "SIEBERS",
      "inventor_name_first": "SCOTT GORDON",
      "inventor_city": "Leawood",
      "inventor_state": "KS",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "HAYS",
      "inventor_name_first": "CHAD G.",
      "inventor_city": "Overland Park",
      "inventor_state": "KS",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "KOMAREK",
      "inventor_name_first": "JASON ANDREW",
      "inventor_city": "Kearney",
      "inventor_state": "MO",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "BECHTEL",
      "inventor_name_first": "TODD",
      "inventor_city": "Overland Park",
      "inventor_state": "KS",
      "inventor_country": "US"
    }
  ],
  "abstract": "The present invention is directed to a system and methods for integrating flexible event detection into a near real-time streaming environment. A streaming platform streams raw data from multiple sources, adds contextual information to the raw data, and makes inferences from the enriched information. A rule execution operator, being integrated within the streaming platform, executes rules against the enriched information to detect events, using a rule repository that stores a plurality of flexible, dynamic, and customizable rules. When an event is detected by the rule execution operator, the streaming platform may use a middleware component to instantiate actions that are responsive to a detected event. Actions may be directly performed, and/or the actions and instructions for implementing or performing those actions are communicated to external devices.",
  "filing_date": "20161223",
  "patent_number": "None",
  "summary": "<SOH> SUMMARY <EOH>This Summary is provided to introduce a selection of concepts in a simplified form that are further described below in the Detailed Description. This Summary is not intended to identify key features or essential features of the claimed subject matter, nor is it intended to be used as an aid in determining the scope of the claimed subject matter. The present invention is defined by the claims. In embodiments, the streaming platform retrieves and/or receives incoming raw data from a plurality of varied data sources, in near real time. The streaming platform enriches the raw data using transformational techniques to add, infer, learn, create, and manage contextual and relational information for data items and data streams. In this way, the enriched information includes contextual information identified and generated from the raw data items, but which is ‘more than the sum’ of the whole of raw data as initially received by the streaming platform. The enriched information serves as input to an integrated or embedded rule execution operator. Generally, the integrated or embedded rule execution operator executes various operational rules against the input enriched information in order to detect, identify, and instantiate events. The instantiated events are included as output, where the output is transferred from the internal rule execution operator back to the streaming platform, and from the streaming platform to external systems, devices, and/or applications where the output can be used to implement actions. The integration of the custom rule execution operator within the streaming platform transforms a streaming platform into a fully functional complex event processing system that handles the entire process from collection of the incoming low complexity data (e.g., raw data) to the implementation of actions and/or firing of instantiated events. Generally, events are instantiated in near real time relative to the initial receipt of raw data from which ...",
  "date_published": "20180628",
  "title": "INTEGRATING FLEXIBLE RULE EXECUTION INTO A NEAR REAL-TIME STREAMING ENVIRONMENT",
  "ipcr_labels": [
    "G06N502",
    "G06F954"
  ],
  "_processing_info": {
    "original_size": 119584,
    "optimized_size": 4069,
    "reduction_percent": 96.6
  }
}