{
  "date_produced": "20170524",
  "publication_number": "US20170161630A1-20170608",
  "main_ipcr_label": "G06N700",
  "decision": "REJECTED",
  "application_number": "15387741",
  "inventor_list": [
    {
      "inventor_name_last": "Martin",
      "inventor_name_first": "Hugh",
      "inventor_city": "Sunnyvale",
      "inventor_state": "CA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Cumpston",
      "inventor_name_first": "Rusty",
      "inventor_city": "Sunnyvale",
      "inventor_state": "CA",
      "inventor_country": "US"
    }
  ],
  "abstract": "In one example, a computing device is configured to process data received in relation in relation to a lighting infrastructure application framework. An example computing device comprises a memory and a processor coupled to the memory configured with processor-executable instructions to perform operations comprising: receiving data reported by a plurality of lighting node platform devices within the lighting infrastructure application framework; processing the received data by at least one of analyzing or aggregating the received data; detecting an occurrence of at least one of a plurality of predefined events based on the processing of the data; identifying a trend within the received data based on the processing of the data; and predicting an event in advance based on the processing of the data.",
  "filing_date": "20161222",
  "patent_number": "None",
  "summary": "<SOH> SUMMARY <EOH>The various embodiments include systems and methods for providing a lighting infrastructure application framework or network that communicates with and otherwise manages street lighting and/or other lighting infrastructures having integrated application platform, network, and sensor capabilities. In an embodiment, a computing device may perform a method to implement a revenue model related to a lighting infrastructure, comprising receiving, at the computing device, a request from a first device to access data from a lighting infrastructure application framework, wherein the data from the lighting infrastructure application framework includes data from at least one lighting node platform device of a plurality of lighting node platform devices, transmitting a response to the request from the first device based at least in part on the requested data from the lighting infrastructure application framework, and calculating at least one of a fee and a revenue related to the transmitted response. In another embodiment, the method may further include registering devices based on received registration information, wherein the registration information is transmitted by one of a device associated with an application provider and the first device. In an embodiment, the registration information may include at least one of authentication credentials, access-control credentials, licensing information, advertisement authorization information, payment information, and a selection of at least one of a plurality of data types. In an embodiment, the plurality of data types may include occupancy sensor data, energy usage sensor data, light sensor data (e.g., daylight sensor data, ambient light sensor data, light level sensor data, etc.), environmental sensor data, (e.g., temperature sensor data, wind sensor data, humidity sensor data, weather sensor data, pollution sensor data, particulate sensor data, barometric pressure sensor data, etc.), security sensor data (e.g.,...",
  "date_published": "20170608",
  "title": "LIGHTING INFRASTRUCTURE AND REVENUE MODEL",
  "ipcr_labels": [
    "G06N700",
    "H04L2908",
    "G06Q5006",
    "H05B3702",
    "G06Q3004",
    "G06Q4000"
  ],
  "_processing_info": {
    "original_size": 177805,
    "optimized_size": 3545,
    "reduction_percent": 98.01
  }
}