{
  "decision": "PENDING",
  "application_number": "15388707",
  "date_published": "20170413",
  "date_produced": "20170329",
  "title": "DIGITAL ASSET INTERMEDIARY ELECTRONIC SETTLEMENT PLATFORM",
  "filing_date": "20161222",
  "inventor_list": [
    {
      "inventor_name_last": "Wilson, JR.",
      "inventor_name_first": "Donald R.",
      "inventor_city": "Chicago",
      "inventor_state": "IL",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Hirani",
      "inventor_name_first": "Sunil",
      "inventor_city": "New York",
      "inventor_state": "NY",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Saraniecki",
      "inventor_name_first": "W. Eric",
      "inventor_city": "New York",
      "inventor_state": "NY",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Rooz",
      "inventor_name_first": "Yuval",
      "inventor_city": "New York",
      "inventor_state": "NY",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Kfir",
      "inventor_name_first": "Shaul",
      "inventor_city": "New York",
      "inventor_state": "NY",
      "inventor_country": "US"
    }
  ],
  "ipcr_labels": [
    "G06Q2036",
    "G06Q2038",
    "G06Q2040"
  ],
  "main_ipcr_label": "G06Q2036",
  "summary": "<SOH> SUMMARY <EOH>An exemplary embodiment digital asset settlement method includes receiving from a first user an authorization for a conditional transaction involving a right of the first user over a digital asset, which has been recorded on a distributed ledger; matching the authorization for transaction from the first user with an authorization for transaction from at least one other user involving at least one right of the at least one other user over at least one digital asset, which has been recorded on the distributed ledger; settling the transaction between the first and at least one other user if the conditional is met; and recording the settled transaction on the distributed ledger. Optionally, at least one of the digital assets represents digitized ownership of a conventional asset. The method may further include receiving from the first user an electronic mechanism for redemption. Optionally, if the transaction does not settle because the condition is not met, the electronic mechanism for redemption is invoked. Optionally, the electronic mechanism for redemption permits the unilateral withdrawal of applicable assets, rights, funds, or contracts, by a depositing user at a preset time in the future. Optionally, the electronic mechanism for redemption comprises a pre-signed authorization for redemption for use in a redeem transaction. Optionally, the electronic mechanism for redemption is automatically invoked. An exemplary embodiment digital asset electronic settlement platform includes nodes, a plurality of which have a copy of a distributed ledger stored thereon; an interface server coupled in signal communication with one of the nodes; a client machine coupled in signal communication with the interface server; a data server coupled in signal communication with the machine; a persistence unit coupled in signal communication with the data server; a cache unit coupled in signal communication with the data server; and a coordination unit coupled in signal ...",
  "patent_number": "None",
  "abstract": "A digital asset settlement method includes receiving from a first user an authorization for a conditional transaction involving a digital right, which has been digitized on a distributed ledger, matching the authorization for transaction from the first user with an authorization for transaction from at least one other user, settling the transaction between at least the first and other users if the conditional is met, and memorializing the settled transaction on the distributed ledger.",
  "publication_number": "US20170103385A1-20170413",
  "_processing_info": {
    "original_size": 92426,
    "optimized_size": 3649,
    "reduction_percent": 96.05
  }
}