{
  "decision": "PENDING",
  "application_number": "15388479",
  "date_published": "20180628",
  "date_produced": "20180613",
  "title": "ADJUSTING MECHANICAL ELEMENTS OF CARGO TRANSPORTATION UNITS",
  "filing_date": "20161222",
  "inventor_list": [
    {
      "inventor_name_last": "Seaman",
      "inventor_name_first": "Conrad Delbert",
      "inventor_city": "Guelph",
      "inventor_state": "",
      "inventor_country": "CA"
    },
    {
      "inventor_name_last": "West",
      "inventor_name_first": "Stephen",
      "inventor_city": "Manotick",
      "inventor_state": "",
      "inventor_country": "CA"
    },
    {
      "inventor_name_last": "Spriggs",
      "inventor_name_first": "Kristian Neil",
      "inventor_city": "Ottawa",
      "inventor_state": "",
      "inventor_country": "CA"
    }
  ],
  "ipcr_labels": [
    "B60W3018",
    "G06Q1008",
    "B60W1022",
    "B60W1020",
    "B60W10184",
    "B60W1030",
    "B60W3002",
    "G07C500",
    "G05D100",
    "G05D102"
  ],
  "main_ipcr_label": "B60W3018",
  "summary": "<SOH> BRIEF DESCRIPTION OF THE DRAWINGS <EOH>Some implementations of the present disclosure are described with respect to the following figures. FIG. 1 is a block diagram of an example arrangement including a cargo transportation unit (CTU) and a vehicle attached to the CTU, according to some implementations. FIG. 2 is a block diagram of another example arrangement including a CTU, a vehicle attached to the CTU, and a remote controller, according to further implementations. FIG. 3 is a flow diagram of an example process of a controller, according to some implementations. FIG. 4 is a block diagram of an example arrangement that includes a controller and a weight sensor, according to some implementations. FIG. 5 is a block diagram of a controller according to some implementations. detailed-description description=\"Detailed Description\" end=\"lead\"?",
  "patent_number": "None",
  "abstract": "In some examples, a controller includes at least one processor configured to receive information regarding a condition associated with a cargo transportation unit (CTU), the received information regarding the condition including information of an environment around the CTU at a location of the CTU, and adjust an adjustable mechanical element of the CTU in response to the received information.",
  "publication_number": "US20180178797A1-20180628",
  "_processing_info": {
    "original_size": 47354,
    "optimized_size": 2205,
    "reduction_percent": 95.34
  }
}