{
  "date_produced": "20170603",
  "publication_number": "US20170169361A1-20170615",
  "main_ipcr_label": "G06N9900",
  "decision": "PENDING",
  "application_number": "15387858",
  "inventor_list": [
    {
      "inventor_name_last": "Gomez-Rosado",
      "inventor_name_first": "David",
      "inventor_city": "Petaluma",
      "inventor_state": "CA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Georgiev",
      "inventor_name_first": "Tihomir Tsankov",
      "inventor_city": "Menlo Park",
      "inventor_state": "CA",
      "inventor_country": "US"
    }
  ],
  "abstract": "Provided herein are method, apparatus, and computer program products for facilitating a learning user interface. The interface may be presented as a plurality of dynamic icons representing a plurality of items. The interface may be facilitated by receiving, by a processor, a selection indication associated with one item of the plurality of dynamic icons. The interface may be facilitated by determining, via the processor, at least one suggested item of the plurality of items based on the selection indication. The interface may also be facilitated by determining a visual bias for at least one suggested dynamic icon representing the at least one suggested item relative to at least one secondary dynamic icon and may be facilitated by applying the visual bias, via the interface, to the at least one suggested dynamic icon.",
  "filing_date": "20161222",
  "patent_number": "None",
  "summary": "<SOH> BRIEF SUMMARY <EOH>In general, embodiments of the present invention provided herein include methods, apparatus, and computer program products for facilitating a learning user interface. In some example embodiments, a method may be provided that may include presenting, via an interface, a plurality of dynamic icons representing a plurality of items. Some embodiments of the method may include receiving, by a processor, a selection indication associated with one item of the plurality of dynamic icons. The method may include determining, via the processor, at least one suggested item of the plurality of items based on the selection indication. Additionally or alternatively, the method may include determining a visual bias for at least one suggested dynamic icon representing the at least one suggested item relative to at least one secondary dynamic icon, and may include applying the visual bias, via the interface, to the at least one suggested dynamic icon. In some embodiments, applying the visual bias to the at least one suggested dynamic icon includes varying a common feature shared between the at least one suggested dynamic icon and the at least one secondary dynamic icon. In some embodiments, applying the visual bias to the at least one suggested dynamic icon may include varying a size of the at least one suggested dynamic icon relative to the at least one secondary dynamic icon. In some embodiments, applying the visual bias to the at least one suggested dynamic icon may include varying a color of the at least one suggested dynamic icon relative to the at least one secondary dynamic icon. In some embodiments, applying the visual bias to the at least one suggested dynamic icon may include varying a shading of the at least one suggested dynamic icon relative to the at least one secondary dynamic icon. In some embodiments, applying the visual bias to the at least one suggested dynamic icon may include varying a border of the at least one suggested dynamic icon rel...",
  "date_published": "20170615",
  "title": "Learning User Interface",
  "ipcr_labels": [
    "G06N9900",
    "G06Q2020",
    "G06F30484",
    "G06Q3006",
    "G06F30481",
    "G06F30482"
  ],
  "_processing_info": {
    "original_size": 176490,
    "optimized_size": 3568,
    "reduction_percent": 97.98
  }
}