{
  "decision": "PENDING",
  "application_number": "15388029",
  "date_published": "20180628",
  "date_produced": "20180613",
  "title": "PULMONARY VEIN DISPLAY IN TWO DIMENSIONS",
  "filing_date": "20161222",
  "inventor_list": [
    {
      "inventor_name_last": "Katz",
      "inventor_name_first": "Natan Sharon",
      "inventor_city": "Atlit",
      "inventor_state": "",
      "inventor_country": "IL"
    },
    {
      "inventor_name_last": "Zar",
      "inventor_name_first": "Lior",
      "inventor_city": "Poria Illit",
      "inventor_state": "",
      "inventor_country": "IL"
    },
    {
      "inventor_name_last": "Cohen",
      "inventor_name_first": "Benjamin",
      "inventor_city": "Haifa",
      "inventor_state": "",
      "inventor_country": "IL"
    }
  ],
  "ipcr_labels": [
    "A61B500",
    "A61B502",
    "A61B1814",
    "G06T1508",
    "G06T1160",
    "G06T773",
    "G06T700"
  ],
  "main_ipcr_label": "A61B500",
  "summary": "<SOH> SUMMARY <EOH>Embodiments of the present invention that are described hereinbelow provide a method for viewing a lumen of a patient. There is therefore provided, in accordance with an embodiment of the present invention, a method for data display, including acquiring a three-dimensional (3D) map of a lumen inside a body of a subject, transforming the 3D map of the lumen into a two-dimensional (2D) image by projecting the 3D map onto an annulus, and presenting the 2D image on a display screen. In a disclosed embodiment, presenting the 2D image includes presenting a stationary 2D image. In some embodiments a 3D image of the 3D map and the stationary 2D image are simultaneously presented on adjacent parts of the display screen. Additionally or alternatively, the 2D image may be kept stationary while manipulating the 3D image. In a disclosed embodiment acquiring the 3D map includes acquiring a 3D map of a lumen undergoing an ablation procedure, wherein the ablation procedure may include ablating a pulmonary vein of a heart. Additionally or alternatively, the method includes calculating a path for the ablation procedure for a given starting point on the pulmonary vein, and displaying an image of the path on a 3D image of the 3D map and on the 2D image. In some embodiments a calculated location and an extent of an ablation lesion are displayed on a 3D image of the 3D map and on the 2D image. Additionally or alternatively, a recommended starting point for a further ablation is calculated based on at least one of the calculated location and the extent of the ablation lesion, and the method includes displaying the recommended starting point as a mark on the 3D image and on the 2D image. In a further embodiment a completion of the ablation procedure is determined in response to presenting an image of a contiguous closed lesion on the 2D image. There is also provided, in accordance with an embodiment of the present invention, an apparatus for displaying data, including a ...",
  "patent_number": "None",
  "abstract": "A method for data display includes acquiring a three-dimensional (3D) map of a lumen inside a body of a subject, transforming the 3D map of the lumen into a two-dimensional (2D) image by projecting the 3D map onto an annulus, and presenting the 2D image on a display screen.",
  "publication_number": "US20180177467A1-20180628",
  "_processing_info": {
    "original_size": 34979,
    "optimized_size": 3154,
    "reduction_percent": 90.98
  }
}