{
  "decision": "REJECTED",
  "application_number": "15382189",
  "date_published": "20170622",
  "date_produced": "20170607",
  "title": "LIGHTING SYSTEM FOR DOORS",
  "filing_date": "20161216",
  "inventor_list": [
    {
      "inventor_name_last": "Kowash",
      "inventor_name_first": "Roger",
      "inventor_city": "Klamath Falls",
      "inventor_state": "OR",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Cooper",
      "inventor_name_first": "James",
      "inventor_city": "Klamath Falls",
      "inventor_state": "OR",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Cox",
      "inventor_name_first": "Randy",
      "inventor_city": "Klamath Falls",
      "inventor_state": "OR",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Riechmann",
      "inventor_name_first": "Mark E.",
      "inventor_city": "Klamath Falls",
      "inventor_state": "OR",
      "inventor_country": "US"
    }
  ],
  "ipcr_labels": [
    "F21V3300",
    "H05B3308",
    "F21V21096",
    "A47B9602",
    "F21S802",
    "E05B1710",
    "E06B728",
    "G06K710",
    "H05B3702",
    "F21S902"
  ],
  "main_ipcr_label": "F21V3300",
  "summary": "<SOH> BRIEF DESCRIPTION OF THE DRAWINGS <EOH>FIG. 1 is a front view of a door with a lighted shelf assembly according to one embodiment. FIG. 2 is a bottom perspective view of a door with a lighted shelf assembly according to another embodiment. FIG. 3 is a partially exploded view of a lighted shelf assembly in accordance with another embodiment. FIG. 4 is an enlarged view of a portion of the lighted shelf assembly of FIG. 3 , illustrating additional detail of a housing structure for an illumination module. FIG. 5 is a view of another embodiment of a lighted shelf assembly. FIG. 6 is a front view of a door with a lighted shelf assembly according to another embodiment. detailed-description description=\"Detailed Description\" end=\"lead\"?",
  "patent_number": "None",
  "abstract": "A lighted shelf assembly for a door arranged to provide illumination for a user to facilitate unlocking and opening a door in low-light conditions. The lighted shelf assembly includes an illumination module supported on or along an underside of the shelf assembly, the module arranged to direct illumination downwardly toward a door lock or knob. The assembly further includes a motion detector operable to detect the presence of a user within its activation field, the motion detector in communication with the illumination module and operable to activate the illumination module upon detection of the user.",
  "publication_number": "US20170175994A1-20170622",
  "_processing_info": {
    "original_size": 30958,
    "optimized_size": 2430,
    "reduction_percent": 92.15
  }
}