{
  "date_produced": "20180608",
  "publication_number": "US20180174039A1-20180621",
  "main_ipcr_label": "G06N308",
  "decision": "PENDING",
  "application_number": "15385170",
  "inventor_list": [
    {
      "inventor_name_last": "Davies",
      "inventor_name_first": "Michael I",
      "inventor_city": "Portland",
      "inventor_state": "OR",
      "inventor_country": "US"
    }
  ],
  "abstract": "Aspects of the embodiments are directed to computationally modeling a filtered temporal spike train trace in the digital domain. A current value of the trace, and a parameter defining temporal behavior of the trace, are each stored. A decay function of the trace is computed based on the parameter and on passage of discrete time increments. Stimulus signaling is received, and an input response function of the trace is computed based on the stimulus signaling. A stochastic computation of the trace decay function may be performed based on a generated randomization value. In some embodiments, a delayed computation of the trace decay function may be performed.",
  "filing_date": "20161220",
  "patent_number": "None",
  "summary": "<SOH> BRIEF DESCRIPTION OF THE DRAWINGS <EOH>FIG. 1A is a high-level block diagram of a model neural core structure. FIG. 1B is a pictorial diagram that illustrates one configuration of multi-compartment neurons and a dendritic accumulation process. FIG. 1C is a pictorial diagram that shows a state structure of multiple compartments; FIG. 2A is a block diagram illustrating state dynamics for a dendritic compartment according to a simple neuron model. FIG. 2B is a block diagram illustrating state dynamics and the dendritic accumulation process for a dendritic compartment according to a multi-compartment neuron model. FIG. 3 is a simplified timing diagram illustrating a trace variable as a function of time, according to an example use case. FIG. 4 is a block diagram illustrating a trace engine according to an illustrative example embodiment. FIG. 5 is a flow diagram illustrating an example process that may be executed by trace engine 402 according to some embodiments. FIGS. 6A-6C provide a pseudocode example of a process of carrying out the computation of a trace variable according to an illustrative embodiment. detailed-description description=\"Detailed Description\" end=\"lead\"?",
  "date_published": "20180621",
  "title": "COMPUTATIONALLY-EFFICIENT SPIKE TRAIN FILTERING",
  "ipcr_labels": [
    "G06N308",
    "G06N3063",
    "G06N304"
  ],
  "_processing_info": {
    "original_size": 86900,
    "optimized_size": 2420,
    "reduction_percent": 97.22
  }
}