{
  "date_produced": "20170621",
  "publication_number": "US20170193356A1-20170706",
  "main_ipcr_label": "G06N3063",
  "decision": "PENDING",
  "application_number": "15389101",
  "inventor_list": [
    {
      "inventor_name_last": "PARK",
      "inventor_name_first": "Sang-Su",
      "inventor_city": "Icheon",
      "inventor_state": "",
      "inventor_country": "KR"
    },
    {
      "inventor_name_last": "LEE",
      "inventor_name_first": "Hyung-Dong",
      "inventor_city": "Icheon",
      "inventor_state": "",
      "inventor_country": "KR"
    }
  ],
  "abstract": "A neuromorphic device includes a synapse. The synapse includes a first electrode, a second electrode spaced apart from the first electrode, an oxygen-containing layer disposed between the first electrode and the second electrode, the oxygen-containing layer including oxygen ions, and a stack structure disposed between the oxygen-containing layer and the second electrode, the stack structure including a plurality of reactive metal layers alternately arranged with a plurality of oxygen diffusion-retarding layers. The plurality of reactive metal layers are capable of reacting with oxygen ions of the oxygen-containing layer. The plurality of oxygen diffusion-retarding layers interfere with a movement of the oxygen ions from the oxygen-containing layer to the plurality of reactive metal layers.",
  "filing_date": "20161222",
  "patent_number": "None",
  "summary": "<SOH> SUMMARY <EOH>Embodiments of the present disclosure are directed to a synapse having enhanced symmetry and linearity, and to a neuromorphic device including the same. In accordance with an embodiment, a synapse includes: a first electrode; a second electrode spaced apart from the first electrode; an oxygen-containing layer disposed between the first electrode and the second electrode, the oxygen-containing layer including oxygen ions; and a stack structure disposed between the oxygen-containing layer and the second electrode, the stack structure including a plurality of reactive metal layers alternately arranged with a plurality of oxygen diffusion-retarding layers, wherein the plurality of reactive metal layers are capable of reacting with oxygen ions of the oxygen-containing layer, and wherein the plurality of oxygen diffusion-retarding layers interfere with a movement of the oxygen ions from the oxygen-containing layer to the plurality of reactive metal layers. In the above embodiment, a dielectric oxide layer is formed or disappears according to a voltage or current applied to the first electrode and the second electrode, the dielectric oxide layer being formed in at least one of the plurality of reactive metal layers at an interface with a corresponding one of the plurality of oxygen diffusion-retarding layers when the at least one of the plurality of reactive metal layers reacts with the oxygen ions. As a thickness of the dielectric oxide layer increases, an electrical conductivity of the synapse decreases, and as the thickness of the dielectric oxide layer decreases, the electrical conductivity of the synapse increases. A thickness of the dielectric oxide layer increases when a number of first electrical pulses applied to the synapse increases, the first electrical pulses having a first polarity, the first electrical pulses being applied to the synapse through the first and second electrodes, and wherein the thickness of the dielectric oxide layer decrea...",
  "date_published": "20170706",
  "title": "SYNAPSE AND A NEUROMORPHIC DEVICE INCLUDING THE SAME",
  "ipcr_labels": [
    "G06N3063"
  ],
  "_processing_info": {
    "original_size": 73090,
    "optimized_size": 3480,
    "reduction_percent": 95.24
  }
}