{
  "date_produced": "20180608",
  "publication_number": "US20180174043A1-20180621",
  "main_ipcr_label": "G06N308",
  "decision": "PENDING",
  "application_number": "15385804",
  "inventor_list": [
    {
      "inventor_name_last": "Po",
      "inventor_name_first": "Ming Jack",
      "inventor_city": "Mountain View",
      "inventor_state": "CA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Co",
      "inventor_name_first": "Christopher",
      "inventor_city": "Saratoga",
      "inventor_state": "CA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Chou",
      "inventor_name_first": "Katherine",
      "inventor_city": "Palo Alto",
      "inventor_state": "CA",
      "inventor_country": "US"
    }
  ],
  "abstract": "Systems and methods of predicting documentation associated with an encounter between attendees are provided. For instance, attendee data indicative of one or more previous visit notes associated with a first attendee can be obtained. The attendee data can be inputted into a machine-learned note prediction model that includes a neural network. The neural network can generate one or more context vectors descriptive of the attendee data. Data indicative of a predicted visit note can be received as output of the machine-learned note prediction model based at least in part on the context vectors. The predicted visit note can include a set of predicted information expected to be included in a subsequently generated visit note associated with the first attendee.",
  "filing_date": "20161220",
  "patent_number": "None",
  "summary": "<SOH> SUMMARY <EOH>Aspects and advantages of embodiments of the present disclosure will be set forth in part in the following description, or may be learned from the description, or may be learned through practice of the embodiments. One example aspect of the present disclosure is directed to a computer-implemented method of predicting documentation associated with an encounter between attendees. The method includes obtaining, by one or more computing devices, attendee data indicative of one or more previously generated visit notes associated with a first attendee of an encounter. The method further includes inputting, by the one or more computing devices, the attendee data into a machine-learned note prediction model comprising a neural network. The method further includes receiving as output of the machine-learned note prediction model, by the one or more computing devices, data indicative of a predicted visit note, the predicted visit note comprising a set of predicted information expected to be included in a subsequently generated visit note associated with the first attendee. Other example aspects of the present disclosure are directed to systems, apparatus, tangible, non-transitory computer-readable media, user interfaces, memory devices, and electronic devices for predicting visit notes. These and other features, aspects and advantages of various embodiments will become better understood with reference to the following description and appended claims. The accompanying drawings, which are incorporated in and constitute a part of this specification, illustrate embodiments of the present disclosure and, together with the description, serve to explain the related principles.",
  "date_published": "20180621",
  "title": "GENERATING TEMPLATED DOCUMENTS USING MACHINE LEARNING TECHNIQUES",
  "ipcr_labels": [
    "G06N308",
    "G06N502"
  ],
  "_processing_info": {
    "original_size": 71434,
    "optimized_size": 3330,
    "reduction_percent": 95.34
  }
}