{
  "date_produced": "20170607",
  "publication_number": "US20170178030A1-20170622",
  "main_ipcr_label": "G06N9900",
  "decision": "PENDING",
  "application_number": "15385295",
  "inventor_list": [
    {
      "inventor_name_last": "Pal",
      "inventor_name_first": "Biplab",
      "inventor_city": "Ellicott City",
      "inventor_state": "MD",
      "inventor_country": "US"
    }
  ],
  "abstract": "A field learning system comprising a system of feedback uses a user interface in web based and mobile applications to overcome the difficulty and infeasibility of supervised machine learning systems used for modeling failure states of machines",
  "filing_date": "20161220",
  "patent_number": "None",
  "summary": "<SOH> BACKGROUND OF THE INVENTION AND SUMMARY OF THE PRIOR ART <EOH>Machine condition based monitoring is growing in use to reduce downtime of machines resulting from unplanned breakdowns. See, for example, Jaouher Ben Ali, Nader Fnaiech, Lotfi Saidi, Brigitte Chebel-Morello, Farhat Fnaiech, Application of empirical mode decomposition and artificial neural network for automatic bearing fault diagnosis based on vibration signals , Applied Acoustics, 20 Sep. 2014. To predict machine failures well in advance so that the machine operators can take adequate steps in advance of any failure to repair the relevant machine, predictive models of the failure modes of the machines are required. Heretofore such predictive models have been built from time series data using appropriate sensor technology for a given physical parameter. For vibration see, for example, C. Lu, J. A. Stankovic, G. Tao, Design and Evaluation of a Feedback Control EDF Scheduling Algorithm ; Transactions of the IEEE, 3 Dec. 1999. For sound see, for example, Widodo A., Yang B., Support Vector Machine in Machine Condition Monitoring and Fault Diagnosis, 2007. For infrared temperature see, for example, P. K. Kankar, Satish C. Sharma, S. P. Harsha, Fault Diagnosis of Ball Bearings Using Machine Learning Methods , Expert Systems with Applications, Volume 38, Issue 3, March 2011, Pages 1876-1886. Known conventional systems for automated detection of machine failure states depend on supervised learning. See, for example, Polycarpou et al., Automated Fault Detection and Accommodation: a Learning Systems Approach , IEEE Transactions on Systems, Management, and Cybernetics, 1995. In such systems, a “training file” is required containing prior data regarding operating and failure states of the relevant machine. However, “training” data needed to construct such a “training file” for machine failure modes is not, as a practical matter, available in wide range of situations such as where the physical parameter sensor h...",
  "date_published": "20170622",
  "title": "METHOD, SYSTEM AND APPARATUS USING FIELD LEARNING TO UPGRADE TRENDING SENSOR CURVES INTO FUEL GAUGE BASED VISUALIZATION OF PREDICTIVE MAINTENANCE BY USER DRIVEN FEEDBACK MECHANISM",
  "ipcr_labels": [
    "G06N9900",
    "G06F1750",
    "G06N504"
  ],
  "_processing_info": {
    "original_size": 51739,
    "optimized_size": 2967,
    "reduction_percent": 94.27
  }
}