{
  "date_produced": "20180608",
  "publication_number": "US20180174070A1-20180621",
  "main_ipcr_label": "G06N9900",
  "decision": "PENDING",
  "application_number": "15381637",
  "inventor_list": [
    {
      "inventor_name_last": "HOFFMAN",
      "inventor_name_first": "MATTHEW",
      "inventor_city": "San Francisco",
      "inventor_state": "CA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "YANG",
      "inventor_name_first": "LONGQI",
      "inventor_city": "New York",
      "inventor_state": "NY",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "JIN",
      "inventor_name_first": "HAILIN",
      "inventor_city": "San Jose",
      "inventor_state": "CA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "FANG",
      "inventor_name_first": "CHEN",
      "inventor_city": "San Jose",
      "inventor_state": "CA",
      "inventor_country": "US"
    }
  ],
  "abstract": "This disclosure involves personalizing user experiences with electronic content based on application usage data. For example, a user representation model that facilitates content recommendations is iteratively trained with action histories from a content manipulation application. Each iteration involves selecting, from an action history for a particular user, an action sequence including a target action. An initial output is computed in each iteration by applying a probability function to the selected action sequence and a user representation vector for the particular user. The user representation vector is adjusted to maximize an output that is generated by applying the probability function to the action sequence and the user representation vector. This iterative training process generates a user representation model, which includes a set of adjusted user representation vectors, that facilitates content recommendations corresponding to users' usage pattern in the content manipulation ...",
  "filing_date": "20161216",
  "patent_number": "None",
  "summary": "<SOH> SUMMARY <EOH>Certain embodiments involve personalizing user experiences with electronic content based on user representations learned from application usage data. For example, a user representation model that facilitates content recommendations is iteratively trained with action histories from a content manipulation application. Each iteration involves selecting, from an action history for a particular user, an action sequence including a target action. An initial output is computed in each iteration by applying a probability function to the selected action sequence and a user representation vector for the particular user. The user representation vector is adjusted to maximize an output that is generated by applying the probability function to the action sequence and the user representation vector. This iterative training process generates a user representation model, which includes a set of adjusted user representation vectors, that facilitates content recommendations corresponding to users' usage pattern in the content manipulation application. These illustrative embodiments are mentioned not to limit or define the disclosure, but to provide examples to aid understanding thereof. Additional embodiments are discussed in the Detailed Description, and further description is provided there.",
  "date_published": "20180621",
  "title": "Personalizing User Experiences With Electronic Content Based on User Representations Learned from Application Usage Data",
  "ipcr_labels": [
    "G06N9900",
    "G06N700"
  ],
  "_processing_info": {
    "original_size": 114829,
    "optimized_size": 3372,
    "reduction_percent": 97.06
  }
}