{
  "decision": "PENDING",
  "application_number": "15386575",
  "date_published": "20170406",
  "date_produced": "20170323",
  "title": "METHOD FOR AUTOMATICALLY INSTALLING APPLICATION INTO PERSONAL COMPUTER",
  "filing_date": "20161221",
  "inventor_list": [
    {
      "inventor_name_last": "Pu",
      "inventor_name_first": "Cheng-Hui",
      "inventor_city": "Taipei",
      "inventor_state": "",
      "inventor_country": "TW"
    }
  ],
  "ipcr_labels": [
    "G06F9445",
    "H04W400",
    "H04L2908"
  ],
  "main_ipcr_label": "G06F9445",
  "summary": "<SOH> SUMMARY OF THE INVENTION <EOH>The following presents a simplified summary of the disclosure in order to provide a basic understanding to the reader. This summary is not an extensive overview of the disclosure and it does not identify key/critical elements of the present invention or delineate the scope of the present invention. One aspect of the present disclosure is directed to a method for automatically installing an application into a personal computer, wherein the personal computer is based on a first OS system and has at least one port actuated by a first driver in the personal computer, wherein the method comprises steps of: (a) detecting whether a mobile device is electrically coupled to the at least one port of the personal computer through a USB cable comprising a memory which stores the application to proceed to step (b) if the mobile device is electrically coupled to the personal computer through the USB cable, or to repeat step (a) if the mobile device is not electrically coupled to the personal computer through the USB cable, wherein the mobile device is based on a second OS system; (b) installing the application comprising a second driver in the personal computer to substitute for the first driver to control the at least one port; (c) sending a command to the mobile device to make the personal computer as an accessory device for the mobile device based on the second OS system; (d) detecting whether the mobile device has a predetermined program to proceed to step (e) if the mobile device does not have the predetermined program; (e) downloading and installing the predetermined program into the mobile device; and (f) transmitting the predetermined program to the personal computer, and installing the predetermined program into the personal computer. In view of the foregoing, embodiments of the present disclosure provide a method for automatically installing the application into the personal computer to improve the problems that the capacity of the me...",
  "patent_number": "None",
  "abstract": "A method for automatically installing an application into a personal computer is provided herein. The personal computer has a port actuated by a first driver in the personal computer. The method includes steps of: (a) detecting whether a mobile device is electrically coupled to the port of the personal computer through a USB cable including a memory which stores the application; (b) installing the application including a second driver in the personal computer to substitute for the first driver to control the port; (c) sending a command to the mobile device to make the personal computer as an accessory device for the mobile device based on the second OS system; (d) detecting whether the mobile device has a predetermined program; (e) downloading and installing the predetermined program in the mobile device; and (f) transmitting and installing the predetermined program into the personal computer.",
  "publication_number": "US20170097817A1-20170406",
  "_processing_info": {
    "original_size": 22684,
    "optimized_size": 3484,
    "reduction_percent": 84.64
  }
}