{
  "decision": "PENDING",
  "application_number": "15382131",
  "date_published": "20170810",
  "date_produced": "20170726",
  "title": "METHODS AND SYSTEMS FOR INTERACTIVE MARKETING CAMPAIGNS AND ANALYTICS",
  "filing_date": "20161216",
  "inventor_list": [
    {
      "inventor_name_last": "Morton",
      "inventor_name_first": "David J.",
      "inventor_city": "Dover",
      "inventor_state": "MA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "DiPippo",
      "inventor_name_first": "Vincent J.",
      "inventor_city": "Johnston",
      "inventor_state": "RI",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Katzeff",
      "inventor_name_first": "Carl R.",
      "inventor_city": "Chestnut Hill",
      "inventor_state": "MA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Delaney",
      "inventor_name_first": "Christopher J.",
      "inventor_city": "Hopkinton",
      "inventor_state": "MA",
      "inventor_country": "US"
    }
  ],
  "ipcr_labels": [
    "G06Q3002",
    "G06Q5000",
    "G06Q1010"
  ],
  "main_ipcr_label": "G06Q3002",
  "summary": "<SOH> SUMMARY OF THE INVENTION <EOH>Embodiments of the invention enables a web-based, integrated platform for engagement automation, content creation/management, and data collection. Web-based system embodiments can send customized content or campaigns through a plurality of channels including email and social media networks, collect and analyze data related to a bi-directional engagement campaign, issue reports providing information on the behavior and response of recipients of the engagement material, inform modifications to the engagement campaign and leverage automated workflow, and create dynamic groups to be targeted based on analyzed data and information. One example embodiment of the invention is a computer system for bi-directional customer engagement. The system includes a processor configured to provide one or more templates that embody behavioral scientific engagement patterns paired with one or more visual layouts and content designs, and an interface coupled to the processor and configured to provide, in conjunction with the processor, a set of questions from which one or more questions are to be incorporated in engagement campaign material designed to elicit prospect engagement with a customer and identify prospect behavior of the customer. Another example embodiment of the invention is a computer implemented method of bi-directional customer engagement. The method includes providing, by a processor, one or more templates that embody behavioral scientific engagement patterns paired with one or more visual layouts and content designs, and providing, by the processor and an interface, a set of questions from which one or more questions are to be incorporated in engagement campaign material designed to elicit prospect engagement with a customer and identify prospect behavior of the customer. The system or method may adaptively suggest questions for inclusion in the engagement campaign material based on criteria entered, questions that have been used prev...",
  "patent_number": "None",
  "abstract": "Computer methods and systems create customer engagement marketing material. Features include qualifying and engaging customers and prospects through interactive marketing campaigns and analytics. Embodiments of the invention can provide a web-based, integrated platform for engagement automation, content creation/management, and data collection. Web-based system embodiments can send customized content or campaigns through a plurality of channels including email and social media networks, collect and analyze data related to a bi-directional engagement campaign, issue reports providing information on the behavior and response of recipients of the engagement material, inform modifications to the engagement campaign and leverage automated workflow, and create dynamic groups to be targeted based on analyzed data and information.",
  "publication_number": "US20170228767A1-20170810",
  "_processing_info": {
    "original_size": 25696,
    "optimized_size": 3876,
    "reduction_percent": 84.92
  }
}