{
  "date_produced": "20170726",
  "publication_number": "US20170228661A1-20170810",
  "main_ipcr_label": "G06N9900",
  "decision": "PENDING",
  "application_number": "15381564",
  "inventor_list": [
    {
      "inventor_name_last": "Chien",
      "inventor_name_first": "Yung-Hsin",
      "inventor_city": "Apex",
      "inventor_state": "NC",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Wang",
      "inventor_name_first": "Pu",
      "inventor_city": "Charlotte",
      "inventor_state": "NC",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Li",
      "inventor_name_first": "Yue",
      "inventor_city": "Raleigh",
      "inventor_state": "NC",
      "inventor_country": "US"
    }
  ],
  "abstract": "Systems and methods are provided for performing data mining and statistical learning techniques on a big data set. More specifically, systems and methods are provided for linear regression using safe screening techniques. Techniques may include receiving a plurality of time series included in a prediction hierarchy for performing statistical learning to develop an improved prediction hierarchy. It may include pre-processing data associated with each of the plurality of time series, wherein the pre-processing includes tasks performed in parallel using a grid-enabled computing environment. For each time series, the system may determine a classification for the individual time series, a pattern group for the individual time series, and a level of the prediction hierarchy at which the each individual time series comprises an need output amount greater than a threshold amount. The computing system may generate an additional prediction hierarchy using the first prediction hierarchy, the clas...",
  "filing_date": "20161216",
  "patent_number": "None",
  "summary": "<SOH> SUMMARY <EOH>In accordance with the teachings provided herein, systems and methods for improving the accuracy and the efficiency of prediction processes. Certain aspects of the disclosed subject matter relate to a system that has the capability to automatically add to its current integrated collection of facts and relationships. This system may use induction, deduction, applications involving learning (i.e., data mining and knowledge discovery) and statistical learning techniques. For example, a system or method may include performing data mining and statistical learning techniques on a big data set, for example using a grid-enabled computing environment.",
  "date_published": "20170810",
  "title": "SYSTEMS AND METHODS FOR MACHINE LEARNING USING CLASSIFYING, CLUSTERING, AND GROUPING TIME SERIES DATA",
  "ipcr_labels": [
    "G06N9900",
    "G06F1730",
    "G06N504"
  ],
  "_processing_info": {
    "original_size": 173029,
    "optimized_size": 2560,
    "reduction_percent": 98.52
  }
}