{
  "date_produced": "20170607",
  "publication_number": "US20170178018A1-20170622",
  "main_ipcr_label": "G06N9900",
  "decision": "PENDING",
  "application_number": "15382278",
  "inventor_list": [
    {
      "inventor_name_last": "Tcaciuc",
      "inventor_name_first": "Alexandr M.",
      "inventor_city": "New Westminster",
      "inventor_state": "",
      "inventor_country": "CA"
    },
    {
      "inventor_name_last": "de Buen",
      "inventor_name_first": "Pedro A.",
      "inventor_city": "Coquitlam",
      "inventor_state": "",
      "inventor_country": "CA"
    },
    {
      "inventor_name_last": "Spear",
      "inventor_name_first": "Peter D.",
      "inventor_city": "Burnaby",
      "inventor_state": "",
      "inventor_country": "CA"
    },
    {
      "inventor_name_last": "Uchaykin",
      "inventor_name_first": "Sergey V.",
      "inventor_city": "Vancouver",
      "inventor_state": "",
      "inventor_country": "CA"
    },
    {
      "inventor_name_last": "Enderud",
      "inventor_name_first": "Colin C.",
      "inventor_city": "Vancouver",
      "inventor_state": "",
      "inventor_country": "CA"
    },
    {
      "inventor_name_last": "Neufeld",
      "inventor_name_first": "Richard D.",
      "inventor_city": "Burnaby",
      "inventor_state": "",
      "inventor_country": "CA"
    },
    {
      "inventor_name_last": "Hilton",
      "inventor_name_first": "Jeremy P.",
      "inventor_city": "Vancouver",
      "inventor_state": "",
      "inventor_country": "CA"
    },
    {
      "inventor_name_last": "Petroff",
      "inventor_name_first": "J. Craig",
      "inventor_city": "Burnaby",
      "inventor_state": "",
      "inventor_country": "CA"
    },
    {
      "inventor_name_last": "Kamdar",
      "inventor_name_first": "Amar B.",
      "inventor_city": "Burnaby",
      "inventor_state": "",
      "inventor_country": "CA"
    },
    {
      "inventor_name_last": "Peregrym",
      "inventor_name_first": "Gregory D.",
      "inventor_city": "Port Moody",
      "inventor_state": "",
      "inventor_country": "CA"
    },
    {
      "inventor_name_last": "Kan",
      "inventor_name_first": "Edmond Ho Yin",
      "inventor_city": "Burnaby",
      "inventor_state": "",
      "inventor_country": "CA"
    },
    {
      "inventor_name_last": "Swenson",
      "inventor_name_first": "Loren J.",
      "inventor_city": "Burnaby",
      "inventor_state": "",
      "inventor_country": "CA"
    },
    {
      "inventor_name_last": "Sterling",
      "inventor_name_first": "George E.G.",
      "inventor_city": "Vancouver",
      "inventor_state": "",
      "inventor_country": "CA"
    },
    {
      "inventor_name_last": "Citver",
      "inventor_name_first": "Gregory",
      "inventor_city": "Richmond",
      "inventor_state": "",
      "inventor_country": "CA"
    }
  ],
  "abstract": "An electrical filter includes a dielectric substrate with inner and outer coils about a first region and inner and outer coils about a second region, a portion of cladding removed from wires that form the coils and coupled to electrically conductive traces on the dielectric substrate via a solder joint in a switching region. An apparatus to thermally couple a superconductive device to a metal carrier with a through-hole includes a first clamp and a vacuum pump. A composite magnetic shield for use at superconductive temperatures includes an inner layer with magnetic permeability of at least 50,000; and an outer layer with magnetic saturation field greater than 1.2 T, separated from the inner layer by an intermediate layer of dielectric. An apparatus to dissipate heat from a superconducting processor includes a metal carrier with a recess, a post that extends upwards from a base of the recess and a layer of adhesive on top of the post. Various cryogenic refrigeration systems are describe...",
  "filing_date": "20161216",
  "patent_number": "None",
  "summary": "<SOH> BRIEF SUMMARY <EOH>A method of fabricating an electrical filter for use with differential signals may be summarized as including: winding a first length of wire about a first region of a dielectric substrate, to form a first inner coil of wire, wherein the first length of wire includes a first wire core and a first resistive cladding; winding the first length of wire about a second region of the dielectric substrate, to form a second inner coil of wire, wherein the first and the second regions of the dielectric substrate are separated by a switching region of the dielectric substrate; winding a second length of wire around the first inner coil of wire, to form a first outer coil of wire, wherein the second length of wire includes a second wire core and a second resistive cladding; winding the second length of wire around the second inner coil of wire, to form a second outer coil of wire; exposing a portion of the first and the second wire core in the switching region by removing a first portion of the first and the second resistive cladding, respectively, and tapering a second portion of the first and the second resistive cladding on each side of the first portion of the first and the second wire cladding, respectively; soldering the first and the second lengths of wire to each of a first and a second conductive trace in the switching region to form a solder joint, wherein the solder joint overlies the exposed portion of the first and the second wire core, and overlies the tapered portion of the first and the second cladding, and wherein the solder joint electrically couples the first and the second wire cores to the first and the second conductive traces, and mechanically couples the first and the second lengths of wire to the switching region; and cutting each of the first and the second lengths of wire between the first and the second conductive trace, to form a first conductive signal path including the first inner coil of wire and the second outer coil of...",
  "date_published": "20170622",
  "title": "SYSTEMS, METHODS AND APPARATUS FOR USE WITH SUPERCONDUCTING BASED COMPUTING SYSTEMS",
  "ipcr_labels": [
    "G06N9900",
    "H01L3912",
    "H01L3924",
    "H05K334",
    "H05K900",
    "F25B4300",
    "H01L3918",
    "H01F4106",
    "H01F4104",
    "H01F1300",
    "F25B912",
    "H03H300",
    "H05K102"
  ],
  "_processing_info": {
    "original_size": 288304,
    "optimized_size": 5644,
    "reduction_percent": 98.04
  }
}