{
  "date_produced": "20170329",
  "publication_number": "US20170103316A1-20170413",
  "main_ipcr_label": "G06N308",
  "decision": "ACCEPTED",
  "application_number": "15389303",
  "inventor_list": [
    {
      "inventor_name_last": "Ross",
      "inventor_name_first": "Jonathan",
      "inventor_city": "Mountain View",
      "inventor_state": "CA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Phelps",
      "inventor_name_first": "Andrew Everett",
      "inventor_city": "Middleton",
      "inventor_state": "WI",
      "inventor_country": "US"
    }
  ],
  "abstract": "Methods, systems, and apparatus, including computer programs encoded on computer storage media, for computing a layer output for a convolutional neural network layer, the method comprising: receiving the layer input, the layer input comprising a plurality of activation inputs, the plurality of activation inputs represented as a multi-dimensional matrix comprising a plurality of depth levels, each depth level being a respective matrix of distinct activation inputs from the plurality of activation inputs; sending each respective kernel matrix structure to a distinct cell along a first dimension of the systolic array; for each depth level, sending the respective matrix of distinct activation inputs to a distinct cell along a second dimension of the systolic array; causing the systolic array to generate an accumulated output from the respective matrices sent to the cells; and generating the layer output from the accumulated output.",
  "filing_date": "20161222",
  "patent_number": "9697463",
  "summary": "<SOH> SUMMARY <EOH>In general, this specification describes a special-purpose hardware circuit that computes neural network inferences. In general, one innovative aspect of the subject matter described in this specification can be embodied in methods that include the actions of computing a layer output for a convolutional neural network layer from a layer input using a two-dimensional systolic array, the convolutional neural network layer having a plurality of kernels, each kernel having a respective matrix structure of weights, the method comprising: receiving the layer input, the layer input comprising a plurality of activation inputs, the plurality of activation inputs represented as a multi-dimensional matrix comprising a plurality of depth levels, each depth level being a respective matrix of distinct activation inputs from the plurality of activation inputs; sending each respective kernel matrix structure to a distinct cell along a first dimension of the systolic array; for each depth level, sending the respective matrix of distinct activation inputs to a distinct cell along a second dimension of the systolic array; causing the systolic array to generate an accumulated output from the respective matrices sent to the cells; and generating the layer output from the accumulated output. Implementations can include one or more of the following features. The first dimension of the systolic array corresponds to columns of the systolic array, and where the second dimension of the systolic array corresponds to rows of the systolic array. Determining that a count of the plurality of activation inputs is less than a size of the second dimension of the systolic array; sending one or more duplicate matrices of distinct activation inputs to unused cells along the second dimension of the systolic array. Determining that a count of the plurality of kernels is less than a size of the first dimension of the systolic array; sending one or more duplicate kernel matrix structures ...",
  "date_published": "20170413",
  "title": "COMPUTING CONVOLUTIONS USING A NEURAL NETWORK PROCESSOR",
  "ipcr_labels": [
    "G06N308",
    "G06N504"
  ],
  "_processing_info": {
    "original_size": 72525,
    "optimized_size": 3659,
    "reduction_percent": 94.95
  }
}