{
  "date_produced": "20170927",
  "publication_number": "US20170293843A1-20171012",
  "main_ipcr_label": "G06N502",
  "decision": "PENDING",
  "application_number": "15386521",
  "inventor_list": [
    {
      "inventor_name_last": "Shanabrook",
      "inventor_name_first": "Susan Carol",
      "inventor_city": "Safety Harbor",
      "inventor_state": "FL",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Stevens",
      "inventor_name_first": "Richard Alan",
      "inventor_city": "Odessa",
      "inventor_state": "FL",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Kimble",
      "inventor_name_first": "Ron H.",
      "inventor_city": "Lutz",
      "inventor_state": "FL",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Cadden",
      "inventor_name_first": "Michael P.",
      "inventor_city": "Lutz",
      "inventor_state": "FL",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Corson",
      "inventor_name_first": "Travis D.",
      "inventor_city": "Tampa",
      "inventor_state": "FL",
      "inventor_country": "US"
    }
  ],
  "abstract": "In accordance with embodiments, there are provided mechanisms and methods for messaging in an on-demand database service. These mechanisms and methods for messaging in an on-demand database service can enable embodiments to more flexibly message in on-demand database environments. The ability of embodiments to provide such feature may lead to enhanced messaging features which may be used for providing more effective ways of messaging in the context of on-demand databases.",
  "filing_date": "20161221",
  "patent_number": "None",
  "summary": "<SOH> BRIEF SUMMARY <EOH>In accordance with embodiments, there are provided mechanisms and methods for messaging in an on-demand database service. These mechanisms and methods for messaging in an on-demand database service can enable embodiments to more flexibly message in on-demand database environments. The ability of embodiments to provide such feature may lead to enhanced messaging features which may be used for providing more effective ways of messaging in the context of on-demand databases. In an embodiment and by way of example, a method is provided for messaging in an on-demand database service. In use, a message is received using an on-demand database service, on behalf of an entity. Additionally, a security criterion retrieved from a portion of an on-demand database limited to information of the entity is applied. Furthermore, a rule for processing the message if the message successfully meets the security criterion is retrieved. While the present invention is described with reference to an embodiment in which techniques for messaging in an on-demand database service are implemented in an application server providing a front end for a multi-tenant database on-demand service, the present invention is not limited to multi-tenant databases or deployment on application servers. Embodiments may be practiced using other database architectures, i.e., ORACLE®, DB2® and the like without departing from the scope of the embodiments claimed. Any of the above embodiments may be used alone or together with one another in any combination. Inventions encompassed within this specification may also include embodiments that are only partially mentioned or alluded to or are not mentioned or alluded to at all in this brief summary or in the abstract. Although various embodiments of the invention may have been motivated by various deficiencies with the prior art, which may be discussed or alluded to in one or more places in the specification, the embodiments of the invention do...",
  "date_published": "20171012",
  "title": "SYSTEM, METHOD AND COMPUTER PROGRAM PRODUCT FOR MESSAGING IN AN ON-DEMAND DATABASE SERVICE",
  "ipcr_labels": [
    "G06N502",
    "H04L1258",
    "G06F2160"
  ],
  "_processing_info": {
    "original_size": 56631,
    "optimized_size": 3687,
    "reduction_percent": 93.49
  }
}