{
  "date_produced": "20170621",
  "publication_number": "US20170193365A1-20170706",
  "main_ipcr_label": "G06N308",
  "decision": "PENDING",
  "application_number": "15389189",
  "inventor_list": [
    {
      "inventor_name_last": "PARK",
      "inventor_name_first": "Sang-Su",
      "inventor_city": "Icheon",
      "inventor_state": "",
      "inventor_country": "KR"
    },
    {
      "inventor_name_last": "LEE",
      "inventor_name_first": "Hyung-Dong",
      "inventor_city": "Icheon",
      "inventor_state": "",
      "inventor_country": "KR"
    }
  ],
  "abstract": "A neuromorphic device includes a synapse. The synapse, according to an embodiment, includes a first electrode, a second electrode spaced apart from the first electrode, an oxygen-containing layer disposed between the first electrode and the second electrode, the oxygen-containing layer including oxygen ions, and a reactive metal layer disposed between the oxygen-containing layer and the second electrode. The oxygen-containing layer includes oxygen ions. The reactive metal layer is capable of reacting with the oxygen ions of the oxygen-containing layer. A width of the reactive metal layer decreases along a direction toward the oxygen-containing layer from the second electrode.",
  "filing_date": "20161222",
  "patent_number": "None",
  "summary": "<SOH> SUMMARY <EOH>Embodiments of the present disclosure are directed to a synapse having enhanced symmetry and linearity, and to a neuromorphic device including the same. In accordance with an embodiment, a synapse includes: a first electrode; a second electrode spaced apart from the first electrode; an oxygen-containing layer disposed between the first electrode and the second electrode, the oxygen-containing layer including oxygen ions; and a reactive metal layer disposed between the oxygen-containing layer and the second electrode, the reactive metal layer being capable of reacting with the oxygen ions of the oxygen-containing layer, and wherein a width of the reactive metal layer decreases along a direction toward the oxygen-containing layer from the second electrode. In the above embodiment, the synapse further comprises: an insulating layer disposed against a side surface of the reactive metal layer and disposed between the first electrode and the second electrode, the insulating layer encircling the reactive metal layer. A side surface of the reactive metal layer extends between the first electrode and the second electrode at an oblique angle. A side surface of the reactive metal layer extends between the first electrode and the second electrode, the side surface having a stair shape. The reactive metal layer includes a first portion and a second portion, a width of the first portion of the reactive metal layer being substantially constant from the second electrode to a certain distance from the second electrode, a width of the second portion decreasing from the certain distance to the oxygen-containing layer. A dielectric oxide layer forms or disappears according to a voltage or current applied through the first electrode and the second electrode, the dielectric oxide layer being formed in the reactive metal layer at an interface between the reactive metal layer and the oxygen-containing layer by a reaction between the reactive metal layer and the oxygen io...",
  "date_published": "20170706",
  "title": "SYNAPSE AND NEUROMORPHIC DEVICE INCLUDING THE SAME",
  "ipcr_labels": [
    "G06N308",
    "G06N3063",
    "H01L2724"
  ],
  "_processing_info": {
    "original_size": 80436,
    "optimized_size": 3384,
    "reduction_percent": 95.79
  }
}