{
  "date_produced": "20180613",
  "publication_number": "US20180181876A1-20180628",
  "main_ipcr_label": "G06N9900",
  "decision": "PENDING",
  "application_number": "15388097",
  "inventor_list": [
    {
      "inventor_name_last": "Zhuo",
      "inventor_name_first": "Keenan",
      "inventor_city": "Beaverton",
      "inventor_state": "OR",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Sindia",
      "inventor_name_first": "Suraj",
      "inventor_city": "Hillsboro",
      "inventor_state": "OR",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Ascazubi",
      "inventor_name_first": "Ricardo",
      "inventor_city": "Portland",
      "inventor_state": "OR",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Gill",
      "inventor_name_first": "Balkaran",
      "inventor_city": "Cornelius",
      "inventor_state": "OR",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "VanDam",
      "inventor_name_first": "Clark",
      "inventor_city": "Hillsboro",
      "inventor_state": "OR",
      "inventor_country": "US"
    }
  ],
  "abstract": "Various implementations provide an aquatic conditions optimization management system accesses aquatic sensor data generated by one or more aquatic sensors, identifies a collection of aquatic data that includes data generated by and collected from the aquatic sensor(s), generates a set of cross-correlation matrices based on the collection of aquatic data, executes a set of unsupervised machine learning algorithms using the set of cross-correlation matrices, and determines one or more optimum conditions for one or more aquatic resources based on the executed set of unsupervised machine learning algorithms. The optimum condition(s) may be communicated to one or more individuals and may include one or more corrective actions to improve one or more of the aquatic resources.",
  "filing_date": "20161222",
  "patent_number": "None",
  "summary": "<SOH> BRIEF DESCRIPTION OF THE DRAWINGS <EOH>FIG. 1A illustrates an embodiment of a system including multiple sensor devices and an example management system. FIG. 1B illustrates an embodiment of an example cloud computing network. FIG. 2 illustrates an embodiment of a system including an example management system. FIGS. 3A-3D are simplified graphs illustrating examples of various ensembles of aquatic sensor data. FIG. 4 is a simplified diagram illustrating an example epoch cross-correlation matrix. FIG. 5 is a simplified diagram illustrating example outputs related to the health of one or more aquatic resources. FIG. 6 illustrates an example system including multiple sensor devices deployed in multiple aquatic resources. FIG. 7 illustrates an example flow diagram of an aquatic resource management application. FIG. 8 a simplified block diagram illustrating an example device to manage one or more aquatic resources. FIG. 9 illustrates simple map 900 that illustrates a geographic region including indications of health for multiple aquatic resources. FIG. 10 is a flowchart illustrating an example method to determine one or more optimal conditions for one or more aquatic resources. FIG. 11 is flowchart illustrating an example method to determine one or more levels of health for one or more aquatic resources. FIG. 12 is a block diagram of an exemplary processor in accordance with one embodiment. FIG. 13 is a block diagram of an exemplary computing system in accordance with one embodiment. detailed-description description=\"Detailed Description\" end=\"lead\"? Like reference numbers and designations in the various drawings indicate like elements.",
  "date_published": "20180628",
  "title": "UNSUPERVISED MACHINE LEARNING TO MANAGE AQUATIC RESOURCES",
  "ipcr_labels": [
    "G06N9900",
    "G06N504"
  ],
  "_processing_info": {
    "original_size": 118800,
    "optimized_size": 3588,
    "reduction_percent": 96.98
  }
}