{
  "decision": "PENDING",
  "application_number": "15380730",
  "date_published": "20180621",
  "date_produced": "20180608",
  "title": "METHOD AND APPARATUS FOR PROVIDING A COMMUNICATIONS SERVICE USING A LOW POWERED RADIO TAG",
  "filing_date": "20161215",
  "inventor_list": [
    {
      "inventor_name_last": "SCHLEEF",
      "inventor_name_first": "THOMAS",
      "inventor_city": "Richardson",
      "inventor_state": "TX",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Lee",
      "inventor_name_first": "Craig",
      "inventor_city": "Frisco",
      "inventor_state": "TX",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Bradee",
      "inventor_name_first": "William Francis",
      "inventor_city": "Plano",
      "inventor_state": "TX",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Cook",
      "inventor_name_first": "Matthew J.",
      "inventor_city": "Plano",
      "inventor_state": "TX",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Marten",
      "inventor_name_first": "David Gordon",
      "inventor_city": "Sachse",
      "inventor_state": "TX",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "McConney",
      "inventor_name_first": "Rick",
      "inventor_city": "Plano",
      "inventor_state": "TX",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Martin",
      "inventor_name_first": "Steve",
      "inventor_city": "Plano",
      "inventor_state": "TX",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Neibaur",
      "inventor_name_first": "Wesley B.",
      "inventor_city": "Flower Mound",
      "inventor_state": "TX",
      "inventor_country": "US"
    }
  ],
  "ipcr_labels": [
    "G06K1907",
    "H04W5202",
    "G06Q1008"
  ],
  "main_ipcr_label": "G06K1907",
  "summary": "<SOH> SUMMARY OF THE DISCLOSURE <EOH>In one embodiment, the present disclosure discloses a radio tag, e.g., a low powered radio tag, and a method for providing a communications service. For example, a radio tag is operable to be attached to an item, the radio tag comprising a first radio comprising a first antenna, wherein the first radio is for listening for a wake-up signal in an idle state, a second radio, coupled to the first radio, the second radio comprising a second antenna, wherein the second radio is for transmitting or receiving data, wherein the radio tag operates using a carrier signal in a pre-determined frequency range for communicating with a device located within a pre-determined distance from the radio tag, a power source, a processor; and a computer-readable storage medium storing a plurality of instructions which, when executed by the processor, cause the processor to perform operations. The operations comprising entering an active state of the radio tag and activating the second radio when the wake-up signal is received, where the second radio draws power from the power source, transmitting the data to the device or receiving the data from the device when the radio tag is in the active state, and deactivating the second radio and entering the idle state when the wake-up signal is no longer being received, where only the first radio draws power from the power source. In another example, a method for operating a radio tag having a first radio and a second radio is disclosed. For example, the method comprises entering, by a processor of the radio tag, an active state of the radio tag and activating the second radio when a wake-up signal is received, where the second radio draws power from a power source, transmitting, by the processor of the radio tag, data to a device or receiving the data from the device when the radio tag is in the active state, and deactivating, by the processor of the radio tag, the second radio and entering an idle state when ...",
  "patent_number": "None",
  "abstract": "A radio tag comprising a first radio and a second radio and a method for providing a communications service are disclosed. For example, the method comprises entering, by a processor of the radio tag, an active state of the radio tag and activating the second radio when a wake-up signal is received, where the second radio draws power from a power source, transmitting, by the processor of the radio tag, data to a device or receiving the data from the device when the radio tag is in the active state, and deactivating, by the processor of the radio tag, the second radio and entering an idle state when the wake-up signal is no longer being received, where only the first radio draws power from the power source for listening for the wake-up signal in the idle state.",
  "publication_number": "US20180174009A1-20180621",
  "_processing_info": {
    "original_size": 59819,
    "optimized_size": 4401,
    "reduction_percent": 92.64
  }
}