{
  "decision": "PENDING",
  "application_number": "15385532",
  "date_published": "20170622",
  "date_produced": "20170607",
  "title": "SYSTEM AND METHOD TO MODIFY DISPLAY OF AUGMENTED REALITY CONTENT",
  "filing_date": "20161220",
  "inventor_list": [
    {
      "inventor_name_last": "BHURUTH",
      "inventor_name_first": "Berty Jacques Alain",
      "inventor_city": "Bankstown",
      "inventor_state": "",
      "inventor_country": "AU"
    },
    {
      "inventor_name_last": "YEE",
      "inventor_name_first": "Belinda Margaret",
      "inventor_city": "Balmain",
      "inventor_state": "",
      "inventor_country": "AU"
    },
    {
      "inventor_name_last": "KOWALD",
      "inventor_name_first": "Julie RAE",
      "inventor_city": "Dundas Valley",
      "inventor_state": "",
      "inventor_country": "AU"
    }
  ],
  "ipcr_labels": [
    "G06T773",
    "G06T1100",
    "G06T320",
    "G06F301"
  ],
  "main_ipcr_label": "G06T773",
  "summary": "<SOH> SUMMARY <EOH>It is an object of the present invention to substantially overcome, or at least ameliorate, at least one disadvantage of existing arrangements. A first aspect of the present disclosure provides a computer-implemented method of modifying display of augmented reality content, the method comprising: detecting an interaction between a person and a user of a mixed reality system, the mixed reality system displaying the augmented reality content to the user, the interaction being detectable by the mixed reality system when a gaze interaction of the person is detected as directed towards the user and accordingly a sensor of the mixed reality system; determining an urgency of the interaction according to further interaction between the person and the user; determining that an element of the display of the augmented reality content is obscuring the interaction; selecting a transition effect for modifying display of the element from a plurality of transition effects according to the determined urgency of the interaction, and modifying the display of the element according to the selected transition effect. According to another aspect of the present disclosure, the transition effect is selected based on a speed at which a visibility of the person to the user is to be varied. According to another aspect of the present disclosure, the second interaction is a non-gaze interaction. According to another aspect of the present disclosure, the element of the augmented reality content is determined to obscure the interaction comprises determining that the element is positioned in an area between the person and a view of the user. According to another aspect of the present disclosure, the area relates to a face of the person. According to another aspect of the present disclosure, the area relates to any portion of a body of the person detectable by the sensor. According to another aspect of the present disclosure, the area relates to a face of the person and an area be...",
  "patent_number": "None",
  "abstract": "A system and computer-implemented method of modifying display of augmented reality content are disclosed. The method comprises detecting an interaction between a person and a user of a mixed reality system, the mixed reality system displaying the augmented reality content to the user, the interaction being detectable by the mixed reality system when a gaze interaction of the person is detected as directed towards the user and accordingly a sensor of the mixed reality system; determining an urgency of the interaction according to further interaction between the person and the user; determining that an element of the display of the augmented reality content is obscuring the interaction; selecting a transition effect for modifying display of the element from a plurality of transition effects according to the determined urgency of the interaction, and modifying the display of the element according to the selected transition effect.",
  "publication_number": "US20170178356A1-20170622",
  "_processing_info": {
    "original_size": 83248,
    "optimized_size": 3842,
    "reduction_percent": 95.38
  }
}