{
  "date_produced": "20170621",
  "publication_number": "US20170193363A1-20170706",
  "main_ipcr_label": "G06N308",
  "decision": "PENDING",
  "application_number": "15386920",
  "inventor_list": [
    {
      "inventor_name_last": "LEE",
      "inventor_name_first": "Hyung-Dong",
      "inventor_city": "Icheon",
      "inventor_state": "",
      "inventor_country": "KR"
    }
  ],
  "abstract": "A method for updating a weight of a synapse of a neuromorphic device is provided. The synapse may include a transistor and a memristor. The memristor may have a first electrode coupled to a source electrode of the transistor. The method may include inputting a row spike to a drain electrode of the transistor at a first time; inputting a column spike to a second electrode of the memristor at a second time; inputting a row pulse to the drain electrode of the transistor at a third time that is delayed by a first delay time from the second time; inputting a column pulse to the second electrode of the memristor at a fourth time that is delayed by a second delay time from the second time; and inputting a gating pulse to a gate electrode of the transistor at a fifth time that is delayed by a third delay time from the fourth time.",
  "filing_date": "20161221",
  "patent_number": "None",
  "summary": "<SOH> SUMMARY <EOH>Various embodiments are directed to methods for updating weights of synapses of a neuromorphic device. Various embodiments are directed to methods capable of potentiating or depressing weights of synapses of a neuromorphic device in a short time. Various embodiments are directed to methods capable of effectively controlling potentiation ratios or depression ratios of synapses of a neuromorphic device. Various objects to be achieved by the present disclosure are not limited to the aforementioned objects, and those skilled in the art to which the present disclosure pertains may clearly understand other objects from the following descriptions. In an embodiment, a method for updating a weight of a synapse of a neuromorphic device, the synapse including a transistor and a memristor, the memristor having a first electrode coupled to a source electrode of the transistor, may include: inputting a row spike to a drain electrode of the transistor at a first time; inputting a column spike to a second electrode of the memristor at a second time; inputting a row pulse to the drain electrode of the transistor at a third time that is delayed by a first delay time from the second time; inputting a column pulse to the second electrode of the memristor at a fourth time that is delayed by a second delay time from the second time; and inputting a gating pulse to a gate electrode of the transistor at a fifth time that is delayed by a third delay time from the fourth time. The row spike may be generated by a pre-synaptic neuron and may be inputted to the drain electrode of the transistor through a row line. The column spike may be generated by a post-synaptic neuron and may be inputted to the second electrode of the memristor through a column line. The row pulse may be generated by the pre-synaptic neuron and may be inputted to the drain electrode of the transistor through a row line. The column pulse may be generated from the post-synaptic neuron and may be inputted t...",
  "date_published": "20170706",
  "title": "METHOD FOR UPDATING WEIGHTS OF SYNAPSES OF A NEUROMORPHIC DEVICE",
  "ipcr_labels": [
    "G06N308",
    "G06N3063"
  ],
  "_processing_info": {
    "original_size": 77078,
    "optimized_size": 3395,
    "reduction_percent": 95.6
  }
}