{
  "date_produced": "20180608",
  "publication_number": "US20180174053A1-20180621",
  "main_ipcr_label": "G06N308",
  "decision": "PENDING",
  "application_number": "15385031",
  "inventor_list": [
    {
      "inventor_name_last": "Lin",
      "inventor_name_first": "Tsung-Han",
      "inventor_city": "Campbell",
      "inventor_state": "CA",
      "inventor_country": "US"
    }
  ],
  "abstract": "A spiking neural network (SNN) is implemented on a neuromorphic computers and includes a plurality of neurons, a first set of the plurality of synapses defining feed-forward connections from a first subset of the neurons to a second subset of the neurons, a second subset of the plurality of synapses to define recurrent connections between the second subset of neurons, and a third subset of the plurality of synapses to define feedback connections from the second subset of neurons to the first subset of neurons. A set of input vectors are provided to iteratively modify weight values of the plurality of synapses. Each iteration involves selectively enabling and disabling the third subset of synapses with a different one of the input vectors applied to the SNN. The weight values are iteratively adjusted to derive a solution to an equation comprising an unknown matrix variable and an unknown vector variable.",
  "filing_date": "20161220",
  "patent_number": "None",
  "summary": "<SOH> BRIEF DESCRIPTION OF THE DRAWINGS <EOH>FIG. 1 illustrates an embodiment of a system including a neuromorphic computing systems. FIG. 2A illustrates a simplified block diagram of an example neuromorphic computing device utilizing a network of hardware-implemented neuromorphic cores. FIG. 2B illustrates a simplified block diagram illustrating a portion of a network of neuromorphic cores interconnected by one or more routers. FIG. 2C illustrates a simplified block diagram of an example one of the number of neuromorphic cores implemented in an example neuromorphic computing device. FIGS. 3A-3B are simplified block diagrams of portions of example neural networks capable of being implemented using an example neuromorphic computing device. FIG. 4A is a simplified block diagram illustrating a portion of an example spiking neural network (SNN). FIGS. 4B-4C are simplified block diagrams illustrating example simplified SNNs. FIGS. 5A-5D are block diagrams illustrating principles corresponding to steady state conditions of various portions of examples SNNs. FIGS. 6A-6B are graphs illustrating spiking behavior and spike rates of example neurons with an example SNN. FIGS. 7A-7C are simplified block diagrams illustrating example simplified SNNs configured to approximate solutions for example matrix inverse problems. FIG. 8 is a simplified block diagram illustrating an example SNN configured to determine multiple unknowns in matrix multiplication problems. FIGS. 9A-9B are a representation of the use of an SNN similar to that shown in FIG. 8 . FIG. 10 is a simplified block diagram illustrating a portion of an example spiking neural network (SNN) configured to classify input vectors. FIGS. 11A-11B are flowcharts illustrating example techniques involving solving for unknown matrix values in equations utilizing SNNs. FIG. 12 is a block diagram of an exemplary processor in accordance with one embodiment; and FIG. 13 is a block diagram of an exemplary computing system in accordance...",
  "date_published": "20180621",
  "title": "UNSUPERVISED LEARNING USING NEUROMORPHIC COMPUTING",
  "ipcr_labels": [
    "G06N308",
    "G06N3063"
  ],
  "_processing_info": {
    "original_size": 125766,
    "optimized_size": 3466,
    "reduction_percent": 97.24
  }
}