{
  "decision": "PENDING",
  "application_number": "15383235",
  "date_published": "20170406",
  "date_produced": "20170323",
  "title": "BASE MATERIAL WITH A TRANSPARENT CONDUCTIVE FILM, METHOD FOR MANUFACTURING THE SAME, TOUCH PANEL, AND SOLAR CELL",
  "filing_date": "20161219",
  "inventor_list": [
    {
      "inventor_name_last": "TSUJIMOTO",
      "inventor_name_first": "AKIRA",
      "inventor_city": "Nara",
      "inventor_state": "",
      "inventor_country": "JP"
    },
    {
      "inventor_name_last": "ICHIRYU",
      "inventor_name_first": "TAKASHI",
      "inventor_city": "Osaka",
      "inventor_state": "",
      "inventor_country": "JP"
    },
    {
      "inventor_name_last": "MIMA",
      "inventor_name_first": "KAZUMA",
      "inventor_city": "Osaka",
      "inventor_state": "",
      "inventor_country": "JP"
    }
  ],
  "ipcr_labels": [
    "H01B514",
    "H01B122",
    "G06F3044",
    "C23F116",
    "G06F3047",
    "H01L310224",
    "H05K328"
  ],
  "main_ipcr_label": "H01B514",
  "summary": "<SOH> SUMMARY <EOH>One non-limiting and exemplary embodiment provides a base material with a transparent conductive film having a structure in which a protective layer is placed on a conductive layer containing thin metal wires. The conductive layer can be readily and precisely patterned. Additional benefits and advantages of the disclosed embodiments will be apparent from the specification and figures. The benefits and/or advantages may be individually provided by the various embodiments and features of the specification and drawings disclosure, and need not all be provided in order to obtain one or more of the same. In one general aspect, the techniques disclosed here feature a base material with a transparent conductive film on or above the base material. The transparent conductive film includes a conductive layer; and a protective layer being located on a side of the conductive layer and containing a first resin, the side not opposing to the base material. The transparent conductive film includes a conductive portion and a non-conductive portion in a plan view. The conductive layer contains no metal wires in the conductive portion or contains less metal wires per unit area in the non-conductive portion than the conductive layer contains the metal wires per unit area in the conductive portion. The protective layer contains a particle in the conductive portion, and includes an aperture penetrating the first resin in a thickness direction in the non-conductive portion. The particle is soluble in an acidic etching solution, and the first resin is resistant to the acidic etching solution. These general and specific aspects may be implemented using a base material with a transparent conductive film, a touch panel, a solar cell, an electronic device, a system, a method, and any combination of a base material with a transparent conductive films, touch panels, solar cells, electronic devices, systems, and methods. In accordance with a base material with a transparent con...",
  "patent_number": "None",
  "abstract": "A base material with a transparent conductive film on or above the base material is provided. The transparent conductive film includes a conductive layer; and a protective layer being located on a side of the conductive layer and containing a first resin, the side not opposing to the base material. The transparent conductive film includes a conductive portion and a non-conductive portion in a plan view. The conductive layer contains no metal wires in the conductive portion or contains less metal wires per unit area in the non-conductive portion than the conductive layer contains the metal wires per unit area in the conductive portion. The protective layer contains a particle in the conductive portion, and includes an aperture penetrating the first resin in a thickness direction in the non-conductive portion. The particle is soluble in an acidic etching solution, and the first resin is resistant to the acidic etching solution.",
  "publication_number": "US20170098490A1-20170406",
  "_processing_info": {
    "original_size": 95600,
    "optimized_size": 3888,
    "reduction_percent": 95.93
  }
}