{
  "decision": "PENDING",
  "application_number": "15389950",
  "date_published": "20170511",
  "date_produced": "20170427",
  "title": "STRUCTURAL BOLLARD ASSEMBLY FOR ELECTRIC VEHICLE INFRASTRUCTURE",
  "filing_date": "20161223",
  "inventor_list": [
    {
      "inventor_name_last": "Johnson",
      "inventor_name_first": "Matthew E.",
      "inventor_city": "Asheville",
      "inventor_state": "NC",
      "inventor_country": "US"
    }
  ],
  "ipcr_labels": [
    "B60L1118",
    "G06Q5006",
    "G06Q4004"
  ],
  "main_ipcr_label": "B60L1118",
  "summary": "<SOH> SUMMARY <EOH>The EV infrastructure of the present invention comprises: a customizable charging station comprised of at least one modular bollard having a form that is mountable upon a footing at one or more bollard attachment points upon a bollard attachment plate, and at least one expansion attachment element fashioned on a bollard expansion plate; electrical vehicle supply equipment sealably integrated with or connected to the modular bollard; and a foundation. The customizable charging station can be fashioned with a structural trunk having at least a first end, a second end, and at least one sidewall extending a length between the first end and the second end. The first end is securable upon the at least one expansion attachment element fashioned on the bollard expansion plate, and the second end can fixedly engage with a functional unit such as a canopy, a security lamp, a surveillance camera, and/or a beam or joist. In another aspect of the invention, a customizable charging station can be assembled on-site by identifying a point of utility interconnection; trenching to interconnection point; forming a foundation; and fastening a modular bollard upon the foundation. Yet another aspect of the invention includes a method for planning EV infrastructure based upon forecasted impacts upon holistic (or social), environmental, and financial factors. These factors can be calculated by inputting research data (which may include publically available figures); analyzing and calculating the research data to determine the most economically, environmentally and socially effective manner of installing a renewable energy powered charging infrastructure; followed by outputting holistic cost and benefit values, environmental cost and benefit values, and financial cost and benefit values, wherein the benefits are determined by a comparative analysis to fossil fuel transportation derived figures. The inputs may include any number of metrics. For example, the research data m...",
  "patent_number": "None",
  "abstract": "The invention disclosed herein is directed to electric vehicle (“EV”) infrastructure, which includes a customizable charging station that comprises a modular bollard assembly having a structural tubular form that is secured to electrical vehicle supply equipment to provide fuel to an EV. The modular bollard assembly is optionally fashioned with expansion elements, such as a solar canopy, which accommodate EV infrastructure requirements. The invention also includes methods of determining and manufacturing EV infrastructure based upon data pertaining to demographic, energy, EV, financial and geographic metrics.",
  "publication_number": "US20170129356A1-20170511",
  "_processing_info": {
    "original_size": 83653,
    "optimized_size": 3209,
    "reduction_percent": 96.16
  }
}