{
  "date_produced": "20170621",
  "publication_number": "US20170193354A1-20170706",
  "main_ipcr_label": "G06N3063",
  "decision": "PENDING",
  "application_number": "15385599",
  "inventor_list": [
    {
      "inventor_name_last": "LEE",
      "inventor_name_first": "Hyung-Dong",
      "inventor_city": "Icheon",
      "inventor_state": "",
      "inventor_country": "KR"
    }
  ],
  "abstract": "A neuromorphic device may include: a plurality of pre-synaptic neurons; row lines extending in a row direction from the plurality of pre-synaptic neurons; a plurality of post-synaptic neurons; column lines extended in a column direction from the plurality of post-synaptic neurons; a plurality of synapses arranged at intersections between the row lines and the column lines; a plurality of first control blocks; and first control lines extending from the control blocks. The first control lines may be electrically connected to the plurality of synapses.",
  "filing_date": "20161220",
  "patent_number": "None",
  "summary": "<SOH> SUMMARY <EOH>Various embodiments are directed to a neuromorphic device capable of adjusting a resistance change ratio of a synapse. Also, various embodiments are directed to a method of adjusting a resistance change ratio of a synapse. In an embodiment, a neuromorphic device may include: a plurality of pre-synaptic neurons; row lines extending in a row direction from the plurality of pre-synaptic neurons; a plurality of post-synaptic neurons; column lines extending in a column direction from the plurality of post-synaptic neurons; a plurality of synapses arranged at intersections between the row lines and the column lines; a plurality of first control blocks; and first control lines extending from the control blocks. The first control lines may be electrically connected to the plurality of synapses. Each of the plurality of synapses comprises a first transistor and a memristor. A gate electrode of the first transistor may be electrically connected to a corresponding one of the first control lines. A drain electrode of the first transistor may be electrically connected to a corresponding one of the row lines. A source electrode of the first transistor may be connected to a first electrode of the memristor. A second electrode of the memristor may be electrically connected to a corresponding one of the column lines. Each of the plurality of synapses may further include a second transistor connected in parallel to the first transistor. The drain electrode of the first transistor may be connected to a drain electrode of the second transistor. The source electrode of the first transistor may be connected to a source electrode of the second transistor. The neuromorphic device may further include: a second control line connected to a gate electrode of the second transistor; and a second control block connected to the second control line. The column lines and the first control lines may be arranged parallel to each other, and each of the plurality of synapses may be co...",
  "date_published": "20170706",
  "title": "NEUROMORPHIC DEVICE AND METHOD OF ADJUSTING A RESISTANCE CHANGE RATIO THEREOF",
  "ipcr_labels": [
    "G06N3063",
    "G06N304"
  ],
  "_processing_info": {
    "original_size": 57762,
    "optimized_size": 3130,
    "reduction_percent": 94.58
  }
}