{
  "decision": "PENDING",
  "application_number": "15385477",
  "date_published": "20180621",
  "date_produced": "20180608",
  "title": "FACILITATING APPLICATION DEVELOPMENT",
  "filing_date": "20161220",
  "inventor_list": [
    {
      "inventor_name_last": "Burges",
      "inventor_name_first": "Christopher John Champness",
      "inventor_city": "Bellevue",
      "inventor_state": "WA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Hart",
      "inventor_name_first": "Ted",
      "inventor_city": "Redmond",
      "inventor_state": "WA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Pastusiak",
      "inventor_name_first": "Andrzej",
      "inventor_city": "Redmond",
      "inventor_state": "WA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Yang",
      "inventor_name_first": "Zi",
      "inventor_city": "Pittsburgh",
      "inventor_state": "PA",
      "inventor_country": "US"
    }
  ],
  "ipcr_labels": [
    "G06F944"
  ],
  "main_ipcr_label": "G06F944",
  "summary": "<SOH> SUMMARY <EOH>This Summary is provided to introduce a selection of concepts in a simplified form that are further described below in the Detailed Description. This Summary is not intended to identify key features or essential features of the claimed subject matter, nor is it intended to be used as an aid in determining the scope of the claimed subject matter. Various aspects of the technology described herein are generally directed to systems, methods, and computer storage media for, among other things, facilitating application development. In particular, utilizing aspects described herein, application development can be performed by non-experts in an efficient manner. In effect, crowd sourcing for application development enables applications to be generated in a more scalable manner. Further, for applications using dialog, the language instruction component of application development can also be performed via individuals that are not software development experts (i.e., non-experts).",
  "patent_number": "None",
  "abstract": "Methods, computer systems, computer-storage media, and graphical user interfaces are provided for facilitating application development. In embodiments, input is received from a designer, the input including an indication of a class of applications and one or more preferences for designing a module specification. Thereafter, the module specification is created in association with the class of applications. Input is received from a teacher in association with the module specification. At least a portion of such input indicates how to recognize when a user intends to run an application. An application is generated based on the input provided from the teacher. Such an application can be used by one or more users.",
  "publication_number": "US20180173500A1-20180621",
  "_processing_info": {
    "original_size": 61790,
    "optimized_size": 2693,
    "reduction_percent": 95.64
  }
}