{
  "decision": "PENDING",
  "application_number": "15382536",
  "date_published": "20170622",
  "date_produced": "20170607",
  "title": "METHOD AND APPARATUS FOR X-RAY IONIZING RADIATION CONTROL",
  "filing_date": "20161216",
  "inventor_list": [
    {
      "inventor_name_last": "Badali",
      "inventor_name_first": "Daniel Salvatore",
      "inventor_city": "Fremont",
      "inventor_state": "CA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Funk",
      "inventor_name_first": "Tobias",
      "inventor_city": "Martinez",
      "inventor_state": "CA",
      "inventor_country": "US"
    }
  ],
  "ipcr_labels": [
    "G06F1750",
    "G05B1304",
    "A61L208",
    "H05G130"
  ],
  "main_ipcr_label": "G06F1750",
  "summary": "<SOH> SUMMARY <EOH>The present invention pertains to a method and apparatus for ionizing radiation control. A digital representation of an inanimate object is formed. The amount of the radiation at a surface of the inanimate object is simulated. The radiation-matter interaction for a material of the inanimate object is calculated. The amount of energy deposited at a plurality of locations at the inanimate object is calculated. The digital representation of the inanimate object is modified in response to an input from a user and the modified digital representation of the inanimate object is displayed. The plurality of locations can be located at the surface of the inanimate object. The amount of energy deposited at each of the plurality of locations can be compared against a dose threshold required to achieve sterilization of the material. Under another embodiment of the present invention, a second digital representation of a packaging device of a second material around the inanimate object can be formed and the effect of the packaging device on the amount of energy deposited at each of the plurality of locations can be simulated. The position of the modified digital representation of the inanimate object can be changed and the amount of energy deposited at each of the plurality of locations at the inanimate object in the changed position can be calculated. The amount of energy deposited at each of the plurality of locations at the inanimate object can be compared against a dose threshold required to achieve adequate crosslinking of the material. The amount of energy deposited at each of the plurality of locations can be compared against a dose threshold required to achieve neutralization of hazardous waste on the material. Under another embodiment of the present invention, a second digital representation of a radiation shield of a second material can be formed and the effect of the radiation shield on the amount of energy deposited at each of the plurality of locati...",
  "patent_number": "None",
  "abstract": "The present invention pertains to a method and apparatus for x-ray ionizing radiation control and ionizing radiation control. A digital representation of an inanimate object is formed. The amount of the radiation at a surface of the inanimate object is simulated. The radiation-matter interaction for a material of the inanimate object is calculated. The amount of energy deposited at a plurality of locations at the inanimate object is calculated. The digital representation of the inanimate object is modified in response to an input from a user and the modified digital representation of the inanimate object is displayed.",
  "publication_number": "US20170177763A1-20170622",
  "_processing_info": {
    "original_size": 76994,
    "optimized_size": 3359,
    "reduction_percent": 95.64
  }
}