{
  "decision": "PENDING",
  "application_number": "15382920",
  "date_published": "20180621",
  "date_produced": "20180608",
  "title": "INTEGRATED PREDICTIVE ANALYSIS",
  "filing_date": "20161219",
  "inventor_list": [
    {
      "inventor_name_last": "Su",
      "inventor_name_first": "Teresa",
      "inventor_city": "Vancouver",
      "inventor_state": "",
      "inventor_country": "CA"
    },
    {
      "inventor_name_last": "Rittinger",
      "inventor_name_first": "Jan",
      "inventor_city": "Wiesloch",
      "inventor_state": "",
      "inventor_country": "DE"
    },
    {
      "inventor_name_last": "Hajizadeh",
      "inventor_name_first": "Amir",
      "inventor_city": "Vancouver",
      "inventor_state": "",
      "inventor_country": "CA"
    }
  ],
  "ipcr_labels": [
    "G06F1730"
  ],
  "main_ipcr_label": "G06F1730",
  "summary": "<SOH> BRIEF DESCRIPTION OF THE DRAWINGS <EOH>FIG. 1 is a block diagram of a system architecture according to some embodiments. FIG. 2 is a flow diagram of a process according to some embodiments. FIG. 3 is an outward view of a user interface to generate a data visualization according to some embodiments. FIG. 4 is an outward view of a user interface displaying a data visualization according to some embodiments. FIG. 5 is a tabular representation of a portion of a data source according to some embodiments. FIG. 6 is an outward view of a user interface displaying a data visualization according to some embodiments. FIG. 7 is an outward view of a user interface displaying a dialog to initiate a predictive analysis according to some embodiments. FIG. 8 is a tabular representation of an aggregation of a portion of a data source according to some embodiments. FIG. 9 is a tabular representation of forecast data according to some embodiments. FIG. 10 is an outward view of a user interface displaying a data visualization including forecast. FIG. 11 is a tabular representation of a portion of a data source including disaggregated forecast data according to some embodiments. FIG. 12 is a block diagram of an apparatus according to some embodiments. detailed-description description=\"Detailed Description\" end=\"lead\"?",
  "patent_number": "None",
  "abstract": "A system includes determination of a query context comprising a measure and one or more dimension values of a data source, generation of a query of the data source for the measure over time and aggregated over the one or more dimension values, reception of a result set of the query, providing of the result set to a predictive analysis engine, and reception of forecast data based on the result set, the forecast data comprising forecast values of the measure over time, aggregated over the one or more dimension values.",
  "publication_number": "US20180173707A1-20180621",
  "_processing_info": {
    "original_size": 37012,
    "optimized_size": 2650,
    "reduction_percent": 92.84
  }
}