{
  "date_produced": "20180608",
  "publication_number": "US20180174056A1-20180621",
  "main_ipcr_label": "G06N502",
  "decision": "PENDING",
  "application_number": "15386134",
  "inventor_list": [
    {
      "inventor_name_last": "Madison",
      "inventor_name_first": "James A.",
      "inventor_city": "Windsor",
      "inventor_state": "CT",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Barnes",
      "inventor_name_first": "Shane Eric",
      "inventor_city": "Avon",
      "inventor_state": "CT",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Kapushinski",
      "inventor_name_first": "Tyler L.",
      "inventor_city": "New Britain",
      "inventor_state": "CT",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Subramaniam",
      "inventor_name_first": "Mohan",
      "inventor_city": "Southington",
      "inventor_state": "CT",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Wasik",
      "inventor_name_first": "Ludwig Steven",
      "inventor_city": "West Hartford",
      "inventor_state": "CT",
      "inventor_country": "US"
    }
  ],
  "abstract": "According to some embodiments, an analytics computing environment data store may contain a set of electronic data records, each electronic data record being associated with a predictive analytic algorithm and including an algorithm identifier and a set of algorithm characteristic values. An analytics environment computer may receive an adjustment from a user associated with an enterprise, the adjustment changing at least one of the set of algorithm characteristic values for a predictive analytic algorithm. Deployment of the predictive analytic algorithm may then be initiated in an enterprise operations workflow and at least one result may be generated. The deployed predictive analytic algorithm may then monitor the result and generate an alert signal when the result exceeds a boundary condition.",
  "filing_date": "20161221",
  "patent_number": "None",
  "summary": "<SOH> SUMMARY OF THE INVENTION <EOH>According to some embodiments, systems, methods, apparatus, computer program code and means are provided to facilitate predictive analytic algorithm deployment for an enterprise. In some embodiments, an analytics computing environment data store may contain a set of electronic data records, each electronic data record being associated with a predictive analytic algorithm and including an algorithm identifier and a set of algorithm characteristic values. An analytics environment computer may receive an adjustment from a user associated with an enterprise, the adjustment changing at least one of the set of algorithm characteristic values for a predictive analytic algorithm. Deployment of the predictive analytic algorithm may then be initiated in an enterprise operations workflow and at least one result may be generated. The deployed predictive analytic algorithm may then monitor the result and generate an alert signal when the result exceeds a boundary condition. Some embodiments comprise: means for receiving, by an analytics environment computer, data from an analytics computing environment data store containing a set of electronic data records, each electronic data record being associated with a predictive analytic algorithm and including an algorithm identifier and a set of algorithm characteristic values; means for receiving, by the analytics environment computer, an adjustment to at least one of the set of algorithm characteristic values from a user associated with the enterprise; means for initiating deployment of the predictive analytic algorithm in an enterprise operations workflow; and means for executing, by an enterprise operations workflow computer, an operations workflow in association with the deployed predictive analytic algorithm to generate at least one result, wherein the deployed predictive analytic algorithm is to monitor the result and generate an alert signal when the result exceeds a boundary condition. In som...",
  "date_published": "20180621",
  "title": "SYSTEM TO FACILITATE PREDICTIVE ANALYTIC ALGORITHM DEPLOYMENT IN AN ENTERPRISE",
  "ipcr_labels": [
    "G06N502",
    "G06N700"
  ],
  "_processing_info": {
    "original_size": 78205,
    "optimized_size": 3997,
    "reduction_percent": 94.89
  }
}