{
  "date_produced": "20170621",
  "publication_number": "US20170193364A1-20170706",
  "main_ipcr_label": "G06N308",
  "decision": "PENDING",
  "application_number": "15386996",
  "inventor_list": [
    {
      "inventor_name_last": "LEE",
      "inventor_name_first": "Hyung-Dong",
      "inventor_city": "Icheon",
      "inventor_state": "",
      "inventor_country": "KR"
    }
  ],
  "abstract": "A learning method for synapses of a neuromorphic device may include generating and inputting, by a pre-synaptic neuron, a first pre-synaptic pulse to a plurality of synapses at a first start time, the plurality of synapses being coupled to the pre-synaptic neuron; generating and inputting, by a first post-synaptic neuron, a first post-synaptic pulse to a first synapse of the plurality of synapses at a first delayed time that is delayed by a first delay amount from the first start time, the first synapse being coupled to the first post-synaptic neuron; and generating and inputting, by a second post-synaptic neuron, a second post-synaptic pulse to a second synapse of the plurality of synapses at a second delayed time that is delayed by a second delay amount from the first start time, the second synapse being coupled to the second post-synaptic neuron.",
  "filing_date": "20161221",
  "patent_number": "None",
  "summary": "<SOH> SUMMARY <EOH>Various embodiments of the present disclosure are directed to a learning method for synapses of a neuromorphic device. Also, various embodiments of the present disclosure are directed to a neuromorphic device which can be efficiently trained. In an embodiment of the inventive concepts, a learning method for synapses of a neuromorphic device may include generating and inputting, by a pre-synaptic neuron, a first pre-synaptic pulse to a plurality of synapses at a first start time, the plurality of synapses being coupled to the pre-synaptic neuron; generating and inputting, by a first post-synaptic neuron, a first post-synaptic pulse to a first synapse of the plurality of synapses at a first delayed time that is delayed by a first delay amount from the first start time, the first synapse being coupled to the first post-synaptic neuron; and generating and inputting, by a second post-synaptic neuron, a second post-synaptic pulse to a second synapse of the plurality of synapses at a second delayed time that is delayed by a second delay amount from the first start time, the second synapse being coupled to the second post-synaptic neuron. The learning method may further include generating and inputting, by a third post-synaptic neuron, a third post-synaptic pulse to a third synapse of the plurality of synapses at a third delayed time, the third synapse being coupled to the third post-synaptic neuron. The learning method may further include generating and inputting, by a fourth post-synaptic neuron, a fourth post-synaptic pulse to a fourth synapse of the plurality of synapses at a fourth delayed time, the fourth synapse being coupled to the fourth post-synaptic neuron. The learning method may further include: generating and inputting, by the pre-synaptic neuron, a second pre-synaptic pulse to the plurality of synapses at a second start time; generating and inputting, by the second post-synaptic neuron, the first post-synaptic pulse to the second synapse at...",
  "date_published": "20170706",
  "title": "LEARNING METHOD FOR SYNAPSES OF A NEUROMORPHIC DEVICE",
  "ipcr_labels": [
    "G06N308",
    "G06N304"
  ],
  "_processing_info": {
    "original_size": 73251,
    "optimized_size": 3410,
    "reduction_percent": 95.34
  }
}