{
  "date_produced": "20180620",
  "publication_number": "US20180189660A1-20180705",
  "main_ipcr_label": "G06N504",
  "decision": "PENDING",
  "application_number": "15395383",
  "inventor_list": [
    {
      "inventor_name_last": "Malmi",
      "inventor_name_first": "Eric",
      "inventor_city": "Espoo",
      "inventor_state": "",
      "inventor_country": "FI"
    },
    {
      "inventor_name_last": "Smura",
      "inventor_name_first": "Timo",
      "inventor_city": "Espoo",
      "inventor_state": "",
      "inventor_country": "FI"
    },
    {
      "inventor_name_last": "Verkasalo",
      "inventor_name_first": "Hannu",
      "inventor_city": "Espoo",
      "inventor_state": "",
      "inventor_country": "FI"
    },
    {
      "inventor_name_last": "Aksela",
      "inventor_name_first": "Matti",
      "inventor_city": "Espoo",
      "inventor_state": "",
      "inventor_country": "FI"
    }
  ],
  "abstract": "Electronic arrangement (112) comprising a data interface (210) for transferring data with external elements, at least one processor (202) for processing instructions and other data, and memory (204) for storing the instructions and other data, said at least one processor being configured, in accordance with the stored instructions, to obtain at least one predictive user model (312,314) including one or more demographic characteristics as dependent variables to be predicted and usage statistics of applications as explanatory variables, obtain deterministic usage (316) statistics indicative of digital applications a target user has utilized during a monitoring period, and determine (318), through utilization of the deterministic usage statistics obtained during the monitoring period as input to the at least one established predictive model, an estimate of said one or more of the demographic characteristics of the target user. The arrangement may be configured to receive the model from an...",
  "filing_date": "20161230",
  "patent_number": "None",
  "summary": "<SOH> SUMMARY <EOH>It is therefore one objective of the present invention to at least alleviate one or more drawbacks or challenges related to the prior art solutions involving or benefiting from the utilization of demographic data. The objective is achieved by the various embodiments of an arrangement and method in accordance with the present invention. In one aspect, there is provided a method for predicting user demographics, and therewith e.g. user preferences, interests, purchase intent and/or other behavior or characteristics in view of providing personalized digital content, to be performed by at least one electronic apparatus, optionally a number of functionally connected servers potentially at least some which being operable in a cloud computing environment. The method comprises obtaining preferably deterministic user data having regard to a plurality of users and a modeling period, wherein user data associated with each user of said plurality of users indicates a number of demographic characteristics of the user as well as preferably comprehensive usage statistics indicative of digital applications the particular user has utilized, preferably in or through at least one, optionally personal, user terminal, during the modeling period, establishing, through utilization of a selected modeling scheme, at least one predictive user model including one or more of the demographic characteristics as dependent variables to be predicted and the usage statistics of applications as explanatory variables (features), obtaining measured, deterministic usage statistics indicative of applications a target user has utilized during a monitoring period, and providing, through utilization of the deterministic usage statistics covering the monitoring period as input to the at least one established predictive model, an estimate of said one or more of the demographic characteristics of the target user. The modeling period and monitoring period may optionally be of substantially equ...",
  "date_published": "20180705",
  "title": "Arrangement and method for inferring demographics from application usage statistics",
  "ipcr_labels": [
    "G06N504",
    "G06N700"
  ],
  "_processing_info": {
    "original_size": 92610,
    "optimized_size": 3998,
    "reduction_percent": 95.68
  }
}