{
  "date_produced": "20170405",
  "publication_number": "US20170109637A1-20170420",
  "main_ipcr_label": "G06N504",
  "decision": "PENDING",
  "application_number": "15391863",
  "inventor_list": [
    {
      "inventor_name_last": "Marcu",
      "inventor_name_first": "Nir",
      "inventor_city": "Hod HaSharon",
      "inventor_state": "",
      "inventor_country": "IL"
    },
    {
      "inventor_name_last": "Libeskind Mulyan",
      "inventor_name_first": "Avichay",
      "inventor_city": "Tel Aviv",
      "inventor_state": "",
      "inventor_country": "IL"
    },
    {
      "inventor_name_last": "Tauber",
      "inventor_name_first": "Doron",
      "inventor_city": "Even Yehuda",
      "inventor_state": "",
      "inventor_country": "IL"
    },
    {
      "inventor_name_last": "Uziely",
      "inventor_name_first": "Shir",
      "inventor_city": "Raanana",
      "inventor_state": "",
      "inventor_country": "IL"
    },
    {
      "inventor_name_last": "Zhmudyak",
      "inventor_name_first": "Alexandra",
      "inventor_city": "Rehovot",
      "inventor_state": "",
      "inventor_country": "IL"
    },
    {
      "inventor_name_last": "Dor",
      "inventor_name_first": "Nurit",
      "inventor_city": "Raanana",
      "inventor_state": "",
      "inventor_country": "IL"
    }
  ],
  "abstract": "Described herein are systems, methods, and computer programs that may be utilized to identify nonconsecutive executions of a Business Process (BP) utilizing a crowd-based model of the BP. In one embodiment, a BP model trainer module generates the crowd-based model of the BP based on sequences of steps corresponding to nonconsecutive executions of the BP, which are associated with at least first and second organizations. In one embodiment, the crowd-based model is utilized to identify nonconsecutive executions of the BP. A sequence parser module receives one or more streams of steps performed during interactions with an instance of the software system, which belongs to another organization, and to select, from among the one or more streams, candidate sequences of steps. Additionally, a BP-identifier module utilizes the crowd-based model to identify, from among the candidate sequences, a sequence of steps that corresponds to a nonconsecutive execution of the BP.",
  "filing_date": "20161228",
  "patent_number": "None",
  "summary": "<SOH> SUMMARY <EOH>Some aspects of this disclosure involve various applications involving data obtained by monitoring interactions with instances of one or more software systems. A “software system”, as used in this disclosure, may refer to one or more of various types of prepackaged business applications, such as enterprise resource planning (ERP), supply chain management (SCM), supplier relationship management (SRM), product lifecycle management (PLM), and customer relationship management (CRM), to name a few. Additionally, a “software system” may refer to a computer system with which a user and/or a computer program (e.g., a software agent) may communicate in order to receive and/or provide information, and/or in order to provide and/or receive a service. In some embodiments, the monitoring is performed by one or more monitoring agents. Each monitoring agent generates a stream comprising steps performed as part of an interaction with an instance of a software system. Optionally, data collected through monitoring may include one or more of the following types of data: data provided by a user (e.g., as input in fields in screens), data provided by a software system (e.g., messages returned as a response to operations), data exchanged between a user interface and a server used to run an instance of a software system (e.g., network traffic between the two), logs generated by an operating system (e.g., on a client used by a user or a server used by an instance of a software system), and logs generated by the instance of the software system (e.g., “event logs” generated by the software system). Various types of models of BPs may be utilized in embodiments described in this disclosure. In one example, a model of a BP may describe one or more sequences of steps involved in executions of the BP. In another example, a model of a BP may be described via a graphical representation (graph) such as a Petri net or a depiction of a BPMN model. In still another example, a model o...",
  "date_published": "20170420",
  "title": "Crowd-Based Model for Identifying Nonconsecutive Executions of a Business Process",
  "ipcr_labels": [
    "G06N504",
    "G06N9900"
  ],
  "_processing_info": {
    "original_size": 352782,
    "optimized_size": 4312,
    "reduction_percent": 98.78
  }
}