{
  "date_produced": "20180613",
  "publication_number": "US20180181879A1-20180628",
  "main_ipcr_label": "G06N9900",
  "decision": "PENDING",
  "application_number": "15393231",
  "inventor_list": [
    {
      "inventor_name_last": "WANG",
      "inventor_name_first": "Jin",
      "inventor_city": "Singapore",
      "inventor_state": "",
      "inventor_country": "SG"
    },
    {
      "inventor_name_last": "LUO",
      "inventor_name_first": "Jun",
      "inventor_city": "Singapore",
      "inventor_state": "",
      "inventor_country": "SG"
    },
    {
      "inventor_name_last": "PAN",
      "inventor_name_first": "Sinno Jialin",
      "inventor_city": "Singapore",
      "inventor_state": "",
      "inventor_country": "SG"
    }
  ],
  "abstract": "Described herein is a framework for outdoor localization. In accordance with one aspect of the framework, a set of hotspot labels are received from one or more user devices connected to an outdoor wireless local area network. Manifold learning may be performed based on the set of hotspot labels to construct one or more manifolds. Using the one or more constructed manifolds, the framework may then estimate a location of a particular user device associated with a query record received from during an online location query.",
  "filing_date": "20161228",
  "patent_number": "None",
  "summary": "<SOH> SUMMARY <EOH>A framework for outdoor localization is described herein. In accordance with one aspect of the framework, a set of hotspot labels are received from one or more user devices connected to an outdoor wireless local area network. Manifold learning may be performed based on the set of hotspot labels to construct one or more manifolds. Using the one or more constructed manifolds, the framework may then estimate a location of a particular user device associated with a query record received from during an online location query. With these and other advantages and features that will become hereinafter apparent, further information may be obtained by reference to the following detailed description and appended claims, and to the figures attached hereto.",
  "date_published": "20180628",
  "title": "OUTDOOR LOCALIZATION USING HOTSPOT LABELS",
  "ipcr_labels": [
    "G06N9900",
    "H04W4814",
    "H04B17318",
    "G01S502"
  ],
  "_processing_info": {
    "original_size": 48945,
    "optimized_size": 2142,
    "reduction_percent": 95.62
  }
}