{
  "date_produced": "20180613",
  "publication_number": "US20180181861A1-20180628",
  "main_ipcr_label": "G06N3063",
  "decision": "PENDING",
  "application_number": "15392407",
  "inventor_list": [
    {
      "inventor_name_last": "SUMBUL",
      "inventor_name_first": "Huseyin E.",
      "inventor_city": "Hillsboro",
      "inventor_state": "OR",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "CHEN",
      "inventor_name_first": "Gregory K.",
      "inventor_city": "Hillsboro",
      "inventor_state": "OR",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "KUMAR",
      "inventor_name_first": "Raghavan",
      "inventor_city": "Hillsboro",
      "inventor_state": "OR",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Knag",
      "inventor_name_first": "Phil C.",
      "inventor_city": "Hillsboro",
      "inventor_state": "OR",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Krishnamurthy",
      "inventor_name_first": "Ram",
      "inventor_city": "Portland",
      "inventor_state": "OR",
      "inventor_country": "US"
    }
  ],
  "abstract": "A neuromorphic computing system is provided which comprises: a synapse core; and a pre-synaptic neuron, a first post-synaptic neuron, and a second post-synaptic neuron coupled to the synaptic core, wherein the synapse core is to: receive a request from the pre-synaptic neuron, generate, in response to the request, a first address of the first post-synaptic neuron and a second address of the second post-synaptic neuron, wherein the first address and the second address are not stored in the synapse core prior to receiving the request.",
  "filing_date": "20161228",
  "patent_number": "None",
  "summary": "<SOH> BRIEF DESCRIPTION OF THE DRAWINGS <EOH>The embodiments of the disclosure will be understood more fully from the detailed description given below and from the accompanying drawings of various embodiments of the disclosure, which, however, should not be taken to limit the disclosure to the specific embodiments, but are for explanation and understanding only. FIG. 1 schematically illustrates a neuromorphic computing system comprising a network of interconnected neurons, according to some embodiments. FIGS. 2A, 2B, and 2C schematically illustrate the neuromorphic computing system of FIG. 1 in more details, according to some embodiments. FIG. 3 schematically illustrates a synapse core of a neuromorphic computing system, where the synapse core transmits forward spikes from a pre-synaptic neuron to various post-synaptic neurons, according to some embodiments. FIG. 4 schematically illustrates transmission of a backward spike from a post-synaptic neuron to a pre-synaptic neuron, according to some embodiments. FIG. 5 schematically illustrates an example implementation of a synapse core of a neuromorphic computing system, according to some embodiments. FIG. 6 schematically illustrates a computer system or a SoC (System-on-Chip), where a synapse core and neurons are included, in accordance with some embodiments. detailed-description description=\"Detailed Description\" end=\"lead\"?",
  "date_published": "20180628",
  "title": "NEUROMORPHIC CIRCUITS FOR STORING AND GENERATING CONNECTIVITY INFORMATION",
  "ipcr_labels": [
    "G06N3063",
    "G06N304",
    "G06N308"
  ],
  "_processing_info": {
    "original_size": 90899,
    "optimized_size": 3117,
    "reduction_percent": 96.57
  }
}