{
  "decision": "PENDING",
  "application_number": "15396125",
  "date_published": "20180705",
  "date_produced": "20180620",
  "title": "Rendering Content in a 3D Environment",
  "filing_date": "20161230",
  "inventor_list": [
    {
      "inventor_name_last": "Upadhyay",
      "inventor_name_first": "Aayush Himanshu",
      "inventor_city": "San Francisco",
      "inventor_state": "CA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Rao",
      "inventor_name_first": "Neel Mamidi",
      "inventor_city": "San Francisco",
      "inventor_state": "CA",
      "inventor_country": "US"
    }
  ],
  "ipcr_labels": [
    "G06T1500",
    "G06T1900",
    "G06F301"
  ],
  "main_ipcr_label": "G06T1500",
  "summary": "<SOH> SUMMARY <EOH>This document describes systems, methods, devices, and other techniques for reducing transmissions of unused third-party content over a network and for efficiently rendering third-party content in a 3D environment. In general, a client computing system, such as a virtual reality system or an augmented reality system, can present a 3D environment that includes one or more third-party content eligible (3PCE) virtual objects. A 3PCE virtual object is an object (e.g., a 3D object such as a cube, a sphere, a cylinder, or other geometric shape) that is configured to present third-party content (e.g., content provided by an entity different than an entity that provides the 3D environment) at a specified location of the 3D environment. The 3PCE virtual object can be displayed at any given time in one of multiple display modes associated with the object. When a triggering event is detected, such as a user interaction with the 3PCE virtual object, the system may update the virtual object, such as by transitioning the object from one display mode to another. In some implementations, a user's interactions with a 3PCE virtual object causes the object to display a new set of third-party content, to change the type of third-party content displayed by the object, to open a portal to an external resource (also referred to as a “portal resource”) associated with displayed third-party content (e.g., a website or an application), or to generate notifications related to displayed third-party content in an external environment outside of the 3D environment. Some implementations of the subject matter described herein include a computing system. The computing system includes a memory subsystem, a communications interface, a rendering engine, an input handling apparatus, and a virtual object manager. The memory subsystem is configured to store first data that (i) defines a three-dimensional (3D) environment and (ii) identifies a virtual object in the 3D environment. The c...",
  "patent_number": "None",
  "abstract": "Systems, methods, devices, and other techniques for rendering content in a 3D environment. In some implementations the system includes a memory subsystem, a communications interface, a rendering engine, an input handling apparatus, and a virtual object manager. The memory subsystem is configured to store first data that (i) defines a three-dimensional (3D) environment and (ii) identifies a virtual object in the 3D environment. The communications interface is configured to transmit requests over a network for third-party content to display with the virtual object in the 3D environment and to receive third-party content responsive to the requests. The rendering engine is configured to use the first data from the memory subsystem to render the 3D environment for presentation on a display device, including rendering the virtual object at a specified location of the 3D environment in a first mode in which the virtual object displays a first set of third-party content.",
  "publication_number": "US20180190003A1-20180705",
  "_processing_info": {
    "original_size": 126458,
    "optimized_size": 3706,
    "reduction_percent": 97.07
  }
}