{
  "patent_number": "None",
  "application_number": "15398540",
  "date_published": "20170831",
  "date_produced": "20170816",
  "filing_date": "20170104",
  "main_ipcr_label": "G06N310",
  "abstract": "A computing device includes an interface configured to interface and communicate with a dispersed or distributed storage network (DSN), a memory that stores operational instructions, and a processing module operably coupled to the interface and memory such that the processing module, when operable within the computing device based on the operational instructions, is configured to perform various operations. The computing device receives first samples corresponding to inputs that characterize configuration of the DSN and receives second samples corresponding to outputs that characterize system behavior of the DSN. The computing device then processes the first and samples to generate a DSN model to generate predictive performance of the outputs based on various values of the inputs. In some instances, the DSN model is based on a neural network model that employs the inputs that characterize the configuration of the DSN and generates the outputs that characterize system behavior of the DS...",
  "publication_number": "US20170249551A1-20170831",
  "summary": "<SOH> BRIEF DESCRIPTION OF THE SEVERAL VIEWS OF THE DRAWING(S) <EOH>FIG. 1 is a schematic block diagram of an embodiment of a dispersed or distributed storage network (DSN) in accordance with the present invention; FIG. 2 is a schematic block diagram of an embodiment of a computing core in accordance with the present invention; FIG. 3 is a schematic block diagram of an example of dispersed storage error encoding of data in accordance with the present invention; FIG. 4 is a schematic block diagram of a generic example of an error encoding function in accordance with the present invention; FIG. 5 is a schematic block diagram of a specific example of an error encoding function in accordance with the present invention; FIG. 6 is a schematic block diagram of an example of a slice name of an encoded data slice (EDS) in accordance with the present invention; FIG. 7 is a schematic block diagram of an example of dispersed storage error decoding of data in accordance with the present invention; FIG. 8 is a schematic block diagram of a generic example of an error decoding function in accordance with the present invention; FIG. 9 is a schematic block diagram of another embodiment of a dispersed storage network (DSN) in accordance with the present invention; FIG. 10 is a schematic block diagram of an example of neural network model in accordance with the present invention; FIG. 11A is a diagram illustrating an embodiment of a method for execution by one or more computing devices in accordance with the present invention; and FIG. 11B is a diagram illustrating another embodiment of a method for execution by one or more computing devices in accordance with the present invention. detailed-description description=\"Detailed Description\" end=\"lead\"?",
  "ipcr_labels": [
    "G06N310",
    "G06N308",
    "G06N304",
    "G06F1750",
    "G06F1110",
    "G06F306"
  ],
  "inventor_list": [
    {
      "inventor_name_last": "Iljazi",
      "inventor_name_first": "Ilir",
      "inventor_city": "Chicago",
      "inventor_state": "IL",
      "inventor_country": "US"
    }
  ],
  "title": "DEVELOPING AN ACCURATE DISPERSED STORAGE NETWORK MEMORY PERFORMANCE MODEL THROUGH TRAINING",
  "decision": "PENDING",
  "_processing_info": {
    "original_size": 82169,
    "optimized_size": 3395,
    "reduction_percent": 95.87
  }
}