{
  "decision": "PENDING",
  "application_number": "15393665",
  "date_published": "20180705",
  "date_produced": "20180620",
  "title": "DYNAMICALLY-QUALIFIED AGGREGATE RELATIONSHIP SYSTEM IN GENEALOGICAL DATABASES",
  "filing_date": "20161229",
  "inventor_list": [
    {
      "inventor_name_last": "Phillips",
      "inventor_name_first": "Jeff",
      "inventor_city": "Lehi",
      "inventor_state": "UT",
      "inventor_country": "US"
    }
  ],
  "ipcr_labels": [
    "G06F1730"
  ],
  "main_ipcr_label": "G06F1730",
  "summary": "<SOH> BRIEF SUMMARY OF THE INVENTION <EOH>Embodiments of the present invention include a method for creating a cluster view person. The method may include obtaining a plurality of genealogical trees. In some embodiments, each of the plurality of genealogical trees includes a plurality of interconnected nodes representing individuals that are related to each other. The method may also include identifying one or more genealogical trees of the plurality of genealogical trees that contain a similar individual. In some embodiments, two different individuals in two different genealogical trees are determined to be similar based on a comparison between the two different individuals and a similarity threshold. Furthermore, the method may include creating an aggregate individual comprising each of the similar individuals in each of the identified genealogical trees. In some embodiments, the aggregate individual combines information from each of the similar individuals. In some embodiments, the combined information from each of the similar individuals includes one or more of the following: a name, a gender, a date of birth, a location of birth, a date of death, and a location of death. The method may also include determining a statistic of the combined information from each of the similar individuals. The method may further include displaying, by a display device, the aggregate individual by displaying the statistic. In some embodiments, the method includes ranking the combined information from each of the similar individuals from most frequent to least frequent. In some embodiments, the similarity threshold is dynamically adjustable by an end user. In some embodiments, the similarity threshold is automatically adjusted by a processor.",
  "patent_number": "None",
  "abstract": "Methods and systems for creating a cluster view person for genealogical studies. Methods may include obtaining a plurality of genealogical trees. Each of the genealogical trees may include a plurality of interconnected nodes representing individuals that are related to each other. Methods may also include identifying one or more of the genealogical trees that contain a similar individual. Whether two individuals are grouped may depend on similarity and/or quality thresholds. Methods may include creating an aggregate individual including each of the similar individuals in each of the identified genealogical trees. The aggregate individual may combine information from each of the similar individuals.",
  "publication_number": "US20180189379A1-20180705",
  "_processing_info": {
    "original_size": 48696,
    "optimized_size": 3022,
    "reduction_percent": 93.79
  }
}