{
  "decision": "PENDING",
  "application_number": "15391526",
  "date_published": "20180628",
  "date_produced": "20180613",
  "title": "CONTEXTUAL DATA IN AUGMENTED REALITY PROCESSING FOR ITEM RECOMMENDATIONS",
  "filing_date": "20161227",
  "inventor_list": [
    {
      "inventor_name_last": "Sanjeevaiah Krishnaiah",
      "inventor_name_first": "Akshay",
      "inventor_city": "San Jose",
      "inventor_state": "CA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Tian",
      "inventor_name_first": "Cheng",
      "inventor_city": "San Jose",
      "inventor_state": "CA",
      "inventor_country": "US"
    }
  ],
  "ipcr_labels": [
    "G06Q3002",
    "G06F30484",
    "G06T1100",
    "G06F316"
  ],
  "main_ipcr_label": "G06Q3002",
  "summary": "<SOH> BRIEF DESCRIPTION OF THE DRAWINGS <EOH>FIG. 1 is a block diagram of a networked system suitable for implementing the processes described herein, according to an embodiment; FIG. 2A is an exemplary environment having a first user utilizing a communication device to capture an environment for display of an augmented reality to provide recommendations to a second user, according to an embodiment; FIG. 2B is an exemplary interface of a communication device displaying an augmented reality to provide recommendations by a first user to a second user, according to an embodiment; FIG. 2C is an exemplary interface of a device displaying recommendations made by a first user to a second user based on tags and contextual data in an environment, according to an embodiment; FIG. 3 is an exemplary system environment showing a communication device and a service provider server interacting to provide recommendations by a first user to a second user based on tags and contextual data in an environment, according to an embodiment; FIG. 4 is a flowchart of an exemplary process for contextual data in augmented reality processing for item recommendations, according to an embodiment; and FIG. 5 is a block diagram of a computer system suitable for implementing one or more components in FIG. 1 , according to an embodiment. detailed-description description=\"Detailed Description\" end=\"lead\"? Embodiments of the present disclosure and their advantages are best understood by referring to the detailed description that follows. It should be appreciated that like reference numerals are used to identify like elements illustrated in one or more of the figures, wherein showings therein are for purposes of illustrating embodiments of the present disclosure and not for purposes of limiting the same.",
  "patent_number": "None",
  "abstract": "There are provided systems and methods for contextual data in augmented reality processing for item recommendations. A first user may provide a recommendation to a second user of an item viewed by the first user through a communication device. The first user may tag the item, for example, through voice input or visual cues while viewing the item at a physical merchant location, or through menu selections within an interface displaying a browsing window of the first user. The first user may provide contextual data that may be used to determine that the first user is recommending the item to the second user, such as voice data that includes an identifier for the second user or visual cues within audiovisual content captured of the item at the physical merchant location. During online browsing, the first user may provide the contextual data through actions, menus selections, and data entry.",
  "publication_number": "US20180181997A1-20180628",
  "_processing_info": {
    "original_size": 100102,
    "optimized_size": 3454,
    "reduction_percent": 96.55
  }
}