{
  "decision": "ACCEPTED",
  "application_number": "15390360",
  "date_published": "20180628",
  "date_produced": "20180613",
  "title": "CONCURRENTLY OPTIMIZED SYSTEM-ON-CHIP IMPLEMENTATION WITH AUTOMATIC SYNTHESIS AND INTEGRATION",
  "filing_date": "20161223",
  "inventor_list": [
    {
      "inventor_name_last": "Fredenburg",
      "inventor_name_first": "Jeffrey",
      "inventor_city": "Ann Arbor",
      "inventor_state": "MI",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Faisal",
      "inventor_name_first": "Muhammad",
      "inventor_city": "Ann Arbor",
      "inventor_state": "MI",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Moore",
      "inventor_name_first": "David M.",
      "inventor_city": "Ann Arbor",
      "inventor_state": "MI",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Shirani",
      "inventor_name_first": "Ramin",
      "inventor_city": "Morgan Hill",
      "inventor_state": "CA",
      "inventor_country": "US"
    }
  ],
  "ipcr_labels": [
    "G06F1750"
  ],
  "main_ipcr_label": "G06F1750",
  "summary": "<SOH> BRIEF DESCRIPTION OF THE DRAWINGS <EOH>Embodiments of the disclosure are illustrated by way of example, and not by way of limitation, in the figures of the accompanying drawings and in which like reference numerals refer to similar elements and in which: FIG. 1 illustrates one embodiment of an electronic design automation (EDA) system. FIG. 2A illustrates a flowchart of steps for one embodiment of a method for manufacturing an integrated circuit utilizing the system of FIG. 1 . FIG. 2B illustrates steps corresponding to the automatically synthesize and integrate step of FIG. 2A . FIG. 2C illustrates steps corresponding to one embodiment of the automatic generation and integration with the digital blocks step of FIG. 2B . FIG. 2D illustrates steps corresponding to a further embodiment of the automatic generation and integration with the digital blocks step of FIG. 2B . FIG. 3A illustrates one embodiment of an oscillator employed as a support circuit in the design flow of FIG. 2A . FIG. 3B is a graph illustrating the timing behavior for the oscillator circuit representation of FIG. 3A . FIG. 4A illustrates one embodiment of a Delay-locked loop (DLL) employed as a support circuit in the design flow of FIG. 2A . FIG. 4B is a graph illustrating the timing behavior for the DLL circuit representation of FIG. 4A . detailed-description description=\"Detailed Description\" end=\"lead\"?",
  "patent_number": "10031992",
  "abstract": "A computer-implemented method for manufacturing an integrated circuit (IC) chip includes defining digital block specifications for the IC; and automatically synthesizing and integrating digital blocks with support circuits in accordance with the digital block specifications.",
  "publication_number": "US20180181684A1-20180628",
  "_processing_info": {
    "original_size": 41538,
    "optimized_size": 2717,
    "reduction_percent": 93.46
  }
}