{
  "patent_number": "None",
  "application_number": "15399722",
  "date_published": "20180705",
  "date_produced": "20180620",
  "filing_date": "20170105",
  "main_ipcr_label": "G06N502",
  "abstract": "Using a specification of a device, a performance capability of the device is computed for hosting a local question and answer (Q and A) system on the device. Based on the specification and a Q and A need, a knowledgebase is selected from a set of knowledgebases in use at a remote Q and A system. The knowledgebase is pruned according to the performance capability of the device, forming a pruned knowledgebase. A Q and A system container (container) is constructed using the pruned knowledgebase. A subset of algorithms is added in the container from a set of algorithms in use at the remote Q and A system. The algorithms in the subset apply to the pruned knowledgebase. The container is deployed as the local Q and A system on the device and updated using an evaluation of an operation of the container.",
  "publication_number": "US20180189657A1-20180705",
  "summary": "<SOH> SUMMARY <EOH>The illustrative embodiments provide a method, system, and computer program product. An embodiment includes a method that computes, at an application operating using a processor and a memory, using a specification of a device, a performance capability of the device for hosting a local question and answer (Q and A) system on the device. The embodiment selects, based on the specification and a Q and A need, a knowledgebase from a set of knowledgebases in use at a remote Q and A system. The embodiment prunes the knowledgebase according to the performance capability of the device, forming a pruned knowledgebase. The embodiment constructs a Q and A system container (container) using the pruned knowledgebase. The embodiment adds a subset of algorithms in the container from a set of algorithms in use at the remote Q and A system, wherein the algorithms in the subset apply to the pruned knowledgebase. The embodiment deploys the container as the local Q and A system on the device. The embodiment updates the container using an evaluation of an operation of the container. An embodiment includes a computer usable program product. The computer usable program product includes one or more computer-readable storage devices, and program instructions stored on at least one of the one or more storage devices. An embodiment includes a computer system. The computer system includes one or more processors, one or more computer-readable memories, and one or more computer-readable storage devices, and program instructions stored on at least one of the one or more storage devices for execution by at least one of the one or more processors via at least one of the one or more memories.",
  "ipcr_labels": [
    "G06N502"
  ],
  "inventor_list": [
    {
      "inventor_name_last": "Karstens",
      "inventor_name_first": "Christopher K.",
      "inventor_city": "Miami Beach",
      "inventor_state": "FL",
      "inventor_country": "US"
    }
  ],
  "title": "DEPLOYING LOCAL Q AND A SYSTEMS IN IoT DEVICES",
  "decision": "PENDING",
  "_processing_info": {
    "original_size": 76285,
    "optimized_size": 3055,
    "reduction_percent": 96.0
  }
}