{
  "decision": "PENDING",
  "application_number": "15390225",
  "date_published": "20180628",
  "date_produced": "20180613",
  "title": "SEMICONDUCTOR PACKAGE DEVICE AND METHOD OF MANUFACTURING THE SAME",
  "filing_date": "20161223",
  "inventor_list": [
    {
      "inventor_name_last": "YEH",
      "inventor_name_first": "Chang-Lin",
      "inventor_city": "Kaohsiung",
      "inventor_state": "",
      "inventor_country": "TW"
    }
  ],
  "ipcr_labels": [
    "H01L23522",
    "H01L23532",
    "H01L23528",
    "G06K710"
  ],
  "main_ipcr_label": "H01L23522",
  "summary": "<SOH> SUMMARY <EOH>In accordance with some embodiments of the present disclosure, an electronic module includes a substrate, an electronic component, a first package body, a magnetic layer, a coil and a second package body. The electronic component is on the substrate. The first package body is on the substrate and covers the electronic component. The magnetic layer is on the first package body. The coil is on the magnetic layer. The coil includes a first section and a second section spaced from the first section. The first section and the second section are connected by a conductive material. The second package body is disposed on the magnetic layer and covers the coil. In accordance with some embodiments of the present disclosure, an electronic module includes a substrate, an electronic component, a first package body, a magnetic layer, a plurality of pillars and a conductive wire. The electronic component is on the substrate. The first package body is on the substrate and covers the electronic component. The magnetic layer is on the first package body. The plurality of pillars are on the magnetic layer and are spaced from one another. The conductive wire connects each of the plurality of pillars. In accordance with some embodiments of the present disclosure, an electronic module includes a substrate, an electronic component, a first package body, a magnetic layer, a plurality of conductive contacts and a plurality of conductive wires. The electronic component is on the substrate. The first package body is on the substrate and covers the electronic component. The magnetic layer is on the first package body. The plurality of conductive contacts are on the magnetic layer and are spaced from one another. Each of the plurality of conductive wires is connected between two conductive contacts.",
  "patent_number": "None",
  "abstract": "The disclosure relates to an electronic module and a manufacturing method of the same. The electronic module includes a substrate, an electronic component, a first package body, a magnetic layer, a coil and a second package body. The electronic component is on the substrate. The first package body is on the substrate and covers the electronic component. The magnetic layer is on the first package body. The coil is on the magnetic layer. The coil includes a first section and a second section spaced from the first section. The first section and the second section are connected by a conductive material. The second package body is on the magnetic layer and covers the coil.",
  "publication_number": "US20180182704A1-20180628",
  "_processing_info": {
    "original_size": 42544,
    "optimized_size": 3086,
    "reduction_percent": 92.75
  }
}