{
  "date_produced": "20170405",
  "publication_number": "US20170109635A1-20170420",
  "main_ipcr_label": "G06N504",
  "decision": "PENDING",
  "application_number": "15391147",
  "inventor_list": [
    {
      "inventor_name_last": "Prestigiacomo",
      "inventor_name_first": "Anthony",
      "inventor_city": "Baton Rouge",
      "inventor_state": "LA",
      "inventor_country": "US"
    }
  ],
  "abstract": "Provided are architectures, system, methods, and computer program products that provide a user with the ability to define an association of data and/or information from known reference sets perceived by the user as relevant to a subject matter domain, thereby imparting and formalizing some of the user's knowledge about the domain. An associative relevancy knowledge profiler may also allow a user to create a profile by modifying or restricting the known reference sets and windowing the results from the association as a user might refine any other analysis algorithms. An associative relevancy knowledge profiler may also be used to define a user profile used by the user and others. A user profile may be usable in various manners depending upon, for example, rights management permissions and restrictions for a user.",
  "filing_date": "20161227",
  "patent_number": "None",
  "summary": "<SOH> SUMMARY <EOH>In light of the foregoing background, embodiments of the present invention provide associative relevancy knowledge profiling architectures, systems, methods, and computer program products for capturing relevant associations between known reference sets as a way of capturing knowledge from a domain expert, also referred to as a subject matter expert (SME). Embodiments of the present invention are not intended to replace search engines or inference engines, but are intended to provide a separate type of technology that may be used, for example, to improve upon search engines and inference engines. Notably, embodiments of the present invention should not be confused with a search engine or inference engine, a search profile, a navigation history, or a search history. Embodiments of the present invention are a separate technology designed to provide additional capabilities and functionalities that are not known to exist, apart from or in conjunction with use in the context of a search engine or inference engine. Embodiments of the present invention provide a user with the ability to define an association of data and/or information that is perceived by the user as relevant to a subject matter domain, thereby imparting and formalizing some of his or her knowledge about the domain. An embodiment of an associative relevancy knowledge profiler of the present invention may also allow a user to create a profile by modifying or restricting the known reference sets and windowing the results from the association as a user might refine any other analysis algorithms and for related evaluation purposes, but here the user in effectively modifying or restricting knowledge, often to improve or clarify the knowledge, or to further define the knowledge. Further embodiments of the present invention can be used to define a profile that can subsequently be used by the user who creates the profile and/or use by others. A user profile may be usable in various manners depend...",
  "date_published": "20170420",
  "title": "Associative Relevancy Knowledge Profiling Architecture, System, Method, And Computer Program Product",
  "ipcr_labels": [
    "G06N504",
    "G06F1730"
  ],
  "_processing_info": {
    "original_size": 86664,
    "optimized_size": 3434,
    "reduction_percent": 96.04
  }
}