{
  "date_produced": "20180516",
  "publication_number": "US20180150754A1-20180531",
  "main_ipcr_label": "G06N504",
  "decision": "PENDING",
  "application_number": "15393554",
  "inventor_list": [
    {
      "inventor_name_last": "Huang",
      "inventor_name_first": "Hsin-Chien",
      "inventor_city": "Tainan City",
      "inventor_state": "",
      "inventor_country": "TW"
    },
    {
      "inventor_name_last": "Tsui",
      "inventor_name_first": "Wen",
      "inventor_city": "Zhubei City",
      "inventor_state": "",
      "inventor_country": "TW"
    },
    {
      "inventor_name_last": "Chung",
      "inventor_name_first": "Chu-An",
      "inventor_city": "Zhubei City",
      "inventor_state": "",
      "inventor_country": "TW"
    },
    {
      "inventor_name_last": "Chiang",
      "inventor_name_first": "Pei-Hsuan",
      "inventor_city": "Chiayi City",
      "inventor_state": "",
      "inventor_country": "TW"
    },
    {
      "inventor_name_last": "Chen",
      "inventor_name_first": "Hung-Hsuan",
      "inventor_city": "New Taipei City",
      "inventor_state": "",
      "inventor_country": "TW"
    }
  ],
  "abstract": "A data analysis method is provided. The data analysis method includes collecting a user data; generating a number of situation conditions from the user data; calculating a distribution ratio of each of the situation conditions to obtain a first data; calculating a success ratio of information association of an information association algorithm under each of the situation conditions to obtain a second data; obtaining at least one evaluating parameter of the information association algorithm under the situation conditions according to the first data and the second data; and generating a suggestion information relating to the information association algorithm according to the at least one evaluating parameter.",
  "filing_date": "20161229",
  "patent_number": "None",
  "summary": "<SOH> SUMMARY <EOH>The disclosure is directed to a data analysis method, system and non-transitory computer readable medium, which could evaluate the performance of various information association algorithms (for example, recommendation algorithm) under each situation condition and provide suggestion information accordingly for analysts. Thereby, the effect of applying the information association algorithm could be improved. According to one embodiment, a data analysis method is provided. The data analysis method includes collecting a user data; generating a number of situation conditions from the user data; calculating a distribution ratio of each of the situation conditions to obtain a first data; calculating a success ratio of information association of an information association algorithm under each of the situation conditions to obtain a second data; obtaining at least one evaluating parameter of the information association algorithm under the situation conditions according to the first data and the second data; and generating a suggestion information relating to the information association algorithm according to the at least one evaluating parameter. According to another embodiment, a data analysis system is provided. The a data analysis system includes a data collecting module, a situation condition generating module, an analysis module, an evaluating module, and a suggestion information generating module. The data collecting module collects a user data. The situation condition generating module generates a number of situation conditions from the user data. The analysis module calculates a distribution ratio of each of the situation conditions to obtain a first data, and calculates a success ratio of information association of an information association algorithm under each of the situation conditions to obtain a second data. The evaluating module obtains at least one evaluating parameter of the information association algorithm under the situation conditions...",
  "date_published": "20180531",
  "title": "DATA ANALYSIS METHOD, SYSTEM AND NON-TRANSITORY COMPUTER READABLE MEDIUM",
  "ipcr_labels": [
    "G06N504",
    "G06N304",
    "G06N308",
    "G06N700"
  ],
  "_processing_info": {
    "original_size": 42572,
    "optimized_size": 3904,
    "reduction_percent": 90.83
  }
}