{
  "decision": "PENDING",
  "application_number": "15396430",
  "date_published": "20180705",
  "date_produced": "20180620",
  "title": "SYSTEMS AND METHODS TO PRESENT REACTIONS TO MEDIA CONTENT IN A VIRTUAL ENVIRONMENT",
  "filing_date": "20161231",
  "inventor_list": [
    {
      "inventor_name_last": "Sutton",
      "inventor_name_first": "Charles Matthew",
      "inventor_city": "San Francisco",
      "inventor_state": "CA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Warren",
      "inventor_name_first": "Cliff",
      "inventor_city": "San Francisco",
      "inventor_state": "CA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Valdivia",
      "inventor_name_first": "Gabriel",
      "inventor_city": "San Francisco",
      "inventor_state": "CA",
      "inventor_country": "US"
    }
  ],
  "ipcr_labels": [
    "G06K900",
    "G06T1340",
    "G06T1380",
    "G06F301",
    "G06T1900",
    "G06T1160"
  ],
  "main_ipcr_label": "G06K900",
  "summary": "<SOH> SUMMARY <EOH>Various embodiments of the present technology can include systems, methods, and non-transitory computer readable media configured to receive a recording of an expression of a content provider in response to a digital environment. The expression can be based on at least one of gestures, body movement, speech, and sounds of the content provider. An animation can be created based on the recording. A reaction based on the animation can be presented to a user in the digital environment. In some embodiments, the animation can comprise at least one of a coin or an avatar exhibiting motion that mirrors the expression of the content provider. In some embodiments, the coin can comprise an identifying picture of the content provider and the avatar can comprise a generic sketch of at least a portion of a human figure. In some embodiments, a form of the reaction to be presented to the user can be determined based on a type of the digital environment. In some embodiments, the reaction can be associated with a time stamp relating to a portion of media content providing the digital environment. Play back of the reaction to the user can be automatically initiated in response to the portion of the media content being presented to the user. In some embodiments, a plurality of reactions associated with a scene in the digital environment can be indicated to the user for selection by the user in response to the scene being presented to the user. In some embodiments, a plurality of reactions can be ranked for potential presentation to the user in the digital environment. The plurality of reactions can be presented in rank order to the user. In some embodiments, the digital environment can comprise at least one of a virtual reality (VR) environment, an augmented reality (AR) environment, or a mixed reality (MR) environment. In some embodiments, the digital environment can be provided through media content presented through an interface of a computing device, the media co...",
  "patent_number": "None",
  "abstract": "Systems, methods, and non-transitory computer readable media are configured to receive a recording of an expression of a content provider in response to a digital environment. The expression can be based on at least one of gestures, body movement, speech, and sounds of the content provider. An animation can be based on the recording. A reaction based on the animation can be presented to a user in the digital environment.",
  "publication_number": "US20180189554A1-20180705",
  "_processing_info": {
    "original_size": 90325,
    "optimized_size": 3371,
    "reduction_percent": 96.27
  }
}