{
  "patent_number": "None",
  "application_number": "15399210",
  "date_published": "20170427",
  "date_produced": "20170412",
  "filing_date": "20170105",
  "main_ipcr_label": "G06N312",
  "abstract": "A method includes receiving a set of parameters for a given project and generating, using information from a knowledge database, a plurality of combinations of group members based at least in part on the set of parameters. The method also includes evaluating a set of metrics for each of the combinations of group members, the set of metrics comprising at least one novelty metric and at least one collective intelligence metric. The method further includes generating one or more strategy matrices for each of at least a subset of the combinations of group members using information from the knowledge database, evaluating the combinations of group members in the subset using the strategy matrices to determine respective predicted success values, and selecting a given one of the combinations of group members for the given project based at least in part on the sets of metrics and predicted success values.",
  "publication_number": "US20170116525A1-20170427",
  "summary": "<SOH> SUMMARY <EOH>According to one embodiment of the present invention, a method comprises receiving a set of parameters for a given project, generating, using information from a knowledge database, a plurality of combinations of group members based at least in part on the set of parameters, evaluating a set of metrics for each of the combinations of group members, the set of metrics comprising at least one novelty metric and at least one collective intelligence metric, generating one or more strategy matrices for each of at least a subset of the combinations of group members using information from the knowledge database, evaluating the combinations of group members in the subset using the strategy matrices to determine respective predicted success values, and selecting a given one of the combinations of group members for the given project based at least in part on the sets of metrics and predicted success values. The method is performed by at least one processing device comprising a processor coupled to a memory. According to another embodiment of the invention, an article of manufacture comprises a computer readable storage medium for storing computer readable program code. The computer readable program code, when executed, causes a computer to receive a set of parameters for a given project, to generate, using information from a knowledge database, a plurality of combinations of group members based at least in part on the set of parameters, to evaluate a set of metrics for each of the combinations of group members, the set of metrics comprising at least one novelty metric and at least one collective intelligence metric, to generate one or more strategy matrices for each of at least a subset of the combinations of group members using information from the knowledge database, to evaluate the combinations of group members in the subset using the strategy matrices to determine respective predicted success values, and to select a given one of the combinations of group...",
  "ipcr_labels": [
    "G06N312",
    "G06N700",
    "G06F1716",
    "G06N9900"
  ],
  "inventor_list": [
    {
      "inventor_name_last": "Pinel",
      "inventor_name_first": "Florian",
      "inventor_city": "New York",
      "inventor_state": "NY",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Ratakonda",
      "inventor_name_first": "Krishna C.",
      "inventor_city": "Yorktown Heights",
      "inventor_state": "NY",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Varshney",
      "inventor_name_first": "Lav R.",
      "inventor_city": "Champaign",
      "inventor_state": "IL",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Wang",
      "inventor_name_first": "Dashun",
      "inventor_city": "White Plains",
      "inventor_state": "NY",
      "inventor_country": "US"
    }
  ],
  "title": "GROUP GENERATION USING SETS OF METRICS AND PREDICTED SUCCESS VALUES",
  "decision": "PENDING",
  "_processing_info": {
    "original_size": 65232,
    "optimized_size": 3958,
    "reduction_percent": 93.93
  }
}