{
  "patent_number": "None",
  "application_number": "15396977",
  "date_published": "20180705",
  "date_produced": "20180620",
  "filing_date": "20170103",
  "main_ipcr_label": "G06N300",
  "abstract": "An approach is provided to receive, at a question answering (QA) system, a question and identify a politeness corresponding to a number of terms corresponding to the question that are included in a corpus of the QA system. The approach identifies the politeness of one or more terms included in each of a set of candidate answers responsive to the question. Finally, the approach scores each of the candidate answers, with the scoring being based, in part, on the politeness identified for each of the terms.",
  "publication_number": "US20180189630A1-20180705",
  "summary": "<SOH> BRIEF SUMMARY <EOH>An approach is provided to receive, at a question answering (QA) system, a question and identify a politeness corresponding to a number of terms corresponding to the question that are included in a corpus of the QA system. The approach identifies the politeness of one or more terms included in each of a set of candidate answers responsive to the question. Finally, the approach scores each of the candidate answers, with the scoring being based, in part, on the politeness identified for each of the terms. The foregoing is a summary and thus contains, by necessity, simplifications, generalizations, and omissions of detail; consequently, those skilled in the art will appreciate that the summary is illustrative only and is not intended to be in any way limiting. Other aspects, inventive features, and advantages of the present disclosure, as defined solely by the claims, will become apparent in the non-limiting detailed description set forth below.",
  "ipcr_labels": [
    "G06N300",
    "G06F1730"
  ],
  "inventor_list": [
    {
      "inventor_name_last": "Boguraev",
      "inventor_name_first": "Branimir K.",
      "inventor_city": "Bedford",
      "inventor_state": "NY",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Chandrasekaran",
      "inventor_name_first": "Swaminathan",
      "inventor_city": "Coppell",
      "inventor_state": "TX",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Dandala",
      "inventor_name_first": "Bharath",
      "inventor_city": "White Plains",
      "inventor_state": "NY",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Krishnamurthy",
      "inventor_name_first": "Lakshminarayanan",
      "inventor_city": "Round Rock",
      "inventor_state": "TX",
      "inventor_country": "US"
    }
  ],
  "title": "Augment Politeness in Question Answer Systems",
  "decision": "PENDING",
  "_processing_info": {
    "original_size": 55680,
    "optimized_size": 2512,
    "reduction_percent": 95.49
  }
}