{
  "decision": "REJECTED",
  "application_number": "15393262",
  "date_published": "20170706",
  "date_produced": "20170621",
  "title": "WIRELESS EARPHONE AND CONTROLLING METHOD OF SAME",
  "filing_date": "20161229",
  "inventor_list": [
    {
      "inventor_name_last": "HUNG",
      "inventor_name_first": "SU-YU",
      "inventor_city": "Chupei",
      "inventor_state": "",
      "inventor_country": "TW"
    },
    {
      "inventor_name_last": "LIAO",
      "inventor_name_first": "CHIA-NAN",
      "inventor_city": "Chupei",
      "inventor_state": "",
      "inventor_country": "TW"
    },
    {
      "inventor_name_last": "CHEN",
      "inventor_name_first": "CHEN-CHUN",
      "inventor_city": "New Taipei",
      "inventor_state": "",
      "inventor_country": "TW"
    }
  ],
  "ipcr_labels": [
    "H04R110",
    "G06F316"
  ],
  "main_ipcr_label": "H04R110",
  "summary": "<SOH> BRIEF DESCRIPTION OF THE DRAWINGS <EOH>Implementations of the present disclosure will now be described, by way of examples only, with references to the accompanying drawings. FIG. 1 is an illustration of exemplary communications configurations of an earphone set and an audio content providing device. FIG. 2A is a front perspective view of an exemplary embodiment of an earphone of the present disclosure. FIG. 2B is a rear perspective view of the earphone in FIG. 2A . FIG. 3 is a circuit block diagram of the earphone in FIG. 2A . FIG. 4 is a flow diagram illustrating an exemplary embodiment for switching between operating modes of the earphone. FIG. 5 is a flow diagram illustrating an exemplary embodiment for switching between operating modes of the earphone by recognizing different input modes of a user. FIG. 6 is a flow diagram illustrating an exemplary method of user input modes triggering various media control functions of the earphone in a media mode. FIG. 7A is a flow diagram illustrating an exemplary method of user input modes triggering various call control functions of the earphone in a call mode when the user receives a call. FIG. 7B is a flow diagram illustrating an exemplary method of user input modes triggering various call control functions of the earphone in a call mode. FIG. 8A is a left-side view of an exemplary embodiment of an opened earphone case, one earphone is inside the earphone case. FIG. 8B is a lateral view of the exemplary embodiment of the opened earphone case, one earphone is inside the earphone case and another earphone is partially outside the earphone case. FIG. 9A is a perspective view of the exemplary embodiment of the earphone case when closed, the case being capable of connecting with a USB cable. FIG. 9B is an enlarged view of a dotted line region of the earphone case in FIG. 9A . FIG. 10A is an illustration of a first embodiment of a stabilizer able to couple to an earphone. FIG. 10B is an illustration of the first embodime...",
  "patent_number": "None",
  "abstract": "A wireless earphone able to accept local user input for controlling of an independent audio-transmitting and communications device includes at least an input unit and a microcontroller. Various input modes and corresponding function-executing instructions are stored in the microcontroller. A user may apply different types of input to the input unit. Upon recognizing one input mode based on the user's input, the microcontroller executes one corresponding instruction to switches between operating modes of the wireless earphone.",
  "publication_number": "US20170195771A1-20170706",
  "_processing_info": {
    "original_size": 40477,
    "optimized_size": 3361,
    "reduction_percent": 91.7
  }
}