{
  "date_produced": "20170823",
  "publication_number": "US20170255879A1-20170907",
  "main_ipcr_label": "G06N9900",
  "decision": "PENDING",
  "application_number": "15392017",
  "inventor_list": [
    {
      "inventor_name_last": "CHEN",
      "inventor_name_first": "Li",
      "inventor_city": "Beijing",
      "inventor_state": "",
      "inventor_country": "CN"
    },
    {
      "inventor_name_last": "XU",
      "inventor_name_first": "Qian",
      "inventor_city": "Beijing",
      "inventor_state": "",
      "inventor_country": "CN"
    },
    {
      "inventor_name_last": "TIAN",
      "inventor_name_first": "Hao",
      "inventor_city": "Beijing",
      "inventor_state": "",
      "inventor_country": "CN"
    },
    {
      "inventor_name_last": "HE",
      "inventor_name_first": "Jingzhou",
      "inventor_city": "Beijing",
      "inventor_state": "",
      "inventor_country": "CN"
    },
    {
      "inventor_name_last": "SHI",
      "inventor_name_first": "Lei",
      "inventor_city": "Beijing",
      "inventor_state": "",
      "inventor_country": "CN"
    },
    {
      "inventor_name_last": "WANG",
      "inventor_name_first": "Fan",
      "inventor_city": "Beijing",
      "inventor_state": "",
      "inventor_country": "CN"
    },
    {
      "inventor_name_last": "HUANG",
      "inventor_name_first": "Shiwei",
      "inventor_city": "Beijing",
      "inventor_state": "",
      "inventor_country": "CN"
    },
    {
      "inventor_name_last": "ZHENG",
      "inventor_name_first": "Derong",
      "inventor_city": "Beijing",
      "inventor_state": "",
      "inventor_country": "CN"
    }
  ],
  "abstract": "A searching method and device based on artificial intelligence is provided in the present disclosure. The searching method includes: obtaining a query; obtaining a first search result corresponding to the query according to a Markov Decision Process MDP model; displaying the first search result; and obtaining a reward for the first search result from a user so as to obtain a second search result according to the MDP model, and displaying the second search result. According to the searching method, the interaction with the user may be more effective, the user's demand is better satisfied, and the user experience is improved.",
  "filing_date": "20161228",
  "patent_number": "None",
  "summary": "<SOH> SUMMARY <EOH>The present disclosure seeks to solve at least one of the problems existing in the related art to at least some extent. For this, according to a first aspect of embodiments of the present disclosure, a searching method based on artificial intelligence is proposed. The searching method includes: obtaining a query; obtaining a first search result corresponding to the query according to a MDP (Markov Decision Process) model; displaying the first search result; and obtaining a reward for the first search result from a user so as to obtain a second search result according to the MDP model, and displaying the second search result. According to a second aspect of embodiments of the present disclosure, a searching device based on artificial intelligence is proposed. The searching device includes one or more computing devices configured to execute one or more software modules, the one or more software modules including: an obtaining module, configured to obtain a query; a calculating module, configured to obtain a first search result corresponding to the query according to a MDP model; a displaying module, configured to display the first search result; and a reward module, configured to obtain a reward for the first search result from a user, such that a second search result is obtained according to the MDP model, and the second search result is displayed. According to a third aspect of embodiments of the present disclosure, a non-transitory computer readable storage medium is provided. The storage medium has stored therein instructions that, when executed by a processor of a terminal, cause the terminal to perform a searching method described above. With the present disclosure, multiple interactions may be performed with the user, such that the interaction with the user is more effective, and moreover, by obtaining the search result according to the MDP model, the user's demand is better satisfied, and the user experience is improved. Additional aspects a...",
  "date_published": "20170907",
  "title": "SEARCHING METHOD AND DEVICE BASED ON ARTIFICIAL INTELLIGENCE",
  "ipcr_labels": [
    "G06N9900",
    "G06F1730"
  ],
  "_processing_info": {
    "original_size": 30391,
    "optimized_size": 4159,
    "reduction_percent": 86.32
  }
}