{
  "decision": "PENDING",
  "application_number": "15395836",
  "date_published": "20180705",
  "date_produced": "20180620",
  "title": "SYSTEMS AND METHODS FOR PROVIDING CONTENT ITEMS ASSOCIATED WITH OBJECTS",
  "filing_date": "20161230",
  "inventor_list": [
    {
      "inventor_name_last": "Paul",
      "inventor_name_first": "Debashish",
      "inventor_city": "Sunnyvale",
      "inventor_state": "CA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Sutton",
      "inventor_name_first": "Charles Matthew",
      "inventor_city": "San Francisco",
      "inventor_state": "CA",
      "inventor_country": "US"
    }
  ],
  "ipcr_labels": [
    "G11B2734",
    "G06T1900",
    "G11B27036",
    "H04N5272",
    "G11B2700",
    "G11B2722",
    "G06F1750",
    "G06Q3002"
  ],
  "main_ipcr_label": "G11B2734",
  "summary": "<SOH> SUMMARY <EOH>Various embodiments of the present disclosure can include systems, methods, and non-transitory computer readable media configured to identify an object included in a video content item. A content item associated with the object can be determined during playback of the video content item, wherein the content item is one or more of: a two-dimensional content item or a three-dimensional content item. An indicator associated with the content item can be provided in the video content item. The content item can be provided in response to a selection of the indicator. In some embodiments, the selection of the indicator associated with the content item creates a layer for presenting three-dimensional content, and wherein the content item is provided in the layer. In certain embodiment, the layer is an augmented reality (AR) layer. In an embodiment, the content item is a three-dimensional model of an object. In some embodiments, the layer is presented on top of the video content item. In certain embodiments, the layer is removed in response to one or more of: completion of playback of the content item or a selection by a user. In an embodiment, the object includes one or more of: a logo or a brand. In some embodiments, the identified object is detected based on one or more of: object detection or object tracking. In certain embodiments, the identified object is defined in the video content item based on user input. In an embodiment, the content item includes one or more of: an advertisement or a menu for purchasing an item associated with the object. It should be appreciated that many other features, applications, embodiments, and/or variations of the disclosed technology will be apparent from the accompanying drawings and from the following detailed description. Additional and/or alternative implementations of the structures, systems, non-transitory computer readable media, and methods described herein can be employed without departing from the principles...",
  "patent_number": "None",
  "abstract": "Systems, methods, and non-transitory computer readable media can identify an object included in a video content item. A content item associated with the object can be determined during playback of the video content item, wherein the content item is one or more of: a two-dimensional content item or a three-dimensional content item. An indicator associated with the content item can be provided in the video content item. The content item can be provided in response to a selection of the indicator.",
  "publication_number": "US20180190324A1-20180705",
  "_processing_info": {
    "original_size": 86327,
    "optimized_size": 3307,
    "reduction_percent": 96.17
  }
}