{
  "decision": "PENDING",
  "application_number": "15394548",
  "date_published": "20170706",
  "date_produced": "20170621",
  "title": "NEUROMORPHIC DEVICE",
  "filing_date": "20161229",
  "inventor_list": [
    {
      "inventor_name_last": "LEE",
      "inventor_name_first": "Hyung-Dong",
      "inventor_city": "Icheon",
      "inventor_state": "",
      "inventor_country": "KR"
    }
  ],
  "ipcr_labels": [
    "H01L2711521",
    "H01L2711556",
    "G06N3063",
    "H01L2711519"
  ],
  "main_ipcr_label": "H01L2711521",
  "summary": "<SOH> SUMMARY <EOH>Embodiments of the present disclosure are directed to a neuromorphic device having enhanced accuracy of learning and recognition. In accordance with an embodiment, a neuromorphic device includes a plurality of row lines extending in a first direction; a plurality of additional row lines extending in the first direction; a plurality of column lines extending in a second direction that crosses the first direction; and a plurality of synapses positioned at intersections of the row lines, the additional row lines, and the column lines, wherein each of the synapses includes a transistor comprising a floating gate, a control gate insulated from the floating gate, a first junction, and a second junction, the control gate being coupled to a corresponding one of the plurality of row lines, the first junction being coupled to a corresponding one of the plurality of additional row lines, the second junction being coupled to a corresponding one of the plurality of column lines. In the above embodiment, the plurality of row lines receive voltage pulses corresponding to certain data. A threshold voltage of the transistor decreases when a certain charge is trapped in the floating gate. An amount of the charge trapped in the floating gate increases when a number of the voltage pulses received by the plurality of row lines increases. The threshold voltage of the transistor decreases when a number of the voltage pulses received by the plurality of row lines increases. A current flow between the first junction and the second junction increases when a number of the voltage pulses received by the plurality of row lines increases. The plurality of additional row lines receives a voltage having the same polarity as the voltage pulses received by the plurality of row lines. The voltage received by the plurality of additional row lines has the same magnitude as the voltage pulses received by the plurality of row lines. Each of the plurality of column lines learns differen...",
  "patent_number": "None",
  "abstract": "A neuromorphic device may include: a plurality of row lines extending in a first direction; a plurality of additional row lines extending in the first direction; a plurality of column lines extending in a second direction that crosses the first direction; and a plurality of synapses positioned at intersections of the row lines, the additional row lines, and the column lines, wherein each of the synapses includes a transistor comprising a floating gate, a control gate insulated from the floating gate, a first junction, and a second junction, the control gate being coupled to a corresponding one of the plurality of row lines, the first junction being coupled to a corresponding one of the plurality of additional row lines, the second junction being coupled to a corresponding one of the plurality of column lines.",
  "publication_number": "US20170194337A1-20170706",
  "_processing_info": {
    "original_size": 88374,
    "optimized_size": 3374,
    "reduction_percent": 96.18
  }
}