{
  "decision": "PENDING",
  "application_number": "15390730",
  "date_published": "20180628",
  "date_produced": "20180613",
  "title": "STYLUS AND OPERATION METHOD THEREOF",
  "filing_date": "20161227",
  "inventor_list": [
    {
      "inventor_name_last": "LIN",
      "inventor_name_first": "Hung-Yi",
      "inventor_city": "TAIPEI",
      "inventor_state": "",
      "inventor_country": "TW"
    },
    {
      "inventor_name_last": "LAI",
      "inventor_name_first": "Yi-Lun",
      "inventor_city": "TAIPEI",
      "inventor_state": "",
      "inventor_country": "TW"
    }
  ],
  "ipcr_labels": [
    "G06F30354",
    "G06F301"
  ],
  "main_ipcr_label": "G06F30354",
  "summary": "<SOH> BRIEF SUMMARY OF THE INVENTION <EOH>According to an aspect of the disclosure, a stylus is provided. The stylus comprises a main body and a functional part. The main body includes a first processor, a trigger coupled to the first processor, and a connection interface coupled to the first processor. The functional part includes a functional module. The functional module is detachably coupled to the connection interface. When the functional part is coupled to the connection interface, the first processor determines a function of the functional module via the connection interface, and the first processor enables the functional module when the trigger is triggered. According to another aspect of the disclosure, an operating method for a stylus is provided. The stylus includes a main body and a functional part. The main body includes a first processor, a trigger and a connection interface. The functional part includes a functional module. The operating method comprises: determining whether the functional part is coupled to the connection interface by the first processor; determining a function of the functional module via the connection interface by the first processor when the functional part is determined to be coupled to the connection interface; determining whether the trigger is triggered by the first processor after the function of the functional module is determined; and enabling the functional module by the first processor when the trigger is determined to be triggered. Therefore, in embodiments, the stylus and the operating method thereof include expanded functions.",
  "patent_number": "None",
  "abstract": "A stylus is provided. The stylus comprises a main body and a functional part. The main body includes a first processor, a trigger coupled to the first processor, and a connection interface coupled to the first processor. The functional part includes a functional module. The functional module is detachably coupled to the connection interface. When the functional part is coupled to the connection interface, the first processor determines a function of the functional module via the connection interface. The first processor enables the functional module when the trigger is triggered. An operating method for a stylus is also provided.",
  "publication_number": "US20180181218A1-20180628",
  "_processing_info": {
    "original_size": 29681,
    "optimized_size": 2906,
    "reduction_percent": 90.21
  }
}