{
  "date_produced": "20170726",
  "publication_number": "US20170228642A1-20170810",
  "main_ipcr_label": "G06N308",
  "decision": "PENDING",
  "application_number": "15395553",
  "inventor_list": [
    {
      "inventor_name_last": "Danihelka",
      "inventor_name_first": "Ivo",
      "inventor_city": "London",
      "inventor_state": "",
      "inventor_country": "GB"
    },
    {
      "inventor_name_last": "Kalchbrenner",
      "inventor_name_first": "Nal Emmerich",
      "inventor_city": "London",
      "inventor_state": "",
      "inventor_country": "GB"
    },
    {
      "inventor_name_last": "Wayne",
      "inventor_name_first": "Gregory Duncan",
      "inventor_city": "London",
      "inventor_state": "",
      "inventor_country": "GB"
    },
    {
      "inventor_name_last": "Uría-Martínez",
      "inventor_name_first": "Benigno",
      "inventor_city": "London",
      "inventor_state": "",
      "inventor_country": "GB"
    },
    {
      "inventor_name_last": "Graves",
      "inventor_name_first": "Alexander Benjamin",
      "inventor_city": "London",
      "inventor_state": "",
      "inventor_country": "GB"
    }
  ],
  "abstract": "Systems, methods, and apparatus, including computer programs encoded on a computer storage medium, related to associative long short-term memory (LSTM) neural network layers configured to maintain N copies of an internal state for the associative LSTM layer, N being an integer greater than one. In one aspect, a system includes a recurrent neural network including an associative LSTM layer, wherein the associative LSTM layer is configured to, for each time step, receive a layer input, update each of the N copies of the internal state using the layer input for the time step and a layer output generated by the associative LSTM layer for a preceding time step, and generate a layer output for the time step using the N updated copies of the internal state.",
  "filing_date": "20161230",
  "patent_number": "None",
  "summary": "<SOH> SUMMARY <EOH>In general, one innovative aspect of the subject matter described in this specification can be embodied in systems that include a recurrent neural network implemented by one or more computers, wherein the recurrent neural network is configured to receive a respective neural network input at each of a plurality of time steps and to generate a respective neural network output at each of the plurality of time steps, wherein the recurrent neural network includes an associative long short-term memory (LSTM) layer, wherein the associative LSTM layer is configured to maintain N copies of an internal state for the associative LSTM layer, N being an integer greater than one, and wherein the associative LSTM layer is further configured to, at each of the plurality of time steps, receive a layer input for the time step, update each of the N copies of the internal state using the layer input for the time step and a layer output generated by the associative LSTM layer for a preceding time step, and generate a layer output for the time step using the N updated copies of the internal state. Other embodiments of this aspect include methods that perform the operations that associative LSTM layer is configured to perform. Other embodiments of this aspect include corresponding computer systems, apparatus, and computer programs recorded on one or more computer storage devices, each configured to perform the actions of the methods. A system of one or more computers can be configured to perform particular operations or actions by virtue of software, firmware, hardware, or any combination thereof installed on the system that in operation may cause the system to perform the actions. One or more computer programs can be configured to perform particular operations or actions by virtue of including instructions that, when executed by data processing apparatus, cause the apparatus to perform the actions. Implementations can include one or more of the following optional featu...",
  "date_published": "20170810",
  "title": "ASSOCIATIVE LONG SHORT-TERM MEMORY NEURAL NETWORK LAYERS",
  "ipcr_labels": [
    "G06N308",
    "G06N304"
  ],
  "_processing_info": {
    "original_size": 61663,
    "optimized_size": 3928,
    "reduction_percent": 93.63
  }
}