{
  "patent_number": "None",
  "application_number": "15398514",
  "date_published": "20170622",
  "date_produced": "20170607",
  "filing_date": "20170104",
  "main_ipcr_label": "G06N502",
  "abstract": "Methods, systems, and products adapt recommender systems with pairwise feedback. A pairwise question is posed to a user. A response is received that selects a preference for a pair of items in the pairwise question. A latent factor model is adapted to incorporate the response, and an item is recommended to the user based on the response.",
  "publication_number": "US20170178006A1-20170622",
  "summary": "<SOH> BRIEF DESCRIPTION OF THE SEVERAL VIEWS OF THE DRAWINGS <EOH>The features, aspects, and advantages of the exemplary embodiments are better understood when the following Detailed Description is read with reference to the accompanying drawings, wherein: FIG. 1 is a simplified schematic illustrating an environment in which exemplary embodiments may be implemented; FIG. 2 is a more detailed schematic illustrating the operating environment, according to exemplary embodiments; FIG. 3 is a high level pseudo-code summary for an algorithm that uses pairwise adaptive sequential feedback, according to exemplary embodiments; FIG. 4 is a graph illustrating the results of the automated experiment, according to exemplary embodiments; FIG. 5 is a generic block diagram of a processor-controlled device, according to exemplary embodiments; and FIG. 6 depicts other possible operating environments for additional aspects of the exemplary embodiments. detailed-description description=\"Detailed Description\" end=\"lead\"?",
  "ipcr_labels": [
    "G06N502",
    "G06F1718",
    "G06N700",
    "G06F1730"
  ],
  "inventor_list": [
    {
      "inventor_name_last": "Balakrishnan",
      "inventor_name_first": "Suhrid",
      "inventor_city": "Scotch Plains",
      "inventor_state": "NJ",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Chopra",
      "inventor_name_first": "Sumit",
      "inventor_city": "Jersey City",
      "inventor_state": "NJ",
      "inventor_country": "US"
    }
  ],
  "title": "ADAPTIVE PAIRWISE PREFERENCES IN RECOMMENDERS",
  "decision": "PENDING",
  "_processing_info": {
    "original_size": 60007,
    "optimized_size": 2082,
    "reduction_percent": 96.53
  }
}