{
  "date_produced": "20180620",
  "publication_number": "US20180189646A1-20180705",
  "main_ipcr_label": "G06N3063",
  "decision": "PENDING",
  "application_number": "15396147",
  "inventor_list": [
    {
      "inventor_name_last": "Kumar",
      "inventor_name_first": "Raghavan",
      "inventor_city": "Hillsboro",
      "inventor_state": "OR",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Sumbul",
      "inventor_name_first": "Huseyin E.",
      "inventor_city": "Hillsboro",
      "inventor_state": "OR",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Chen",
      "inventor_name_first": "Gregory K.",
      "inventor_city": "Hillsboro",
      "inventor_state": "OR",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Knag",
      "inventor_name_first": "Phil",
      "inventor_city": "Hillsboro",
      "inventor_state": "OR",
      "inventor_country": "US"
    }
  ],
  "abstract": "Apparatus and method for configuring large numbers of fan-in and fan-out connections in a neuromorphic computer. For example, one embodiment of an apparatus comprises: a plurality of neurons, each neuron uniquely identifiable with a neuron identifier (ID); at least one memory to store neuron addresses with wildcard values to establish fan-in and/or fan-out connections between the neurons; and a router to translate at least one neuron address containing wildcard values into two or more neuron IDs to establish the fan-in and/or fan-out connections between the neurons.",
  "filing_date": "20161230",
  "patent_number": "None",
  "summary": "<SOH> BRIEF DESCRIPTION OF THE DRAWINGS <EOH>The foregoing aspects and many of the attendant advantages of this invention will become more readily appreciated as the same becomes better understood by reference to the following detailed description, when taken in conjunction with the accompanying drawings, wherein like reference numerals refer to like parts throughout the various views unless otherwise specified: FIG. 1A is a block diagram illustrating both an exemplary in-order fetch, decode, retire pipeline and an exemplary register renaming, out-of-order issue/execution pipeline according to embodiments of the invention; FIG. 1B is a block diagram illustrating both an exemplary embodiment of an in-order fetch, decode, retire core and an exemplary register renaming, out-of-order issue/execution architecture core to be included in a processor according to embodiments of the invention; FIG. 2 is a block diagram of a single core processor and a multicore processor with integrated memory controller and graphics according to embodiments of the invention; FIG. 3 illustrates a block diagram of a system in accordance with one embodiment of the present invention; FIG. 4 illustrates a block diagram of a second system in accordance with an embodiment of the present invention; FIG. 5 illustrates a block diagram of a third system in accordance with an embodiment of the present invention; FIG. 6 illustrates a block diagram of a system on a chip (SoC) in accordance with an embodiment of the present invention; FIG. 7 illustrates a block diagram contrasting the use of a software instruction converter to convert binary instructions in a source instruction set to binary instructions in a target instruction set according to embodiments of the invention; FIG. 8 is a block diagram illustrating an exemplary neuromorphic computer architecture in accordance to an embodiment; FIG. 9A illustrates a spiking neural network topology; FIG. 9B is an embodiment of a table for tracking neuron addre...",
  "date_published": "20180705",
  "title": "APPARATUS AND METHOD FOR CONFIGURING FAN-IN AND FAN-OUT CONNECTIONS IN A NEUROMORPHIC PROCESSOR",
  "ipcr_labels": [
    "G06N3063"
  ],
  "_processing_info": {
    "original_size": 74358,
    "optimized_size": 3602,
    "reduction_percent": 95.16
  }
}