{
  "date_produced": "20170614",
  "publication_number": "US20170185922A1-20170629",
  "main_ipcr_label": "G06N9900",
  "decision": "PENDING",
  "application_number": "15391764",
  "inventor_list": [
    {
      "inventor_name_last": "Lange",
      "inventor_name_first": "Jeffrey S.",
      "inventor_city": "Chicago",
      "inventor_state": "IL",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "López de Prado",
      "inventor_name_first": "Marcos",
      "inventor_city": "Harrison",
      "inventor_state": "NY",
      "inventor_country": "US"
    }
  ],
  "abstract": "A cluster of server computing devices receives a matrix of observations and divides the matrix into a plurality of input data sets. Each processor in the cluster generates a first data structure for a distance matrix based upon a corresponding input data set, the distance matrix comprising a plurality of items, and clusters the items to generate a clustered distance matrix. Each processor generates a second data structure for a linkage matrix using the clustered matrix. Each processor analyzes the linkage matrix to determine a number of items per cluster and analyzes the linkage matrix to assign a weight to each cluster based upon a distance of the cluster to other clusters and a size of the cluster. Each processor generates a third data structure containing the clusters and assigned weights. Each third data structure is consolidated into a hierarchical data structure, which is transmitted to a remote computing device.",
  "filing_date": "20161227",
  "patent_number": "None",
  "summary": "<SOH> SUMMARY <EOH>Therefore, what is needed is a specialized computing system, including a server computing cluster, that is programmed to execute machine learning techniques in parallel using complex software, including algorithms and processes to implement a hierarchical data structure that enables the computing system to traverse a computer-generated model to determine an optimal allocation for a portfolio of assets. FIG. 1B depicts a visual representation of a hierarchical (tree) structure as generated by the clustered machine learning techniques described herein. It should be appreciated that a tree structure introduces two desirable features: a) It has only N−1 edges to connect N nodes, so the weights only rebalance among peers at various hierarchical levels; and b) the weights are distributed top-down, consistent with how many asset managers build their portfolios, from asset class to sectors to individual securities. For these reasons, hierarchical structures are designed to give not only stable but also intuitive results. The invention, in one aspect, features a system comprising a cluster of server computing devices communicably coupled to each other and to a database computing device, each server computing device having one or more machine learning processors. The cluster of server computing devices is programmed to receive a matrix of observations. The cluster of server computing devices is programmed to divide the matrix of observations into a plurality of input data sets and transmit each one of the plurality of input data sets to a corresponding machine learning processor. Each machine learning processor is programmed to generate a first data structure for a distance matrix based upon the corresponding input data set. The distance matrix comprises a plurality of items. Each machine learning processor is programmed to determine a distance between any two column-vectors of the distance matrix, and generate a cluster of items using a pair of columns ass...",
  "date_published": "20170629",
  "title": "Hierarchical Capital Allocation Using Clustered Machine Learning",
  "ipcr_labels": [
    "G06N9900",
    "G06F1716",
    "H04L2908"
  ],
  "_processing_info": {
    "original_size": 92168,
    "optimized_size": 3676,
    "reduction_percent": 96.01
  }
}