{
  "date_produced": "20180620",
  "publication_number": "US20180189661A1-20180705",
  "main_ipcr_label": "G06N504",
  "decision": "PENDING",
  "application_number": "15396094",
  "inventor_list": [
    {
      "inventor_name_last": "Tatourian",
      "inventor_name_first": "Igor",
      "inventor_city": "Fountain Hills",
      "inventor_state": "AZ",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Wouhaybi",
      "inventor_name_first": "Rita H.",
      "inventor_city": "Portland",
      "inventor_state": "OR",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Poornachandran",
      "inventor_name_first": "Rajesh",
      "inventor_city": "Portland",
      "inventor_state": "OR",
      "inventor_country": "US"
    }
  ],
  "abstract": "In some embodiments, the disclosed subject matter involves a system and method to identify objects in an environment or scene to assist in locating objects and individuals. In at least one embodiment, users register with a service to help locate and/or track objects and individuals. The service may provide recommendations on how to locate, reach, or avoid the target object or individual. Identifying and tracking an object may be used to locate an individual when the object is correlated with the individual. Individuals may register with the service for purposes of user authentication and for defining privacy authorizations for data related to the identifying the user and user's location to other parties. The service may execute in a trusted execution environment to help preserve privacy. Embodiments may be used for games, geo-caching, finding groups and individuals for meeting up, avoiding objects or individuals, etc. Other embodiments are described and claimed.",
  "filing_date": "20161230",
  "patent_number": "None",
  "summary": "<SOH> BRIEF DESCRIPTION OF THE DRAWINGS <EOH>In the drawings, which are not necessarily drawn to scale, like numerals may describe similar components in different views. Like numerals having different letter suffixes may represent different instances of similar components. Some embodiments are illustrated by way of example, and not limitation, in the figures of the accompanying drawings in which: FIG. 1 is a block diagram illustrating high level flow for an object and individual tracking and identification system, according to an embodiment; FIG. 2 is a block diagram illustrating an example embodiment, including an IoT trusted execution environment; FIG. 3 illustrates an example flow diagram, according to an embodiment described herein; FIG. 4 illustrates an environment which may be used with embodiments described herein; and FIG. 5 is a block diagram illustrating an example of a machine upon which one or more embodiments may be implemented. detailed-description description=\"Detailed Description\" end=\"lead\"?",
  "date_published": "20180705",
  "title": "OBJECT IDENTIFICATION FOR IMPROVED UX USING IOT NETWORK",
  "ipcr_labels": [
    "G06N504",
    "H04L2906",
    "G06F2162",
    "G06N9900",
    "G06N502"
  ],
  "_processing_info": {
    "original_size": 77064,
    "optimized_size": 2900,
    "reduction_percent": 96.24
  }
}