{
  "decision": "PENDING",
  "application_number": "15395420",
  "date_published": "20180705",
  "date_produced": "20180620",
  "title": "MULTIPHASE SIGNALING FOR SCAN TIME REDUCTION FOR A TOUCH SYSTEM",
  "filing_date": "20161230",
  "inventor_list": [
    {
      "inventor_name_last": "KHANDELWAL",
      "inventor_name_first": "ASHISH",
      "inventor_city": "IRVING",
      "inventor_state": "TX",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "HOSUR",
      "inventor_name_first": "SRINATH",
      "inventor_city": "PLANO",
      "inventor_state": "TX",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "GUVELIOGLU",
      "inventor_name_first": "BERK",
      "inventor_city": "RICHARDSON",
      "inventor_state": "TX",
      "inventor_country": "US"
    }
  ],
  "ipcr_labels": [
    "G06F3044"
  ],
  "main_ipcr_label": "G06F3044",
  "summary": "<SOH> SUMMARY <EOH>In described examples, a system includes a transmitter to transmit excitation signals. At least one of the excitation signals is transmitted to at least one row or column of a touch system and at least one other of the excitation signals is concurrently transmitted to at least one other row or column of the touch system. The transmitter generates at least one of the excitation signals at a given phase to one row or column of the touch system and generates the other of the excitation signals at a different phase from the given phase to the other row or column of the touch system. In another example, a system includes a receiver to receive an output signal from a touch system. The receiver includes at least two receiving circuits to process the output signal from the touch system. The output signal is received in response to at least two excitation signals applied to at least two rows or columns of the touch system. At least one of the excitation signals is received at a given phase from at least one row or column of the touch system. At least one other of the excitation signals is received at a given phase from at least one other row or column of the touch system. In yet another example, a method includes transmitting excitation signals that are out of phase with respect to each other to a touch system. At least one of the excitation signals is transmitted to at least one row or column of the touch system, and at least one other of the excitation signals is concurrently transmitted to at least one other row or column of the touch system. The method includes receiving an output signal from the touch system in response to the excitation signals. The output signal includes a combined response from two or more rows or columns of the touch system excited by the excitation signals. The method includes summing the output signal with each of the excitation signals to generate an extrapolated signal to determine the row or column excited in response to the ...",
  "patent_number": "None",
  "abstract": "A system includes a transmitter to transmit excitation signals. At least one of the excitation signals is transmitted to at least one row or column of a touch system and at least one other of the signals is concurrently transmitted to at least one other row or column of the touch system. The transmitter generates at least one of the excitation signals at a given phase to one row or column of the touch system and generates the other of the excitation signals at a different phase from the given phase to the other row or column of the touch system.",
  "publication_number": "US20180188844A1-20180705",
  "_processing_info": {
    "original_size": 32264,
    "optimized_size": 3399,
    "reduction_percent": 89.47
  }
}