{
  "date_produced": "20180516",
  "publication_number": "US20180150756A1-20180531",
  "main_ipcr_label": "G06N504",
  "decision": "PENDING",
  "application_number": "15395289",
  "inventor_list": [
    {
      "inventor_name_last": "WU",
      "inventor_name_first": "Xuan-Wei",
      "inventor_city": "Taichung City",
      "inventor_state": "",
      "inventor_country": "TW"
    }
  ],
  "abstract": "A method for enhancing association rules including: performing an association rule algorithm to establish a list of established association rules, wherein the list of established association rules includes at least one antecedent item set, at least one consequent item set and at least one original confidence; performing minimization of a cost function to obtain vector(s) of the at least one antecedent item set and vector(s) of the at least one consequent item set according to the list of established association rules, wherein the vector(s) of the at least one antecedent item set and the vector(s) of the at least one consequent item set correspond to the at least one antecedent item set and the at least one consequent item set; and establishing an enhanced association list according to the vector(s) of the at least one antecedent item set and the vector(s) of the at least one consequent item set.",
  "filing_date": "20161230",
  "patent_number": "None",
  "summary": "<SOH> SUMMARY <EOH>The disclosure is directed to a method for enhancing association rules, an apparatus using the same and a computer readable medium therefor, capable of finding unknown, potential rules to enhance the association rules by use of established association rules. Furthermore, the disclosure could enhance the association rules by use of the consequent item set corresponding to the subset of the antecedent item set according to the properties of the antecedent item set of association rules. According to one embodiment, a method for enhancing association rules is provided. The enhancing method includes: performing an association rule algorithm to establish a list of established association rules, wherein the list of established association rules includes at least one antecedent item set, at least one consequent item set and at least one original confidence; performing minimization of a cost function to obtain vector(s) of the at least one antecedent item set and vector(s) of the at least one consequent item set according to the list of established association rules, wherein the vector(s) of the at least one antecedent item set and the vector(s) of the at least one consequent item set correspond to the at least one antecedent item set and the at least one consequent item set, respectively; and establishing an enhanced association list according to the vector(s) of the at least one antecedent item set and the vector(s) of the at least one consequent item set. According to another embodiment, an apparatus for enhancing association rules is provided. The enhancing apparatus includes: a module for generating established association rules used for establishing a list of established association rules, wherein the list of established association rules includes at least one antecedent item set, at least one consequent item set and at least one original confidence; and a module for enhancing association rules used for performing minimization of a cost function to e...",
  "date_published": "20180531",
  "title": "METHOD FOR ENHANCING ASSOCIATION RULES, APPARATUS USING THE SAME AND COMPUTER READABLE MEDIUM THEREFOR",
  "ipcr_labels": [
    "G06N504",
    "G06N9900",
    "G06N700"
  ],
  "_processing_info": {
    "original_size": 73128,
    "optimized_size": 3522,
    "reduction_percent": 95.18
  }
}