{
  "date_produced": "20170621",
  "publication_number": "US20170193400A1-20170706",
  "main_ipcr_label": "G06N9900",
  "decision": "PENDING",
  "application_number": "15394790",
  "inventor_list": [
    {
      "inventor_name_last": "Bhaskar",
      "inventor_name_first": "Kris",
      "inventor_city": "San Jose",
      "inventor_state": "CA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Karsenti",
      "inventor_name_first": "Laurent",
      "inventor_city": "Rehovot",
      "inventor_state": "",
      "inventor_country": "IL"
    },
    {
      "inventor_name_last": "Young",
      "inventor_name_first": "Scott",
      "inventor_city": "Soquel",
      "inventor_state": "CA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Mahadevan",
      "inventor_name_first": "Mohan",
      "inventor_city": "Livermore",
      "inventor_state": "CA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Zhang",
      "inventor_name_first": "Jing",
      "inventor_city": "Santa Clara",
      "inventor_state": "CA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Duffy",
      "inventor_name_first": "Brian",
      "inventor_city": "San Jose",
      "inventor_state": "CA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "He",
      "inventor_name_first": "Li",
      "inventor_city": "San Jose",
      "inventor_state": "CA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Ying",
      "inventor_name_first": "Huajun",
      "inventor_city": "San Jose",
      "inventor_state": "CA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Nien",
      "inventor_name_first": "Hung",
      "inventor_city": "San Jose",
      "inventor_state": "CA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Venkataraman",
      "inventor_name_first": "Sankar",
      "inventor_city": "Milpitas",
      "inventor_state": "CA",
      "inventor_country": "US"
    }
  ],
  "abstract": "Methods and systems for accelerated training of a machine learning based model for semiconductor applications are provided. One method for training a machine learning based model includes acquiring information for non-nominal instances of specimen(s) on which a process is performed. The machine learning based model is configured for performing simulation(s) for the specimens. The machine learning based model is trained with only information for nominal instances of additional specimen(s). The method also includes re-training the machine learning based model with the information for the non-nominal instances of the specimen(s) thereby performing transfer learning of the information for the non-nominal instances of the specimen(s) to the machine learning based model.",
  "filing_date": "20161229",
  "patent_number": "None",
  "summary": "<SOH> BRIEF DESCRIPTION OF THE DRAWINGS <EOH>Further advantages of the present invention will become apparent to those skilled in the art with the benefit of the following detailed description of the preferred embodiments and upon reference to the accompanying drawings in which: FIGS. 1 and 1 a are schematic diagrams illustrating side views of embodiments of a system configured as described herein; FIG. 2 is a flow chart illustrating steps that may be performed by the embodiments described herein; and FIG. 3 is a block diagram illustrating one embodiment of a non-transitory computer-readable medium storing program instructions for causing computer syste to perform a computer-implemented method described herein. detailed-description description=\"Detailed Description\" end=\"lead\"? While the invention is susceptible to various modifications and alternative forms, specific embodiments thereof are shown by way of example in the drawings and are herein described in detail. The drawings may not be to scale. It should be understood, however, that, the drawings and detailed description thereto are not intended to limit the invention to the particular thrm disclosed, but on the contrary, the intention is to cover all modifications, equivalents and alternatives falling within the spirit and scope of the present invention as defined by the appended claims.",
  "date_published": "20170706",
  "title": "ACCELERATED TRAINING OF A MACHINE LEARNING BASED MODEL FOR SEMICONDUCTOR APPLICATIONS",
  "ipcr_labels": [
    "G06N9900",
    "G06F1750"
  ],
  "_processing_info": {
    "original_size": 121524,
    "optimized_size": 4030,
    "reduction_percent": 96.68
  }
}