{
  "patent_number": "None",
  "application_number": "15398655",
  "date_published": "20170427",
  "date_produced": "20170412",
  "filing_date": "20170104",
  "main_ipcr_label": "G06N502",
  "abstract": "Generating a database of skills possessed by a user includes with an electronic interaction tool, detecting an interaction between a requested user and an initiating user with regard to a collaboration activity, in response to a determination that the requested user uses at least one skill from a list of skills associated with the collaboration activity, generating a prompt for the initiating user that identifies the at least one skill of the requested user, and recording in a database a record associated with the requested user based on the collaboration activity, the record documenting the collaboration activity and the requested user's use of the at least one skill in connection with the collaboration activity.",
  "publication_number": "US20170116529A1-20170427",
  "summary": "<SOH> BRIEF SUMMARY <EOH>A method for generating a database of skills possessed by a user includes, with an electronic interaction tool, detecting an interaction between a requested user and an initiating user with regard to a collaboration activity, in response to a determination that the requested user uses at least one skill from a list of skills associated with the collaboration activity, generating a prompt for the initiating user that identifies the at least one skill of the requested user, and recording in a database a record associated with the requested user based on the collaboration activity, the record documents the collaboration activity and the requested user's use of the at least one skill in connection with the collaboration activity. A system for generating a database of skills possessed by a user includes a processor, memory, communicatively connected to the processor, a skill database generator, the skill database generator includes a create engine to create a skill taxonomy, the skill taxonomy describing a classification of skills that are used in connection with a collaboration activity, a detect engine to detect, with an electronic interaction tool, an interaction between a requested user and an initiating user with regard to the collaboration activity, a generate engine to generate, in response to a determination that the requested use will use at least one skill from a list of skills associated with the collaboration activity, generate a prompt for the initiating user to identify at least one skill of the requested user, a record engine to record, in a database, a record associated with the requested user based on the collaboration activity, the record documenting the collaboration activity and the requested user's use of the at least one skill in connection with the collaboration activity, and a provide engine to selectively provide, based on a number of records associated with the requested user, a user profile, the user profile describing ...",
  "ipcr_labels": [
    "G06N502",
    "G06F1730"
  ],
  "inventor_list": [
    {
      "inventor_name_last": "Bastide",
      "inventor_name_first": "Paul R.",
      "inventor_city": "Boxford",
      "inventor_state": "MA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Broomhall",
      "inventor_name_first": "Matthew E.",
      "inventor_city": "Goffstown",
      "inventor_state": "NH",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Callanan",
      "inventor_name_first": "Sean",
      "inventor_city": "Dublin",
      "inventor_state": "",
      "inventor_country": "IE"
    },
    {
      "inventor_name_last": "Kogan",
      "inventor_name_first": "Sandra L.",
      "inventor_city": "Newton",
      "inventor_state": "MA",
      "inventor_country": "US"
    }
  ],
  "title": "GENERATING A DATABASE OF SKILLS",
  "decision": "PENDING",
  "_processing_info": {
    "original_size": 83225,
    "optimized_size": 3697,
    "reduction_percent": 95.56
  }
}