{
  "patent_number": "None",
  "application_number": "15399045",
  "date_published": "20180705",
  "date_produced": "20180620",
  "filing_date": "20170105",
  "main_ipcr_label": "G06N502",
  "abstract": "Managing questions is provided. A question is sent to a subject matter expert corresponding to a selected subject matter expert class via a network. A response is received from the subject matter expert via the network indicating whether the subject matter expert is able to answer the question. It is determined whether the response indicates that the subject matter expert is able to answer the question. In response to determining that the response indicates that the subject matter expert is able to answer the question, a state of a data structure corresponding to the selected subject matter expert class is transformed by adding text of the question to the selected subject matter expert class.",
  "publication_number": "US20180189656A1-20180705",
  "summary": "<SOH> SUMMARY <EOH>According to one illustrative embodiment, a computer-implemented method for managing questions is provided. A computer sends a question to a subject matter expert corresponding to a selected subject matter expert class via a network. The computer receives a response from the subject matter expert via the network indicating whether the subject matter expert is able to answer the question. The computer determines whether the response indicates that the subject matter expert is able to answer the question. In response to the computer determining that the response does indicate that the subject matter expert is able to answer the question, the computer transforms a state of a data structure corresponding to the selected subject matter expert class by adding text of the question to the selected subject matter expert class. According to other illustrative embodiments, a computer system and computer program product for managing questions are provided.",
  "ipcr_labels": [
    "G06N502",
    "G06N9900"
  ],
  "inventor_list": [
    {
      "inventor_name_last": "Church",
      "inventor_name_first": "Caroline",
      "inventor_city": "Andover",
      "inventor_state": "",
      "inventor_country": "GB"
    },
    {
      "inventor_name_last": "Frost",
      "inventor_name_first": "Mark P.",
      "inventor_city": "Eastleigh",
      "inventor_state": "",
      "inventor_country": "GB"
    },
    {
      "inventor_name_last": "Hurworth",
      "inventor_name_first": "Allan C.",
      "inventor_city": "Southampton",
      "inventor_state": "",
      "inventor_country": "GB"
    },
    {
      "inventor_name_last": "Storey",
      "inventor_name_first": "Dominic J.",
      "inventor_city": "Eastleigh",
      "inventor_state": "",
      "inventor_country": "GB"
    }
  ],
  "title": "Managing Questions",
  "decision": "PENDING",
  "_processing_info": {
    "original_size": 56545,
    "optimized_size": 2637,
    "reduction_percent": 95.34
  }
}