{
  "decision": "PENDING",
  "application_number": "15392473",
  "date_published": "20170629",
  "date_produced": "20170614",
  "title": "SYSTEM AND METHOD USING A DATABASE FOR ENHANCED USER INITIATED REQUESTS OF MATERIAL OR INFORMATION",
  "filing_date": "20161228",
  "inventor_list": [
    {
      "inventor_name_last": "Bentley",
      "inventor_name_first": "Daniel M.",
      "inventor_city": "Washington",
      "inventor_state": "DC",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Dixon, JR.",
      "inventor_name_first": "Robert E.",
      "inventor_city": "Washington",
      "inventor_state": "DC",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Luckay",
      "inventor_name_first": "Ryan M.",
      "inventor_city": "Washington",
      "inventor_state": "DC",
      "inventor_country": "US"
    }
  ],
  "ipcr_labels": [
    "G06F2162",
    "G06Q1010",
    "H04L2906",
    "G06F1730"
  ],
  "main_ipcr_label": "G06F2162",
  "summary": "<SOH> SUMMARY <EOH>In certain embodiments, there is an enhanced user initiated request for material or information identifying a product via an interne or intranet application, web based plugin, or helper application which enables the seamless sharing of user contact data, rating preferences and terms of use (if required). This summary is provided to introduce the subject matter of using a database for enhanced user initiated requests for material or information, which is further described below in the Detailed Description. This summary is not intended to identify essential features of the claimed subject matter, nor is it intended for use in determining the scope of the claimed subject matter.",
  "patent_number": "None",
  "abstract": "A method of providing material based on a user-initiated request utilizing an electronic database includes receiving search keywords to conduct a search and accessing a first database having previously stored contact information for the particular user in an initial table record. The method includes transforming data in the fields of the record for the particular user in the initial table to generate a record in a sanitized table, accessing a second electronic database having previously stored data structures corresponding to businesses, where each data structure maps selected keyword combinations to corresponding icons, and to particular material corresponding to each keyword combination, and displaying icons associated with search results having corresponding selected keywords near associated result items on an electronic display. The method includes initiating sending of particular material corresponding to the request based on the selected icon and contact data for the user obtaine...",
  "publication_number": "US20170185800A1-20170629",
  "_processing_info": {
    "original_size": 104986,
    "optimized_size": 2637,
    "reduction_percent": 97.49
  }
}