{
  "decision": "ACCEPTED",
  "application_number": "15392920",
  "date_published": "20170608",
  "date_produced": "20170524",
  "title": "SYSTEMS AND METHODS FOR MACHINE CONTROL",
  "filing_date": "20161228",
  "inventor_list": [
    {
      "inventor_name_last": "Holz",
      "inventor_name_first": "David S.",
      "inventor_city": "San Francisco",
      "inventor_state": "CA",
      "inventor_country": "US"
    }
  ],
  "ipcr_labels": [
    "G06F301",
    "G06K900"
  ],
  "main_ipcr_label": "G06F301",
  "summary": "<SOH> SUMMARY <EOH>Aspects of the systems and methods described herein provide for improved image- and sensory-signal-based machine interactivity and/or communication by interpreting the position and/or motion of an object (including objects having one or more articulating members, e.g., hands, but more generally any moving parts of humans and/or animals and/or machines) acquired through various machine sensory mechanisms. Among other aspects, embodiments can enable automatically (e.g., programmatically) determining command information (including command information to the sensory system itself, e.g., indicating the manner of further scanning or other sensory data acquisition) using inputs detected from positional information (e.g., position, volume, and/or surface characteristics) and/or motion information (e.g., translation, rotation, deformation and/or other structural change) of a portion of a hand or other detectable object moving in free space. In some embodiments, this is based upon scanning a scene to detect variations that might indicate a presence, position and/or variation (conformations, deformations, translations, rotations, or other object state changes) of a control object portion. Scanning can be performed according to coarse as well as refined scanning patterns and/or intermixed with capturing of images and/or other sensory data capture. Inputs can be interpreted from scan(s), image(s) and/or other sensory data in conjunction with providing command information, machine input, commands, communications and/or other user-machine interfacing, gathering information about objects, events and/or actions existing or occurring within an area being explored, monitored, or controlled, and/or combinations thereof. In various embodiments, a scene is scanned with a moving directed emission of light or other electromagnetic radiation (e.g., a light beam “sweeping” the scene), or multiple sequentially activated emissions in generally different directions, in accord...",
  "patent_number": "9778752",
  "abstract": "A region of space may be monitored for the presence or absence of one or more control objects, and object attributes and changes thereto may be interpreted as control information provided as input to a machine or application. In some embodiments, the region is monitored using a combination of scanning and image-based sensing.",
  "publication_number": "US20170160816A1-20170608",
  "_processing_info": {
    "original_size": 120330,
    "optimized_size": 2884,
    "reduction_percent": 97.6
  }
}