{
  "date_produced": "20180109",
  "publication_number": "US20180025268A1-20180125",
  "main_ipcr_label": "G06N308",
  "decision": "PENDING",
  "application_number": "15396267",
  "inventor_list": [
    {
      "inventor_name_last": "TEIG",
      "inventor_name_first": "Steven L.",
      "inventor_city": "Menlo Park",
      "inventor_state": "CA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "HABA",
      "inventor_name_first": "Belgacem",
      "inventor_city": "Saratoga",
      "inventor_state": "CA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "MOHAMMED",
      "inventor_name_first": "Ilyas",
      "inventor_city": "Santa Clara",
      "inventor_state": "CA",
      "inventor_country": "US"
    }
  ],
  "abstract": "Configurable machine learning assemblies for autonomous operation in personal devices are provided. Example systems implement machine learning based on neural networks that draw low power for use in smart phones, watches, drones, automobiles, and medical devices. The onboard machine learning assemblies can be powered by batteries, and once onboard a small personal device, can learn to perform object recognition and autonomous decision-making without access to outside resources. The assemblies can be small or even nano-scale, and may draw less than one watt of power on average. An assembly can be configured from pluggable, interchangeable modules that have compatible ports for interconnecting and integrating functionally dissimilar sensor systems. A core module contains a machine learning kernel, and multiple cores can be connected together to expand the neural network. An example machine learning assembly auto-detects sensors and peripherals, and extends a network or bus to all connect...",
  "filing_date": "20161230",
  "patent_number": "None",
  "summary": "<SOH> SUMMARY <EOH>Configurable machine learning assemblies for autonomous operation in personal devices are provided. Example systems implement machine learning based on neural networks that draw low power for use in smart phones, watches, drones, automobiles, and medical devices. Moreover, the example machine learning assemblies can be made small, for example 6-20 millimeters long per module, down to nano-size for some applications. The onboard machine learning assemblies can be powered by batteries, for example, and once onboard a small personal device, can learn to perform object recognition and autonomous decision-making without access to outside resources. In addition to their small size in some circumstances, the assemblies may draw less than one watt of power on average. An assembly can be configured from pluggable, interchangeable modules that have identical or compatible ports for interconnecting and integrating functionally dissimilar sensor systems. The ports may have identical or complementary interfaces and pinouts. An example core module of the system contains a machine learning kernel, and multiple cores can be connected together to expand the neural network. An example machine learning assembly auto-detects sensors and peripherals, and extends a network or bus to all connected components. This summary is not intended to identify key or essential features of the claimed subject matter, nor is it intended to be used as an aid in limiting the scope of the claimed subject matter.",
  "date_published": "20180125",
  "title": "Configurable machine learning assemblies for autonomous operation in personal devices",
  "ipcr_labels": [
    "G06N308",
    "G06N9900"
  ],
  "_processing_info": {
    "original_size": 63415,
    "optimized_size": 3401,
    "reduction_percent": 94.64
  }
}