{
  "date_produced": "20170405",
  "publication_number": "US20170109657A1-20170420",
  "main_ipcr_label": "G06N9900",
  "decision": "PENDING",
  "application_number": "15391876",
  "inventor_list": [
    {
      "inventor_name_last": "Marcu",
      "inventor_name_first": "Nir",
      "inventor_city": "Hod HaSharon",
      "inventor_state": "",
      "inventor_country": "IL"
    },
    {
      "inventor_name_last": "Libeskind Mulyan",
      "inventor_name_first": "Avichay",
      "inventor_city": "Tel Aviv",
      "inventor_state": "",
      "inventor_country": "IL"
    },
    {
      "inventor_name_last": "Tauber",
      "inventor_name_first": "Doron",
      "inventor_city": "Even Yehuda",
      "inventor_state": "",
      "inventor_country": "IL"
    },
    {
      "inventor_name_last": "Uziely",
      "inventor_name_first": "Shir",
      "inventor_city": "Raanana",
      "inventor_state": "",
      "inventor_country": "IL"
    },
    {
      "inventor_name_last": "Zhmudyak",
      "inventor_name_first": "Alexandra",
      "inventor_city": "Rehovot",
      "inventor_state": "",
      "inventor_country": "IL"
    },
    {
      "inventor_name_last": "Dor",
      "inventor_name_first": "Nurit",
      "inventor_city": "Raanana",
      "inventor_state": "",
      "inventor_country": "IL"
    }
  ],
  "abstract": "Described herein are systems, methods, and computer programs that may be utilized to identify a sequence corresponding to an execution of a Business Processes (BP) using a machine learning-based model of the BP generated based on sequences corresponding to previous executions of the BP by a plurality of organizations. In one embodiment, a sequence parser module receives one or more streams of steps performed during interactions with an instance of a software system, which belongs to a certain organization, and selects, from among the one or more streams, candidate sequences of steps. A feature generator module generate, for each sequence from among the candidate sequences, a plurality of feature values. And a predictor module utilizes the model to calculate, based on an input comprising the plurality of feature values generated for the sequence, a value indicative of whether the sequence corresponds to an execution of the BP.",
  "filing_date": "20161228",
  "patent_number": "None",
  "summary": "<SOH> SUMMARY <EOH>Some aspects of this disclosure involve various applications involving data obtained by monitoring interactions with instances of one or more software systems. A “software system”, as used in this disclosure, may refer to one or more of various types of prepackaged business applications, such as enterprise resource planning (ERP), supply chain management (SCM), supplier relationship management (SRM), product lifecycle management (PLM), and customer relationship management (CRM), to name a few. Additionally, a “software system” may refer to a computer system with which a user and/or a computer program (e.g., a software agent) may communicate in order to receive and/or provide information, and/or in order to provide and/or receive a service. In some embodiments, the monitoring is performed by one or more monitoring agents. Each monitoring agent generates a stream comprising steps performed as part of an interaction with an instance of a software system. Optionally, data collected through monitoring may include one or more of the following types of data: data provided by a user (e.g., as input in fields in screens), data provided by a software system (e.g., messages returned as a response to operations), data exchanged between a user interface and a server used to run an instance of a software system (e.g., network traffic between the two), logs generated by an operating system (e.g., on a client used by a user or a server used by an instance of a software system), and logs generated by the instance of the software system (e.g., “event logs” generated by the software system). One aspect of this disclosure involve utilizing a machine learning-based model to identify sequences of steps corresponding to executions of a BP. The sequences of steps are identified from among candidate sequences of steps selected from among steps belonging to one or more streams of steps, each describing interactions with an instance of a software system. In some embodiments...",
  "date_published": "20170420",
  "title": "Machine Learning-Based Model for Identifying Executions of a Business Process",
  "ipcr_labels": [
    "G06N9900",
    "G06N504"
  ],
  "_processing_info": {
    "original_size": 353205,
    "optimized_size": 4274,
    "reduction_percent": 98.79
  }
}