{
  "date_produced": "20180613",
  "publication_number": "US20180181877A1-20180628",
  "main_ipcr_label": "G06N9900",
  "decision": "PENDING",
  "application_number": "15390305",
  "inventor_list": [
    {
      "inventor_name_last": "Wu",
      "inventor_name_first": "Zonghuan",
      "inventor_city": "Cupertino",
      "inventor_state": "CA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Zang",
      "inventor_name_first": "Hui",
      "inventor_city": "Cupertino",
      "inventor_state": "CA",
      "inventor_country": "US"
    }
  ],
  "abstract": "A system, computer-readable medium, and method are provided for tracking modeling of datasets. The method includes the steps of executing an exploration operation to generate a result and storing an entry in a database that correlates an exploration operation configuration for the exploration operation with at least one performance metric. Each performance metric in the at least one performance metric is a value used to evaluate the result. The exploration operation utilizes a machine learning algorithm to process the dataset, and the exploration operation may be executed using at least one node in a computing cluster.",
  "filing_date": "20161223",
  "patent_number": "None",
  "summary": "<SOH> SUMMARY <EOH>A system, computer-readable medium, and method are provided for tracking modeling of datasets. The method includes the steps of executing an exploration operation to generate a result and storing an entry in a database that correlates an exploration operation configuration for the exploration operation with at least one performance metric. Each performance metric in the at least one performance metric is a value used to evaluate the result. The exploration operation utilizes a machine learning algorithm to process the dataset, and the exploration operation may be executed using at least one node in a computing cluster. The system includes a cluster including a plurality of nodes, the cluster including at least one node including a processor configured to perform the method. The computer-readable media stores computer instructions that, when executed by one or more processors, cause the one or more processors to perform the steps of the method. In a first embodiment, the method further includes the step of generating the input for the machine learning algorithm based on the dataset. The input is generated by performing at least one of: extracting a plurality of samples from the dataset to include in the input; and calculating at least one value per sample for one or more derived features of the input. Each sample in the plurality of samples comprises one or more values corresponding to features of the input. In a second embodiment (which may or may not be combined with the first embodiment), the configuration of the exploration operation comprises an identifier that specifies the dataset, an identifier that specifies the machine learning algorithm, a list of one or more features included in the input to the machine learning algorithm, a list of normalization methods corresponding to each feature of the one or more features, and a list of zero or more parameter values utilized to configure the machine learning algorithm. In a third embodiment (which...",
  "date_published": "20180628",
  "title": "GENERATING A KNOWLEDGE BASE TO ASSIST WITH THE MODELING OF LARGE DATASETS",
  "ipcr_labels": [
    "G06N9900",
    "G06F1730"
  ],
  "_processing_info": {
    "original_size": 70070,
    "optimized_size": 3342,
    "reduction_percent": 95.23
  }
}