{
  "patent_number": "None",
  "application_number": "15397201",
  "date_published": "20171109",
  "date_produced": "20171025",
  "filing_date": "20170103",
  "main_ipcr_label": "G06N502",
  "abstract": "A method and device. The device determines an initial estimate of an amount of time for a generic user to read a document, wherein the initial estimate is determined based on a value of one or more parameters associated with the document. The device determines an estimate correction parameter for modifying the determined initial estimate to compensate for a particular user who will read the document, a particular context n which the particular user will read the document, or a combination thereof. The device uses the initial estimate and the estimate correction parameter to determine an estimate of the amount of time for the particular user to read the document.",
  "publication_number": "US20170323205A1-20171109",
  "summary": "<SOH> SUMMARY <EOH>The present invention provides a method and associated device and computer program product. The device determines an initial estimate of an amount of time for a generic user to read a document, wherein the initial estimate is determined based on a value of one or more parameters associated with the document. The device determines an estimate correction parameter for modifying the determined initial estimate to compensate for a particular user who will read the document, a particular context in which the particular user will read the document, or a combination thereof. The device uses the initial estimate and the estimate correction parameter to determine an estimate of the amount of time for the particular user to read the document.",
  "ipcr_labels": [
    "G06N502",
    "G06F1728"
  ],
  "inventor_list": [
    {
      "inventor_name_last": "Gonzalez",
      "inventor_name_first": "Ignacio P.",
      "inventor_city": "Madrid",
      "inventor_state": "",
      "inventor_country": "ES"
    },
    {
      "inventor_name_last": "Pazos",
      "inventor_name_first": "Fernando P.",
      "inventor_city": "Madrid",
      "inventor_state": "",
      "inventor_country": "ES"
    }
  ],
  "title": "ESTIMATING DOCUMENT READING AND COMPREHENSION TIME FOR USE IN TIME MANAGEMENT SYSTEMS",
  "decision": "PENDING",
  "_processing_info": {
    "original_size": 67223,
    "optimized_size": 2161,
    "reduction_percent": 96.79
  }
}