{
  "date_produced": "20170621",
  "publication_number": "US20170193358A1-20170706",
  "main_ipcr_label": "G06N3063",
  "decision": "PENDING",
  "application_number": "15391761",
  "inventor_list": [
    {
      "inventor_name_last": "LEE",
      "inventor_name_first": "Hyung-Dong",
      "inventor_city": "Icheon",
      "inventor_state": "",
      "inventor_country": "KR"
    }
  ],
  "abstract": "A neuromorphic device may include: a pre-synaptic neuron; a row line electrically coupled to the pre-synaptic neuron; a post-synaptic neuron; a column line electrically coupled to the post-synaptic neuron; and a synapse disposed at a cross point between the row line and the column line. The post-synaptic neuron may include: a first integrator electrically coupled to the synapse; a second integrator electrically coupled to the first integrator; and a comparator electrically coupled to the second integrator.",
  "filing_date": "20161227",
  "patent_number": "None",
  "summary": "<SOH> SUMMARY <EOH>Embodiments of the present disclosure are directed to a neuromorphic device that may substantially prevent or minimize an occurrence of data recognition errors. The beneficial aspects of the present disclosure are not limited to the above-mentioned beneficial aspect, and other beneficial aspects may be possible. In accordance with an embodiment of the inventive concepts, a neuromorphic device may include a pre-synaptic neuron; a row line electrically coupled to the pre-synaptic neuron; a post-synaptic neuron; a column line electrically coupled to the post-synaptic neuron; and a synapse disposed at a cross point between the row line and the column line. The post-synaptic neuron may include: a first integrator electrically coupled to the synapse; a second integrator electrically coupled to the first integrator; and a comparator electrically coupled to the second integrator. The synapse and an input terminal of the first integrator may be electrically connected to each other. An output terminal of the first integrator and an input terminal of the second integrator may be electrically connected to each other. An output terminal of the second integrator and an input terminal of the comparator may be electrically connected to each other. The first integrator, the second integrator, and the comparator may be electrically connected in series. The post-synaptic neuron may further include: a first amplifier disposed between an output terminal of the first integrator and an input terminal of the second integrator. The post-synaptic neuron may further include: a second amplifier disposed between an output terminal of the second integrator and an input terminal of the comparator. The post-synaptic neuron may further include: a sampling element disposed between the synapse and the first integrator. The sampling element may include a switching element. The post-synaptic neuron may further include: an amplifier disposed between the sampling element and the first ...",
  "date_published": "20170706",
  "title": "NEUROMORPHIC DEVICES INCLUDING POST-SYNAPTIC NEURONS HAVING AT LEAST ONE OF INTEGRATORS, AMPLIFIERS, OR SAMPLING ELEMENTS",
  "ipcr_labels": [
    "G06N3063",
    "G06N304"
  ],
  "_processing_info": {
    "original_size": 54593,
    "optimized_size": 3130,
    "reduction_percent": 94.27
  }
}