{
  "date_produced": "20180613",
  "publication_number": "US20180181868A1-20180628",
  "main_ipcr_label": "G06N502",
  "decision": "PENDING",
  "application_number": "15392360",
  "inventor_list": [
    {
      "inventor_name_last": "Chew",
      "inventor_name_first": "Yen Hsiang",
      "inventor_city": "Georgetown",
      "inventor_state": "",
      "inventor_country": "MY"
    }
  ],
  "abstract": "A computing device and method for cloud-assisted perceptual computing is described. The computing device includes a sensor to collect data for perceptual computing. The computing device also includes an analytics determiner to calculate a disposition result based on the data collected by the sensor and to calculate a confidence level of the disposition result. The computing device compares the confidence level to a threshold and sends the data to a cloud computing device in response to the confidence level being below the threshold.",
  "filing_date": "20161228",
  "patent_number": "None",
  "summary": "<SOH> BRIEF DESCRIPTION OF THE DRAWINGS <EOH>FIG. 1 is a block diagram of a perceptual computing analytics system. FIG. 2 is a block diagram of an embodiment of a client computing device configured for cloud-assisted perceptual computing analytics. FIG. 3 is a block diagram of a client computing device configured for cloud-assisted perceptual computing analytics. FIG. 4 is a flow diagram of a method for cloud-assisted perceptual computing analytics. FIG. 5 is a flow diagram of a method analogous to the method shown in FIG. 4 . FIG. 6 is a block diagram of a medium containing code to execute cloud-assisted perceptual computing. FIG. 7 is a drawing of an IoT system including a cloud computing network, or cloud, in communication with a number of Internet of Things devices. FIG. 8 is a drawing of a cloud computing network, or cloud, in communication with a mesh network of IoT devices, which may be termed a fog device, operating at the edge of the cloud. FIG. 9 is a block diagram of an example of components that may be present in an IoT device for perceptual computing. detailed-description description=\"Detailed Description\" end=\"lead\"? The same numbers are used throughout the disclosure and the figures to reference like components and features. Numbers in the 100 series refer to features originally found in FIG. 1 ; numbers in the 200 series refer to features originally found in FIG. 2 ; and so on.",
  "date_published": "20180628",
  "title": "CLOUD-ASSISTED PERCEPTUAL COMPUTING ANALYTICS",
  "ipcr_labels": [
    "G06N502",
    "H04L2908",
    "H04L2906"
  ],
  "_processing_info": {
    "original_size": 100719,
    "optimized_size": 2514,
    "reduction_percent": 97.5
  }
}