{
  "date_produced": "20171004",
  "publication_number": "US20170300814A1-20171019",
  "main_ipcr_label": "G06N308",
  "decision": "PENDING",
  "application_number": "15394668",
  "inventor_list": [
    {
      "inventor_name_last": "Shaked",
      "inventor_name_first": "Tal",
      "inventor_city": "Los Altos",
      "inventor_state": "CA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Anil",
      "inventor_name_first": "Rohan",
      "inventor_city": "San Francisco",
      "inventor_state": "CA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Aradhye",
      "inventor_name_first": "Hrishikesh Balkrishna",
      "inventor_city": "Mountain View",
      "inventor_state": "CA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Ispir",
      "inventor_name_first": "Mustafa",
      "inventor_city": "Mountain View",
      "inventor_state": "CA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Anderson",
      "inventor_name_first": "Glen",
      "inventor_city": "Palo Alto",
      "inventor_state": "CA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Chai",
      "inventor_name_first": "Wei",
      "inventor_city": "Cupertino",
      "inventor_state": "CA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Koc",
      "inventor_name_first": "Mehmet Levent",
      "inventor_city": "Mountain View",
      "inventor_state": "CA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Harmsen",
      "inventor_name_first": "Jeremiah",
      "inventor_city": "San Jose",
      "inventor_state": "CA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Liu",
      "inventor_name_first": "Xiaobing",
      "inventor_city": "Mountain View",
      "inventor_state": "CA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Corrado",
      "inventor_name_first": "Gregory Sean",
      "inventor_city": "San Francisco",
      "inventor_state": "CA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Chandra",
      "inventor_name_first": "Tushar Deepak",
      "inventor_city": "Los Altos",
      "inventor_state": "CA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Cheng",
      "inventor_name_first": "Heng-Tze",
      "inventor_city": "Mountain View",
      "inventor_state": "CA",
      "inventor_country": "US"
    }
  ],
  "abstract": "A system includes one or more computers and one or more storage devices storing instructions that when executed by the one or more computers cause the computers to implement a combined machine learning model for processing an input including multiple features to generate a predicted output for the machine learning input. The combined model includes: a deep machine learning model configured to process the features to generate a deep model output; a wide machine learning model configured to process the features to generate a wide model output; and a combining layer configured to process the deep model output generated by the deep machine learning model and the wide model output generated by the wide machine learning model to generate the predicted output, in which the deep model and the wide model have been trained jointly on training data to generate the deep model output and the wide model output.",
  "filing_date": "20161229",
  "patent_number": "None",
  "summary": "<SOH> SUMMARY <EOH>This specification describes systems and methods for implementing a wide and deep machine learning model, i.e., a combined machine learning model that includes both a wide machine learning model and a deep machine learning model. In general, one innovative aspect of the subject matter described in this specification can be embodied in a system that includes one or more computers and one or more storage devices storing instructions that when executed by the one or more computers cause the one or more computers to implement a combined machine learning model for processing a machine learning input including multiple features to generate a predicted output for the machine learning input. The combined machine learning model can include: a deep machine learning model configured to process the features to generate a deep model intermediate predicted output; a wide machine learning model configured to process the features to generate a wide model intermediate predicted output; and a combining layer configured to process the deep model intermediate predicted output generated by the deep machine learning model and the wide model intermediate predicted output generated by the wide machine learning model to generate the predicted output, in which the deep machine learning model and the wide machine learning model have been trained jointly on training data to generate the deep model intermediate predicted output and the wide model intermediate predicted output. The foregoing and other embodiments can each optionally include one or more of the following features, alone or in combination. The features can be features of a content presentation setting, and wherein the predicted output is a predicted output for the content presentation setting. The features of the content presentation setting can include features of a content item to be presented in the content presentation setting, and wherein the predicted output for the content presentation setting represents a...",
  "date_published": "20171019",
  "title": "WIDE AND DEEP MACHINE LEARNING MODELS",
  "ipcr_labels": [
    "G06N308",
    "G06N304"
  ],
  "_processing_info": {
    "original_size": 65860,
    "optimized_size": 5118,
    "reduction_percent": 92.23
  }
}