{
  "date_produced": "20180613",
  "publication_number": "US20180181873A1-20180628",
  "main_ipcr_label": "G06N700",
  "decision": "PENDING",
  "application_number": "15392998",
  "inventor_list": [
    {
      "inventor_name_last": "Chen",
      "inventor_name_first": "Si",
      "inventor_city": "Mountain View",
      "inventor_state": "CA",
      "inventor_country": "US"
    }
  ],
  "abstract": "An online system selects a number of content items and presents the selected content items through a feed to a target user, where each selected candidate content item is likely to cause the target user to post his/her new content in response to the selected candidate content item within a short period of time. The online system selects the candidate content items for presentation through the feed using a trained post session prediction model. A ranking score for a candidate content item is determined based on a probability value indicating likelihood that the candidate content item causes the target user to post new content. The probability value is determined by applying a trained model to user features of the target user and content features of the candidate content item. The online system ranks the candidate content items based on their ranking scores and present the feed to the target user.",
  "filing_date": "20161228",
  "patent_number": "None",
  "summary": "<SOH> SUMMARY <EOH>A personalized post session model is provided for presenting selected content items in a newsfeed for a target user in an online system, where the target user is likely to post his/her original new content on the selected content items. The online system receives multiple candidate content items to be included in the newsfeed for the target user. To select candidate content items for inclusion in the newsfeed and to order the selected candidate content items included in the newsfeed, the online system determines a score for each candidate content item. The score of a candidate content item is generated by a trained post session prediction model (also simply referred to as “trained prediction model”), which generates a probability value indicating likelihood that the candidate content item causes the target user to post his/her new content in the online system. The online system trains the prediction model using machine learning techniques based on training data curated from historical posting activity of users of the online system and attributes of content items posted by the users of the online system. The online system applies the trained prediction model to user features of the target user and content features of each candidate content item to determine the probability value. Examples of user features include positing history of the target user, attributes of posts of the target user, and biographic, demographic, or other types of descriptive information of the target user. The online system further generates a weighted prediction value of the candidate content item (also referred to as “a posting score of the candidate content item’), e.g., multiplying the probability value with a weight of the target user posting new content. The weight of posting new content can be assigned by operators of the online system manually or by the online system automatically. The online system generates a ranking score for each content item based on the posting s...",
  "date_published": "20180628",
  "title": "PERSONALIZED POST SESSION MODEL FOR AN ONLINE SYSTEM",
  "ipcr_labels": [
    "G06N700",
    "H04L2908",
    "G06N9900",
    "G06F1730"
  ],
  "_processing_info": {
    "original_size": 66168,
    "optimized_size": 3502,
    "reduction_percent": 94.71
  }
}