{
  "date_produced": "20170621",
  "publication_number": "US20170193359A1-20170706",
  "main_ipcr_label": "G06N3063",
  "decision": "PENDING",
  "application_number": "15394524",
  "inventor_list": [
    {
      "inventor_name_last": "PARK",
      "inventor_name_first": "Sang-Su",
      "inventor_city": "Icheon",
      "inventor_state": "",
      "inventor_country": "KR"
    },
    {
      "inventor_name_last": "LEE",
      "inventor_name_first": "Hyung-Dong",
      "inventor_city": "Icheon",
      "inventor_state": "",
      "inventor_country": "KR"
    }
  ],
  "abstract": "A neuromorphic device includes a substrate; a first electrode and a second electrode that are disposed over the substrate, extend in a first direction, and are spaced apart in a second direction; a stack structure between the first electrode and the second electrode, which includes reactive metal layers alternately stacked with one or more insulating layers; an oxygen-containing layer between the first electrode and the stack structure, which includes oxygen ions; and an oxygen diffusion-retarding layer between the stack structure and the oxygen-containing layer. The first direction is perpendicular to a top surface of the substrate, and the second direction is parallel to the top surface of the substrate. Each reactive metal layer may react with the oxygen ions to form a dielectric oxide layer. The oxygen diffusion-retarding layer interferes with a movement of the oxygen ions. A thickness of the oxygen diffusion-retarding layer varies along the first direction.",
  "filing_date": "20161229",
  "patent_number": "None",
  "summary": "<SOH> SUMMARY <EOH>Embodiments of the present disclosure are directed to neuromorphic device including a synapse having enhanced symmetry and linearity. In accordance with an embodiment, a neuromorphic device includes: a substrate; a first electrode and a second electrode that are disposed over the substrate, the first and second electrodes extending in a first direction and being spaced apart from each other in a second direction, the first direction being perpendicular to a top surface of the substrate, the second direction being parallel to the top surface of the substrate; a stack structure disposed between the first electrode and the second electrode, the stack structure including a plurality of reactive metal layers which are alternately stacked with one or more insulating layers, wherein each of the reactive metal layers is capable of reacting with oxygen ions to form a dielectric oxide layer; an oxygen-containing layer disposed between the first electrode and the stack structure, the oxygen-containing layer including the oxygen ions; and an oxygen diffusion-retarding layer disposed between the stack structure and the oxygen-containing layer, the oxygen diffusion-retarding layer interfering with a movement of the oxygen ions from the oxygen-containing layer to the reactive metal layers, and wherein a thickness of the oxygen diffusion-retarding layer varies along the first direction. In the above embodiment, the thickness of the oxygen diffusion-retarding layer increases from a top of the oxygen diffusion-retarding layer to a bottom of the oxygen diffusion-retarding layer. The thickness of the oxygen diffusion-retarding layer decreases from a top of the oxygen diffusion-retarding layer to a bottom of the oxygen diffusion-retarding layer. The second electrode includes a plurality of second electrodes, which are spaced apart from each other, and wherein the stack structure includes a plurality of stack structures, which are spaced apart from each other, each of ...",
  "date_published": "20170706",
  "title": "NEUROMORPHIC DEVICE",
  "ipcr_labels": [
    "G06N3063",
    "G06N304"
  ],
  "_processing_info": {
    "original_size": 102249,
    "optimized_size": 3634,
    "reduction_percent": 96.45
  }
}