{
  "decision": "PENDING",
  "application_number": "15394323",
  "date_published": "20180705",
  "date_produced": "20180620",
  "title": "AUTOMATIC GENERATION OF MANUAL CODING SUGGESTIONS FOR CONVERSION OF APPLICATION PROGRAMS TO OFF-LINE ENVIRONMENT",
  "filing_date": "20161229",
  "inventor_list": [
    {
      "inventor_name_last": "HART",
      "inventor_name_first": "Michael",
      "inventor_city": "San Ramon",
      "inventor_state": "CA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "WAID",
      "inventor_name_first": "Milton",
      "inventor_city": "San Ramon",
      "inventor_state": "CA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "OSTERHOUDT",
      "inventor_name_first": "Jeremy",
      "inventor_city": "San Ramon",
      "inventor_state": "CA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "JOHNS",
      "inventor_name_first": "Andy",
      "inventor_city": "San Ramon",
      "inventor_state": "CA",
      "inventor_country": "US"
    }
  ],
  "ipcr_labels": [
    "G06F945"
  ],
  "main_ipcr_label": "G06F945",
  "summary": "<SOH> BRIEF DESCRIPTION OF THE DRAWINGS <EOH>FIG. 1 illustrates generally an example of portions of a first asset management platform (AMP). FIG. 2 is a high level block diagram showing other aspects of the AMP depicted in FIG. 1 . FIG. 3 is a block diagram of a typical mobile device such as those shown in FIG. 2 . FIG. 4 is a block diagram of an automatic application program conversion system according to some embodiments. FIGS. 5, 6 and 7 are flow charts that illustrate processes performed according to some embodiments. FIG. 8 schematically illustrates an application program code listing to be processed by the system of FIG. 4 . FIG. 9 schematically illustrates a converted application program code listing generated by the system of FIG. 4 from the code listing of FIG. 8 . FIG. 10 is a block diagram of a computing system according to some embodiments. detailed-description description=\"Detailed Description\" end=\"lead\"?",
  "patent_number": "None",
  "abstract": "A method includes machine reading a first code listing. The first code listing represents at least a portion of an application program. The machine-reading proceeds through a plurality of segments of the first code listing. A processor determines, during the machine-reading, that one of the plurality of segments is of a predetermined type. In response to that determination, an indication of a suggested manual coding approach is automatically appended to a second code listing. The suggested manual coding approach is for converting the first code listing segment for use in the second code listing.",
  "publication_number": "US20180189039A1-20180705",
  "_processing_info": {
    "original_size": 76462,
    "optimized_size": 2575,
    "reduction_percent": 96.63
  }
}