{
  "date_produced": "20180109",
  "publication_number": "US20180025288A1-20180125",
  "main_ipcr_label": "G06N9900",
  "decision": "PENDING",
  "application_number": "15395401",
  "inventor_list": [
    {
      "inventor_name_last": "Piche",
      "inventor_name_first": "Stephen William",
      "inventor_city": "Austin",
      "inventor_state": "TX",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Pickard",
      "inventor_name_first": "Fred Francis",
      "inventor_city": "Norfolk",
      "inventor_state": "MA",
      "inventor_country": "US"
    }
  ],
  "abstract": "A method for modeling a system that includes a disturbance rejection model configured for modeling an operation of the system so to generate a predicted value for a system output. The disturbance rejection model having a network for mapping system inputs to the system output, and input-output pairings, each representing a unique pairing of one of the system inputs with the system output. The method may include the steps of: calculating a confidence metric for a selected input-output pairing of the disturbance rejection model; and recommending a modification be made to the disturbance rejection model based upon the confidence metric calculated for the selected one of the input-output pairing. The confidence metric may indicate a probability that a predicted sign of a gain in the system output made by the disturbance rejection model is correct when the system input of the selected input-output pairing is varied.",
  "filing_date": "20161230",
  "patent_number": "None",
  "summary": "<SOH> BRIEF DESCRIPTION OF THE INVENTION <EOH>The present application thus describes a method for modeling a system that includes a disturbance rejection model configured for modeling an operation of the system so to generate a predicted value for a system output. The disturbance rejection model having a network for mapping system inputs to the system output, and input-output pairings, each representing a unique pairing of one of the system inputs with the system output. The method may include the steps of: calculating a confidence metric for a selected one of the input-output pairings of the disturbance rejection model; and recommending a modification be made to the disturbance rejection model based upon the confidence metric calculated for the selected one of the input-output pairing. The confidence metric may indicate a probability that a predicted sign of a gain in the system output at the future time made by the disturbance rejection model is correct when the system input of the selected one of the input-output pairings is varied. These and other features of the present application will become apparent upon review of the following detailed description of the preferred embodiments when taken in conjunction with the drawings and the appended claims.",
  "date_published": "20180125",
  "title": "SYSTEM MODELING, CONTROL AND OPTIMIZATION",
  "ipcr_labels": [
    "G06N9900",
    "G06F1750",
    "G06N700",
    "G06F1711"
  ],
  "_processing_info": {
    "original_size": 159292,
    "optimized_size": 2916,
    "reduction_percent": 98.17
  }
}