{
  "decision": "PENDING",
  "application_number": "15391875",
  "date_published": "20170420",
  "date_produced": "20170405",
  "title": "Automaton-Based Identification of Executions of a Business Process",
  "filing_date": "20161228",
  "inventor_list": [
    {
      "inventor_name_last": "Marcu",
      "inventor_name_first": "Nir",
      "inventor_city": "Hod HaSharon",
      "inventor_state": "",
      "inventor_country": "IL"
    },
    {
      "inventor_name_last": "Libeskind Mulyan",
      "inventor_name_first": "Avichay",
      "inventor_city": "Tel Aviv",
      "inventor_state": "",
      "inventor_country": "IL"
    },
    {
      "inventor_name_last": "Tauber",
      "inventor_name_first": "Doron",
      "inventor_city": "Even Yehuda",
      "inventor_state": "",
      "inventor_country": "IL"
    },
    {
      "inventor_name_last": "Uziely",
      "inventor_name_first": "Shir",
      "inventor_city": "Raanana",
      "inventor_state": "",
      "inventor_country": "IL"
    },
    {
      "inventor_name_last": "Zhmudyak",
      "inventor_name_first": "Alexandra",
      "inventor_city": "Rehovot",
      "inventor_state": "",
      "inventor_country": "IL"
    },
    {
      "inventor_name_last": "Dor",
      "inventor_name_first": "Nurit",
      "inventor_city": "Raanana",
      "inventor_state": "",
      "inventor_country": "IL"
    }
  ],
  "ipcr_labels": [
    "G06Q1006",
    "G06N9900",
    "G06F948",
    "G06F1750"
  ],
  "main_ipcr_label": "G06Q1006",
  "summary": "<SOH> SUMMARY <EOH>Some aspects of this disclosure involve various applications involving data obtained by monitoring interactions with instances of one or more software systems. A “software system”, as used in this disclosure, may refer to one or more of various types of prepackaged business applications, such as enterprise resource planning (ERP), supply chain management (SCM), supplier relationship management (SRM), product lifecycle management (PLM), and customer relationship management (CRM), to name a few. Additionally, a “software system” may refer to a computer system with which a user and/or a computer program (e.g., a software agent) may communicate in order to receive and/or provide information, and/or in order to provide and/or receive a service. In some embodiments, the monitoring is performed by one or more monitoring agents. Each monitoring agent generates a stream comprising steps performed as part of an interaction with an instance of a software system. Optionally, data collected through monitoring may include one or more of the following types of data: data provided by a user (e.g., as input in fields in screens), data provided by a software system (e.g., messages returned as a response to operations), data exchanged between a user interface and a server used to run an instance of a software system (e.g., network traffic between the two), logs generated by an operating system (e.g., on a client used by a user or a server used by an instance of a software system), and logs generated by the instance of the software system (e.g., “event logs” generated by the software system). One aspects of this disclosure involve utilizing an automaton to identify executions of a BP in a stream of steps describing interactions with an instance of a software system. In some embodiments, the identification is done by simulating the running of the automaton on an input that includes the stream and/or candidate sequences selected from the stream. Optionally, an executio...",
  "patent_number": "None",
  "abstract": "Described herein are systems, methods, and computer programs that may be utilized to identify a sequence corresponding to an execution of a Business Processes (BP) using an automaton. In one embodiment, a monitoring agent generates a stream of steps that were performed during interactions with an instance of a software system belonging to a certain organization, and a simulation module simulates a running of an automaton on an input comprising a sequence of steps. Optionally, parameters that define a behavior of the automaton are generated based on sequences of steps corresponding to executions of the BP associated with other organizations. Responsive to running the automaton on the stream, the automaton arrives at an accepting state at least once following a certain subsequence of steps that corresponds to a nonconsecutive execution of the BP, and the simulation module generates an indication indicative of a detection of an execution of the BP.",
  "publication_number": "US20170109667A1-20170420",
  "_processing_info": {
    "original_size": 355109,
    "optimized_size": 4307,
    "reduction_percent": 98.79
  }
}