{
  "date_produced": "20170927",
  "publication_number": "US20170293834A1-20171012",
  "main_ipcr_label": "G06N300",
  "decision": "PENDING",
  "application_number": "15391250",
  "inventor_list": [
    {
      "inventor_name_last": "Raison",
      "inventor_name_first": "Martin Jean",
      "inventor_city": "San Francisco",
      "inventor_state": "CA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Blandin",
      "inventor_name_first": "Willy",
      "inventor_city": "San Francisco",
      "inventor_state": "CA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Crisan",
      "inventor_name_first": "Andreea-Loredana",
      "inventor_city": "San Francisco",
      "inventor_state": "CA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Parunashvili",
      "inventor_name_first": "Stepan",
      "inventor_city": "San Francisco",
      "inventor_state": "CA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "El Moujahid",
      "inventor_name_first": "Kemal",
      "inventor_city": "Mountain View",
      "inventor_state": "CA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Landowski",
      "inventor_name_first": "Laurent Nicolas",
      "inventor_city": "Emeral Hills",
      "inventor_state": "CA",
      "inventor_country": "US"
    }
  ],
  "abstract": "Techniques to response to respond to user requests using natural-language machine learning based on branching example conversations are described. In one embodiment, an apparatus may comprise a bot application interface component operative to receive an example-interaction repository, the example-interaction repository comprising a plurality of example user-to-bot interactions, including one or more branching example user-to-bot interactions; and an interaction processing component operative to generate a linearized example-interaction repository by replacing the one or more branching example user-to-bot interactions with the plurality of linearized example user-to-bot interactions; submit the example-interaction repository to a natural-language machine learning component; and receive a sequence model from the natural-language machine learning component in response to submitting the example-interaction repository; and a client communication component operative to perform a user-to-bot ...",
  "filing_date": "20161227",
  "patent_number": "None",
  "summary": "<SOH> SUMMARY <EOH>The following presents a simplified summary in order to provide a basic understanding of some novel embodiments described herein. This summary is not an extensive overview, and it is not intended to identify key/critical elements or to delineate the scope thereof. Some concepts are presented in a simplified form as a prelude to the more detailed description that is presented later. Various embodiments are generally directed to techniques to respond to user requests using natural-language machine learning based on branching example conversations. Some embodiments are particularly directed to techniques to response to user requests using natural-language machine learning based on branching example conversations for the fulfillment of user service requests, in which branching example conversations are repeatedly traversed to generate linearized example conversations. In one embodiment, for example, an apparatus may comprise a bot application interface component operative to receive an example-interaction repository, the example-interaction repository comprising a plurality of example user-to-bot interactions, including one or more branching example user-to-bot interactions; and an interaction processing component operative to generate a linearized example-interaction repository by replacing the one or more branching example user-to-bot interactions with the plurality of linearized example user-to-bot interactions; submit the example-interaction repository to a natural-language machine learning component; and receive a sequence model from the natural-language machine learning component in response to submitting the example-interaction repository; and a client communication component operative to perform a user-to-bot conversation based on the sequence model. Other embodiments are described and claimed. To the accomplishment of the foregoing and related ends, certain illustrative aspects are described herein in connection with the following description...",
  "date_published": "20171012",
  "title": "TECHNIQUES TO RESPOND TO USER REQUESTS USING NATURAL-LANGUAGE MACHINE LEARNING BASED ON BRANCHING EXAMPLE CONVERSATIONS",
  "ipcr_labels": [
    "G06N300",
    "H04L1258",
    "G06F1728",
    "G06N9900",
    "G06F1727"
  ],
  "_processing_info": {
    "original_size": 155243,
    "optimized_size": 4454,
    "reduction_percent": 97.13
  }
}