{
  "date_produced": "20180608",
  "publication_number": "US20180174072A1-20180621",
  "main_ipcr_label": "G06N9900",
  "decision": "PENDING",
  "application_number": "15392565",
  "inventor_list": [
    {
      "inventor_name_last": "CHARLES",
      "inventor_name_first": "DAVID SANCHEZ",
      "inventor_city": "BARCELONA",
      "inventor_state": "",
      "inventor_country": "ES"
    },
    {
      "inventor_name_last": "LLAGOSTERA",
      "inventor_name_first": "JAUME FERRARONS",
      "inventor_city": "BARCELONA",
      "inventor_state": "",
      "inventor_country": "ES"
    },
    {
      "inventor_name_last": "SEGURA",
      "inventor_name_first": "ALBERTO HUELAMO",
      "inventor_city": "BARCELONA",
      "inventor_state": "",
      "inventor_country": "ES"
    },
    {
      "inventor_name_last": "MULERO",
      "inventor_name_first": "VICTOR MUNTES",
      "inventor_city": "BARCELONA",
      "inventor_state": "",
      "inventor_country": "ES"
    },
    {
      "inventor_name_last": "NOGUERO",
      "inventor_name_first": "DAVID SOLANS",
      "inventor_city": "BARCELONA",
      "inventor_state": "",
      "inventor_country": "ES"
    },
    {
      "inventor_name_last": "SIMO",
      "inventor_name_first": "MARC SOLE",
      "inventor_city": "BARCELONA",
      "inventor_state": "",
      "inventor_country": "ES"
    }
  ],
  "abstract": "In a datacenter setting, future states of nodes of a datacenter (each node representing a component of the datacenter in a context graph) are predicted. Initially, historical metrics collected from the datacenter nodes, as well as historical metrics of neighboring nodes. The metrics are aggregated into historical metric summary vector representations of the nodes which are utilized to train a future state predictor to predict future datacenter states. Once trained, metrics may be input into the future state predictor and the future state predictor may be utilized to predict a future state of one or more of the nodes of the datacenter.",
  "filing_date": "20161228",
  "patent_number": "None",
  "summary": "<SOH> SUMMARY <EOH>This summary is provided to introduce a selection of concepts in a simplified form that are further described below in the detailed description. This summary is not intended to identify key features or essential features of the claimed subject matter, nor should it be used as an aid in determining the scope of the claimed subject matter. Embodiments of the present disclosure relate to predicting future states of nodes of a datacenter (each node representing a component of the datacenter in a context graph) utilizing a trained future state predictor. The evolution of recent states of the datacenter is analyzed by examining historical metrics collected from the datacenter nodes, as well as historical metrics of neighboring nodes. The metrics are aggregated into historical metric summary vector representations of the nodes which are utilized to train a future state predictor to predict future datacenter states. Once trained, metrics may be input into the future state predictor and the future state predictor may be utilized to predict a future state of one or more of the nodes of the datacenter.",
  "date_published": "20180621",
  "title": "METHOD AND SYSTEM FOR PREDICTING FUTURE STATES OF A DATACENTER",
  "ipcr_labels": [
    "G06N9900",
    "G06N502"
  ],
  "_processing_info": {
    "original_size": 56611,
    "optimized_size": 3098,
    "reduction_percent": 94.53
  }
}