{
  "decision": "ACCEPTED",
  "application_number": "15391988",
  "date_published": "20170420",
  "date_produced": "20170405",
  "title": "SYSTEM AND METHOD FOR PRODUCT DELIVERY",
  "filing_date": "20161228",
  "inventor_list": [
    {
      "inventor_name_last": "Sharma",
      "inventor_name_first": "Prateek",
      "inventor_city": "Scottsdale",
      "inventor_state": "AZ",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Guthrie",
      "inventor_name_first": "Sean",
      "inventor_city": "Phoenix",
      "inventor_state": "AZ",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Trinh",
      "inventor_name_first": "Toan",
      "inventor_city": "Phoenix",
      "inventor_state": "AZ",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Kapadia",
      "inventor_name_first": "Atin",
      "inventor_city": "Chandler",
      "inventor_state": "AZ",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Mahar",
      "inventor_name_first": "Michael",
      "inventor_city": "Phoenix",
      "inventor_state": "AZ",
      "inventor_country": "US"
    }
  ],
  "ipcr_labels": [
    "G06Q1008",
    "G05B19042"
  ],
  "main_ipcr_label": "G06Q1008",
  "summary": "<SOH> BACKGROUND AND SUMMARY OF THE INVENTION <EOH>Exemplary embodiments of the present invention relate generally to a system and method for product, order or container delivery. While an exemplary embodiment may be particularly useful for transporting at least one vial order or container to a desired destination, other types of products not limited to vial orders or containers may be delivered via an exemplary system and method. An exemplary embodiment may be particularly useful for the delivery of pharmacy orders or containers. A pharmacy vial or bottle is one example of a pharmacy order or container. Nevertheless, other types of delivery systems may also benefit from exemplary embodiments of the present invention. In a known delivery system for pharmacy containers, the production rate and efficiency is hampered by manual operations. For example, a human operator may be required to pick a pharmacy product or container from a conveyor one at a time and then manually process it for packing. The picked product or container is then manually scanned before being added to a package (e.g., a delivery bag or box). After the package is filled in this manner, the operator then seals the package. This process is inefficient and susceptible to operator error in selecting the wrong container. Accordingly, there is a need for an improved delivery system and method that improves efficiency and production rates. A need also exists for an improved delivery system and method that minimizes operator error. An exemplary embodiment may satisfy some or all of the aforementioned needs. An exemplary embodiment may comprise a chute in association with a conveyor. The chute is adapted to receive product from the conveyor. The chute is then adapted to transfer the product to a packing system such as a delivery bag or box. Accordingly, an exemplary embodiment may also include a packing system adapted to receive product from the chute. Another exemplary embodiment includes a related method f...",
  "patent_number": "9679271",
  "abstract": "A system and method for delivering a product such as a pharmacy bottle from a conveyor system to a delivery container via a delivery chute. A sensor is placed at a top opening of the chute to sense for product in the chute area and to provide instructions to complete the delivery order if the chute area is clear.",
  "publication_number": "US20170109691A1-20170420",
  "_processing_info": {
    "original_size": 32895,
    "optimized_size": 3438,
    "reduction_percent": 89.55
  }
}