{
  "patent_number": "None",
  "application_number": "15408557",
  "date_published": "20170803",
  "date_produced": "20170719",
  "filing_date": "20170118",
  "main_ipcr_label": "G06N502",
  "abstract": "A method for measuring a technical system, especially a combustion engine for a motor vehicle, using a number of measuring points to in each instance obtain a value of at least one output variable. The method includes selecting a measuring point from a quantity of measuring points, determining a confidence value for the selected measuring point on the basis of a classification model, the confidence value indicating a permissibility of an operating point that results owing to the operation of the technical system at the measuring point, measuring the technical system at the selected measuring point as a function of the confidence value, and updating the classification model, with an indication as to whether the operating point of the technical system set by the measurement of the selected measuring point is permissible.",
  "publication_number": "US20170220931A1-20170803",
  "summary": "<SOH> SUMMARY <EOH>According to the present invention, a method for measuring a technical system using a quantity of measuring points, as well as the corresponding device are provided. According to a further aspect, an example method is provided to measure a technical system for generating a system model of the technical system, the measurement being carried out using a number of measuring points to in each instance obtain a value of at least one output variable. The method includes, e.g., the following steps: Selecting a measuring point from a quantity of measuring points; Determining a confidence value for the selected measuring point on the basis of a classification model, the confidence value indicating a modeled permissibility of an operating point that results owing to the operation of the technical system at the measuring point; Measuring the technical system at the selected measuring point as a function of the confidence value; and Updating the classification model, with an indication as to whether the operating point of the technical system set by the measurement of the selected measuring point is permissible. In accordance with the present invention, from a quantity of measuring points provided, select measuring points are selected for measuring a technical system in such a way that the number of measuring processes at potentially system-endangering measuring points in the quantity of measuring points is minimized when measuring the technical system. To that end, according to the method above, the next measuring point to be measured in each case is selected as a function of a confidence value. The confidence value is ascertained according to a classification model as a model prediction or as a prognosis, and indicates a safety of the application of the corresponding measuring point to the technical system or a permissibility of the operating point of the technical system obtained owing to the measuring point. In this manner, upon determining that an imperm...",
  "ipcr_labels": [
    "G06N502",
    "G06F1750",
    "G06N9900",
    "G01M1502",
    "G06N700"
  ],
  "inventor_list": [
    {
      "inventor_name_last": "Kloppenburg",
      "inventor_name_first": "Ernst",
      "inventor_city": "Ditzingen",
      "inventor_state": "",
      "inventor_country": "DE"
    }
  ],
  "title": "METHOD AND DEVICE FOR MEASURING A SYSTEM TO BE TESTED",
  "decision": "PENDING",
  "_processing_info": {
    "original_size": 30512,
    "optimized_size": 3421,
    "reduction_percent": 88.79
  }
}