{
  "patent_number": "None",
  "application_number": "15406521",
  "date_published": "20170525",
  "date_produced": "20170510",
  "filing_date": "20170113",
  "main_ipcr_label": "G06N700",
  "abstract": "An online system extracts features from an application linked to the online system. The application is used by users of the online system and posts content to the online system. A trained model is applied to the extracted features to generate a quality score for the application. The trained model is trained using features extracted from a set of training applications and quality scores manually assigned to the training applications, wherein the manually assigned quality scores indicate whether each training application satisfies a set of criteria and the generated quality score represents a probability of the application satisfying the set of criteria. Based on the quality score, content provided by the application is ranked for presentation to a user of the online system in relation to other content of the online system. The online system presents the content provided by the application to the user according to the ranking.",
  "publication_number": "US20170147936A1-20170525",
  "summary": "<SOH> SUMMARY <EOH>An online system, such as a social networking system, generates quality scores for applications linked to the online system to present content associated with high-quality applications to users of the online system. Applications linked to the online system are used by users of the online system and post content to the online system, such as content identifying actions taken by the users when using the applications. To generate a quality score for an application linked to the online system, the online system extracts features from the application. A trained model is applied to the extracted features, which assigns a quality score to the application. To obtain the trained model, the online system receives quality scores manually assigned to a training set of applications by human reviewers. The human reviewers assign the quality scores to the applications by rating the applications across a plurality of dimensions defining criteria for a quality application. For example, the reviewers rate the applications according to navigability, non-triviality, novelty, and quality of content generated by the applications. The online system trains the model using features extracted from the training applications and the manually assigned quality scores to predict a probability of an application satisfying the quality criteria. In one embodiment, the manually assigned quality scores are binary and indicate whether an application satisfies all of the quality criteria. In this case, the quality score generated by applying the trained model to features extracted from an application represents a probability that the application satisfies all of the quality criteria. The trained model may alternatively predict for each dimension a probability of the application satisfying the criteria associated with the dimension, and generate a quality score for the application based on the determined probabilities. The online system uses the quality score to rank content provided b...",
  "ipcr_labels": [
    "G06N700",
    "G06N9900",
    "H04L2908"
  ],
  "inventor_list": [
    {
      "inventor_name_last": "Gross",
      "inventor_name_first": "Jonathan J.",
      "inventor_city": "Seattle",
      "inventor_state": "WA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Liao",
      "inventor_name_first": "Yihua",
      "inventor_city": "Fremont",
      "inventor_state": "CA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Krivoshein",
      "inventor_name_first": "Joshua Luke",
      "inventor_city": "San Francisco",
      "inventor_state": "CA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Bickert",
      "inventor_name_first": "Monika Leigh",
      "inventor_city": "Menlo Park",
      "inventor_state": "CA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Zarakhovsky",
      "inventor_name_first": "Eugene",
      "inventor_city": "Seattle",
      "inventor_state": "WA",
      "inventor_country": "US"
    }
  ],
  "title": "ANALYZING QUALITY OF APPLICATIONS LINKED TO AN ONLINE SYSTEM",
  "decision": "PENDING",
  "_processing_info": {
    "original_size": 56092,
    "optimized_size": 4120,
    "reduction_percent": 92.65
  }
}