{
  "patent_number": "None",
  "application_number": "15400829",
  "date_published": "20170706",
  "date_produced": "20170621",
  "filing_date": "20170106",
  "main_ipcr_label": "G06N502",
  "abstract": "Systems and methods for providing an assistive communication layer includes receiving a communication and/or data input from one or more users and/or one or more non-users; establishing an interaction session between the one or more users and/or one or more non-users and the assistive communication layer based on the communication and/or data input from the one or more users and/or one or more non-users; analyzing the communication and/or data input from the one or more users and/or one or more non-users; and responsive to the analysis of the communication and/or data input, (i) referencing a knowledge database for data relevant to the analysis and (ii) identifying one of a plurality of operational protocols to execute.",
  "publication_number": "US20170193369A1-20170706",
  "summary": "<SOH> BRIEF DESCRIPTION OF THE FIGURES <EOH>FIG. 1 illustrates a schematic of a system of one or more embodiments of the present application; FIG. 2 illustrates a process flow of a method of one or more embodiments of the present application; and FIG. 3 illustrates a process flow of a method of one or more embodiments of the present application. detailed-description description=\"Detailed Description\" end=\"lead\"?",
  "ipcr_labels": [
    "G06N502",
    "G06F944",
    "G06F1728"
  ],
  "inventor_list": [
    {
      "inventor_name_last": "Ferrell",
      "inventor_name_first": "William",
      "inventor_city": "Fort Lauderdale",
      "inventor_state": "FL",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Kopf",
      "inventor_name_first": "Jared",
      "inventor_city": "Fort Lauderdale",
      "inventor_state": "FL",
      "inventor_country": "US"
    }
  ],
  "title": "ASSISTIVE COMMUNICATION SYSTEM AND METHOD",
  "decision": "PENDING",
  "_processing_info": {
    "original_size": 80282,
    "optimized_size": 1856,
    "reduction_percent": 97.69
  }
}