{
  "patent_number": "None",
  "application_number": "15401097",
  "date_published": "20170720",
  "date_produced": "20170705",
  "filing_date": "20170109",
  "main_ipcr_label": "G06N700",
  "abstract": "Provided is a failure prediction method using a failure prediction apparatus, including: receiving time-series data about measured performance parameters from a device under test; encoding the time-series data with a plurality of symbols corresponding to a predetermined range; calculating a transition probabilities between the symbols of the encoded time-series data, and generating a transition matrix according to the transition probabilities; calculating an abnormal indicator, which is a difference between the transition matrix and a pre-stored database, and an increased value of the abnormal indicator; and comparing the increased value of the abnormal indicator and a predetermined threshold value, and if the increased value of the abnormal indicator is greater than the predetermined threshold value, predicting that failure of the device under test is to occur.",
  "publication_number": "US20170206459A1-20170720",
  "summary": "<SOH> SUMMARY OF THE DISCLOSURE <EOH>The present invention has been made in an effort to provide a failure prediction apparatus for an electronic device under test and a failure prediction method using the same for predicting failure occurrence of the electronic device by analyzing measurement data on performance parameters of the corresponding electronic device. An exemplary embodiment of the present invention provides a failure prediction method using a failure prediction apparatus including: receiving time-series data about measured performance parameters from a device under test; encoding the time-series data with a plurality of symbols corresponding to a predetermined range; calculating a transition probabilities between the symbols of the encoded time-series data, and generating a transition matrix according to the transition probabilities; calculating an abnormal indicator, which is a difference between the transition matrix and a pre-stored database, and an increased value of the abnormal indicator; and comparing the increased value of the abnormal indicator and a predetermined threshold value, and if the increased value of the abnormal indicator is greater than the predetermined threshold value, predicting that failure of the device under test is to occur. The database may be generated by encoding the time-series data about the performance parameters measured when the device under test is normally operated, and forming a transition matrix of the transition probabilities between the respective symbols. The calculating of the abnormal indicator and the increased value of the abnormal indicator may include calculating, using a matrix norm, the abnormal indicator, which is the difference between the transition matrix and the pre-stored database. The increased value of the abnormal indicator may include at least one of an instantaneous slope of the abnormal indicator and the number of continuous times the abnormal indicator is increased. The calculating of the a...",
  "ipcr_labels": [
    "G06N700",
    "G06F1716"
  ],
  "inventor_list": [
    {
      "inventor_name_last": "KWON",
      "inventor_name_first": "Dae Il",
      "inventor_city": "Ulsan",
      "inventor_state": "",
      "inventor_country": "KR"
    }
  ],
  "title": "FAILURE PREDICTION APPARATUS FOR ELECTRIC DEVICE AND FAILURE PREDICTION METHOD USING THE SAME",
  "decision": "PENDING",
  "_processing_info": {
    "original_size": 34231,
    "optimized_size": 3460,
    "reduction_percent": 89.89
  }
}