{
  "patent_number": "None",
  "application_number": "15409425",
  "date_published": "20171221",
  "date_produced": "20171207",
  "filing_date": "20170118",
  "main_ipcr_label": "G06N308",
  "abstract": "Petroleum Analytics Learning Machine (or PALM) system is a machine learning based, “brutally empirical” analysis system for use in all upstream and midstream oil and gas operations. PALM system optimizes exploration, production and gathering from at least one well of oil and natural gas fields to maximize production while minimizing costs. Normalized data are processed to determine clusters of correlation in multi-dimensional space to identify a machine learned ranking of importance weights for each attribute. Predictive and prescriptive optimization on the normalized data is performed utilizing unique combinations of machine learning and statistical algorithm ensembles. The unstructured textual data are classified to correlate with optimal production to capture the dynamics of at least one or more wells of oil and natural gas fields and to provide categorization results from labeled data sets to identify patterns.",
  "publication_number": "US20170364795A1-20171221",
  "summary": "<SOH> OBJECT AND ASUMMARY OF THE INVENTION <EOH>The Petroleum Analytics Learning Machine (PALM) is a machine learning based, “brutally empirical” analysis system for use in all upstream and midstream oil and gas operations. The Petroleum Analytics Learning Machine™ is a trademark of applicant. The objective of the PALM is to become the go-to ‘brain’ of oil and gas exploration and production, including drilling, completion, and pipeline gathering operations. The PALM was reduced to practice primarily in the new unconventional shale oil and gas play. The PALM analyzed more than 100 attributes integrated from all available data referenced above, in more than 150 horizontal wells and more than 2000 hydraulic fracture (frac) stages that were drilled since 2012 in the wet gas region of the Target Layer shale of Pennsylvania. The PALM was also validated in more than 3000 shale oil wells with more than 10,000 hydraulic fracture stages in the Permian Basin of Texas. In accordance with an exemplary embodiment of the claimed invention. The PALM comprises Machine Analytics Products™ (MAP) Application subsystems (subsystems) that are big-data-centric, using computational machine learning predictive and prescriptive analysis techniques to maximize production of hydrocarbons while minimizing costs of oil and gas upstream exploration and production (E&P) and midstream pipeline operations. In accordance with an exemplary embodiment of the claimed invention, the PALM comprises MAP subsystems for geology, geophysics, reservoir modeling and rock physics, MAPGEORES; drilling, MAPDRILL; hydraulic fracturing and completions, MAPFRAC; production of hydrocarbons including oil and other liquid condensates, natural gas, and water, MAPPROD; and gathering pipelines and compressor stations, MAPGATHER. In accordance with an aspect of the claimed invention, PALM further comprises other MAP subsystems, such as portfolio management, MAPPORTFOLIO; and others subsystems specifically developed for a cu...",
  "ipcr_labels": [
    "G06N308",
    "G06N502"
  ],
  "inventor_list": [
    {
      "inventor_name_last": "ANDERSON",
      "inventor_name_first": "ROGER N.",
      "inventor_city": "NEW YORK",
      "inventor_state": "NY",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "XIE",
      "inventor_name_first": "BOYI",
      "inventor_city": "NEW YORK",
      "inventor_state": "NY",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "WU",
      "inventor_name_first": "LEON L.",
      "inventor_city": "NEW YORK",
      "inventor_state": "NY",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "KRESSNER",
      "inventor_name_first": "ARTHUR",
      "inventor_city": "WESTFIELD",
      "inventor_state": "NJ",
      "inventor_country": "US"
    }
  ],
  "title": "PETROLEUM ANALYTICS LEARNING MACHINE SYSTEM WITH MACHINE LEARNING ANALYTICS APPLICATIONS FOR UPSTREAM AND MIDSTREAM OIL AND GAS INDUSTRY",
  "decision": "PENDING",
  "_processing_info": {
    "original_size": 141601,
    "optimized_size": 4040,
    "reduction_percent": 97.15
  }
}