{
  "patent_number": "None",
  "application_number": "15400151",
  "date_published": "20170427",
  "date_produced": "20170412",
  "filing_date": "20170106",
  "main_ipcr_label": "G06N504",
  "abstract": "A process for recommending choices to a user uses a first model representing the user's subconscious and a second model representing the user's consciousness. The process comprises receiving data and performing, using the second model, a simulation by modeling the user and a third party to derive a simulation result that determines how the user would react to a situation based at least in part on the received data. Using the first model and the simulation, a first set of recommendation choices based at least in part on the received data is derived, and a set of recommendation choices for presentation based on the first set of recommendation choices is determined and presented to the user. As the user is making a selection, the user is monitored for conscious decisions and subconscious reactions, which are used to update the first model and the second model.",
  "publication_number": "US20170116534A1-20170427",
  "summary": "<SOH> BRIEF SUMMARY <EOH>According to aspects of the present invention, a process for recommending choices to a user uses a first model representing the user's subconscious and a second model representing the user's consciousness. The process comprises receiving data and performing, using the second model, a simulation by modeling the user and a third party to derive a simulation result that determines how the user would react to a situation based at least in part on the received data. Using the first model and the simulation, a first set of recommendation choices based at least in part on the received data is derived, and a set of recommendation choices for presentation based on the first set of recommendation choices is determined and presented to the user. The process further comprises monitoring a conscious decision made by the user and monitoring subconscious reactions of the user. The subconscious reactions of the user are monitored both while the user is making the selection and not making the selection, and data representing the subconscious reactions of the user is appended to a first memory space. To monitor the conscious decision made by the user, a selection from the set of recommendation choices for presentation performed by the user is received and what the user did not select from the set of recommendation choices for presentation by the user is monitored. Data representing the conscious decisions of the user is appended to a second memory space. The data representing the conscious decisions of the user and the data representing the subconscious reactions of the user is used to update one or both of the models. According to aspects of the present disclosure, the process may determine recommendation choices for presentation by determining a second set of recommendation choices and blending the first set of recommendation choices with the second set of recommendation choices by vetoing the second set of recommendation choices such that the set of recomm...",
  "ipcr_labels": [
    "G06N504",
    "G06F1750",
    "G06N9900"
  ],
  "inventor_list": [
    {
      "inventor_name_last": "Rogers",
      "inventor_name_first": "Steven Keith",
      "inventor_city": "Beavercreek",
      "inventor_state": "OH",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Rogers",
      "inventor_name_first": "Adam Steven",
      "inventor_city": "Beavercreek",
      "inventor_state": "OH",
      "inventor_country": "US"
    }
  ],
  "title": "TWO-MODEL RECOMMENDER",
  "decision": "PENDING",
  "_processing_info": {
    "original_size": 65170,
    "optimized_size": 3565,
    "reduction_percent": 94.53
  }
}