{
  "patent_number": "None",
  "application_number": "15401875",
  "date_published": "20170427",
  "date_produced": "20170412",
  "filing_date": "20170109",
  "main_ipcr_label": "G06N502",
  "abstract": "A computer-implemented content suggestion engine provides content suggestions to a requesting user based on information about content items that other users may have independently categorized or organized into folders within a content repository. Embodiments of the method comprise a content repository having a plurality of content items, where each content item is associated with one or more user-created folders. Embodiments further comprise receiving, via a network, a suggestion request for suggested content, where the suggestion request identifies a first content item for which suggestions are sought. Other content items in the content repository are then identified as potential suggestions based on the application of a formal relationship between the first content item and the potential suggested content items. One or more of the potential suggested content items may then be provided in response to the suggestion request via the network.",
  "publication_number": "US20170116527A1-20170427",
  "summary": "<SOH> SUMMARY OF THE INVENTION <EOH>This summary is provided to introduce certain concepts in a simplified form that are further described below in the Detailed Description. This summary is not intended to identify key features or essential features of the claimed subject matter, nor is it intended to limit in any way the scope of the claimed invention. Embodiments of the present invention are directed to providing content suggestions in an information space, based on at least one content item that a user may have identified or received in response to a search, combined with information about related content items that other users have independently categorized or organized. A content item (also referred to herein as “content” or “item”) is a discrete digital information resource, such as a document or file that is accessible by a computer. Content items may comprise, for example, web pages, snapshots or archived versions of those web pages (including discrete historical versions), images, videos, audio files, multimedia files, data files, documents, or other digital items that can be presented to a user via a browser or other type of content interface application, content viewing application, or computer file management software. Content items may also include links, Uniform Resource Locators (“URLs”), and other pointers or references corresponding to the content. In one embodiment, a plurality of computer users may perform searches for content in an information space such as the Internet, utilizing any of a number of search engines known in the art. In response to the searches, the users may receive search results comprising content items and/or links to content items, and may optionally receive a short synopsis or summary of each returned content item and/or link. Each user may then organize at least some of the received content items by saving them to a content repository for later use. A user may save a content item in several ways known by persons of ordinary ...",
  "ipcr_labels": [
    "G06N502",
    "G06F1730",
    "G06N504"
  ],
  "inventor_list": [
    {
      "inventor_name_last": "Cohen",
      "inventor_name_first": "Alain J",
      "inventor_city": "McLean",
      "inventor_state": "VA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Cohen",
      "inventor_name_first": "Marc A.",
      "inventor_city": "McLean",
      "inventor_state": "VA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "McKeown",
      "inventor_name_first": "Ryan",
      "inventor_city": "Fairfax",
      "inventor_state": "VA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Znam",
      "inventor_name_first": "Stefan",
      "inventor_city": "Rockville",
      "inventor_state": "MD",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Morales",
      "inventor_name_first": "Alberto",
      "inventor_city": "Reston",
      "inventor_state": "VA",
      "inventor_country": "US"
    }
  ],
  "title": "Deriving Semantic Relationships Based on  Empirical Organization of Content by Users",
  "decision": "PENDING",
  "_processing_info": {
    "original_size": 174874,
    "optimized_size": 4156,
    "reduction_percent": 97.62
  }
}