{
  "patent_number": "None",
  "application_number": "15403761",
  "date_published": "20170615",
  "date_produced": "20170603",
  "filing_date": "20170111",
  "main_ipcr_label": "G06N502",
  "abstract": "Techniques for customizing knowledge representation systems including identifying, based on a plurality of concepts in a knowledge representation (KR), a group of one or more concepts relevant to user context information, and providing the identified group of one more concepts to a user. The KR may include a combination of modules. The modules may include a kernel and a customized module customized for the user. The kernel may accessible via a second KR.",
  "publication_number": "US20170169334A1-20170615",
  "summary": "<SOH> SUMMARY <EOH>The inventive concepts presented herein are illustrated in a number of different embodiments, each showing one or more concepts, though it should be understood that, in general, the concepts are not mutually exclusive and may be used in combination even when not so illustrated. Some embodiments provide for a method comprising obtaining user context information associated with a user; identifying, based on a plurality of concepts in a first knowledge representation (KR), a group of one or more concepts relevant to the user context information; and providing the identified group of one or more concepts to the user, wherein the first KR includes a combination of modules, the modules including a kernel and a customized module, the kernel being accessible via a second KR, the customized module being customized for the user, and wherein the identifying and the providing are performed at least in part by using at least one processor and a data structure representing the first KR. Other embodiments provide for at least one non-transitory computer-readable storage medium storing processor executable instructions that, when executed by at least one processor, cause the at least one processor to perform a method comprising obtaining user context information associated with a user; identifying, based on a plurality of concepts in a first knowledge representation (KR), a group of one or more concepts relevant to the user context information; providing the identified group of one or more concepts to the user, wherein the first KR includes a kernel and a customized module, the kernel being accessible via a second KR, the customized module being customized for the user, and wherein the identifying and providing are performed at least in part by using a data structure representing the first KR. Still other embodiments provide for a system comprising at least one processor configured to perform obtaining user context information associated with a user; identifying,...",
  "ipcr_labels": [
    "G06N502",
    "G06F1730"
  ],
  "inventor_list": [
    {
      "inventor_name_last": "SWEENEY",
      "inventor_name_first": "Peter",
      "inventor_city": "Kitchener",
      "inventor_state": "",
      "inventor_country": "CA"
    },
    {
      "inventor_name_last": "ILYAS",
      "inventor_name_first": "Ihab Francis",
      "inventor_city": "Waterloo",
      "inventor_state": "",
      "inventor_country": "CA"
    }
  ],
  "title": "METHODS AND DEVICES FOR CUSTOMIZING KNOWLEDGE REPRESENTATION SYSTEMS",
  "decision": "PENDING",
  "_processing_info": {
    "original_size": 300240,
    "optimized_size": 3174,
    "reduction_percent": 98.94
  }
}