{
  "patent_number": "None",
  "application_number": "15406557",
  "date_published": "20170713",
  "date_produced": "20170627",
  "filing_date": "20170113",
  "main_ipcr_label": "G06N304",
  "abstract": "In one aspect, this specification describes a recurrent neural network system implemented by one or more computers that is configured to process input sets to generate neural network outputs for each input set. The input set can be a collection of multiple inputs for which the recurrent neural network should generate the same neural network output regardless of the order in which the inputs are arranged in the collection. The recurrent neural network system can include a read neural network, a process neural network, and a write neural network. In another aspect, this specification describes a system implemented as computer programs on one or more computers in one or more locations that is configured to train a recurrent neural network that receives a neural network input and sequentially emits outputs to generate an output sequence for the neural network input.",
  "publication_number": "US20170200076A1-20170713",
  "summary": "<SOH> SUMMARY <EOH>In one aspect, this specification describes a recurrent neural network system implemented by one or more computers in one or more locations that is configured to process input sets to generate neural network outputs for each input set. An input set is a collection of multiple inputs to the recurrent neural network system for which the order does not matter, i.e., a collection for which the recurrent neural network should generate the same neural network output regardless of the order in which the inputs are arranged in the collection. The recurrent neural network includes a read neural network that is configured to receive an input set that includes multiple inputs and process each input in the input set to generate a respective memory vector for each input in the input set. The recurrent neural network also includes a process neural network that is configured to process the respective memory vectors to generate an order-invariant numeric embedding for the input set. The order-invariant numeric embedding is a numeric representation of the input set that is permutation invariant to the inputs in the input set. That is, regardless of the order in which the process neural network processes the memory vectors, the order-invariant numeric embedding generated by the recurrent neural network will be the same. The recurrent neural network also includes a write neural network that is configured to process the order-invariant numeric embedding to generate the neural network output for the input set. The architecture of the write neural network will generally depend on the type of neural network output that the system is configured to generate. In another aspect, this specification describes a system implemented as computer programs on one or more computers in one or more locations that is configured to train a recurrent neural network that receives a neural network input and sequentially emits outputs to generate an output sequence for the neural network in...",
  "ipcr_labels": [
    "G06N304",
    "G06N308"
  ],
  "inventor_list": [
    {
      "inventor_name_last": "Vinyals",
      "inventor_name_first": "Oriol",
      "inventor_city": "London",
      "inventor_state": "",
      "inventor_country": "GB"
    },
    {
      "inventor_name_last": "Bengio",
      "inventor_name_first": "Samuel",
      "inventor_city": "Los Altos",
      "inventor_state": "CA",
      "inventor_country": "US"
    }
  ],
  "title": "PROCESSING AND GENERATING SETS USING RECURRENT NEURAL NETWORKS",
  "decision": "PENDING",
  "_processing_info": {
    "original_size": 66672,
    "optimized_size": 3578,
    "reduction_percent": 94.63
  }
}