{
  "patent_number": "None",
  "application_number": "15413158",
  "date_published": "20170803",
  "date_produced": "20170719",
  "filing_date": "20170123",
  "main_ipcr_label": "G06N504",
  "abstract": "A method of maintaining interoperability amongst Internet of Things (IoT) devices connected via an IoT integration platform is disclosed. The method includes: receiving a selection of a semantic label associated with an IoT device; determining a recommendation of an interoperable rule based on the semantic label, the interoperable rule having a condition trigger and an action policy for execution at satisfaction of the condition trigger; presenting the recommendation on a rule management interface; and receiving a confirmation from a user through the rule management interface to activate the interoperable rule.",
  "publication_number": "US20170220940A1-20170803",
  "summary": "<SOH> BRIEF DESCRIPTION OF THE DRAWINGS <EOH>FIG. 1A is a block diagram illustrating vertical solutions provided for connected devices. FIG. 1B is a block diagram illustrating an integration platform operating in conjunction with the vertical solutions. FIG. 2 is a block diagram illustrating an example system environment of a internet of things (IoT) integration platform system. FIG. 3 is a block diagram illustrating the IoT integration platform system. FIG. 4 is an example of an user interface illustrating an active lifeline diagram for a user account on an integration interface, consistent with various embodiments of the disclosed technology FIG. 5 is a diagrammatic representation of a machine in the example form of a computer system within which a set of instructions, for causing the machine to perform any one or more of the methodologies or modules discussed herein, may be executed. FIG. 6 is a diagrammatic representation of a wireless device. FIG. 7 is a flow diagram of a method of data consolidation, consistent with various embodiments of the disclosed technology. FIG. 8 is a flow diagram of a method of interoperable IoT rule management, consistent with various embodiments of the disclosed technology. FIG. 9A is an exemplary screen shot illustrating a rule management interface of an integration platform at a rule activation stage, consistent with various embodiments of the disclosed technology. FIG. 9B is an exemplary screen shot illustrating the rule management interface of the integration platform at a condition selection stage, consistent with various embodiments of the disclosed technology. FIG. 9C is an exemplary screen shot illustrating the rule management interface of the integration at an action selection stage, consistent with various embodiments of the disclosed technology. FIG. 10A is an exemplary screen shot illustrating the consolidation interface showing a correlative insight, consistent with various embodiments of the disclosed technology. FIG. ...",
  "ipcr_labels": [
    "G06N504",
    "G06N700",
    "H04L2908",
    "G06N9900"
  ],
  "inventor_list": [
    {
      "inventor_name_last": "Shaashua",
      "inventor_name_first": "Triinu Magi",
      "inventor_city": "Sunnyvale",
      "inventor_state": "CA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Shaashua",
      "inventor_name_first": "Ori",
      "inventor_city": "Sunnyvale",
      "inventor_state": "CA",
      "inventor_country": "US"
    }
  ],
  "title": "INTEROPERABILITY MECHANISMS FOR INTERNET OF THINGS INTEGRATION PLATFORM",
  "decision": "PENDING",
  "_processing_info": {
    "original_size": 102944,
    "optimized_size": 3366,
    "reduction_percent": 96.73
  }
}