{
  "patent_number": "None",
  "application_number": "15419238",
  "date_published": "20170803",
  "date_produced": "20170719",
  "filing_date": "20170130",
  "main_ipcr_label": "G06N304",
  "abstract": "Boltzmann machine includes a plurality of circuit units each having an adder that adds weighted input signals and a comparison unit that compares an output signal of the adder with a threshold signal to output a binary output signal; and digital arithmetic units each generating the weighted input signals by weighting the binary output signal of the circuit units with a weight. The comparison unit has a first comparator that compares a thermal noise with a reference voltage to output a binary digital random signal, a DA converter that converts the digital random signal to an analog random signal and varies a magnitude of the analog random signal, and a second comparator that compares the output signal of the adder with the analog random signal to generate the binary output signal with a predetermined probability function.",
  "publication_number": "US20170220924A1-20170803",
  "summary": "<SOH> SUMMARY <EOH>In the Boltzmann machine, in order to prevent the solution from falling into a local minimum value, a method called simulated annealing is used which, using a temperature parameter, changes a probability with which each lattice (unit) outputs+1. In the conventional Boltzmann machine, in order to change the above probability, a noise is generated by a random noise generator, the amplitude of the generated noise is changed by an amplifier, and the output value of each lattice (unit) is thereby generated. With this, the probability that each lattice (unit) outputs+1 is changed using the temperature parameter. However, the circuit scale of the random noise generator is large and, since the magnitude of the generated noise is random, it is difficult to appropriately change the amplitude of the noise. According to an aspect of the embodiments, Boltzmann machine includes a plurality of circuit units each of which has an adder that performs addition of a plurality of weighted input signals and a comparison unit that compares an output signal of the adder with a threshold signal to output a binary output signal; and a plurality of digital arithmetic units each of which generates each of the weighted input signals by weighting the binary output signal of a first circuit unit of a pair of the circuit units in the plurality of circuit units with a weight to output the weighted input signal to a second circuit unit of the pair of the circuit units, wherein the comparison unit has: a first comparator that compares a thermal noise with a reference voltage to output a binary digital random signal; a first DA converter that converts the digital random signal to an analog random signal, and varies a magnitude of the analog random signal; and a second comparator that input the analog random signal as the threshold signal, and compares the output signal of the adder with the threshold signal to generate the binary output signal with a predetermined probability functi...",
  "ipcr_labels": [
    "G06N304",
    "G06N700"
  ],
  "inventor_list": [
    {
      "inventor_name_last": "DANJO",
      "inventor_name_first": "Takumi",
      "inventor_city": "Kawasaki",
      "inventor_state": "",
      "inventor_country": "JP"
    },
    {
      "inventor_name_last": "TSUKAMOTO",
      "inventor_name_first": "Sanroku",
      "inventor_city": "Setagaya",
      "inventor_state": "",
      "inventor_country": "JP"
    },
    {
      "inventor_name_last": "TAMURA",
      "inventor_name_first": "Hirotaka",
      "inventor_city": "Yokohama",
      "inventor_state": "",
      "inventor_country": "JP"
    }
  ],
  "title": "BOLTZMANN MACHINE, METHOD FOR CONTROLLING BOLTZMANN MACHINE, AND INFORMATION PROCESSING DEVICE HAVING BOLTZMANN MACHINE",
  "decision": "PENDING",
  "_processing_info": {
    "original_size": 65298,
    "optimized_size": 3741,
    "reduction_percent": 94.27
  }
}