{
  "patent_number": "None",
  "application_number": "15417095",
  "date_published": "20170518",
  "date_produced": "20170503",
  "filing_date": "20170126",
  "main_ipcr_label": "G06N9900",
  "abstract": "A system and method enables users to selectively expose and optionally monetize their data resources, for example on a web site. Data assets such as datasets and models can be exposed by the proprietor on a public gallery for use by others. Fees may be charged, for example, per new model, or per prediction using a model. Users may selectively expose public datasets or public models while keeping their raw data private.",
  "publication_number": "US20170140302A1-20170518",
  "summary": "<SOH> SUMMARY OF PREFERRED EMBODIMENTS <EOH>The following is a summary of the invention in order to provide a basic understanding of some aspects of the invention. This summary is not intended to identify key/critical elements of the invention or to delineate the scope of the invention. Its sole purpose is to present some concepts of the invention in a simplified form as a prelude to the more detailed description that is presented later. In one aspect, a system in accordance with the present disclosure may enable an owner of a dataset to control permissions that would enable another party or second user to use the dataset to make a new model derived from the dataset. The owner or the system may charge the second user a fee to use the dataset. The fee may be shared with the owner. In another aspect, a system in accordance with the present disclosure may enable an owner of a model to control permissions that would enable another party or second user to use the model to make a predictions based on a new input dataset provided by the second user. The owner or the system may charge the second user a fee to use the model. The fee may be shared with the owner of the model. The model may be, for example, a decision tree model. According to another aspect, a dataset or a model may be displayed or advertised in a public gallery. The display may contain a summary, thumbnail or metadata describing the dataset or the model, as the case may be. According to yet another aspect, a model may be published to a public gallery in a black-box form that enables use of the model to make predictions without disclosing its internal operation. In another aspect, a model may be published to a public gallery in a white-box form that enables use of the model to make predictions and also discloses a descriptive and actionable version of the model. The actionable version enables the user to understand operation and if desired modify the model. Different fees may be charged for black-box and white...",
  "ipcr_labels": [
    "G06N9900",
    "G06F2162",
    "G06F2160",
    "G06F1750",
    "G06Q2010"
  ],
  "inventor_list": [
    {
      "inventor_name_last": "MARTIN",
      "inventor_name_first": "Francisco J.",
      "inventor_city": "Corvallis",
      "inventor_state": "OR",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "ROVIRA",
      "inventor_name_first": "Oscar",
      "inventor_city": "Corvallis",
      "inventor_state": "OR",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "VERWOERD",
      "inventor_name_first": "Jos",
      "inventor_city": "Corvallis",
      "inventor_state": "OR",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "PETERSEN",
      "inventor_name_first": "Poul",
      "inventor_city": "Corvallis",
      "inventor_state": "OR",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "PARKER",
      "inventor_name_first": "Charles",
      "inventor_city": "Corvallis",
      "inventor_state": "OR",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "ORTEGA",
      "inventor_name_first": "Jose Antonio",
      "inventor_city": "Corvallis",
      "inventor_state": "OR",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "GARCIA",
      "inventor_name_first": "Beatriz",
      "inventor_city": "Corvallis",
      "inventor_state": "OR",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "DONALDSON",
      "inventor_name_first": "J. Justin",
      "inventor_city": "Corvallis",
      "inventor_state": "OR",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "BLASCO",
      "inventor_name_first": "Antonio",
      "inventor_city": "Corvallis",
      "inventor_state": "OR",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "ASHENFELTER",
      "inventor_name_first": "Adam",
      "inventor_city": "Corvallis",
      "inventor_state": "OR",
      "inventor_country": "US"
    }
  ],
  "title": "PREDICTIVE MODELING AND DATA ANALYSIS IN A SECURE SHARED SYSTEM",
  "decision": "PENDING",
  "_processing_info": {
    "original_size": 40792,
    "optimized_size": 4369,
    "reduction_percent": 89.29
  }
}