{
  "patent_number": "None",
  "application_number": "15417075",
  "date_published": "20170727",
  "date_produced": "20170713",
  "filing_date": "20170126",
  "main_ipcr_label": "G06N9900",
  "abstract": "An AI database hosted on cloud platform is configured to cooperate with a search engine and an AI engine. The AI database stores and indexes trained AI objects and its class of AI objects have searchable criteria. The AI database cooperates with the search engine to utilize search criteria supplied from a user, from either or both 1) via scripted software code and 2) via data put into defined fields of a user interface. The search engine utilizes the search criteria in order for the search engine to retrieve one or more AI data objects that have already been trained as query results. The AI database is coupled to an AI engine to allow any of reuse, reconfigure ability, and recomposition of the one or more trained AI data objects from the AI database into a new trained AI model.",
  "publication_number": "US20170213155A1-20170727",
  "summary": "<SOH> SUMMARY <EOH>Provided herein in some embodiments is an AI database hosted on cloud platform is configured to cooperate with a search engine and an AI engine. In an embodiment, the AI database stores and indexes trained AI objects and its class of AI objects have searchable criteria. The AI database cooperates with the search engine to utilize search criteria supplied from a user, from either or both 1) via scripted software code and 2) via data put into defined fields of a user interface. The search engine utilizes the search criteria in order for the search engine to retrieve one or more AI data objects that have already been trained as query results. The AI database is coupled to an AI engine to allow any of reuse, reconfigure ability, and recomposition of the one or more trained AI data objects from the AI database into a new trained AI model. These and other features of the design provided herein can be better understood with reference to the drawings, description, and claims, all of which form the disclosure of this patent application.",
  "ipcr_labels": [
    "G06N9900",
    "G06F1730"
  ],
  "inventor_list": [
    {
      "inventor_name_last": "Hammond",
      "inventor_name_first": "Mark Isaac",
      "inventor_city": "Berkeley",
      "inventor_state": "CA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Browne",
      "inventor_name_first": "Keen McEwan",
      "inventor_city": "Berkeley",
      "inventor_state": "CA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Campos",
      "inventor_name_first": "Marcos",
      "inventor_city": "Carlsbad",
      "inventor_state": "CA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Brown",
      "inventor_name_first": "Matthew James",
      "inventor_city": "San Francisco",
      "inventor_state": "CA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Kong",
      "inventor_name_first": "Ruofan",
      "inventor_city": "Berkeley",
      "inventor_state": "CA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Guss",
      "inventor_name_first": "William",
      "inventor_city": "Berkeley",
      "inventor_state": "CA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Story",
      "inventor_name_first": "Ross",
      "inventor_city": "Berkeley",
      "inventor_state": "CA",
      "inventor_country": "US"
    }
  ],
  "title": "SEARCHABLE DATABASE OF TRAINED ARTIFICIAL INTELLIGENCE OBJECTS THAT CAN BE REUSED, RECONFIGURED, AND RECOMPOSED, INTO ONE OR MORE SUBSEQUENT ARTIFICIAL INTELLIGENCE MODELS",
  "decision": "PENDING",
  "_processing_info": {
    "original_size": 114604,
    "optimized_size": 3411,
    "reduction_percent": 97.02
  }
}