{
  "patent_number": "None",
  "application_number": "15418927",
  "date_published": "20171221",
  "date_produced": "20171207",
  "filing_date": "20170130",
  "main_ipcr_label": "G06N700",
  "abstract": "System and method for analyzing driver behavior based on telematics data are disclosed. In an example, a probability of a user driving a vehicle is computed and a risk score is generated to develop at least one driver profile based on the probability. Further, routes taken by said user driving said vehicle are clustered to generate enhanced driver profile and using the clustered output to develop dynamic intelligent contexts for each said route and adding contextual intelligence messages to customize said risk score. Furthermore, the routes taken by the said user in real time are predicted. In addition, a missing route is identified through imputation of missed routes to compute annualized mileage, and a missing distance is imputed in an analysis of at least one trip of the driver in the vehicle. Also, independent trips are stitched based on at least one recommendation from an analytics engine.",
  "publication_number": "US20170364821A1-20171221",
  "summary": "<SOH> SUMMARY <EOH>Embodiments of the present disclosure present technological improvements as solutions to one or more of the above-mentioned technical problems recognized by the inventors in conventional systems. In view of the foregoing, embodiments herein provide a system and method for analyzing driver behavior by aggregating telematics data. In view of the foregoing, an embodiment herein provides method and system for analyzing driver behavior by aggregating telematics data. In one embodiment, a computer-implemented method for analyzing driver behavior by aggregating telematics data is provided. The method includes computing a probability of a user driving a vehicle and generating a risk score to develop at least one driver profile based on the computed probability. Further, the method includes clustering a plurality of routes taken by the user driving the vehicle to generate enhanced driver profile. The clustered output is used to develop a plurality of dynamic intelligent contexts for each the route and adding a plurality of contextual intelligence messages to customize the risk score wherein the driver profiling is enabled and associated with a plurality of trip level data for the driver. Furthermore, the method includes predicting the plurality of routes taken by the user in real time. Predicting includes a prediction of a type of trip based on at least one of a historical and a real time geo co-ordinate data. Moreover, the method includes identifying a missing route through imputation of a plurality of missed routes to compute annualized mileage, and imputing a missing distance in an analysis of at least one trip of the driver in the vehicle. Further, the method includes stitching of a plurality of independent trips based on at least one recommendation from an analytics engine. In another embodiment, a computer-implemented system for analyzing driver behavior by aggregating telematics data is provided. The at least one memory is coupled to the at least on...",
  "ipcr_labels": [
    "G06N700",
    "G06N9900"
  ],
  "inventor_list": [
    {
      "inventor_name_last": "MATHUR",
      "inventor_name_first": "Raghav",
      "inventor_city": "Bangalore",
      "inventor_state": "",
      "inventor_country": "IN"
    },
    {
      "inventor_name_last": "KAVADIKI",
      "inventor_name_first": "Rajesh",
      "inventor_city": "Bangalore",
      "inventor_state": "",
      "inventor_country": "IN"
    },
    {
      "inventor_name_last": "PANDA",
      "inventor_name_first": "Balaram",
      "inventor_city": "Bangalore",
      "inventor_state": "",
      "inventor_country": "IN"
    },
    {
      "inventor_name_last": "KUMAR",
      "inventor_name_first": "Sumit",
      "inventor_city": "Bangalore",
      "inventor_state": "",
      "inventor_country": "IN"
    }
  ],
  "title": "METHOD AND SYSTEM FOR ANALYZING DRIVER BEHAVIOUR BASED ON TELEMATICS DATA",
  "decision": "PENDING",
  "_processing_info": {
    "original_size": 70013,
    "optimized_size": 3914,
    "reduction_percent": 94.41
  }
}