{
  "patent_number": "None",
  "application_number": "15413479",
  "date_published": "20170727",
  "date_produced": "20170713",
  "filing_date": "20170124",
  "main_ipcr_label": "G06N304",
  "abstract": "Described invention and its embodiments, in part, facilitate discovery of ‘Most Recent Common Ancestors’ in the family trees between a massive plurality of individuals who have been predicted to be related according to amount of deoxyribonucleic acids (DNA) shared as determined from a plurality of 3rd party genome sequencing and matching systems. This facilitation is enabled through a holistic set of distributed software Agents running, in part, a plurality of cooperating Machine Learning systems, such as smart evolutionary algorithms, custom classification algorithms, cluster analysis and geo-temporal proximity analysis, which in part, enable and rely on a system of Knowledge Management applied to manually input and data-mined evidences and hierarchical clusters, quality metrics, fuzzy logic constraints and Bayesian network inspired inference sharing spanning across and between all data available on personal family trees or system created virtual trees, and employing all available dat...",
  "publication_number": "US20170213127A1-20170727",
  "summary": "<SOH> BRIEF SUMMARY OF THE INVENTION <EOH>It is determined from experimentation on real genealogic data and objective estimations, and the published reports of several genealogic vendors, that there are enough sufficiently deep (e.g. generations back), correct, or semi correct ancestral trees, which are referencing sufficient accumulated genealogic records across multiple online sites and resources, to facilitate identification of, and potentially hinted or automated correction of, many incorrect family trees, and also to further extend deep-history growth of many family trees through the use of hybrid machine-learning assisted logic and probabilistic means, with said information presented to the User in various formats including graphical user interfaces, and through automated tree generation. For example, this invention will help discover which sub-trees are most reliable, out of the billions available, through enhancement of confidences based in part on DNA triangulations, and in part on confidences of the evidences associated with the elements of sub-trees, and in part on application of fuzzy-logic evaluation of the likelihood of the data and relations in those sub-trees, and in part based on simultaneous processes of elimination of unlikely trees along with enhanced likelihoods based on reduced sets of possibilities for MRCA assignments based in part on DNA chromosome mapping, and intelligent methods of mapping patterns of relatedness (such as In-Common-With Matches and ‘Disembodied Cousin’ networks). This will become more apparent in the discussion of the Figures and in the following. In particular, the cleanup and deep-history growth of involved family trees will be greatly enhanced by the phenomenal reach of DNA sequenced genome correlations between members. For example, observations have indicated a surprisingly high number of DNA matches which triangulate to MRCA at the 10th great grandparent distance. This invention will, in many cases, be able to sort ou...",
  "ipcr_labels": [
    "G06N304",
    "G06N504",
    "G06N300",
    "G06N308"
  ],
  "inventor_list": [
    {
      "inventor_name_last": "Duncan",
      "inventor_name_first": "Matthew Charles",
      "inventor_city": "Plano",
      "inventor_state": "TX",
      "inventor_country": "US"
    }
  ],
  "title": "Method and System for Discovering Ancestors using Genomic and Genealogic Data",
  "decision": "PENDING",
  "_processing_info": {
    "original_size": 582628,
    "optimized_size": 3627,
    "reduction_percent": 99.38
  }
}