{
  "patent_number": "None",
  "application_number": "15412982",
  "date_published": "20180726",
  "date_produced": "20180711",
  "filing_date": "20170123",
  "main_ipcr_label": "G06N9900",
  "abstract": "Systems, methods and apparatus for automatic signal detection with temporal feature extraction in an RF environment are disclosed. An apparatus learns the RF environment in a predetermined period based on statistical learning techniques, thereby creating learning data. A knowledge map is formed based on the learning data. The apparatus automatically extracts temporal features of the RF environment from the knowledge map. A real-time spectral sweep is scrubbed against the knowledge map. The apparatus is operable to detect a signal in the RF environment, which has a low power level or is a narrowband signal buried in a wideband signal, and which cannot be identified otherwise.",
  "publication_number": "US20180211179A1-20180726",
  "summary": "<SOH> SUMMARY OF THE INVENTION <EOH>The present invention relates to systems, methods and apparatus for automatic signal detection with temporal feature extraction in an RF environment. An apparatus learns the RF environment in a predetermined period based on statistical learning techniques, thereby creating learning data. A knowledge map is formed based on the learning data. The apparatus automatically extracts temporal features of the RF environment from the knowledge map. A real-time spectral sweep is scrubbed against the knowledge map. The apparatus is operable to detect a signal in the RF environment, which has a low power level or is a narrowband signal buried in a wideband signal, and which cannot be identified otherwise. These and other aspects of the present invention will become apparent to those skilled in the art after a reading of the following description of the preferred embodiment when considered with the drawings, as they support the claimed invention.",
  "ipcr_labels": [
    "G06N9900",
    "G06N502"
  ],
  "inventor_list": [
    {
      "inventor_name_last": "Dzierwa",
      "inventor_name_first": "Ronald C.",
      "inventor_city": "Baltimore",
      "inventor_state": "",
      "inventor_country": "US"
    }
  ],
  "title": "SYSTEMS, METHODS, AND DEVICES FOR AUTOMATIC SIGNAL DETECTION WITH TEMPORAL FEATURE EXTRACTION WITHIN A SPECTRUM",
  "decision": "PENDING",
  "_processing_info": {
    "original_size": 214284,
    "optimized_size": 2278,
    "reduction_percent": 98.94
  }
}