{
  "patent_number": "None",
  "application_number": "15417056",
  "date_published": "20170727",
  "date_produced": "20170713",
  "filing_date": "20170126",
  "main_ipcr_label": "G06N304",
  "abstract": "Provided in some embodiments is an artificial intelligence (“AI”) engine configured to work with a pedagogical programming language configured to enable an author to 1) define a mental model to be learned by an AI model, the mental model including an input, one or more concept nodes, one or more stream nodes, and an output, as well as 2) define one or more curriculums for training the AI model respectively on the one or more concept nodes. A compiler can be configured to generate an assembly code from a source code authored in the pedagogical programming language. An architect module can be configured to propose a neural-network layout from the assembly code. A learner module can be configured to build the AI model the neural-network layout. An instructor module can be configured to train the AI model on the one or more concept nodes respectively with the one or more curriculums.",
  "publication_number": "US20170213126A1-20170727",
  "summary": "<SOH> SUMMARY <EOH>Provided herein in some embodiments is an AI engine configured to work with a pedagogical programming language including a compiler and one or more AI-engine modules including an architect module, an instructor module, and a learner module. The compiler can be configured to generate an assembly code from a source code written in the pedagogical programming language. The pedagogical programming language can be configured to enable an author to define a mental model to be learned by an AI model, the mental model including an input, one or more concept nodes, one or more stream nodes, and an output. The pedagogical programming language can also be configured to enable an author to define one or more curriculums for training the AI model respectively on the one or more concept nodes. The architect module can be configured to propose a neural-network layout with one or more neural-network layers from the assembly code. The learner module can be configured to build the AI model with the one or more neural-network layers from the neural-network layout proposed by the architect module. The instructor module can be configured to train the AI model built by the learner module on the one or more concept nodes respectively with the one or more curriculums. Also provided herein in some embodiments is an AI system including one or more remote servers and one or more local clients including. The one or more remote servers can include a compiler; one or more AI-engine modules including an architect module, an instructor module, and a learner module; one or more server-side client-server interfaces configured to enable client interactions with the AI engine. The compiler can be configured to generate an assembly code from a source code written in the pedagogical programming language. The pedagogical programming language can be configured to enable an author to define a mental model to be learned by an AI model, the mental model including an input, one or more conc...",
  "ipcr_labels": [
    "G06N304",
    "G06N308",
    "H04L2906"
  ],
  "inventor_list": [
    {
      "inventor_name_last": "Hammond",
      "inventor_name_first": "Mark Isaac",
      "inventor_city": "Berkeley",
      "inventor_state": "CA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Browne",
      "inventor_name_first": "Keen McEwan",
      "inventor_city": "Berkeley",
      "inventor_state": "CA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Adams",
      "inventor_name_first": "Megan",
      "inventor_city": "San Francisco",
      "inventor_state": "CA",
      "inventor_country": "US"
    }
  ],
  "title": "ARTIFICIAL INTELLIGENCE ENGINE CONFIGURED TO WORK WITH A PEDAGOGICAL PROGRAMMING LANGUAGE TO TRAIN ONE OR MORE TRAINED ARTIFICIAL INTELLIGENCE MODELS",
  "decision": "PENDING",
  "_processing_info": {
    "original_size": 143754,
    "optimized_size": 3867,
    "reduction_percent": 97.31
  }
}