{
  "patent_number": "None",
  "application_number": "15418969",
  "date_published": "20170810",
  "date_produced": "20170726",
  "filing_date": "20170130",
  "main_ipcr_label": "G06N304",
  "abstract": "The arithmetic processing circuit includes a first layer configured to dispose a learning neural network to compute a coefficient to be set in a recognition neural network, configured to recognize input data by using the coefficient computed on a basis of a recognition result of the recognition neural network with for the input data serving as a reference for computing the coefficient and a recognition result serving as a reference for the input data serving as the reference. The circuit further includes a second layer configured to dispose the recognition neural network to recognize the input data by the coefficient computed by the learning neural network. The circuit still further includes a third layer disposed between the first layer and the second layer, and configured to dispose a memory connected to both of the learning neural network and the recognition neural network.",
  "publication_number": "US20170228634A1-20170810",
  "summary": "<SOH> SUMMARY <EOH>One aspect of the technology of the disclosure is exemplified by an arithmetic processing circuit. The arithmetic processing circuit includes a first layer configured to dispose a learning neural network to compute a coefficient to be set in a recognition neural network, wherein the recognition neural network is configured to recognize input data by using the coefficient computed on a basis of a recognition result of the recognition neural network with respect to the input data serving as a reference for computing the coefficient and a recognition result serving as a reference with respect to the input data serving as the reference. The arithmetic processing circuit further includes a second layer configured to dispose the recognition neural network to recognize the input data by the coefficient computed by the learning neural network. The arithmetic processing circuit still further includes a third layer disposed between the first layer and the second layer, and configured to dispose a memory connected to both of the learning neural network and the recognition neural network. The object and advantage of the embodiment will be realized and attained by means of the elements and combinations particularly pointed out in the appended claims. It is to be understood that both the foregoing general description and the following detailed description are exemplary and explanatory only and are not restrictive of the invention, as claimed.",
  "ipcr_labels": [
    "G06N304",
    "G06N308"
  ],
  "inventor_list": [
    {
      "inventor_name_last": "TOMITA",
      "inventor_name_first": "Yasumoto",
      "inventor_city": "Kawasaki",
      "inventor_state": "",
      "inventor_country": "JP"
    }
  ],
  "title": "ARITHMETIC PROCESSING CIRCUIT AND INFORMATION PROCESSING APPARATUS",
  "decision": "PENDING",
  "_processing_info": {
    "original_size": 78235,
    "optimized_size": 2922,
    "reduction_percent": 96.27
  }
}