{
  "patent_number": "None",
  "application_number": "15416904",
  "date_published": "20170727",
  "date_produced": "20170713",
  "filing_date": "20170126",
  "main_ipcr_label": "G06N9900",
  "abstract": "Provided herein in some embodiments is an artificial intelligence (“AI”) engine hosted on one or more servers configured to cooperate with one or more databases including one or more AI-engine modules. The one or more AI-engine modules include an architect module configured to propose an AI model from an assembly code. The assembly code can be generated from a source code written in a pedagogical programming language describing a mental model of one or more concept modules to be learned by the AI model and curricula of one or more lessons for training the AI model on the one or more concept modules in one or more training cycles. The AI engine can be configured to instantiate a trained AI model based on the one or more concept modules learned by the AI model in the one or more training cycles.",
  "publication_number": "US20170213154A1-20170727",
  "summary": "<SOH> SUMMARY <EOH>Provided herein in some embodiments is an AI engine hosted on one or more servers configured to cooperate with one or more databases including one or more AI-engine modules. The one or more AI-engine modules can include an architect module configured to propose an AI model from an assembly code. The assembly code can be generated from a source code written in a pedagogical programming language describing a mental model of one or more concept modules to be learned by the AI model and curricula of one or more lessons for training the AI model on the one or more concept modules in one or more training cycles. Each of the one or more lessons can be configured to optionally use a different flow of the training data. The AI engine can be configured to instantiate a trained mental model based on the one or more concept modules learned by the AI model in the one or more training cycles. Also provided herein in some embodiments is an AI system including one or more servers, one or more databases, and one or more clients. The one or more servers can include an AI engine including one or more AI-engine modules and a compiler. The one or more AI-engine modules can include an architect module configured to propose an AI model from an assembly code. The compiler can be configured to generate the assembly code from a source code written in a pedagogical programming language describing a mental model of one or more concept modules to be learned by the AI model and curricula of one or more lessons for training the AI model on the one or more concept modules in one or more training cycles. Each of the one or more lessons can be configured to optionally use a different flow of the training data. The AI engine can be configured to instantiate a trained AI model based on the one or more concept modules learned by the AI model in the one or more training cycles. The one or more clients can include a coder for generating the source code written in the pedagogical progra...",
  "ipcr_labels": [
    "G06N9900",
    "G06N308",
    "G06F944"
  ],
  "inventor_list": [
    {
      "inventor_name_last": "Hammond",
      "inventor_name_first": "Mark Isaac",
      "inventor_city": "Berkeley",
      "inventor_state": "CA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Browne",
      "inventor_name_first": "Keen McEwan",
      "inventor_city": "Berkeley",
      "inventor_state": "CA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Campos",
      "inventor_name_first": "Marcos",
      "inventor_city": "Carlsbad",
      "inventor_state": "CA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Brown",
      "inventor_name_first": "Matthew James",
      "inventor_city": "San Francisco",
      "inventor_state": "CA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Kong",
      "inventor_name_first": "Ruofan",
      "inventor_city": "Berkeley",
      "inventor_state": "CA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Adams",
      "inventor_name_first": "Megan",
      "inventor_city": "San Francisco",
      "inventor_state": "CA",
      "inventor_country": "US"
    }
  ],
  "title": "ARTIFICIAL INTELLIGENCE ENGINE HAVING AN ARCHITECT MODULE",
  "decision": "PENDING",
  "_processing_info": {
    "original_size": 108857,
    "optimized_size": 4135,
    "reduction_percent": 96.2
  }
}