{
  "patent_number": "None",
  "application_number": "15411469",
  "date_published": "20170727",
  "date_produced": "20170713",
  "filing_date": "20170120",
  "main_ipcr_label": "G06N504",
  "abstract": "A device may receive issue resolution information, associated with a cognitive model, including an item of issue resolution information that describes an issue and a resolution to the issue. The device may assign the item of issue resolution information to a domain hierarchy, where the assigning is associated with a first user. The device may generate a question and an answer corresponding to the item of issue resolution information, where the generating of the question and the answer is associated with a second user. The device may approve the question and the answer, where the approving is associated with a third user. The device may generate a question/answer (QA) pair for the question and the answer. The device may create a data corpus including the QA pair, and provide the data corpus to cause the cognitive model to be trained based on the data corpus.",
  "publication_number": "US20170213139A1-20170727",
  "summary": "<SOH> SUMMARY <EOH>According to some possible implementations, a device may include one or more processors to: receive issue resolution information associated with a cognitive model, where the issue resolution information may include an item of issue resolution information that describes an issue and a resolution corresponding to the issue; assign the item of issue resolution information to a particular domain hierarchy, where the assigning of the item of issue resolution information to the particular domain hierarchy may be associated with a first user; generate a set of questions and an answer corresponding to the item of issue resolution information, where the generating of the set of questions and the answer may be associated with a second user that is different from the first user; approve the set of questions and the answer corresponding to the item of issue resolution information, where the approving of the set of questions and the answer may be associated with a third user that is different from the first user and the second user; generate, based on approving the set of questions and the answer, a set of question/answer (QA) pairs for the set of questions and the answer, where each QA pair, of the set of QA pairs, may be associated with a question, of the set of questions, and the answer; create a data corpus including the set of QA pairs; and provide the data corpus to cause the cognitive model to be trained based on a portion of the data corpus. According to some possible implementations, a method may include: receiving, by a device, issue resolution information associated with a cognitive model, where the issue resolution information may include an item of issue resolution information that describes an issue and a resolution to the issue; assigning, by the device, the item of issue resolution information to a domain hierarchy of a plurality of domain hierarchies, where the assigning of the item of issue resolution information to the domain hierarchy may b...",
  "ipcr_labels": [
    "G06N504",
    "G06N300",
    "G06N9900"
  ],
  "inventor_list": [
    {
      "inventor_name_last": "SAWANT",
      "inventor_name_first": "Nitin Madhukar",
      "inventor_city": "Mumbai",
      "inventor_state": "",
      "inventor_country": "IN"
    },
    {
      "inventor_name_last": "Prasad",
      "inventor_name_first": "Rajendra T.",
      "inventor_city": "Bangalore",
      "inventor_state": "",
      "inventor_country": "IN"
    },
    {
      "inventor_name_last": "Mehta",
      "inventor_name_first": "Bhavin",
      "inventor_city": "Mumbai",
      "inventor_state": "",
      "inventor_country": "IN"
    },
    {
      "inventor_name_last": "Swamy",
      "inventor_name_first": "Jayant",
      "inventor_city": "Bangalore",
      "inventor_state": "",
      "inventor_country": "IN"
    },
    {
      "inventor_name_last": "Contractor",
      "inventor_name_first": "Gopali Raval",
      "inventor_city": "Mumbai",
      "inventor_state": "",
      "inventor_country": "IN"
    },
    {
      "inventor_name_last": "Vijaywargiya",
      "inventor_name_first": "Manish",
      "inventor_city": "Hyderabad",
      "inventor_state": "",
      "inventor_country": "IN"
    }
  ],
  "title": "PROCESSING DATA FOR USE IN A COGNITIVE INSIGHTS PLATFORM",
  "decision": "PENDING",
  "_processing_info": {
    "original_size": 88282,
    "optimized_size": 4178,
    "reduction_percent": 95.27
  }
}