{
  "patent_number": "9947856",
  "application_number": "15414940",
  "date_published": "20170511",
  "date_produced": "20170427",
  "filing_date": "20170125",
  "main_ipcr_label": "G06N9900",
  "abstract": "A technique relates to a qubit readout system. A cavity-qubit system has a qubit and a readout resonator and outputs a readout signal. A lossless superconducting circulator is configured to receive the microwave readout signal from the cavity-qubit system and transmit the microwave readout signal according to a rotation. A quantum limited directional amplifier amplifies the readout signal. A directional coupler is connected to and biases the amplifier to set a working point. A microwave bandpass filter transmits in a microwave frequency band by passing the readout signal while blocking electromagnetic radiation outside of the microwave frequency band. A low-loss infrared filter has a distributed Bragg reflector integrated into a transmission line. The low-loss filter is configured to block infrared electromagnetic radiation while passing the microwave readout signal. The low-loss infrared filter is connected to the microwave bandpass filter to receive input of the microwave readout sig...",
  "publication_number": "US20170132524A1-20170511",
  "summary": "<SOH> SUMMARY <EOH>According to one embodiment, a qubit readout system is provided. A cavity-qubit system includes a qubit and a readout resonator, where the cavity-qubit system is configured to output a microwave readout signal. A lossless superconducting circulator is configured to receive the microwave readout signal from the cavity-qubit system and transmit the microwave readout signal according to a rotation. A quantum limited directional amplifier in which amplification takes place in one direction, and the quantum limited directional amplifier is configured to amplify the microwave readout signal. A directional coupler operatively connected to the quantum limited directional amplifier, and the directional coupler is configured to enable biasing of the quantum limited directional amplifier to set a working point. A microwave bandpass filter configured to transmit in a microwave frequency band, and the microwave bandpass filter is configured to pass the microwave readout signal while blocking electromagnetic radiation outside of the microwave frequency band. The microwave bandpass filter is operatively connected to the quantum limited directional amplifier to receive input of the microwave readout signal. A low-loss infrared filter has a distributed Bragg reflector integrated into a transmission line, and the low-loss filter is configured to block infrared electromagnetic radiation while passing the microwave readout signal. The low-loss infrared filter is operatively connected to the microwave bandpass filter to receive input of the microwave readout signal. According to one embodiment, a method of configuring a microwave apparatus is provided. The method includes providing a cavity-qubit system comprising a qubit and a readout resonator, where the cavity-qubit system is configured to output a microwave readout signal. The method includes configuring a lossless superconducting circulator to receive the microwave readout signal from the cavity-qubit system and ...",
  "ipcr_labels": [
    "G06N9900",
    "H01L3922",
    "H01L3902"
  ],
  "inventor_list": [
    {
      "inventor_name_last": "Abdo",
      "inventor_name_first": "Baleegh",
      "inventor_city": "Carmel",
      "inventor_state": "NY",
      "inventor_country": "US"
    }
  ],
  "title": "HIGH FIDELITY AND HIGH EFFICIENCY QUBIT READOUT SCHEME",
  "decision": "ACCEPTED",
  "_processing_info": {
    "original_size": 76492,
    "optimized_size": 3572,
    "reduction_percent": 95.33
  }
}