{
  "patent_number": "None",
  "application_number": "15417774",
  "date_published": "20180802",
  "date_produced": "20180718",
  "filing_date": "20170127",
  "main_ipcr_label": "G06N308",
  "abstract": "In an approach to managing images and captions, one or more computer processors receive one or more captured images of including one or more subjects. The one or more computer processors identify the one or more subjects from the first image. The one or more computer processors identify the context of the first image of the one or more captured images containing the one or more subjects. The one or more computer processors analyze one or more social networking histories and relationships associated with the one or more subjects using recognition techniques. The one or more computer processors create one or more captions associated with the first image of the one or more captured images based on the social networking histories and relationships of the one or more subjects and the identified context of the first image of the one or more captured images containing the one or more subjects.",
  "publication_number": "US20180218258A1-20180802",
  "summary": "<SOH> SUMMARY <EOH>Embodiments of the present invention disclose a method, a computer program product, and a system for managing captured images and captions using deep machine learning. The method includes one or more computer processors receiving one or more captured images of one or more subjects, wherein a first image of the one or more images includes one or more subjects. The one or more computer processors identify the one or more subjects from the first image. The one or more computer processors identify the context of the first image of the one or more captured images containing the one or more subjects. The one or more computer processors analyze one or more social networking histories and relationships associated with the one or more subjects using facial recognition techniques and object recognition techniques. The one or more computer processors create one or more captions associated with the first image of the one or more captured images based on the social networking histories and relationships of the one or more subjects and the identified context of the first image of the one or more captured images containing the one or more subjects.",
  "ipcr_labels": [
    "G06N308",
    "G06K900",
    "G06K962",
    "H04L2908",
    "G06Q5000",
    "H04L2906"
  ],
  "inventor_list": [
    {
      "inventor_name_last": "Dey",
      "inventor_name_first": "Kuntal",
      "inventor_city": "New Delhi",
      "inventor_state": "",
      "inventor_country": "IN"
    },
    {
      "inventor_name_last": "Nagar",
      "inventor_name_first": "Seema",
      "inventor_city": "Bangalore",
      "inventor_state": "",
      "inventor_country": "IN"
    },
    {
      "inventor_name_last": "Tamilselvam",
      "inventor_name_first": "Srikanth G.",
      "inventor_city": "Chennai",
      "inventor_state": "",
      "inventor_country": "IN"
    },
    {
      "inventor_name_last": "Vijil",
      "inventor_name_first": "Enara C.",
      "inventor_city": "Millwood",
      "inventor_state": "NY",
      "inventor_country": "US"
    }
  ],
  "title": "CONTEXT-BASED PHOTOGRAPHY AND CAPTIONS",
  "decision": "PENDING",
  "_processing_info": {
    "original_size": 62220,
    "optimized_size": 3089,
    "reduction_percent": 95.04
  }
}