{
  "patent_number": "None",
  "application_number": "15416970",
  "date_published": "20170727",
  "date_produced": "20170713",
  "filing_date": "20170126",
  "main_ipcr_label": "G06N304",
  "abstract": "Provided herein in some embodiments is an artificial intelligence (“AI”) engine hosted on one or more remote servers configured to cooperate with one or more databases including one or more AI-engine modules and one or more server-side client-server interfaces. The one or more AI-engine modules include an instructor module and a learner module configured to train an AI model. An assembly code can be generated from a source code written in a pedagogical programming language describing a mental model of one or more concept modules to be learned by the AI model and curricula of one or more lessons for training the AI model. The one or more server-side client-server interfaces can be configured to enable client interactions from a local client such as submitting the source code for training the AI model and using the trained AI model for one or more predictions.",
  "publication_number": "US20170213128A1-20170727",
  "summary": "<SOH> SUMMARY <EOH>Provided herein in some embodiments is an AI engine hosted on one or more remote servers configured to cooperate with one or more databases including one or more AI-engine modules and one or more server-side client-server interfaces. The one or more AI-engine modules can include an instructor module and a learner module configured to train an AI model in one or more training cycles. An assembly code can be generated from a source code written in a pedagogical programming language describing a mental model of one or more concept modules to be learned by the AI model and curricula of one or more lessons for training the AI model on the one or more concept modules. Each of the one or more lessons can be configured to optionally use a different flow of the training data. The one or more server-side client-server interfaces can be configured to enable client interactions with the AI engine in one or both client interactions selected from i) submitting the source code for training the AI model and ii) using the trained AI model for one or more predictions. The AI engine can be configured to instantiate the trained AI model based on the one or more concept modules learned by the AI model in the one or more training cycles. Also provided herein in some embodiments is an AI system including one or more remote servers, one or more databases, and one or more local clients. The one or more remote servers can include an AI engine including one or more AI-engine modules, a compiler, and one or more server-side client-server interfaces configured to enable client interactions with the AI engine. The one or more AI-engine modules can include an instructor module and a learner module configured to train an AI model in one or more training cycles. The compiler can be configured to generate an assembly code from a source code written in a pedagogical programming language describing a mental model of one or more concept modules to be learned by the AI model and curri...",
  "ipcr_labels": [
    "G06N304",
    "G06N308",
    "H04L2906"
  ],
  "inventor_list": [
    {
      "inventor_name_last": "Hammond",
      "inventor_name_first": "Mark Isaac",
      "inventor_city": "Berkeley",
      "inventor_state": "CA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Browne",
      "inventor_name_first": "Keen McEwan",
      "inventor_city": "Berkeley",
      "inventor_state": "CA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Campos",
      "inventor_name_first": "Marcos",
      "inventor_city": "Carlsbad",
      "inventor_state": "CA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Brown",
      "inventor_name_first": "Matthew James",
      "inventor_city": "San Francisco",
      "inventor_state": "CA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Kong",
      "inventor_name_first": "Ruofan",
      "inventor_city": "Berkeley",
      "inventor_state": "CA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Adams",
      "inventor_name_first": "Megan",
      "inventor_city": "San Francisco",
      "inventor_state": "CA",
      "inventor_country": "US"
    }
  ],
  "title": "ARTIFICIAL INTELLIGENCE ENGINE HOSTED ON AN ONLINE PLATFORM",
  "decision": "PENDING",
  "_processing_info": {
    "original_size": 116332,
    "optimized_size": 4202,
    "reduction_percent": 96.39
  }
}