{
  "patent_number": "None",
  "application_number": "15429470",
  "date_published": "20180118",
  "date_produced": "20180103",
  "filing_date": "20170210",
  "main_ipcr_label": "G06N304",
  "abstract": "There is disclosed a novel system and method for building artificial neural networks for a given task. In an embodiment, the method utilizes one or more network models that define the probabilities of nodes and/or interconnects, and/or the probabilities of groups of nodes and/or interconnects, from sets of possible nodes and interconnects existing in a given artificial neural network. These network models can be constructed based on the properties of one or more artificial neural networks, or constructed based on desired architecture properties. These network models are then used to build combined network models using a model combiner module. The combined network models and random numbers generated by a random number generator module are then used to build one or more new artificial neural network architectures. New artificial neural networks are then built based on the newly built artificial neural network architectures and are trained for a given task. These trained artificial neural...",
  "publication_number": "US20180018555A1-20180118",
  "summary": "<SOH> SUMMARY <EOH>The present disclosure relates generally to the field of artificial neural networks, and more specifically to systems and methods for building artificial neural networks. In one aspect, the present method consists of one or more network models that define the probabilities of nodes and/or interconnects, and/or the probabilities of groups of nodes and/or interconnects, from sets of possible nodes and interconnects existing in an artificial neural network. These network models may be constructed based on the network architectures of one or more artificial neural networks, or alternatively constructed based on desired network architecture properties (e.g., the desired network architectural properties may be: a larger number of nodes and/or interconnects; a smaller number of nodes and/or interconnects; a larger number of nodes but smaller number of interconnects; a larger number of interconnects but smaller number of nodes; a larger number of nodes at certain layers, a larger number of interconnects at certain layers, increase or decrease in the number of layers, adapting to a different task or to different tasks, etc.). In an embodiment, the network models are combined using a model combiner module to build combined network models. Using a random number generator and the combined network models, new artificial neural network architectures are then automatically built using a network architecture builder. New artificial neural networks are then built such that their artificial neural network architectures are the same as the automatically built neural network architectures, and are then trained. In an iterative process, the artificial neural networks can then be used to generate network models for automatically building subsequent artificial neural network architectures. This iterative building process can be repeated in order to learn how to build new artificial neural network architectures, and this learning may be stored to build future artificial ...",
  "ipcr_labels": [
    "G06N304",
    "G06N308",
    "G06F758"
  ],
  "inventor_list": [
    {
      "inventor_name_last": "WONG",
      "inventor_name_first": "Alexander Sheung Lai",
      "inventor_city": "Waterloo",
      "inventor_state": "",
      "inventor_country": "CA"
    },
    {
      "inventor_name_last": "SHAFIEE",
      "inventor_name_first": "Mohammad Javad",
      "inventor_city": "Waterloo",
      "inventor_state": "",
      "inventor_country": "CA"
    }
  ],
  "title": "SYSTEM AND METHOD FOR BUILDING ARTIFICIAL NEURAL NETWORK ARCHITECTURES",
  "decision": "PENDING",
  "_processing_info": {
    "original_size": 63253,
    "optimized_size": 3746,
    "reduction_percent": 94.08
  }
}