{
  "patent_number": "None",
  "application_number": "15428782",
  "date_published": "20180621",
  "date_produced": "20180608",
  "filing_date": "20170209",
  "main_ipcr_label": "G06N700",
  "abstract": "Embodiment of the present disclosure discloses method and system for predicting a success rate of a project. The method comprises initiating a natural language conversation with stakeholder associated with project to determine one or more features relevant for the stakeholder. The one or more features are determined by performing Bayesian network analysis for one or more properties associated with project. The method comprises creating relationship structure, comprising one or more features, based on natural language processing of natural language conversation, wherein each of one or more features are assigned a score. The method comprises creating a prediction model with relative weightage values to each of one or more relevant features based on assigned score, wherein the prediction model is trained based on historic data associated with project and predicting success rate of project based on trained prediction model and current state of the project.",
  "publication_number": "US20180174066A1-20180621",
  "summary": "<SOH> SUMMARY <EOH>In an embodiment, the present disclosure relates to a method for predicting a success rate of a project in real-time. The method may comprise initiating a natural language conversation with a stakeholder associated with a project to determine one or more features relevant for the stakeholder. The one or more features may be determined by performing a Bayesian network analysis for one or more properties associated with the project. The method may comprise creating a relationship structure, comprising the one or more features, based on natural language processing of the natural language conversation. In an embodiment, each of the one or more features may be assigned a score. The method may further comprises creating a prediction model with relative weightage values to each of the one or more relevant features based on the assigned score. In an embodiment, the prediction model is trained based on the historic data associated with the project. The method further comprises predicting a success rate of the project based on the trained prediction model and a current state of the project. In an embodiment, the present disclosure relates to a prediction system for predicting a success rate of a project in real-time. The predicting system may comprise a processor and a memory communicatively coupled to the processor. The memory stores processor executable instructions, which, on execution, may cause the predicting system to initiate a natural language conversation with a stakeholder associated with a project to determine one or more features relevant for the stakeholder. In an embodiment, the one or more features may be determined by performing a Bayesian network analysis for one or more properties associated with the project, create a relationship structure, comprising the one or more features, based on natural language processing of the natural language conversation. Each of the one or more features may be assigned a score. Further, a prediction model is ...",
  "ipcr_labels": [
    "G06N700",
    "G06N9900"
  ],
  "inventor_list": [
    {
      "inventor_name_last": "Venkataraman",
      "inventor_name_first": "Arthi",
      "inventor_city": "Bangalore",
      "inventor_state": "",
      "inventor_country": "IN"
    },
    {
      "inventor_name_last": "Jariwala",
      "inventor_name_first": "Swapnil",
      "inventor_city": "Bangalore",
      "inventor_state": "",
      "inventor_country": "IN"
    }
  ],
  "title": "SYSTEM AND METHOD FOR PREDICTING STATE OF A PROJECT FOR A STAKEHOLDER",
  "decision": "PENDING",
  "_processing_info": {
    "original_size": 55250,
    "optimized_size": 3687,
    "reduction_percent": 93.33
  }
}