{
  "patent_number": "None",
  "application_number": "15425763",
  "date_published": "20170622",
  "date_produced": "20170607",
  "filing_date": "20170206",
  "main_ipcr_label": "G06N9900",
  "abstract": "Systems and methods may provide for using one or more generic classifiers to generate self-training data based on a first plurality of events associated with a device, and training a personal classifier based on the self-training data. Additionally, the one or more generic classifiers and the personal classifier to may be used to generate validation data based on a second plurality of events associated with the device. In one example, the personal classifier is substituted for the one or more generic classifiers if the validation data indicates that the personal classifier satisfies a confidence condition relative to the one or more generic classifiers.",
  "publication_number": "US20170178032A1-20170622",
  "summary": "<SOH> BRIEF DESCRIPTION OF THE DRAWINGS <EOH>The various advantages of the embodiments will become apparent to one skilled in the art by reading the following specification and appended claims, and by referencing the following drawings, in which: FIG. 1 is a block diagram of an example of a classification approach according to an embodiment; FIG. 2 is a flowchart of an example of a method of operating a device according to an embodiment; FIG. 3 is a flowchart of a more detailed example of a method of operating a device according to an embodiment; FIG. 4 is a block diagram of an example of a logic architecture according to an embodiment; and FIG. 5 is a block diagram of an example of a device according to an embodiment. detailed-description description=\"Detailed Description\" end=\"lead\"?",
  "ipcr_labels": [
    "G06N9900",
    "G06F116"
  ],
  "inventor_list": [
    {
      "inventor_name_last": "Yang",
      "inventor_name_first": "Xue",
      "inventor_city": "Arcadia",
      "inventor_state": "CA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Krishnamurthy",
      "inventor_name_first": "Lakshman",
      "inventor_city": "Portland",
      "inventor_state": "OR",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Nachman",
      "inventor_name_first": "Lama",
      "inventor_city": "Santa Clara",
      "inventor_state": "CA",
      "inventor_country": "US"
    }
  ],
  "title": "USING A GENERIC CLASSIFIER TO TRAIN A PERSONALIZED CLASSIFIER FOR WEARABLE DEVICES",
  "decision": "PENDING",
  "_processing_info": {
    "original_size": 35135,
    "optimized_size": 2338,
    "reduction_percent": 93.35
  }
}