{
  "patent_number": "None",
  "application_number": "15428532",
  "date_published": "20170810",
  "date_produced": "20170726",
  "filing_date": "20170209",
  "main_ipcr_label": "G06N504",
  "abstract": "Provided herein are methods and systems for defining an outcome of interest and receiving a plurality of input that may be analyzed to determine a set of fact patterns that are present within or implied by the input. The Decision Making Platform described herein may be used to calculate a degree of association between each of a plurality of fact patterns and a specified outcome of interest. A user of the Decision Making Platform may input data, such as that pertaining to the user's circumstances or facts relating to the user, for analysis. The user input may be analyzed to determine the association of the user's data with the specified outcome of interest based at least in part on the plurality of input and associated fact patterns, and associations with the outcome of interest, within a corpus of data that is stored by the Decision Making Platform.",
  "publication_number": "US20170228655A1-20170810",
  "summary": "<SOH> SUMMARY <EOH>Provided herein are methods and systems for defining an outcome of interest and receiving a plurality of inputs, including but not limited to text, audio or multimedia, that may be analyzed to determine a set of fact patterns that are present within or implied by the inputs. The Decision Making Platform described herein may be used to calculate a degree of association between each of a plurality of fact patterns and a specified outcome of interest. A user of the Decision Making Platform may input data, such as that pertaining to the user's circumstances or facts relating to the user, for analysis. The user input may be analyzed to determine the association of the user's data with the specified outcome of interest based at least in part on the plurality of inputs and associated fact patterns, and associations with the outcome of interest, within a corpus of data that is stored by the Decision Making Platform. A report may then be generated to the user, such as on a remote client device, wherein the report includes at least in part a summary of the degree of association of the user fact patterns with the outcome of interest based on the comparison of the user fact patterns with the plurality of fact patterns. In embodiments the summary within the report may be ranked based at least in part on the strength of the degree of association. A “user” may comprise a plurality of users, and the plurality of users' inputs may be analyzed in the aggregate. In embodiments, an outcome of interest and receiving a plurality of inputs, including but not limited to text, audio or multimedia, that may be analyzed to determine a set of fact patterns that are present within or implied by the inputs. The Decision Making Platform described herein may be used to calculate a degree of association between each of a plurality of fact patterns and a specified outcome of interest. A user of the Decision Making Platform may input data, such as that pertaining to the user's circ...",
  "ipcr_labels": [
    "G06N504"
  ],
  "inventor_list": [
    {
      "inventor_name_last": "Alarie",
      "inventor_name_first": "Benjamin",
      "inventor_city": "Toronto",
      "inventor_state": "",
      "inventor_country": "CA"
    },
    {
      "inventor_name_last": "Janssen",
      "inventor_name_first": "Brett",
      "inventor_city": "Toronto",
      "inventor_state": "",
      "inventor_country": "CA"
    },
    {
      "inventor_name_last": "Niblett",
      "inventor_name_first": "Anthony",
      "inventor_city": "Toronto",
      "inventor_state": "",
      "inventor_country": "CA"
    },
    {
      "inventor_name_last": "Yoon",
      "inventor_name_first": "Albert",
      "inventor_city": "Toronto",
      "inventor_state": "",
      "inventor_country": "CA"
    }
  ],
  "title": "DECISION MAKING PLATFORM",
  "decision": "PENDING",
  "_processing_info": {
    "original_size": 111440,
    "optimized_size": 3811,
    "reduction_percent": 96.58
  }
}