{
  "patent_number": "None",
  "application_number": "15422349",
  "date_published": "20170518",
  "date_produced": "20170503",
  "filing_date": "20170201",
  "main_ipcr_label": "G06N504",
  "abstract": "A mechanism for facilitating customer interactions within a customer service environment provides prompt and accurate answers to customer questions. A smart chat facility for use in a customer service environment to predict a customer problem examines a customer chat transcript to identify customer statements that set forth a customer issue and, responsive to this, can route the customer to an agent, an appropriate FAQ, or can implement a problem specific widget in the customer UI. Customer queries are matched with most correct responses and accumulated knowledge is used to predict a best response to future customer queries. The iterative system thus learns from each customer interaction and can adapt to customer responses over time to improve the accuracy of problem prediction.",
  "publication_number": "US20170140280A1-20170518",
  "summary": "<SOH> SUMMARY OF THE INVENTION <EOH>An embodiment of the invention provides predictive experience solutions for online customer experiences. Unlike proactive chat and reactive web-self-service, an embodiment of the invention predicts not only who needs assistance, but when, where, why, and how. The invention also integrates self-service and chat in a compelling interface that guides customer journeys across multiple pages and queues, if necessary. One embodiment of the invention provides a mechanism for facilitating customer interactions within a customer service environment to provide prompt and accurate answers to customer questions. In particular, this embodiment of the invention provides a smart chat facility for use in a customer service environment to predict a customer problem. For example, the invention examines a customer chat transcript to identify customer statements that set forth a customer issue and, responsive to this, can route the customer to an agent, an appropriate FAQ, or can implement a problem specific widget in the customer UI. The invention provides a facility that learns to match customer queries with most correct responses and then uses this accumulated knowledge to predict a best response to future customer queries. Because the invention provides an iterative system that learns from each customer interaction, the system can adapt to customer responses over time and improve the accuracy of problem prediction.",
  "ipcr_labels": [
    "G06N504",
    "H04L1258",
    "G06N9900",
    "H04M351",
    "G06Q3000",
    "G06N300"
  ],
  "inventor_list": [
    {
      "inventor_name_last": "AJMERA",
      "inventor_name_first": "Dinesh",
      "inventor_city": "Bangalore",
      "inventor_state": "",
      "inventor_country": "IN"
    },
    {
      "inventor_name_last": "PANDA",
      "inventor_name_first": "Debashish",
      "inventor_city": "Bangalore",
      "inventor_state": "",
      "inventor_country": "IN"
    },
    {
      "inventor_name_last": "GHANSHANI",
      "inventor_name_first": "Pankaj",
      "inventor_city": "Delhi",
      "inventor_state": "",
      "inventor_country": "IN"
    },
    {
      "inventor_name_last": "KUMAR",
      "inventor_name_first": "Sumit",
      "inventor_city": "Bangalore",
      "inventor_state": "",
      "inventor_country": "IN"
    },
    {
      "inventor_name_last": "VIJAYARAGHAVAN",
      "inventor_name_first": "Ravi",
      "inventor_city": "Bangalore",
      "inventor_state": "",
      "inventor_country": "IN"
    },
    {
      "inventor_name_last": "RAMACHANDRAN",
      "inventor_name_first": "Mathangi Sri",
      "inventor_city": "Bangalore",
      "inventor_state": "",
      "inventor_country": "IN"
    }
  ],
  "title": "PREDICTIVE CUSTOMER SERVICE ENVIRONMENT",
  "decision": "PENDING",
  "_processing_info": {
    "original_size": 60716,
    "optimized_size": 3570,
    "reduction_percent": 94.12
  }
}