{
  "patent_number": "None",
  "application_number": "15420754",
  "date_published": "20180329",
  "date_produced": "20180315",
  "filing_date": "20170131",
  "main_ipcr_label": "G06N308",
  "abstract": "Systems and methods include obtaining a set of events, each event in the set of events comprising a time-stamped portion of raw machine data, the raw machine data produced by one or more components within an information technology or security environment and reflects activity within the information technology or security environment. Thereafter, a first neural network is used to automatically identify variable text to extract as a field from the set of events. An indication of the variable text is provided as a field extraction recommendation, for example, to a user device for presentation to a user.",
  "publication_number": "US20180089561A1-20180329",
  "summary": "<SOH> SUMMARY <EOH>Embodiments of the present invention are directed to facilitating field extraction recommendations. In various implementations, a set of events are obtained. Each event in the set of events can be a time-stamped portion of raw machine data, the raw machine data produced by one or more components within an information technology or security environment and reflects activity within the information technology or security environment. Thereafter, a first neural network is used to automatically identify variable text to extract as a field from the set of events. An indication of the variable text is provided as a field extraction recommendation, for example, to a user device for presentation to a user. This summary is provided to introduce a selection of concepts in a simplified form that are further described below in the detailed description. This summary is not intended to identify key features or essential features of the claimed subject matter, nor is it intended to be used in isolation as an aid in determining the scope of the claimed subject matter.",
  "ipcr_labels": [
    "G06N308",
    "G06F1730"
  ],
  "inventor_list": [
    {
      "inventor_name_last": "Oliner",
      "inventor_name_first": "Adam Jamison",
      "inventor_city": "San Francisco",
      "inventor_state": "CA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Nguyen",
      "inventor_name_first": "Nghi Huu",
      "inventor_city": "Union City",
      "inventor_state": "CA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Leverich",
      "inventor_name_first": "Jacob",
      "inventor_city": "San Francisco",
      "inventor_state": "CA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Yang",
      "inventor_name_first": "Zidong",
      "inventor_city": "Millbrae",
      "inventor_state": "CA",
      "inventor_country": "US"
    }
  ],
  "title": "AUTOMATICALLY GENERATING FIELD EXTRACTION RECOMMENDATIONS",
  "decision": "PENDING",
  "_processing_info": {
    "original_size": 248096,
    "optimized_size": 2704,
    "reduction_percent": 98.91
  }
}