{
  "patent_number": "None",
  "application_number": "15424469",
  "date_published": "20170615",
  "date_produced": "20170603",
  "filing_date": "20170203",
  "main_ipcr_label": "G06N504",
  "abstract": "Methods and systems for analysis and/or classification of electronic message information so as to capture and identify salient objects exchanged during electronic message passing in order to impute certain information about the object, groups of objects, the message, groups of messages, the parties, communities involved in the message exchange or combinations, thereof.",
  "publication_number": "US20170169347A1-20170615",
  "summary": "<SOH> SUMMARY <EOH>Embodiments disclosed herein solve these problems and other problems and provide certain advantages as described herein. The present inventions will now be described in detail with reference to one or more embodiments of the inventions, examples of which are illustrated in the accompanying drawings. The examples and embodiments are provided by way of explanation only and are not to be taken as limiting to the scope of the inventions. Furthermore, features illustrated or described as part of one embodiment may be used with one or more other embodiments to provide a further new combination. It will be understood that the present inventions will cover these variations and embodiments as well as variations and modifications that would be understood by the person skilled in the art. There are a number of types of directed message streams in common use, such as: Emails, Short Message Service (SMS), Instant messaging (IM), Social Media, Blogs, Faxes, Really simple syndications (RSS) etc. Certain methods and systems disclosure herein may be used with these messaging forms and combinations thereof. In addition, it is contemplated that the present disclosure will be applicable to other directed electronic message streams that may be deployed in the future. For purposes of illustrating the embodiments, the disclosure focuses on email systems as the source of the directed message stream. However, for the sake of clarity, email is understood to include other messaging forms and the methods and systems enunciated for email may also apply across other messaging forms. Other aspects, features, and advantages will become apparent from the following detailed description when taken in conjunction with the accompanying drawings, which are a part of this disclosure and which illustrate, by way of example, principles of the inventions disclosed. Certain embodiments disclose an algorithmic method by which a large quantity of messages is analyzed in such a way as to capt...",
  "ipcr_labels": [
    "G06N504",
    "H04L1258"
  ],
  "inventor_list": [
    {
      "inventor_name_last": "Ryan",
      "inventor_name_first": "Simon David",
      "inventor_city": "Glen Waverly",
      "inventor_state": "",
      "inventor_country": "AU"
    }
  ],
  "title": "Methods and Systems for Analysis and/or Classification of Information",
  "decision": "PENDING",
  "_processing_info": {
    "original_size": 107620,
    "optimized_size": 2945,
    "reduction_percent": 97.26
  }
}