{
  "patent_number": "None",
  "application_number": "15427506",
  "date_published": "20180426",
  "date_produced": "20180411",
  "filing_date": "20170208",
  "main_ipcr_label": "G06N504",
  "abstract": "Embodiments of the invention are directed to systems, methods, and computer program products for providing a multi-channel cognitive resource platform configured for intelligent, proactive and responsive communication with a user, via a user device. The system is further configured to perform one or more user activities, in an integrated manner, within a single interface of the user device, without requiring the user to operate disparate applications. Furthermore, the system is configured to receive user input through multiple communication channels such as a textual communication channel and an audio communication channel. The system is further configured to switch between the various communication channels seamlessly, and in real-time.",
  "publication_number": "US20180114127A1-20180426",
  "summary": "<SOH> BRIEF SUMMARY <EOH>The following presents a simplified summary of one or more embodiments of the invention in order to provide a basic understanding of such embodiments. This summary is not an extensive overview of all contemplated embodiments, and is intended to neither identify key or critical elements of all embodiments, nor delineate the scope of any or all embodiments. Its sole purpose is to present some concepts of one or more embodiments in a simplified form as a prelude to the more detailed description that is presented later. Embodiments of the present invention address these and/or other needs by providing a multi-channel cognitive resource platform configured for intelligent, proactive and responsive communication with a user, via a user device. The system is further configured to perform one or more user activities, in an integrated manner, within a single interface of the user device, without requiring the user to operate disparate applications. Furthermore, the system is configured to receive user input through multiple communication channels such as a textual communication channel and an audio communication channel. The system is further configured to switch between the various communication channels seamlessly, and in real-time. Embodiments of the invention relate to systems, methods, and computer program products for establishing intelligent, proactive and responsive communication with a user, comprising a multi-channel cognitive resource platform for performing electronic activities in an integrated manner from a single interface, the invention comprising: providing a multi-channel cognitive resource application on a user device associated with the user, wherein the multi-channel cognitive resource application is configured to present a central user interface on a display device of the user device; conducting, via the central user interface, a first conversation with the user, wherein conducting the first conversation comprises: receiving, vi...",
  "ipcr_labels": [
    "G06N504",
    "H04L2908",
    "G06N9900",
    "G06F1727",
    "G10L1526"
  ],
  "inventor_list": [
    {
      "inventor_name_last": "Cole",
      "inventor_name_first": "Kevin T.",
      "inventor_city": "Charlotte",
      "inventor_state": "NC",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Jones-McFadden",
      "inventor_name_first": "Alicia C.",
      "inventor_city": "Fort Mill",
      "inventor_state": "SC",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Golani",
      "inventor_name_first": "Sushil",
      "inventor_city": "Charlotte",
      "inventor_state": "NC",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Bullock",
      "inventor_name_first": "Caitlin Chrisman",
      "inventor_city": "Mountain View",
      "inventor_state": "CA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Hunt",
      "inventor_name_first": "Dariane K.",
      "inventor_city": "Concord",
      "inventor_state": "MA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Yannam",
      "inventor_name_first": "Ramakrishna R.",
      "inventor_city": "Plano",
      "inventor_state": "TX",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Kitchell",
      "inventor_name_first": "Christian S.",
      "inventor_city": "New York",
      "inventor_state": "NY",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Hsieh",
      "inventor_name_first": "Matthew",
      "inventor_city": "Charlotte",
      "inventor_state": "NC",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Khosraviani",
      "inventor_name_first": "Shahram",
      "inventor_city": "Dallas",
      "inventor_state": "TX",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Shah",
      "inventor_name_first": "Priyank R.",
      "inventor_city": "Seattle",
      "inventor_state": "WA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Shanmugam",
      "inventor_name_first": "Maruthi",
      "inventor_city": "Plano",
      "inventor_state": "TX",
      "inventor_country": "US"
    }
  ],
  "title": "MULTI-CHANNEL COGNITIVE RESOURCE PLATFORM",
  "decision": "PENDING",
  "_processing_info": {
    "original_size": 131869,
    "optimized_size": 4835,
    "reduction_percent": 96.33
  }
}