{
  "patent_number": "None",
  "application_number": "15428002",
  "date_published": "20170824",
  "date_produced": "20170809",
  "filing_date": "20170208",
  "main_ipcr_label": "G06N9900",
  "abstract": "A method for optimizing chat-based conversations using machine learning is disclosed, comprising the use of machine learning to improve the likelihood of the chat-based conversation attaining a long-term goal or maintaining the engagement/interest level of an entity engaged in the conversation.",
  "publication_number": "US20170243134A1-20170824",
  "summary": "<SOH> SUMMARY OF THE INVENTION <EOH>An object of the present invention is to provide a system and method for monitoring and improving a long-term outcome of a chat-based conversation. Another object of the present invention is to provide a system and method for monitoring and improving a short-term outcome of a chat-based conversation. Another object of the present invention is to provide a system and method for predicting an outcome of a chat-based conversation. Another object of the present invention is to provide a system and method for improving the performance of an entity participating in a chat-based conversation in order to improve the long-term or short-term outcome of the chat-based conversation. The method of the present invention is implemented on a computing device such as a computer, tablet, smartphone, or any other similar device capable of running chat software and connecting to another device that is also running chat software. In the preferred embodiment, the computing device connects to a cloud machine which comprises a machine learning module and which connects to a data warehouse. The data warehouse stores data that the machine learning module requires for its operation, such as past conversations, suggestions for improvement, suggested remarks, and so on. It will be understood, however, that the machine learning module and the data warehouse may reside on the same computer as the chat software, or may reside on multiple computing devices. The method of the present invention comprises the following steps for optimizing a chat-based communication between a first entity and a second entity, wherein the first entity has a long-term goal for the communication. After a first entity sends a message to the second entity and the second entity replies, the second message is analyzed for each of a plurality of textual and other predictors and a cluster analysis is performed to determine its subject matter. The second message is also analyzed using a machi...",
  "ipcr_labels": [
    "G06N9900",
    "G06F1730",
    "G06F1727",
    "G06N504"
  ],
  "inventor_list": [
    {
      "inventor_name_last": "Housman",
      "inventor_name_first": "Michael",
      "inventor_city": "San Francisco",
      "inventor_state": "CA",
      "inventor_country": "US"
    }
  ],
  "title": "Optimization System and Method for Chat-Based Conversations",
  "decision": "PENDING",
  "_processing_info": {
    "original_size": 54711,
    "optimized_size": 2886,
    "reduction_percent": 94.73
  }
}