{
  "patent_number": "None",
  "application_number": "15426795",
  "date_published": "20170817",
  "date_produced": "20170802",
  "filing_date": "20170207",
  "main_ipcr_label": "G06N9900",
  "abstract": "A method of classifying machine alarms produced by a machine monitoring system may include: Collecting a plurality of machine alarms from the machine monitoring system, the machine alarms being indicative of out-of-range machine system parameters; collecting a plurality of alarm annotations associated with at least some of the machine alarms; grouping the plurality of machine alarms by criticality; determining a strength of alarm annotations; and developing an alarm classification policy for machine alarms based at least on the criticality of the alarms and the strength of the alarm annotations.",
  "publication_number": "US20170236071A1-20170817",
  "summary": "<SOH> SUMMARY OF THE INVENTION <EOH>One embodiment of a method of classifying machine alarms produced by a machine monitoring system may include the steps of: Collecting a plurality of machine alarms from the machine monitoring system, the machine alarms being indicative of out-of-range machine system parameters; collecting a plurality of alarm annotations associated with at least some of the machine alarms; grouping the plurality of machine alarms by criticality; determining a strength of alarm annotations; and developing an alarm classification policy for machine alarms based at least on the criticality of the alarms and the strength of the alarm annotations. Also disclosed is a non-transitory computer-readable storage medium having computer-executable instructions embodied thereon that, when executed by at least one computer processor cause the processor to: Collect a plurality of machine alarms from the machine monitoring system, the machine alarms being indicative of out-of-range machine system parameters of the machine; collect a plurality of alarm annotations associated with at least some of the machine alarms; group the plurality of machine alarms by criticality; determine a strength of alarm annotations; and develop an alarm classification policy for machine alarms based at least on the criticality of the alarms and the strength of the alarm annotations. A method of operating a machine having a machine monitoring system that produces machine alarms indicative of out-of-range machine system parameters may include: Receiving machine alarms from the machine monitoring system; classifying the machine alarms based on a predetermined alarm classification system for the machine, the predetermined alarm classification system being based on criticality of representative samples of machine alarms and strength of representative samples of alarm annotations; and managing the subsequent operation of the machine based on the alarm condition category. Also disclosed is a ...",
  "ipcr_labels": [
    "G06N9900",
    "G08B2918"
  ],
  "inventor_list": [
    {
      "inventor_name_last": "Walker",
      "inventor_name_first": "Mary Amelia",
      "inventor_city": "Phoenix",
      "inventor_state": "AZ",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Brown",
      "inventor_name_first": "D. Bradley",
      "inventor_city": "Phoenix",
      "inventor_state": "AZ",
      "inventor_country": "US"
    }
  ],
  "title": "ALARM MANAGEMENT SYSTEM",
  "decision": "PENDING",
  "_processing_info": {
    "original_size": 34809,
    "optimized_size": 3279,
    "reduction_percent": 90.58
  }
}