{
  "patent_number": "9990586",
  "application_number": "15431405",
  "date_published": "20170601",
  "date_produced": "20170517",
  "filing_date": "20170213",
  "main_ipcr_label": "G06N700",
  "abstract": "A system and method for analyzing and validating oil and gas well production data is disclosed. The system includes a network, a server connected to the network, and a set of wells connected to the network. In a preferred embodiment, the server is programmed to store and execute the method. The method includes the steps of collecting a set of data from the set of wells, performing an first RPI® evaluation on the set of data, creating a matched data set from the set of data, segregating the matched data set into a set of comparison groups, normalizing each comparison group of the set of comparison groups, calculating a set of performance metrics between a subset of the set of comparison groups, and calculating a probability for each performance metric of the set of performance metrics.",
  "publication_number": "US20170154278A1-20170601",
  "summary": "<SOH> SUMMARY <EOH>A system and method for analyzing and validating oil and gas well production data is disclosed. The system includes a network, a server connected to the network, and a set of wells connected to the network. In a preferred embodiment, the server is programmed to store and execute the method. The method includes the steps of collecting a set of data from the set of wells, performing an RPI® evaluation on the set of data, creating a matched data set from the set of data, segregating the matched data set into a set of comparison groups, normalizing each comparison group of the set of comparison groups, calculating a set of performance metrics between a subset of the set of comparison groups, and calculating a probability for each performance metric of the set of performance metrics.",
  "ipcr_labels": [
    "G06N700"
  ],
  "inventor_list": [
    {
      "inventor_name_last": "Crafton",
      "inventor_name_first": "James W.",
      "inventor_city": "Evergreen",
      "inventor_state": "CO",
      "inventor_country": "US"
    }
  ],
  "title": "SYSTEM AND METHOD FOR ANALYZING AND VALIDATING OIL AND GAS WELL PRODUCTION DATA",
  "decision": "ACCEPTED",
  "_processing_info": {
    "original_size": 43204,
    "optimized_size": 2185,
    "reduction_percent": 94.94
  }
}