{
  "patent_number": "None",
  "application_number": "15430041",
  "date_published": "20170817",
  "date_produced": "20170802",
  "filing_date": "20170210",
  "main_ipcr_label": "G06N9900",
  "abstract": "Methods and systems for developing a behavioral index model are described. According to various embodiments, the system accesses a set of behavioral data stored in association with a set of member profiles. The system generates a set of training data from the set of behavioral data and generates a set of feature vectors from the set of training data. The system generates a behavioral index model from the set of training data and the set of feature vectors. The system then generates a tuned behavioral index model from the behavioral index model by tuning a threshold of the behavioral index model using a precision recall curve.",
  "publication_number": "US20170236073A1-20170817",
  "summary": "<SOH> BRIEF DESCRIPTION OF THE SEVERAL VIEWS OF THE DRAWINGS <EOH>Some embodiments are illustrated by way of example and not limitation in the accompanying drawings, in which: FIG. 1 is a block diagram of the functional modules or components that comprise a computer-network based social network service, including a candidate selection machine consistent with some embodiments described herein; FIG. 2 is a block diagram depicting some example components of the candidate selection machine of FIG. 1 ; FIG. 3 is a flow diagram illustrating an example method of generating a behavioral index model, according to some embodiments of the present disclosure; FIG. 4 is a flow diagram illustrating an example method of generating a behavioral index model, according to some embodiments of the present disclosure; FIG. 5 is a flow diagram illustrating an example method of generating a behavioral index model, according to some embodiments of the present disclosure; FIG. 6 is a flow diagram illustrating an example method of generating a behavioral index model, according to some embodiments of the present disclosure; FIG. 7 is a flow diagram illustrating an example method of generating a behavioral index model, according to some embodiments of the present disclosure; FIG. 8 is a flow diagram illustrating an example method of identifying and retrieving structured result sets from a behavioral index model, according to some embodiments of the present disclosure; FIG. 9 is a flow diagram illustrating an example method of identifying and retrieving structured result sets from a behavioral index model, according to some embodiments of the present disclosure; FIG. 10 is a flow diagram illustrating an example method of identifying and retrieving structured result sets from a behavioral index model, according to some embodiments of the present disclosure; FIG. 11 is a flow diagram illustrating an example method of identifying and retrieving structured result sets from a behavioral index model,...",
  "ipcr_labels": [
    "G06N9900",
    "G06Q5000"
  ],
  "inventor_list": [
    {
      "inventor_name_last": "Borisyuk",
      "inventor_name_first": "Fedor Vladimirovich",
      "inventor_city": "Sunnyvale",
      "inventor_state": "CA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Kenthapadi",
      "inventor_name_first": "Krishnaram",
      "inventor_city": "Sunnyvale",
      "inventor_state": "CA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Stein",
      "inventor_name_first": "David",
      "inventor_city": "Mountain View",
      "inventor_state": "CA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Jain",
      "inventor_name_first": "Parul",
      "inventor_city": "Cupoertino",
      "inventor_state": "CA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Zhao",
      "inventor_name_first": "Bo",
      "inventor_city": "Redwood City",
      "inventor_state": "CA",
      "inventor_country": "US"
    }
  ],
  "title": "MACHINE LEARNED CANDIDATE SELECTION ON INVERTED INDICES",
  "decision": "PENDING",
  "_processing_info": {
    "original_size": 142725,
    "optimized_size": 3799,
    "reduction_percent": 97.34
  }
}