{
  "patent_number": "None",
  "application_number": "15434643",
  "date_published": "20170608",
  "date_produced": "20170524",
  "filing_date": "20170216",
  "main_ipcr_label": "G06N308",
  "abstract": "Systems and methods for training networks are provided. A method for training networks comprises receiving an input from each of a plurality of neural networks differing from each other in at least one of architecture, input modality, and feature type, connecting the plurality of neural networks through a common output layer, or through one or more common hidden layers and a common output layer to result in a joint network, and training the joint network.",
  "publication_number": "US20170161608A1-20170608",
  "summary": "<SOH> SUMMARY <EOH>In general, exemplary embodiments of the invention include methods and systems for training neural networks and, in particular, to methods and systems for training of hybrid neural networks for acoustic modeling in automatic speech recognition. According to an exemplary embodiment of the present invention, a method for training networks comprises receiving an input from each of a plurality of neural networks differing from each other in at least one of architecture, input modality, and feature type, connecting the plurality of neural networks through a common output layer, or through one or more common hidden layers and a common output layer to result in a joint network, and training the joint network. According to an exemplary embodiment of the present invention, a system for training networks, comprises an input module capable of receiving an input from each of a plurality of neural networks differing from each other in at least one of architecture, input modality, and feature type, a connection module capable of connecting the plurality of neural networks through a common output layer, or through one or more common hidden layers and a common output layer to result in a joint network, and a training module capable of training the joint network. According to an exemplary embodiment of the present invention, a computer program product for training networks comprises a computer readable storage medium having program instructions embodied therewith, the program instructions executable by a processor to cause the processor to perform a method comprising receiving an input from each of a plurality of neural networks differing from each other in at least one of architecture, input modality, and feature type, connecting the plurality of neural networks through a common output layer, or through one or more common hidden layers and a common output layer to result in a joint network, and training the joint network. These and other exemplary embodiments of ...",
  "ipcr_labels": [
    "G06N308",
    "G06N304"
  ],
  "inventor_list": [
    {
      "inventor_name_last": "SAON",
      "inventor_name_first": "GEORGE A.",
      "inventor_city": "STAMFORD",
      "inventor_state": "CT",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "SOLTAU",
      "inventor_name_first": "HAGEN",
      "inventor_city": "YORKTOWN HEIGHTS",
      "inventor_state": "NY",
      "inventor_country": "US"
    }
  ],
  "title": "METHOD AND SYSTEM FOR JOINT TRAINING OF HYBRID NEURAL NETWORKS FOR ACOUSTIC MODELING IN AUTOMATIC SPEECH RECOGNITION",
  "decision": "PENDING",
  "_processing_info": {
    "original_size": 56297,
    "optimized_size": 3228,
    "reduction_percent": 94.27
  }
}