{
  "patent_number": "None",
  "application_number": "15436825",
  "date_published": "20170824",
  "date_produced": "20170809",
  "filing_date": "20170219",
  "main_ipcr_label": "G06N300",
  "abstract": "A user statement associated with a query is received. The user statement is parsed to determine a set of interpretations matching the user statement. Based at least in part on the set of interpretations the query is determined to be a candidate for iterative improvement. The query is iteratively improved at least in part by prompting a user associated with the user statement to provide a further input.",
  "publication_number": "US20170243107A1-20170824",
  "summary": "<SOH> BRIEF DESCRIPTION OF THE DRAWINGS <EOH>Various embodiments of the invention are disclosed in the following detailed description and the accompanying drawings. FIG. 1 is a functional diagram illustrating a programmed computer/server system for enhanced search in accordance with some embodiments. FIG. 2 is a block diagram illustrating an embodiment of a system for enhanced search. FIG. 3A is a block diagram illustrating an embodiment of a data system. FIG. 3B is a flow diagram illustrating an embodiment of a multi-source probabilistic entity and concept graph. FIG. 3C is a flow diagram illustrating an embodiment of entity resolution and attribute fusion. FIG. 4A is a block diagram illustrating an embodiment of an intent system. FIG. 4B is an illustration of an overview for representing meaning. FIG. 4C is an illustration of an overview for syntactic deconstruction. FIG. 4D is an illustration of a result from a constituency parse. FIG. 4E is an example of a predicate-argument data structure. FIGS. 5A-5D illustrate examples of resolving ambiguity. FIG. 6A is a block diagram illustrating an embodiment of an application system. FIGS. 6B-6D illustrate examples of carousels of cards. FIG. 6E illustrates an example of evidence-supported results. FIGS. 6F-6M illustrate example screenshots for an intelligent agent. FIGS. 7A-7I illustrate interactive search. FIG. 7J is a flow chart illustrating an embodiment of a process for generating a measurement set. FIG. 7K is an illustration of an embodiment for a first mining of variety. FIG. 7L is an illustration of an embodiment for a second mining of variety. FIG. 8A is a flow chart illustrating an embodiment of a process for providing enhanced search using an intelligent agent and interface. FIG. 8B is a flow chart illustrating an embodiment of a process for user intent and context based search results. FIG. 8C is a flow chart illustrating an embodiment of a process for an interactive search engine. detailed-description descrip...",
  "ipcr_labels": [
    "G06N300",
    "G06N502",
    "G06F1730"
  ],
  "inventor_list": [
    {
      "inventor_name_last": "Jolley",
      "inventor_name_first": "Charles",
      "inventor_city": "San Francisco",
      "inventor_state": "CA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Hanson",
      "inventor_name_first": "Michael",
      "inventor_city": "Los Altos",
      "inventor_state": "CA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Iyer",
      "inventor_name_first": "Chandrasekhar",
      "inventor_city": "Pleasanton",
      "inventor_state": "CA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Young",
      "inventor_name_first": "Heidi",
      "inventor_city": "Woodinville",
      "inventor_state": "WA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Baggeroer",
      "inventor_name_first": "David",
      "inventor_city": "Menlo Park",
      "inventor_state": "CA",
      "inventor_country": "US"
    }
  ],
  "title": "INTERACTIVE SEARCH ENGINE",
  "decision": "PENDING",
  "_processing_info": {
    "original_size": 127616,
    "optimized_size": 3545,
    "reduction_percent": 97.22
  }
}