{
  "patent_number": "None",
  "application_number": "15434558",
  "date_published": "20170824",
  "date_produced": "20170809",
  "filing_date": "20170216",
  "main_ipcr_label": "G06N9900",
  "abstract": "Provided are an artificial intelligence (AI) learning method and system and an answer relay method and system using an AI. According to an AI learning method, an AI may transmit a question to users through a messaging service and may acquire learning data for the AI through reactions of the user to the transmitted question.",
  "publication_number": "US20170243136A1-20170824",
  "summary": "<SOH> SUMMARY <EOH>One or more example embodiments provide an artificial intelligence (AI) learning methods and/or systems that may transmit question data to users using a messaging service in an instant messaging environment and may train an AI using answers of the users. One or more example embodiments also provide answer relay methods and/or systems that enable an AI to directly provide an answer to a question using an instant message of a user in an instant messaging environment and to relay an answer using an instant message of each of other users or a user selected as a specialist (e.g., an expert) in a specific field from among the other users, thereby connecting the users to each other. According to an example embodiment, there is provided an AI learning method of an AI learning system configured as a computer, the method comprising selecting question data; verifying a communication session between an account of at least one user among users registered to a messaging service and an AI account registered to the messaging service, transmitting the question data to the at least one user through the verified communication session as an instant message of the AI account, receiving answer data to the question data from the at least one user through the verified communication session, and generating learning data to train the AI learning system based on the question data and the received answer data. According to an example embodiment, an AI learning system includes a memory configured to store non-transitory computer-readable instructions, and at least one processor configured to execute the non-transitory computer-readable instructions such that the at least one processor is configured to select question data, verify a communication session between an account of at least one user among users registered to a messaging service and an AI account registered to the messaging service, transmit the question data to the at least one user through the verified communicatio...",
  "ipcr_labels": [
    "G06N9900",
    "H04L1258"
  ],
  "inventor_list": [
    {
      "inventor_name_last": "Ho Kang",
      "inventor_name_first": "Seok",
      "inventor_city": "Seongnam-si",
      "inventor_state": "",
      "inventor_country": "KR"
    },
    {
      "inventor_name_last": "Lee",
      "inventor_name_first": "Jae Gwang",
      "inventor_city": "Seongnam-si",
      "inventor_state": "",
      "inventor_country": "KR"
    },
    {
      "inventor_name_last": "Jung",
      "inventor_name_first": "Jea Seung",
      "inventor_city": "Seongnam-si",
      "inventor_state": "",
      "inventor_country": "KR"
    },
    {
      "inventor_name_last": "Seo",
      "inventor_name_first": "Hee-Cheol",
      "inventor_city": "Seongnam-si",
      "inventor_state": "",
      "inventor_country": "KR"
    },
    {
      "inventor_name_last": "Lee",
      "inventor_name_first": "JoongJae",
      "inventor_city": "Seongnam-si",
      "inventor_state": "",
      "inventor_country": "KR"
    },
    {
      "inventor_name_last": "Lee",
      "inventor_name_first": "Jeehyun",
      "inventor_city": "Seongnam-si",
      "inventor_state": "",
      "inventor_country": "KR"
    },
    {
      "inventor_name_last": "Lim",
      "inventor_name_first": "Young-sik",
      "inventor_city": "Seongnam-si",
      "inventor_state": "",
      "inventor_country": "KR"
    },
    {
      "inventor_name_last": "Lee",
      "inventor_name_first": "Injae",
      "inventor_city": "Seongnam-si",
      "inventor_state": "",
      "inventor_country": "KR"
    }
  ],
  "title": "METHOD AND SYSTEM FOR ARTIFICIAL INTELLIGENCE LEARNING USING MESSAGING SERVICE AND METHOD AND SYSTEM FOR RELAYING ANSWER USING ARTIFICIAL INTELLIGENCE",
  "decision": "PENDING",
  "_processing_info": {
    "original_size": 106005,
    "optimized_size": 4000,
    "reduction_percent": 96.23
  }
}