{
  "patent_number": "9864955",
  "application_number": "15437130",
  "date_published": "20170608",
  "date_produced": "20170524",
  "filing_date": "20170220",
  "main_ipcr_label": "G06N9900",
  "abstract": "A wearable computing device is described that predicts, based on movement detected, over time, by the wearable computing device, one or more future periods of time during which the wearable computing device will not be used. Responsive to determining that the wearable computing device is not being used at a current time, the wearable computing device determines whether the current time coincides with at least one period of time from the one or more future periods of time. Responsive to determining that the current time coincides with the at least one period of time, the wearable computing device performs an operation.",
  "publication_number": "US20170161642A1-20170608",
  "summary": "<SOH> SUMMARY <EOH>In one example, the disclosure is directed to a method that includes predicting, based on movements of a wearable computing device, over time, one or more future periods of time during which the wearable computing device will not be used. The method further includes responsive to determining that the wearable computing device is not being used at a current time, determining whether the current time coincides with at least one period of time from the one or more future periods of time. The method further includes responsive to determining that the current time coincides with the at least one period of time, performing, by the wearable computing device, an operation. In another example, the disclosure is directed to a wearable computing device that includes at least one motion sensor, at least one module, and at least one processor operable by the at least one processor to predict, based on movements detected, over time, by the at least one motion sensor, one or more future periods of time during which the wearable computing device will not be used. The at least one module is further operable by the at least one processor to responsive to determining that the wearable computing device is not being used at a current time, determine whether the current time coincides with at least one period of time from the one or more future periods of time, and responsive to determining that the current time coincides with the at least one period of time, perform an operation. In another example, the disclosure is directed to a method that includes obtaining, by a computing system, an indication of one or more movements detected by a wearable computing device on a plurality of prior days, and identifying, by the computing system, based on the one or more movements, a recurring period of time during which a frequency of movement or a magnitude of change associated with at least one movement from the one or more movements satisfies a threshold for indicating that the...",
  "ipcr_labels": [
    "G06N9900",
    "G06N504"
  ],
  "inventor_list": [
    {
      "inventor_name_last": "Faaborg",
      "inventor_name_first": "Alexander",
      "inventor_city": "Mountain View",
      "inventor_state": "CA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Chang",
      "inventor_name_first": "Jeffrey Albert",
      "inventor_city": "Palo Alto",
      "inventor_state": "CA",
      "inventor_country": "US"
    }
  ],
  "title": "INFERRING PERIODS OF NON-USE OF A WEARABLE DEVICE",
  "decision": "ACCEPTED",
  "_processing_info": {
    "original_size": 109135,
    "optimized_size": 3342,
    "reduction_percent": 96.94
  }
}