{
  "patent_number": "9679261",
  "application_number": "15439183",
  "date_published": "20170608",
  "date_produced": "20170524",
  "filing_date": "20170222",
  "main_ipcr_label": "G06N9900",
  "abstract": "A machine learning classifier system includes a data set processing subsystem to generate a training set and a validation set from multiple data sources. Classifier hardware induces a classifier according to the training set, and tests the classifier according to the validation set. A buffer connected to the classifier hardware stores data objects to be classified, and a register connected to the classifier hardware stores outputs of the classifier, including classified data objects.",
  "publication_number": "US20170161643A1-20170608",
  "summary": "<SOH> BRIEF DESCRIPTION OF DRAWINGS <EOH>Embodiments are described in detail in the following description with reference to the following figures. The embodiments are illustrated by examples shown in the accompanying figures in which like reference numerals indicate similar elements. FIG. 1 illustrates a machine learning classifier system, according to an embodiment; FIG. 2A illustrates a data set processing subsystem, according to an embodiment; FIG. 2B illustrates a data flow diagram for creating an ensemble classifier, according to an embodiment; FIG. 3 illustrates a method to generate a classifier, according to an embodiment; FIGS. 4A-B illustrate hardware for a classifier system, according to embodiments; FIG. 5 illustrates a system, according to an embodiment; FIG. 6 illustrates a system architecture, according to an embodiment; FIG. 7 shows a computer system that may be a platform for a system, according to an embodiment; FIGS. 8-11 illustrate flow charts of methods, according to embodiments; FIGS. 12A-C show examples of price risk scores, supplier risk scores and item risk scores on a scoring scale, according to embodiments; FIGS. 13-17 show examples of screenshots, according to embodiments; FIG. 18 shows a workflow for a procurement process, according to an embodiment; FIG. 19 shows components of a procurement system, according to an embodiment; FIG. 20 shows case management operations, according to embodiments; FIG. 21 shows a mobile application, according to an embodiment; and FIG. 22 shows automated safeguards that may be implemented in response to alerts for item, price and supplier risks, according to an embodiment. detailed-description description=\"Detailed Description\" end=\"lead\"?",
  "ipcr_labels": [
    "G06N9900",
    "G06Q3006",
    "G06Q1006",
    "G06N504",
    "G06F1730"
  ],
  "inventor_list": [
    {
      "inventor_name_last": "HOOVER",
      "inventor_name_first": "James",
      "inventor_city": "Mechanicsburg",
      "inventor_state": "PA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "MILLER",
      "inventor_name_first": "Jeffrey Scott",
      "inventor_city": "Fairfax Station",
      "inventor_state": "VA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "WESTER",
      "inventor_name_first": "Lisa",
      "inventor_city": "Alexandria",
      "inventor_state": "VA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "GOWAT",
      "inventor_name_first": "Randall C.",
      "inventor_city": "Arlington",
      "inventor_state": "VA",
      "inventor_country": "US"
    }
  ],
  "title": "MACHINE LEARNING CLASSIFIER",
  "decision": "ACCEPTED",
  "_processing_info": {
    "original_size": 122909,
    "optimized_size": 3242,
    "reduction_percent": 97.36
  }
}