{
  "patent_number": "None",
  "application_number": "15434511",
  "date_published": "20180329",
  "date_produced": "20180315",
  "filing_date": "20170216",
  "main_ipcr_label": "G06N3063",
  "abstract": "Technical solutions are described for forming a semiconductor device for a crosspoint array that implements a pre-programmed neural network. An example method includes sequentially depositing a semiconducting layer, a top insulating layer, and a shunting layer onto a base insulating layer. The method further includes etching selective portions of the top insulating layer corresponding to resistance values associated with weights of the crossbar that implements the neural network.",
  "publication_number": "US20180089559A1-20180329",
  "summary": "<SOH> SUMMARY <EOH>According to one or more embodiments, an example method for forming a semiconductor device for a crosspoint array that implements a pre-programmed neural network is described. The method includes sequentially depositing a semiconducting layer, a top insulating layer, and a shunting layer onto a base insulating layer. The method further includes etching selective portions of the top insulating layer corresponding to resistance values associated with weights of the crossbar that implements the neural network. According to one or more embodiments, a semiconductor device for a crosspoint device from a crosspoint array is described. The semiconductor device is formed using a method that includes depositing a semiconducting layer on a base insulating layer. The method further includes depositing a top insulating layer on the semiconducting layer. The method further includes removing a portion of the top insulating layer. The method further includes depositing a shunting layer on the top insulating layer, wherein the shunting layer contacts the semiconducting layer via the portion that is removed from the top insulating layer, wherein the dimensions of the portion determine a resistance value of the crosspoint device. According to one or more embodiments, a semiconductor device that implements a pre-programmed neural network includes a semiconducting layer deposited on a base insulating layer. The semiconductor device further includes a top insulating layer deposited on the semiconducting layer. The semiconductor device further includes a portion of the top insulating layer removed. The semiconductor device further includes a shunting layer deposited on the top insulating layer, wherein the shunting layer contacts the semiconducting layer via the portion that is removed from the top insulating layer, wherein the dimensions of the portion determine a resistance value of the semiconductor device.",
  "ipcr_labels": [
    "G06N3063",
    "H01L4500",
    "G06N304",
    "G06N308"
  ],
  "inventor_list": [
    {
      "inventor_name_last": "COPEL",
      "inventor_name_first": "MATTHEW W.",
      "inventor_city": "YORKTOWN HEIGHTS",
      "inventor_state": "NY",
      "inventor_country": "US"
    }
  ],
  "title": "PRE-PROGRAMMED RESISTIVE CROSS-POINT ARRAY FOR NEURAL NETWORK",
  "decision": "PENDING",
  "_processing_info": {
    "original_size": 88392,
    "optimized_size": 3016,
    "reduction_percent": 96.59
  }
}