{
  "patent_number": "9996802",
  "application_number": "15434413",
  "date_published": "20180419",
  "date_produced": "20180404",
  "filing_date": "20170216",
  "main_ipcr_label": "G06N9900",
  "abstract": "An optical system comprising a charged quantum dot having, a charged carrier, first and second ground state levels and a plurality of excited state levels, the first and second ground state energy levels having different spin states such that the said charged carrier cannot transfer between the first and second ground state energy levels without changing its spin state, the system further comprising a controller adapted to control a first radiating beam with energy not more than 100 micro-eV from a first transition within said quantum dot from a first ground state level to a selected excited state level from the plurality of excited state levels to, the system being adapted to enhance the decay rate of a second transition within said quantum dot from the selected excited state level to a second ground state level, but not a first transition, such that a photon is produced due to scattering of a photon from the first radiating beam, wherein the controller is adapted to irradiate the qua...",
  "publication_number": "US20180107937A1-20180419",
  "summary": "<SOH> BRIEF DESCRIPTION OF THE FIGURES <EOH>Devices in accordance with embodiments of the present invention will now be described with reference to the following figures in which: FIG. 1A is a diagram showing the energy levels in a quantum dot; FIG. 1B shows the spin states associated with an electron in the quantum dot of FIG. 1A ; FIG. 1C shows the spin states associated with a whole in the quantum dot of FIG. 1A ; FIG. 2 is a further diagram showing the energy levels in the quantum dot of FIG. 1A and the external laser input and photon collection in accordance with an embodiment of the present invention; FIG. 3A shows the preparation of the initial state in a sequence of excitations in accordance with an embodiment of the present invention used to produce a controlled photon output; FIG. 3B schematically shows an excitation of the 2-3 transition to produce a superposition of states in the ground state in the sequence of excitations used to produce the controlled photon output; FIG. 3C shows the application of a control pulse to further modify the superposed state in the sequence of excitations used to produce the controlled photon output; FIG. 3D shows a final excitation of the 2-3 transition in the sequence of excitations used to produce the controlled photon output; FIG. 4A shows the preparation of the initial state in a sequence of excitations in accordance with an embodiment of the present invention used to produce an entangled photon pair; FIG. 4B schematically shows an excitation of the 2-3 transition to produce a superposition of states in the ground state in the sequence of excitations used to produce the entangled photon pair; FIG. 4C shows the application of a beam of radiation to supply a second photon for entanglement dependent on the superposition in the sequence of excitations used to produce the entangled photon pair; FIG. 4D shows a population inversion between the two ground states in the sequence of excitations used to produce the entangled phot...",
  "ipcr_labels": [
    "G06N9900"
  ],
  "inventor_list": [
    {
      "inventor_name_last": "BENNETT",
      "inventor_name_first": "Anthony John",
      "inventor_city": "Cambridge",
      "inventor_state": "",
      "inventor_country": "GB"
    },
    {
      "inventor_name_last": "SHIELDS",
      "inventor_name_first": "Andrew James",
      "inventor_city": "Cambridge",
      "inventor_state": "",
      "inventor_country": "GB"
    }
  ],
  "title": "QUANTUM OPTICAL SYSTEM",
  "decision": "ACCEPTED",
  "_processing_info": {
    "original_size": 52294,
    "optimized_size": 3677,
    "reduction_percent": 92.97
  }
}