{
  "patent_number": "None",
  "application_number": "15431136",
  "date_published": "20170601",
  "date_produced": "20170517",
  "filing_date": "20170213",
  "main_ipcr_label": "G06N502",
  "abstract": "A method for predicting the behavior of an electronic social network (ESN) includes identifying one user's connections with other users and creating a data structure in a memory that represents the users and their connections in the ESN. A plurality of data sources for electronic communications between users are analyzed and assigned a relative importance value. A weight is also assigned to each of the connections between the users. The weight is an encoded value computed based on a link structure of the connections where the link structure includes metadata indicating a category and a status of the respective connection. The probability that one user will communicate with one of the other users is calculated based on the analyzed plurality of data sources calculating, and the user's connections with respect to other users are ranked based on the calculated probabilities.",
  "publication_number": "US20170154267A1-20170601",
  "summary": "<SOH> SUMMARY <EOH>According to one embodiment, a method for predicting the behavior of an electronic social network (ESN) includes identifying one user's connections with other users and creating a data structure in a memory that represents the users and their connections in the ESN. A plurality of data sources for electronic communications between users are analyzed and assigned a relative importance value. A weight is also assigned to each of the connections between the users. The weight is an encoded value computed based on a link structure of the connections where the link structure includes metadata indicating a category and a status of the respective connection. The probability that one user will communicate with one of the other users is calculated based on the analyzed plurality of data sources calculating, and the user's connections with respect to other users are ranked based on the calculated probabilities.",
  "ipcr_labels": [
    "G06N502",
    "G06F1730",
    "G06N700",
    "H04L1258"
  ],
  "inventor_list": [
    {
      "inventor_name_last": "Garg",
      "inventor_name_first": "Dinesh",
      "inventor_city": "Beawar",
      "inventor_state": "",
      "inventor_country": "IN"
    },
    {
      "inventor_name_last": "Narayanam",
      "inventor_name_first": "Ramasuri",
      "inventor_city": "Andra Pradesh",
      "inventor_state": "",
      "inventor_country": "IN"
    }
  ],
  "title": "DISCOVERING SIGNATURE OF ELECTRONIC SOCIAL NETWORKS",
  "decision": "PENDING",
  "_processing_info": {
    "original_size": 118666,
    "optimized_size": 2535,
    "reduction_percent": 97.86
  }
}