{
  "patent_number": "None",
  "application_number": "15442370",
  "date_published": "20170608",
  "date_produced": "20170524",
  "filing_date": "20170224",
  "main_ipcr_label": "G06N700",
  "abstract": "A non-transitory computer readable medium for storing one or more sequences of one or more instructions for execution by one or more processors in a processing system to perform a method for determining a dichotomy for a parametric decision process, the instructions when executed by the one or more processors are presented. Embodiments can be configured to define a network having a plurality of members as inter-member coherency coupling represented by elements of a coherency matrix, wherein for each ith member the network includes an intensity value, Ii. Further embodiments may include determining non-diagonal elements Tij of the coherency matrix in which i≠j and in which i and j represent ith and jth members of the network, and constructing diagonal kernels Ki or non-diagonal kernels Hi based on the non-diagonal elements Tij of the coherency matrix and intensity values (Ii) of the members.",
  "publication_number": "US20170161625A1-20170608",
  "summary": "<SOH> BRIEF SUMMARY OF THE EMBODIMENTS <EOH>The technology disclosed herein relates to Integrative Software System (ISS) technology, which in various embodiments combines two AI schools: probabilistic and logicist, together with Bayesian Inference and Binary Sensing, in the form of Bayesian Truthing Inference (BTI). The ISS, which can include digital decision generation tools, can be configured to detect, recognize and identify adverse networks by detecting Bayesian anomalous events, or BAEVENTS, in cyberspace, through the inspection of professional (or pseudo-professional) databases, or PRO-CLOUDS (could also be referred to as “CYBER-CLOUDS”). In various embodiments, a discrete truthing space can be included with targets that might be of interest—referred to as High Value Individual Candidates (HVICs)—as sample units, and targets that are confirmed by the system as targets of interest—referred to as High Value Individuals (HVIs). In the examples provided herein, these targets can be individuals (e.g., people), while in other embodiments, targets can be other entities. Various embodiments can be configured to evaluate data and information about HVICs to determine whether they are actually HVIs. The ISS architecture can, in some embodiments, be configured as a chain structure with elemental tasks as its nodes. It can be configured with two or more software engines. For example, in the case of two engines, one may be an intra-cloud engine, and the other an inter-cloud engine. In various embodiments, these can be supported by multiple (e.g., 2, 3, 4, a dozen, or more) supportive elemental tasks (modules). The ISS chain can be fully actionable and can be configured to avoid the correlation/causation contradiction by applying a natural binary sensor scheme that is unidirectional, with a well-defined causation relation. This scheme can be based exclusively on sensor events and readouts (thus, avoiding correlation problems). There can also be an intra-cloud software engine...",
  "ipcr_labels": [
    "G06N700",
    "G06F1716"
  ],
  "inventor_list": [
    {
      "inventor_name_last": "Jannson",
      "inventor_name_first": "Tomasz",
      "inventor_city": "Torrance",
      "inventor_state": "CA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Wang",
      "inventor_name_first": "Wenjian",
      "inventor_city": "Torrance",
      "inventor_state": "CA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Forrester",
      "inventor_name_first": "Thomas",
      "inventor_city": "Hacienda Heights",
      "inventor_state": "CA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Kostrzweski",
      "inventor_name_first": "Andrew",
      "inventor_city": "Garden Grove",
      "inventor_state": "CA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Jannson",
      "inventor_name_first": "Joanna",
      "inventor_city": "Torrance",
      "inventor_state": "CA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Nielsen",
      "inventor_name_first": "Thomas",
      "inventor_city": "Torrance",
      "inventor_state": "CA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Veeris",
      "inventor_name_first": "Christian",
      "inventor_city": "Torrance",
      "inventor_state": "CA",
      "inventor_country": "US"
    }
  ],
  "title": "INTEGRATIVE SOFTWARE SYSTEM, DEVICE, AND METHOD",
  "decision": "PENDING",
  "_processing_info": {
    "original_size": 172644,
    "optimized_size": 4381,
    "reduction_percent": 97.46
  }
}