{
  "patent_number": "None",
  "application_number": "15444902",
  "date_published": "20180322",
  "date_produced": "20180308",
  "filing_date": "20170228",
  "main_ipcr_label": "G06N304",
  "abstract": "A memcapacitor according to an embodiment includes a first electrode, a first dielectric layer provided on the first electrode, a plurality of variable resistance portions provided separately from each other on the first dielectric layer, a second dielectric layer provided on the first dielectric layer and between the variable resistance portions, and a second electrode provided on the variable resistance portions and the second dielectric layer. Each of the variable resistance portions is formed of a material that allows diffusion of metal atoms constituting the second electrode to inside of the variable resistance portion, and the second dielectric layer is formed of a material that prevents diffusion of the metal atoms constituting the second electrode to inside of the second dielectric layer.",
  "publication_number": "US20180082168A1-20180322",
  "summary": "<SOH> BRIEF DESCRIPTION OF THE DRAWINGS <EOH>FIG. 1 is a block diagram illustrating a schematic configuration example of a neural network device according to a first embodiment; FIG. 2 is a schematic diagram illustrating an example of a processing unit according to the first embodiment; FIG. 3 is a block diagram illustrating a schematic configuration example of a neuro device according to the first embodiment; FIG. 4 is a diagram illustrating an example of an equivalent circuit of the neuro device illustrated in FIG. 3 ; FIG. 5 is a cross-sectional view illustrating a schematic configuration example of a memcapacitor according to the first embodiment; FIG. 6 is a diagram illustrating an A-A cross-section in FIG. 5 ; FIG. 7 is a diagram illustrating another example of the equivalent circuit of the neuro device illustrated in FIG. 3 ; FIG. 8 is a diagram illustrating an example of the memcapacitor illustrated in FIG. 5 , after a potential difference of a certain level or higher is applied across an upper electrode and a lower electrode; FIG. 9 is an equivalent circuit diagram illustrating a schematic configuration example of a memcapacitor in a neuro device used for a simulation in the first embodiment; FIG. 10 is an equivalent circuit diagram illustrating a schematic configuration example of the neuro device used for the simulation in the first embodiment; FIG. 11 is a voltage waveform diagram of a voltage V 1 used in the simulation in the first embodiment; FIG. 12 is a voltage waveform diagram of a voltage V 2 used in the simulation in the first embodiment; FIG. 13 is a diagram illustrating an example of a waveform of a voltage output from a threshold function unit of the neuro device in the state illustrated in FIG. 9 ; FIG. 14 is an explanatory diagram of a state of a memcapacitor after performing an arithmetic operation in the first embodiment, and is a diagram illustrating a state after a first arithmetic operation is performed; FIG. 15 is a diagram illustrating...",
  "ipcr_labels": [
    "G06N304",
    "H01L4500"
  ],
  "inventor_list": [
    {
      "inventor_name_last": "MARUKAME",
      "inventor_name_first": "Takao",
      "inventor_city": "Chuo",
      "inventor_state": "",
      "inventor_country": "JP"
    },
    {
      "inventor_name_last": "DEGUCHI",
      "inventor_name_first": "Jun",
      "inventor_city": "Kawasaki",
      "inventor_state": "",
      "inventor_country": "JP"
    },
    {
      "inventor_name_last": "NISHI",
      "inventor_name_first": "Yoshifumi",
      "inventor_city": "Yokohama",
      "inventor_state": "",
      "inventor_country": "JP"
    },
    {
      "inventor_name_last": "SUZUKI",
      "inventor_name_first": "Masamichi",
      "inventor_city": "Koto",
      "inventor_state": "",
      "inventor_country": "JP"
    },
    {
      "inventor_name_last": "TACHIBANA",
      "inventor_name_first": "Fumihiko",
      "inventor_city": "Yokohama",
      "inventor_state": "",
      "inventor_country": "JP"
    },
    {
      "inventor_name_last": "MORIMOTO",
      "inventor_name_first": "Makoto",
      "inventor_city": "Yokohama",
      "inventor_state": "",
      "inventor_country": "JP"
    },
    {
      "inventor_name_last": "MITANI",
      "inventor_name_first": "Yuichiro",
      "inventor_city": "Miura",
      "inventor_state": "",
      "inventor_country": "JP"
    }
  ],
  "title": "MEMCAPACITOR, NEURO DEVICE, AND NEURAL NETWORK DEVICE",
  "decision": "PENDING",
  "_processing_info": {
    "original_size": 59043,
    "optimized_size": 4224,
    "reduction_percent": 92.85
  }
}