{
  "patent_number": "None",
  "application_number": "15445945",
  "date_published": "20170831",
  "date_produced": "20170816",
  "filing_date": "20170228",
  "main_ipcr_label": "G06N308",
  "abstract": "An electronic synapse is disclosed, comprising a heavy metal layer having a high spin orbit coupling, a domain wall magnet layer having a bottom surface adjacent to a top surface of the heavy metal layer, the domain wall magnet layer having a perpendicular magnetic anisotropy, the domain wall magnet layer having a domain wall, the domain wall running parallel to a longitudinal axis of the domain wall magnet layer, a pinned layer having perpendicular magnetic anisotropy, and an oxide tunnel barrier connected between the domain wall magnet layer and the pinned layer, wherein the pinned layer, the oxide tunnel barrier, and the free layer form a magnetic tunnel junction.",
  "publication_number": "US20170249550A1-20170831",
  "summary": "<SOH> SUMMARY <EOH>The present disclosure provides a device structure based on a ferromagnet with oppositely polarized magnetic domains separated by a transition region called a domain wall, referred to herein as a domain-wall magnet (DWM). The structure has decoupled spike transmission and learning current paths which allows a learning event to take place at any time during the operation of a connected neural network. Spin-orbit torque generated by the magnetic heterostructure generates STDP. According to various aspects, an electronic synapse is disclosed, comprising a heavy metal layer having a high spin orbit coupling, a domain wall magnet layer having a bottom surface adjacent to a top surface of the heavy metal layer, the domain wall magnet layer having a perpendicular magnetic anisotropy, the domain wall magnet layer having a domain wall, the domain wall running parallel to a longitudinal axis of the domain wall magnet layer, a pinned layer having perpendicular magnetic anisotropy, and an oxide tunnel barrier connected between the domain wall magnet layer and the pinned layer, wherein the pinned layer, the oxide tunnel barrier, and the free layer form a magnetic tunnel junction. The electronic synapse may further comprise a non-magnetic electrical contact having a bottom surface in contact with the top surface of the domain wall magnet layer, the non-magnetic electrical contact electrically isolated from the magnetic tunnel junction. The magnetic tunnel junction may be disposed near a first end of the domain wall magnet layer and the non-magnetic electrical contact is disposed near a second end of the domain wall magnet layer. The electronic synapse may further comprise a current source configured to supply a spike current from the pinned layer, through the magnetic tunnel junction, through the heavy metal layer to the non-magnetic electrical contact. The current source may also supply a learning current through the heavy metal layer from the first end of the...",
  "ipcr_labels": [
    "G06N308",
    "G06N3063",
    "G06N304",
    "H01L4308",
    "H01L4310"
  ],
  "inventor_list": [
    {
      "inventor_name_last": "Sengupta",
      "inventor_name_first": "Abhronil",
      "inventor_city": "West Lafayette",
      "inventor_state": "IN",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Azim",
      "inventor_name_first": "Zubair Al",
      "inventor_city": "West Lafayette",
      "inventor_state": "IN",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Fong",
      "inventor_name_first": "Xuanyao Kelvin",
      "inventor_city": "West Lafayette",
      "inventor_state": "IN",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Roy",
      "inventor_name_first": "Kaushik",
      "inventor_city": "West Lafayette",
      "inventor_state": "IN",
      "inventor_country": "US"
    }
  ],
  "title": "ELECTRONIC SYNAPSE HAVING SPIN-ORBIT TORQUE INDUCED SPIKETIMING DEPENDENT PLASTICITY",
  "decision": "PENDING",
  "_processing_info": {
    "original_size": 32856,
    "optimized_size": 3765,
    "reduction_percent": 88.54
  }
}