{
  "patent_number": "None",
  "application_number": "15449614",
  "date_published": "20170622",
  "date_produced": "20170607",
  "filing_date": "20170303",
  "main_ipcr_label": "G06N308",
  "abstract": "A neural network includes inputs for receiving input signals, and synapses connected to the inputs and having corrective weights organized in an array. Training images are either received by the inputs as an array or codified as such during training of the network. The network also includes neurons, each having an output connected with at least one input via one synapse and generating a neuron sum array by summing corrective weights selected from each synapse connected to the respective neuron. Furthermore, the network includes a controller that receives desired images in an array, determines a deviation of the neuron sum array from the desired output value array, and generates a deviation array. The controller modifies the corrective weight array using the deviation array. Adding up the modified corrective weights to determine the neuron sum array reduces the subject deviation and generates a trained corrective weight array for concurrent network training.",
  "publication_number": "US20170177998A1-20170622",
  "summary": "<SOH> SUMMARY <EOH>A neural network includes a plurality of inputs to the neural network configured to receive training images. The training images are either received by the plurality of inputs as a training input value array or codified as the training input value array during training of the neural network, i.e., after having been received by the plurality of inputs. The neural network also includes a plurality of synapses. Each synapse is connected to one of the plurality of inputs and includes a plurality of corrective weights. Each corrective weight is defined by a weight value, and the corrective weights of the plurality of synapses are organized in a corrective weight array. The neural network additionally includes a plurality of neurons. Each neuron has at least one output and is connected with at least one of the plurality of inputs via at least one of the plurality of synapses. Each neuron is configured to add up the weight values of the corrective weights corresponding to each synapse connected to the respective neuron, such that the plurality of neurons generate a neuron sum array. The neural network also includes a controller configured to receive desired images organized as a desired output value array. The controller is also configured to determine a deviation of the neuron sum array from the desired output value array and generate a deviation array. The controller is additionally configured to modify the corrective weight array using the determined deviation array. Adding up the modified corrective weight values to determine the neuron sum array reduces the deviation of the neuron sum array from the desired output value array, i.e., compensates for errors generated by the neuron network during training, and generates a trained corrective weight array to thereby facilitate concurrent or parallel training of the neural network. In a trained neural network, the plurality of inputs to the neural network may be configured to receive input images. Such in...",
  "ipcr_labels": [
    "G06N308",
    "G06F1716"
  ],
  "inventor_list": [
    {
      "inventor_name_last": "Pescianschi",
      "inventor_name_first": "Dmitri",
      "inventor_city": "Darmstadt",
      "inventor_state": "",
      "inventor_country": "DE"
    }
  ],
  "title": "NEURAL NETWORK AND METHOD OF NEURAL NETWORK TRAINING",
  "decision": "PENDING",
  "_processing_info": {
    "original_size": 69096,
    "optimized_size": 3527,
    "reduction_percent": 94.9
  }
}