{
  "patent_number": "None",
  "application_number": "15443221",
  "date_published": "20180607",
  "date_produced": "20180523",
  "filing_date": "20170227",
  "main_ipcr_label": "G06N300",
  "abstract": "A system and method is disclosed for improving automated question-answering using real-world knowledge from a knowledge base. The system can be used to answer questions from various users. The system can generate answers to these questions using data stored in a knowledge base. In some embodiments, the system is provided with a list of questions separate from any user questions. The system can be trained using these questions in advance of a user question. The system can process the presented questions to determine that it can generate high-quality correct answers. The system can take various steps to determine a high-quality answer to a question. The system can utilize human intelligence providers to improve this process, such as through a human interactive task system. Human intelligence can be used to determine that a question is understood, that a question is answered, and that the answer is of high quality.",
  "publication_number": "US20180157960A1-20180607",
  "summary": "<SOH> BRIEF DESCRIPTION OF DRAWINGS <EOH>Embodiments of various inventive features will now be described with reference to the following drawings. Throughout the drawings, reference numbers may be re-used to indicate correspondence between referenced elements. The drawings are provided to illustrate example embodiments described herein and are not intended to limit the scope of the disclosure. FIG. 1 is a flow diagram of an illustrative process for using a scalable curation system to generate a high-quality answer to a given question. FIG. 2 is a flow diagram of an illustrative subroutine for performing diagnostic steps and remedy steps in order to resolve a problem with an answer. FIG. 3 is a block diagram of an illustrative networked environment containing a system that can generate high-quality answers to various user questions. FIG. 4 is a flow diagram of an illustrative subroutine for determining a high-quality answer to a user question in real-time using the scalable curation system and notifying the user when the answer has been generated. detailed-description description=\"Detailed Description\" end=\"lead\"?",
  "ipcr_labels": [
    "G06N300",
    "G06N502",
    "G06N700",
    "G06F1730"
  ],
  "inventor_list": [
    {
      "inventor_name_last": "Holmes",
      "inventor_name_first": "Petra Elisabeth",
      "inventor_city": "Cambridgeshire",
      "inventor_state": "",
      "inventor_country": "GB"
    },
    {
      "inventor_name_last": "Fenn",
      "inventor_name_first": "Andrew Graham",
      "inventor_city": "Cambridge",
      "inventor_state": "",
      "inventor_country": "GB"
    },
    {
      "inventor_name_last": "Hopkinson",
      "inventor_name_first": "Andrew",
      "inventor_city": "Cambridgeshire",
      "inventor_state": "",
      "inventor_country": "GB"
    },
    {
      "inventor_name_last": "Palfrey",
      "inventor_name_first": "David Spike",
      "inventor_city": "Cambridge",
      "inventor_state": "",
      "inventor_country": "GB"
    },
    {
      "inventor_name_last": "Tunstall-Pedoe",
      "inventor_name_first": "William",
      "inventor_city": "Cambridge",
      "inventor_state": "",
      "inventor_country": "GB"
    },
    {
      "inventor_name_last": "Copland",
      "inventor_name_first": "Neil",
      "inventor_city": "Cambridge",
      "inventor_state": "",
      "inventor_country": "GB"
    }
  ],
  "title": "SCALABLE CURATION SYSTEM",
  "decision": "PENDING",
  "_processing_info": {
    "original_size": 98038,
    "optimized_size": 3367,
    "reduction_percent": 96.57
  }
}