{
  "patent_number": "None",
  "application_number": "15447489",
  "date_published": "20170921",
  "date_produced": "20170906",
  "filing_date": "20170302",
  "main_ipcr_label": "G06N504",
  "abstract": "An electronic device comprising circuitry configured to: obtain information representing a person's knowledge and/or skills; update a user model representing the person's knowledge and/or skills based on the obtained information; and provide user-adaptive information depending on the user model.",
  "publication_number": "US20170270415A1-20170921",
  "summary": "<SOH> SUMMARY <EOH>According to a first aspect, the disclosure provides an electronic device comprising: circuitry configured to: obtain information representing a person's knowledge and/or skills; update a user model representing the person's knowledge and/or skills based on the obtained information; and provide user-adaptive information depending on the user model. According to a further aspect, the disclosure provides a system comprising: one or more collectors for obtaining information representing a person's knowledge and/or skills; a storage comprising a user model representing the person's knowledge and/or skills based on the obtained information; and an information provider for providing user-adaptive information depending on the user model. According to a still further aspect, the disclosure provides a method comprising: obtaining information representing a person's knowledge and/or skills; updating a user model representing the person's knowledge and/or skills based on the obtained information; and providing user-adaptive information depending on the user model. Further aspects are set forth in the dependent claims, the following description and the drawings.",
  "ipcr_labels": [
    "G06N504",
    "G06N9900"
  ],
  "inventor_list": [
    {
      "inventor_name_last": "KEMP",
      "inventor_name_first": "Thomas",
      "inventor_city": "Esslingen",
      "inventor_state": "",
      "inventor_country": "DE"
    },
    {
      "inventor_name_last": "CARDINAUX",
      "inventor_name_first": "Fabien",
      "inventor_city": "Stuttgart",
      "inventor_state": "",
      "inventor_country": "DE"
    },
    {
      "inventor_name_last": "HAGG",
      "inventor_name_first": "Wilhelm",
      "inventor_city": "Stuttgart",
      "inventor_state": "",
      "inventor_country": "DE"
    },
    {
      "inventor_name_last": "BORDEWIECK",
      "inventor_name_first": "Aurel",
      "inventor_city": "Kirchheim unter Teck",
      "inventor_state": "",
      "inventor_country": "DE"
    },
    {
      "inventor_name_last": "UHLICH",
      "inventor_name_first": "Stefan",
      "inventor_city": "Renningen",
      "inventor_state": "",
      "inventor_country": "DE"
    }
  ],
  "title": "ELECTRONIC DEVICE, SYSTEM, AND METHOD",
  "decision": "PENDING",
  "_processing_info": {
    "original_size": 50898,
    "optimized_size": 2610,
    "reduction_percent": 94.87
  }
}