{
  "patent_number": "None",
  "application_number": "15440374",
  "date_published": "20170608",
  "date_produced": "20170524",
  "filing_date": "20170223",
  "main_ipcr_label": "G06N9900",
  "abstract": "Media item recommendations, such as music track recommendations, may be made using one or more models generated using data collected from a plurality of media stream sources, such as, for example, Internet radio stations. In an initial, bootstrapping phase, data about media items and media stream playlists of media stream sources may be used to generate a model, which comprises latent factor vectors, or learned profiles, of media items, e.g., tracks, artists, etc. Such a bootstrapping phase may be performed without user data, such as user playlists and/or user feedback, to generate a model that may be used to make media item recommendations. As user data becomes available, e.g., as users of a recommendation service provide user data, the user data may be used to supplement and/or update the model and/or to create user profiles.",
  "publication_number": "US20170161644A1-20170608",
  "summary": "<SOH> SUMMARY <EOH>The present disclosure seeks to address failings in the art and to provide a collaborative filtering (CF) approach that uses playlists of media streams provided by media stream sources, such as without limitation Internet radio stations, to generate a model, or models, which can be used to make recommendations. In a case of music playlists generated by Internet radio stations, a CF model can be used to recommend a track, artist and/or station to a user. Media streams comprising any type of media, e.g., audio, video, multimedia, etc., might be used to generate a model. Embodiments of the present disclosure address, among other things, a problem that results from an insufficient amount of data to model or profile items. By way of a non-limiting example, data may be past user behavior, e.g., previous user transactions or feedback. Where there is an insufficient amount of data about past user behavior, it is difficult to draw accurate inferences, if any inferences are even able to be drawn, about users and/or items. This problem may be referred to as the cold start problem. Success of a CF approach strongly depends on having a sufficient amount of data, i.e., user transaction and feedback, on record. To illustrate using a simple example involving two users, user A and user B, user transaction and feedback data may be used to draw inferences about them. If the data indicates that user A and user B have similar interests, or like similar items, and the data indicates that user A likes item Y, it can be inferred that user B will probably like item Y. The inference is particularly useful where there is little or no input from user B about item Y to draw a conclusion about user B's interest in item Y. Where there is an insufficient amount of user data, e.g., user transactions and feedback, to model or profile items, such as media items, the success of a CF approach that must rely on such user data is at best limited. Therefore, a service, such as a new ser...",
  "ipcr_labels": [
    "G06N9900"
  ],
  "inventor_list": [
    {
      "inventor_name_last": "SOMEKH",
      "inventor_name_first": "Oren",
      "inventor_city": "Bet-Yehoshua",
      "inventor_state": "",
      "inventor_country": "IL"
    },
    {
      "inventor_name_last": "KOREN",
      "inventor_name_first": "Yehuda",
      "inventor_city": "Zichron Yaakov",
      "inventor_state": "",
      "inventor_country": "IL"
    },
    {
      "inventor_name_last": "AIZENBERG",
      "inventor_name_first": "Natalie",
      "inventor_city": "Natanya",
      "inventor_state": "",
      "inventor_country": "IL"
    }
  ],
  "title": "MEDIA RECOMMENDATION USING INTERNET MEDIA STREAM MODELING",
  "decision": "PENDING",
  "_processing_info": {
    "original_size": 74832,
    "optimized_size": 3682,
    "reduction_percent": 95.08
  }
}