{
  "patent_number": "nan",
  "application_number": "15444766",
  "date_published": "20180621",
  "date_produced": "20180608",
  "filing_date": "20170228",
  "main_ipcr_label": "G06N504",
  "abstract": "The present invention implements, in a trend or pattern trigger device or system, the generation of hypotheses automatically while considering any collection of data by automatically assessing with templates or charts the presence of patterns in the data without a priori postulation of what the pattern might be. The trend or pattern examination templates or charts contain quantifiable thresholds for data or change in data so that trends or patterns in data can be discerned inductively and automatically without preconceived notions of what or where the patterns or trends might be.",
  "publication_number": "US20180174063A1-20180621",
  "summary": "<SOH> SUMMARY OF THE INVENTION <EOH>The present invention implements, in a trend or pattern trigger device or system, hypothesis generation while removing the heretofore unappreciated “you only ever find what you are looking for” fallacy of prior art hypothesis generation paths. The invention accomplishes this result by automating hypothesis generation with templates or charts to allow—and typically to require—consideration of trends or patterns that might or might not otherwise rationally or plausibly occur to an investigator to consider. The removal of the “you only ever find what you are looking for” fallacy is specifically accomplished by the use of trend or pattern examination templates or charts that register the presence, absence or value of nominal data and/or contain quantifiable thresholds for data or change in data without a priori specific postulation as to which data, thresholds, trends or patterns will prove important. In this way, computational analysis of data sets analyzed parameter thresholds yields trend or pattern analysis results independent of anyone's being able to, or having had to, postulate a potentially significant trend—because the computational analysis not only identifies the trend or pattern but likewise identifies which parameters or indicia are actually important. The invention is not just a computational method, however—the invention is a trend or pattern trigger device or system that takes an analytical approach applied to any given data set which then, upon identification of one or more trends, also reacts to real-world occurrence of events matching those trends by generating a further event, such as an alarm, telephone call or other concrete transaction. The implementation of this novel approach may occur in a wide variety of fields, described more particularly in the ensuing description. detailed-description description=\"Detailed Description\" end=\"lead\"?",
  "ipcr_labels": [
    "G06N504",
    "G06Q1004",
    "G06Q4004"
  ],
  "inventor_list": [
    {
      "inventor_name_last": "Juola",
      "inventor_name_first": "Patrick",
      "inventor_city": "Pittsburgh",
      "inventor_state": "PA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Brennan",
      "inventor_name_first": "Patrick",
      "inventor_city": "Munhall",
      "inventor_state": "PA",
      "inventor_country": "US"
    }
  ],
  "title": "Trend or Pattern Trigger Device",
  "decision": "PENDING",
  "_processing_info": {
    "original_size": 299348,
    "optimized_size": 3242,
    "reduction_percent": 98.92
  }
}