{
  "patent_number": "None",
  "application_number": "15443437",
  "date_published": "20171116",
  "date_produced": "20171103",
  "filing_date": "20170227",
  "main_ipcr_label": "G06N700",
  "abstract": "A system for storing and moving data based on the location of a user or a change in location of a user is described herein. Data associated with a user may be stored at one or more storage devices associated with a location of the user. Some or all of the data associated with the user may be moved to one or more other storage devices if, for example, the user moves to a different location or is expected to move to a different location, so that the user's data may be more efficiently accessed by the user.",
  "publication_number": "US20170330100A1-20171116",
  "summary": "<SOH> BRIEF SUMMARY <EOH>Various features described herein may be used to implement a mobile or moveable storage system. The system, in one aspect, may include a processor and one or more non-transitory computer readable media storing instructions that, when executed by the processor, cause the processor to identify, for a user, a geographical location change from a first geographical location to a second geographical location, identify a routing path to route the user's information from a first storage device associated with the first geographical location to a second storage device associated with the second geographical location, and in response to identifying the geographical location change, transfer the user's information using the identified routing path. In additional aspects, the system may implement a method that includes identifying a user's information and generating a location schedule for the user. In some aspects, the location schedule may process information identifying a first geographical location, a first time frame associated with the first geographical location, and a storage action associated with the first geographical location. In additional aspects, the storage action may identify a first cache storage. The location schedule may also process information identifying a user transition, a second time frame associated with the user transition, and a transfer action associated with the user transition. In some aspects, the transfer action may identify transfer of the user's information to the first cache storage. An aspect may also include using the location schedule to anticipate a geographical location change of the user and determining whether the first cache storage is available. In some aspects, the method may include in response to anticipating the geographical location change, moving the user's information to the first cache storage during the second time frame if the first cache storage is available. The method may also include, in some a...",
  "ipcr_labels": [
    "G06N700",
    "G06F1730",
    "G06F1730",
    "G06N504"
  ],
  "inventor_list": [
    {
      "inventor_name_last": "Bevan",
      "inventor_name_first": "Frances",
      "inventor_city": "Voohees",
      "inventor_state": "NJ",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Markowitz",
      "inventor_name_first": "David",
      "inventor_city": "Plymouth Meeting",
      "inventor_state": "PA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Rekstad",
      "inventor_name_first": "Michael",
      "inventor_city": "Langhome",
      "inventor_state": "PA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Sim",
      "inventor_name_first": "Jae",
      "inventor_city": "Upper Darby",
      "inventor_state": "PA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Stone",
      "inventor_name_first": "Christopher",
      "inventor_city": "Newtown",
      "inventor_state": "PA",
      "inventor_country": "US"
    }
  ],
  "title": "Moveable Storage",
  "decision": "PENDING",
  "_processing_info": {
    "original_size": 111781,
    "optimized_size": 3643,
    "reduction_percent": 96.74
  }
}