{
  "patent_number": "None",
  "application_number": "15449550",
  "date_published": "20170907",
  "date_produced": "20170823",
  "filing_date": "20170303",
  "main_ipcr_label": "G06N504",
  "abstract": "Systems and computerized methods for determining patterns in user activity such that user contextual information can be provided based on the patterns. Historic data associated with a first user is received and entity information is determined based on the historic data. Current location data associated with the first user is received and prediction information is generated based on a combination of the entity information and the current location data for a current time period. Contextual insight information is determined based on a combination of the prediction information with at least one of the current location data, real time data, and contextual data, the contextual insight information including a recommendation of at least one of an activity, a purchase, and an accessory associated with the current location of the first user.",
  "publication_number": "US20170255868A1-20170907",
  "summary": "<SOH> SUMMARY OF THE INVENTION <EOH>Aspects of the present disclosure relate to systems and computerized methods for determining patterns in user activity thereby providing the user contextual information based on the patterns. In some embodiments, a computing device receives historic data associated with a first user, the historic data including at least one of historic measured time-stamped location data associated with the first user, and historic inferred time-stamped location data associated with the first data user. In some embodiments, a computing device determines entity information based on the historic data, the entity information including information about user activity occurring within historic recurring time periods, the information about the user activity including at least one of a type of user activity, a time associated with the user activity, and a likelihood of the user activity occurring with the historic recurring time periods. In some embodiments, the computing device receives current location data associated with the first user, the current location data being received after the historic data, the current location data including current measured time-stamped location data associated with the first user, and current inferred time-stamped location data associated with the first data user. In some embodiments, the computing device generates prediction information based on a combination of the entity information and the current location data for a current time period, the prediction information including at least one of an assignment of a higher confidence level associated with a type of user activity occurring within at least one of the current time period and a future time period that also occurred in at least one of the historic recurring time periods, and an indication of a new type of user activity in at least one of the current time period and a future time period. In some embodiments, the computing device determines contextual insight info...",
  "ipcr_labels": [
    "G06N504",
    "G06N700"
  ],
  "inventor_list": [
    {
      "inventor_name_last": "GELINAS",
      "inventor_name_first": "Simon",
      "inventor_city": "Brooklyn",
      "inventor_state": "NY",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "VILIM",
      "inventor_name_first": "Ryan",
      "inventor_city": "Brooklyn",
      "inventor_state": "NY",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "YOSHIDA",
      "inventor_name_first": "Katherine",
      "inventor_city": "New York",
      "inventor_state": "NY",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "TAGLIABUE",
      "inventor_name_first": "Jacopo",
      "inventor_city": "New York",
      "inventor_state": "NY",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "MURPHY",
      "inventor_name_first": "Michael",
      "inventor_city": "Norwich",
      "inventor_state": "",
      "inventor_country": "GB"
    },
    {
      "inventor_name_last": "OBERLI",
      "inventor_name_first": "Roman",
      "inventor_city": "Sarnen",
      "inventor_state": "",
      "inventor_country": "CH"
    },
    {
      "inventor_name_last": "ANNICQ",
      "inventor_name_first": "Thomas",
      "inventor_city": "New York",
      "inventor_state": "NY",
      "inventor_country": "US"
    }
  ],
  "title": "SYSTEMS AND METHODS FOR PREDICTING USER BEHAVIOR BASED ON LOCATION DATA",
  "decision": "PENDING",
  "_processing_info": {
    "original_size": 66858,
    "optimized_size": 4287,
    "reduction_percent": 93.59
  }
}