{
  "patent_number": "None",
  "application_number": "15442409",
  "date_published": "20170831",
  "date_produced": "20170816",
  "filing_date": "20170224",
  "main_ipcr_label": "G06N502",
  "abstract": "An application program, system and methods are configured to implement concurrent multiuser epistemological collaboration, that is, collaborative development of a digital knowledge model based on at least one epistemological “experience,” which is stored as a structured data entity containing information that can be personally perceived (typically viewed, read, observed) by multiple concurrent users of the application over a network. The users develop the digital knowledge model, by way of GIU interactions, comprising assertion entities and belief entities based on the experience and/or selected portions of the experience defined by focus entities; wherein each set of assertion entities is related as a child of a corresponding individual experience of the set of experience entities; and each set of belief entities is related as a child of a corresponding individual assertion of the set of assertion entities.",
  "publication_number": "US20170249553A1-20170831",
  "summary": "<SOH> SUMMARY OF THE DISCLOSURE <EOH>The following is a summary of the present disclosure in order to provide a basic understanding of some features and context. This summary is not intended to identify key/critical elements of the invention or to delineate the scope of the invention. Its sole purpose is to present some concepts of the present disclosure in a simplified form as a prelude to the more detailed description that is presented later. Accordingly, it is an object of the present disclosure to provide a system, method and data structures for multiple human users to simultaneously articulate, explore, and critically examine their own and each other's views and beliefs in a graphical user interface of a computer system. It is a further object of the disclosure that this epistemological exploration be originated ultimately from phenomenological experiences which may be reproduced exactly and consistently for any and all users, providing a common object of study about which views may be formed. This exploration may be further structured through virtual windows of focus descending from a parent experience to a child experience, such as, in some embodiments, an article to its footnotes, a visual film to a specific scene, or an interview to its topic questions. It is also an object of the present disclosure to offer within this method a generic structure for separating the objective, unqualified experiences from subjective assertions about these experiences and, further, to separate personal beliefs about these assertions from the assertions themselves with the intention to permit a plurality of beliefs about assertion statements. These assertions and beliefs may be contained within assertion sets and belief sets respectively, to group analyses and personal beliefs into collections potentially matched to specific users, modes of thought, or other classifications. Another feature of the present disclosure comprises a complete method and system for a server-client ne...",
  "ipcr_labels": [
    "G06N502",
    "G09B1900",
    "G06F30482",
    "G06F30484",
    "G06N700",
    "G06F944"
  ],
  "inventor_list": [
    {
      "inventor_name_last": "Sellers-Blais",
      "inventor_name_first": "Dominic Samuel",
      "inventor_city": "Coeur d'Alene",
      "inventor_state": "ID",
      "inventor_country": "US"
    }
  ],
  "title": "METHOD FOR CONCURRENT MULTIUSER EPISTEMOLOGICAL COLLABORATION",
  "decision": "PENDING",
  "_processing_info": {
    "original_size": 43630,
    "optimized_size": 3560,
    "reduction_percent": 91.84
  }
}