{
  "patent_number": "None",
  "application_number": "15443463",
  "date_published": "20180412",
  "date_produced": "20180328",
  "filing_date": "20170227",
  "main_ipcr_label": "G06N9900",
  "abstract": "A machine learning system includes a data set processing subsystem to store data objects from multiple sources. An ensemble machine learning subsystem and a data search function may execute queries and identify related structured and unstructured data from the stored data objects. The structured and unstructured data may be used to create new data objects.",
  "publication_number": "US20180101791A1-20180412",
  "summary": "<SOH> BRIEF DESCRIPTION OF DRAWINGS <EOH>Embodiments and examples are described in detail in the following description with reference to the following figures. The embodiments are illustrated by examples shown in the accompanying figures in which like reference numerals indicate similar elements. FIG. 1 illustrates a machine learning system, according to an example; FIG. 2 illustrates a data flow diagram, according to an example; FIG. 3 illustrates a method to create a new data object, according to an example; FIGS. 4A-B illustrate hardware for a machine learning system, according to examples; FIG. 5 illustrates a machine learning system, according to another example; and FIGS. 6-10 illustrate examples of screen shots generated by a graphical user interface of the machine learning systems, according to examples. detailed-description description=\"Detailed Description\" end=\"lead\"?",
  "ipcr_labels": [
    "G06N9900",
    "G06F1730"
  ],
  "inventor_list": [
    {
      "inventor_name_last": "VISWANATHAN",
      "inventor_name_first": "Venkataraman",
      "inventor_city": "Bangalore",
      "inventor_state": "",
      "inventor_country": "IN"
    }
  ],
  "title": "ENSEMBLE MACHINE LEARNING FOR STRUCTURED AND UNSTRUCTURED DATA",
  "decision": "PENDING",
  "_processing_info": {
    "original_size": 46058,
    "optimized_size": 1824,
    "reduction_percent": 96.04
  }
}