{
  "patent_number": "None",
  "application_number": "15450315",
  "date_published": "20170921",
  "date_produced": "20170906",
  "filing_date": "20170306",
  "main_ipcr_label": "G06N3063",
  "abstract": "To provide a semiconductor device which can execute the product-sum operation. The semiconductor device includes a first memory cell, a second memory cell, and an offset circuit. First analog data is stored in the first memory cell, and reference analog data is stored in the second memory cell. The first memory cell and the second memory cell supply a first current and a second current, respectively, when a reference potential is applied as a selection signal. The offset circuit has a function of supplying a third current corresponding to a differential current between the first current and the second current. In the semiconductor device, the first memory and the second memory supply a fourth current and a fifth current, respectively, when a potential corresponding to second analog data is applied as a selection signal. By subtracting the third current from a differential current between the fourth current and the fifth current, a current that depends on the sum of products of the firs...",
  "publication_number": "US20170270405A1-20170921",
  "summary": "<SOH> BRIEF DESCRIPTION OF DRAWINGS <EOH>FIG. 1 is a block diagram showing an example of a semiconductor device. FIG. 2 is a circuit diagram showing an example of an offset circuit in the semiconductor device of FIG. 1 . FIG. 3 is a circuit diagram showing an example of an offset circuit in the semiconductor device of FIG. 1 . FIG. 4 is a circuit diagram showing an example of an offset circuit in the semiconductor device of FIG. 1 . FIG. 5 is a circuit diagram showing an example of a memory cell array in the semiconductor device of FIG. 1 . FIG. 6 is a circuit diagram showing an example of an offset circuit in the semiconductor device of FIG. 1 . FIG. 7 is a circuit diagram showing an example of a memory cell array in the semiconductor device of FIG. 1 . FIG. 8 is a timing chart showing an operation example of a semiconductor device. FIG. 9 is a timing chart showing an operation example of a semiconductor device. FIGS. 10A to 10E are a flow chart, a perspective view of an electronic component, and perspective views of a semiconductor wafer. FIGS. 11A to 11D are perspective views illustrating examples of electronic devices. FIG. 12 is a schematic view illustrating data transmission in a broadcast system. FIG. 13 illustrates a structure example of a video distribution system in a medical field. FIGS. 14A to 14C illustrate an example of a structure of a touch panel. FIGS. 15A and 15B illustrate a structure example of a pixel in a display panel of a touch panel. FIGS. 16A and 16B are cross-sectional views illustrating a structure example of a touch panel. FIGS. 17A and 17B are cross-sectional views illustrating a structure example of a touch panel. FIGS. 18A to 18C are schematic views illustrating an example of a shape of a reflective film of a display panel. FIG. 19 is a block diagram illustrating a structure example of an input portion. FIG. 20 is a circuit diagram showing a pixel of a display portion. FIGS. 21A to 21C are a top view and cross-sectional views illustra...",
  "ipcr_labels": [
    "G06N3063",
    "H01L29786",
    "G06N308",
    "G11C514"
  ],
  "inventor_list": [
    {
      "inventor_name_last": "KUROKAWA",
      "inventor_name_first": "Yoshiyuki",
      "inventor_city": "Sagamihara",
      "inventor_state": "",
      "inventor_country": "JP"
    }
  ],
  "title": "SEMICONDUCTOR DEVICE AND SYSTEM USING THE SAME",
  "decision": "PENDING",
  "_processing_info": {
    "original_size": 257847,
    "optimized_size": 3579,
    "reduction_percent": 98.61
  }
}