{
  "patent_number": "10013657",
  "application_number": "15455105",
  "date_published": "20170914",
  "date_produced": "20170830",
  "filing_date": "20170309",
  "main_ipcr_label": "G06N9900",
  "abstract": "Method and circuit for reading a value {circumflex over (σ)}z stored in a quantum information unit (qubit) memory having a qubit frequency ωa, with a resonator defined by a resonator damping rate κ, a resonator frequency ωr, a resonator electromagnetic field characterized by â† and â, a longitudinal coupling strength gz, an output âout and a longitudinal coupling gz{circumflex over (σ)}z(â†+â). At a quantum non-demolition (QND) longitudinal modulator, periodically modulating the longitudinal coupling strength gz with a signal of amplitude {tilde over (g)}z at least three (3) times greater than the resonator damping rate κ and of frequency ωm with ωm+κ resonant with ωr, wherein the longitudinal coupling strength gz varies over time (t) in accordance with gz(t)=gz+{tilde over (g)}z cos(ωmt) with gz representing an average value of gz and at a QND homodyne detector, measuring the value {circumflex over (σ)}z of the qubit memory from a phase reading of the output {circumflex over (σ)}out.",
  "publication_number": "US20170262765A1-20170914",
  "summary": "<SOH> SUMMARY <EOH>This summary is provided to introduce a selection of concepts in a simplified form that are further described below in the Detailed Description. This Summary is not intended to identify key features or essential features of the claimed subject matter, nor is it intended to be used as an aid in determining the scope of the claimed subject matter. A first aspect of the present invention is directed to a circuit quantum electrodynamics (circuit QED) implementation of a quantum information unit (qubit) memory having a qubit frequency ω a and holding a value {circumflex over (σ)} z . The circuit QED implementation comprises a resonator, a modulator and a homodyne detector. The resonator is defined by a resonator damping rate κ, a resonator frequency ω 4 , a resonator electromagnetic field characterized by â † and â, a longitudinal coupling strength g z , an output â out and a quantum non-demolition (QND) longitudinal coupling g z {circumflex over (σ)} z (â † +â). The modulator periodically modulates the longitudinal coupling strength g z with a signal of amplitude {tilde over (g)} z greater than or equal to the resonator damping rate κ and of frequency ω m with ω m +κ resonant with ω r ±a correction factor. The correction factor is smaller than |ω r /10| and the longitudinal coupling strength g z varies over time (t) in accordance with g z (t)= g z +{tilde over (g)} z cos(ω m t) with g z representing an average value of g z . The homodyne detector for measuring the value {circumflex over (σ)} z of the qubit memory from a reading of the output â out . Optionally, the correction factor may be between 0 and |ω r /100|. The homodyne detector may measure the value {circumflex over (σ)} z of the qubit memory from a phase reading of the output â out . The signal amplitude {tilde over (g)} z may be at least three (3) times greater than the resonator damping rate κ or at least ten (10) times greater than the resonator damping rate κ. The circuit QED implementat...",
  "ipcr_labels": [
    "G06N9900",
    "H01L3922",
    "G11C1144",
    "H01L3902"
  ],
  "inventor_list": [
    {
      "inventor_name_last": "Bourassa",
      "inventor_name_first": "Jerome",
      "inventor_city": "Grandby",
      "inventor_state": "",
      "inventor_country": "CA"
    }
  ],
  "title": "PERIODICAL MODULATION OF LONGITUDINAL COUPLING STRENGTH FOR QUANTUM NON-DEMOLITION QUBIT READOUT",
  "decision": "ACCEPTED",
  "_processing_info": {
    "original_size": 94433,
    "optimized_size": 3860,
    "reduction_percent": 95.91
  }
}