{
  "patent_number": "None",
  "application_number": "15459622",
  "date_published": "20171019",
  "date_produced": "20171004",
  "filing_date": "20170315",
  "main_ipcr_label": "G06N3063",
  "abstract": "A neuromorphic device includes an input device; an output device; and a neural network including a first synapse network and a second synapse network between the input device and the output device. The first synapse network includes a first synapse system having higher learning efficiency than the second synapse network, and the second synapse network includes a second synapse system having more excellent data retention capability than the first synapse network.",
  "publication_number": "US20170300810A1-20171019",
  "summary": "<SOH> SUMMARY <EOH>Various embodiments are directed to a neural network system and a neuromorphic device, which have excellent learning efficiency and an excellent data retention capability. Various objects to be achieved by the disclosure are not limited to the aforementioned objects, and those skilled in the art to which the disclosure pertains may clearly understand other objects from the following descriptions. In an embodiment, a neuromorphic device may include: an input device; an output device; and a neural network including a first synapse network and a second synapse network, the synapse network being disposed between the input device and the output device. The first synapse network may include a first synapse system having a higher learning efficiency than the second synapse network. The second synapse network may include a second synapse system having a better data retention capability than the first synapse network. The first synapse network may include a first synapse system and the second synapse network includes a plurality of second synapse systems, which are subordinated to the first synapse system. The neural network may further include a third synapse network disposed between the first synapse network and the second synapse network. The third synapse network may have a better data retention capability than the first synapse network and a worse retention capability than the second synapse network. The third synapse network may have a higher learning efficiency than the second synapse network and a lower learning efficiency than the first synapse network. The third synapse network may include a plurality of third synapse systems. The third synapse systems may be subordinated to the first synapse system. The second synapse network may include a plurality of second synapse systems. The second synapse systems may be subordinated to one of the third synapse systems. A data pattern learned by the first synapse network may be transmitted to the third syna...",
  "ipcr_labels": [
    "G06N3063",
    "G06N308"
  ],
  "inventor_list": [
    {
      "inventor_name_last": "LEE",
      "inventor_name_first": "Hyung-Dong",
      "inventor_city": "Hwaseong",
      "inventor_state": "",
      "inventor_country": "KR"
    }
  ],
  "title": "NEURAL NETWORK SYSTEM",
  "decision": "PENDING",
  "_processing_info": {
    "original_size": 53850,
    "optimized_size": 2987,
    "reduction_percent": 94.45
  }
}