{
  "patent_number": "None",
  "application_number": "15453177",
  "date_published": "20170622",
  "date_produced": "20170607",
  "filing_date": "20170308",
  "main_ipcr_label": "G06N504",
  "abstract": "Systems and methods facilitate decision support based on dynamic expression data stored in memory. The dynamic expression data includes a plurality of expressions, each expression representing a different condition that varies as a function of one or more variables. A user interface can be programmed to assign a given expression to a selected visualization space in response to a user input. A data interface can receive values from at least one data source for each variable in the given expression. An output engine can be programmed to populate the selected visualization space with information based on each condition defined by the given expression that has been assigned to the selected visualization space.",
  "publication_number": "US20170178010A1-20170622",
  "summary": "<SOH> SUMMARY <EOH>This disclosure relates to providing clinical decision support. A system to facilitate decision support can include dynamic expression data stored in memory. The dynamic expression data includes a plurality of expressions, each expression representing a different condition that varies as a function of one or more variables. A user interface can be programmed to assign a given expression to a selected visualization space in response to a user input. A data interface can receive values from at least one data source for each variable in the given expression. An output engine can be programmed to populate the selected visualization space with information based on each condition defined by the given expression that has been assigned to the selected visualization space. As another example, a graphical user interface (GUI) can provide clinical decision support. The GUI can include a GUI element associated with a patient encounter, the GUI element being presented in a visualization space and programmed to provide a status feature for a given alert condition that graphically discriminates between an alert condition and a non-alert condition for a given alert guidance based on a given expression that is assigned to the given alert guidance. After the alert condition is resolved, the status feature can be changed gradually over a predetermined time from indicating the alert condition to indicating the non-alert condition.",
  "ipcr_labels": [
    "G06N504",
    "G06F1900"
  ],
  "inventor_list": [
    {
      "inventor_name_last": "Stapelfeldt",
      "inventor_name_first": "Wolf H.",
      "inventor_city": "Ballwin",
      "inventor_state": "MO",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Reynolds",
      "inventor_name_first": "Marc R.",
      "inventor_city": "Kirtland",
      "inventor_state": "OH",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Ghosh",
      "inventor_name_first": "Bhaswati",
      "inventor_city": "Shaker Heights",
      "inventor_state": "OH",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Takla",
      "inventor_name_first": "George F.",
      "inventor_city": "Strongsville",
      "inventor_state": "OH",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Magdalla",
      "inventor_name_first": "Bishoy M.",
      "inventor_city": "Strongsville",
      "inventor_state": "OH",
      "inventor_country": "US"
    }
  ],
  "title": "CLINICAL DECISION SUPPORT SYSTEMS AND METHODS",
  "decision": "PENDING",
  "_processing_info": {
    "original_size": 119261,
    "optimized_size": 3324,
    "reduction_percent": 97.21
  }
}