{
  "patent_number": "None",
  "application_number": "15452194",
  "date_published": "20170914",
  "date_produced": "20170830",
  "filing_date": "20170307",
  "main_ipcr_label": "G06N308",
  "abstract": "A processor-implemented method for generating a multi-dimensional risk profiling data structure includes identifying one or more dimensions common to a plurality of risks along which all of the plurality of risks may be aggregated, assigning the one or more common dimensions to a top level cube structure, identifying a set of dimensions and risk drivers specific to each of the plurality of risks, and assigning each set of dimensions and risk drivers to each of a plurality of second level cubes.",
  "publication_number": "US20170262751A1-20170914",
  "summary": "<SOH> SUMMARY <EOH>In one embodiment, a processor-implemented method for generating a data structure for multi-dimensional risk profiling includes facilitating the identification of one or more dimensions that are common to a plurality of risks and along which all of the plurality of risks may be aggregated, assigning the one or more common dimensions to a top level cube structure, facilitating the identification of a set of dimensions and risk drivers specific to each of the plurality of risks, assigning each set of dimensions and risk drivers to each of a plurality of second level cubes, and enabling end user analyses of such risks by risk specific drivers while allowing viewing of aggregated risks by common dimensions. In another embodiment, a data structure includes a tangible, non-transitory, computer-readable medium storing instructions that, when executed by a processor, cause the processor to perform a method including facilitating the identification of one or more dimensions common to a plurality of risks along which all of the plurality of risks may be aggregated, assigning the one or more common dimensions to a top level cube structure, facilitating the identification of a set of dimensions and risk drivers specific to each of the plurality of risks, assigning each set of dimensions and risk drivers to each of a plurality of second level cubes, and enabling end user analyses of such risks by risk specific drivers while allowing viewing of aggregated risks by common risk dimensions. It is to be understood that both the foregoing general description and the following detailed description are exemplary and explanatory only and are not restrictive of the invention, as claimed.",
  "ipcr_labels": [
    "G06N308",
    "G06N504"
  ],
  "inventor_list": [
    {
      "inventor_name_last": "REDDY",
      "inventor_name_first": "Venu Palchuru",
      "inventor_city": "Clive",
      "inventor_state": "IA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "MOKONCHU",
      "inventor_name_first": "George Nubudem",
      "inventor_city": "Linfield",
      "inventor_state": "PA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "SWAMINATHAN",
      "inventor_name_first": "Swami Ramamurthi",
      "inventor_city": "Edison",
      "inventor_state": "NJ",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "GOPAL",
      "inventor_name_first": "Vikas",
      "inventor_city": "Lewis Center",
      "inventor_state": "OH",
      "inventor_country": "US"
    }
  ],
  "title": "DATA MODELING SYSTEMS AND METHODS FOR RISK PROFILING",
  "decision": "PENDING",
  "_processing_info": {
    "original_size": 38589,
    "optimized_size": 3225,
    "reduction_percent": 91.64
  }
}