{
  "patent_number": "None",
  "application_number": "15451141",
  "date_published": "20180215",
  "date_produced": "20180131",
  "filing_date": "20170306",
  "main_ipcr_label": "G06N700",
  "abstract": "System and method for scoring and ranking possible outcome scenarios within a range of possible outcome scenarios for a defined issue. The system and the method may practiced manually or on a computer system by defining a range of possible outcome scenarios for the defined issue, including a status quo outcome scenario, defining and ranking the factors and options associated with the defined issue, establishing pathways linking the options to the possible outcome scenarios, using reverse induction to generate a utility payoff schedule for the range of possible outcome scenarios, calculating an average influence-weighted utility payoff score for each possible outcome scenario, and ranking the possible outcome scenarios from most likely to least likely to occur based on the average influence-weighted utility payoff scores. Embodiments of the invention may also be used to determine the most likely egalitarian outcome scenario and the amount of friction for the defined issue.",
  "publication_number": "US20180046931A1-20180215",
  "summary": "<SOH> BRIEF SUMMARY OF EXEMPLARY EMBODIMENTS OF THE INVENTION <EOH>In general, embodiments of the present invention address the aforementioned needs by providing a system and method for scoring and ranking possible outcome scenarios within a range of possible outcome scenarios for a defined issue, decision, conflict or dispute. By identifying, isolating and rank ordering the factors and options associated with the range of possible outcome scenarios for the defined issue, embodiments of the invention provide more accurate expected utility values for each one of the possible outcome scenarios for each one of the agents and/or stakeholders. In addition to isolating and ranking the factors and options associated with the range of possible outcome scenarios, embodiments of the present invention also identify a status quo outcome scenario and take into account the utility payoffs for each stakeholder relative to the status quo outcome scenario. Furthermore, some embodiments of the present invention also receive and factor in the relative influences and levels of concern about the issue for all of the stakeholders in order to calculate average-influence-weighted payoffs for each outcome scenario in the range of possible outcome scenarios. The average influence-weighted payoffs are then used to generate more trustworthy scores and rankings for the possible outcome scenarios for any defined issue. Embodiments of the present invention also generate landscape visualizations for the issue, which improves users' ability to recognize and comprehend the differences between the stated positions of the stakeholders and the true positions of the stakeholders across the defined issue spectrum, and thereby make more reliable predictions about outcomes. The defined issue may be simple or complex, and may or may not be the subject of extended, delicate or contentious negotiations between multiple agents and/or stakeholders. The defined issue could arise, for example, from local, regiona...",
  "ipcr_labels": [
    "G06N700",
    "G06Q3004"
  ],
  "inventor_list": [
    {
      "inventor_name_last": "Bagherpour",
      "inventor_name_first": "Amir",
      "inventor_city": "Laguna Niguel",
      "inventor_state": "CA",
      "inventor_country": "US"
    }
  ],
  "title": "Method and Apparatus for Quantitatively Ranking Possible Outcome Scenarios for Issues Involving Multiple Stakeholders",
  "decision": "PENDING",
  "_processing_info": {
    "original_size": 245065,
    "optimized_size": 3610,
    "reduction_percent": 98.53
  }
}