{
  "patent_number": "None",
  "application_number": "15452739",
  "date_published": "20180524",
  "date_produced": "20180509",
  "filing_date": "20170308",
  "main_ipcr_label": "G06N300",
  "abstract": "A communications system with smart agent robots includes a message interface, a first agent robot, a friend agent robot and a friend message interface. The message interface is used for inputting message data. The first agent robot is connected to the message interface for integrating and transceiving the message data automatically. The friend agent robot is connected to the first agent robot for communicating with the first agent robot. The friend message interface is connected to the friend agent robot for communicating with the first agent robot.",
  "publication_number": "US20180144236A1-20180524",
  "summary": "<SOH> SUMMARY OF THE INVENTION <EOH>In an embodiment of the present invention, a communications system with smart agent robots is disclosed. The communications system includes a message interface, a first agent robot, a friend agent robot, and a friend message interface. The first agent robot is connected to the message interface and used to automatically integrate and transceive the message data. The friend agent robot is connected to the first agent robot and used to communicate with the first agent robot. The friend message interface is connected to the friend agent robot and used to communicate with the first agent robot. These and other objectives of the present invention will no doubt become obvious to those of ordinary skill in the art after reading the following detailed description of the preferred embodiment that is illustrated in the various figures and drawings.",
  "ipcr_labels": [
    "G06N300",
    "H04L1258",
    "G06N9900"
  ],
  "inventor_list": [
    {
      "inventor_name_last": "Tan",
      "inventor_name_first": "Der-Hwa",
      "inventor_city": "Hsinchu",
      "inventor_state": "",
      "inventor_country": "TW"
    }
  ],
  "title": "Communications System with Smart Agent Robots for Accessing Message Data",
  "decision": "PENDING",
  "_processing_info": {
    "original_size": 34272,
    "optimized_size": 2017,
    "reduction_percent": 94.11
  }
}