{
  "patent_number": "None",
  "application_number": "15456429",
  "date_published": "20170629",
  "date_produced": "20170614",
  "filing_date": "20170310",
  "main_ipcr_label": "G06N308",
  "abstract": "In one embodiment, the present invention provides a neural network comprising multiple modalities. Each modality comprises multiple neurons. The neural network further comprises an interconnection lattice for cross-associating signaling between the neurons in different modalities. The interconnection lattice includes a plurality of perception neuron populations along a number of bottom-up signaling pathways, and a plurality of action neuron populations along a number of top-down signaling pathways. Each perception neuron along a bottom-up signaling pathway has a corresponding action neuron along a reciprocal top-down signaling pathway. An input neuron population configured to receive sensory input drives perception neurons along a number of bottom-up signaling pathways. A first set of perception neurons along bottom-up signaling pathways drive a first set of action neurons along top-down signaling pathways. Action neurons along a number of top-down signaling pathways drive an output ne...",
  "publication_number": "US20170185896A1-20170629",
  "summary": "<SOH> SUMMARY <EOH>In one embodiment, the present invention provides a neural network comprising multiple modalities. Each modality comprises multiple neurons. The neural network further comprises an interconnection lattice for cross-associating signaling between the neurons in different modalities. Each neuron generates a signal in response to input signals from one or more other neurons via the interconnection lattice. The interconnection lattice comprises a plurality of reciprocal signaling pathways for directed information flow between different modalities. The plurality of reciprocal signaling pathways comprises top-down signaling pathways and bottom-up signaling pathways configured for information flow in a first direction and a second direction opposite to the first direction, respectively. Each bottom-up signaling pathway has a reciprocal top-down signaling pathway, such that bottom-up signaling pathways for a first set of modalities influence top-down signaling pathways for a second set of modalities via learning rules. In another embodiment, the present invention provides a neural network comprising a first set and a second set of neural nodes. Each node of the first set comprises multiple neuron populations including multiple neurons. Each node of the second set is a union of at least two nodes of the first set. The neural network further comprises an interconnect network comprising multiple directed edges that connect neuron in nodes of the first set with neurons in nodes of the second set. Nodes of the first and second set are arranged in a lattice. A connected node of the second set exchanges signals with at least two nodes of the first set via the interconnect network. Each neuron generates a firing signal in response to input signals from one or more other neurons via the interconnect network. In yet another embodiment, the present invention provides a method comprising interconnecting a plurality of neural nodes via an interconnect network of multip...",
  "ipcr_labels": [
    "G06N308",
    "G06N304"
  ],
  "inventor_list": [
    {
      "inventor_name_last": "Modha",
      "inventor_name_first": "Dharmendra S.",
      "inventor_city": "San Jose",
      "inventor_state": "CA",
      "inventor_country": "US"
    }
  ],
  "title": "MULTI-MODAL NEURAL NETWORK FOR UNIVERSAL, ONLINE LEARNING",
  "decision": "PENDING",
  "_processing_info": {
    "original_size": 79322,
    "optimized_size": 3565,
    "reduction_percent": 95.51
  }
}