{
  "patent_number": "None",
  "application_number": "15451879",
  "date_published": "20180524",
  "date_produced": "20180509",
  "filing_date": "20170307",
  "main_ipcr_label": "G06N504",
  "abstract": "Systems and methods are provided for receiving a query created by a user, tokenizing the query to identify a plurality of elements for the query using a knowledge data source, determining whether additional elements should be included in the plurality of elements, and identifying at least one intent of the query based on the plurality of elements. The systems and methods further provide for identifying at least one function to perform to retrieve data associated with the intent of the query, performing the at least one function to produce an output of the function, and generating a response to the query based on the output of the function.",
  "publication_number": "US20180144257A1-20180524",
  "summary": "<SOH> BRIEF DESCRIPTION OF THE DRAWINGS <EOH>Various ones of the appended drawings merely illustrate example embodiments of the present disclosure and should not be considered as limiting its scope. FIG. 1 is a block diagram illustrating a networked system, according to some example embodiments. FIG. 2 is a block diagram illustrating the building blocks of a cognitive enterprise system, according to some example embodiments. FIG. 3 is a block diagram illustrating data discovery and knowledge, according to some example embodiments. FIG. 4 is a flow chart illustrating aspects of a method, according to some example embodiments, for dynamic intent capturing. FIG. 5 illustrates an example a user interface for a cognitive enterprise system, according to some example embodiments. FIG. 6 is a flow chart illustrating aspects of a method, according to some example embodiments, for generating a dynamic knowledge graph. FIGS. 7A and 7B are a block diagram illustrating dynamic knowledge graph and query response generation, according to some example embodiments. FIG. 8 is a block diagram illustrating an example of a software architecture that may be installed on a machine, according to some example embodiments. FIG. 9 illustrates a diagrammatic representation of a machine, in the form of a computer system, within which a set of instructions may be executed for causing the machine to perform any one or more of the methodologies discussed herein, according to an example embodiment. detailed-description description=\"Detailed Description\" end=\"lead\"?",
  "ipcr_labels": [
    "G06N504",
    "G06F1730"
  ],
  "inventor_list": [
    {
      "inventor_name_last": "Ankisettipalli",
      "inventor_name_first": "Anil Babu",
      "inventor_city": "Sunnyvale",
      "inventor_state": "CA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Uppuluri",
      "inventor_name_first": "Karthik",
      "inventor_city": "Mountain View",
      "inventor_state": "CA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Blechschmidt",
      "inventor_name_first": "Frank",
      "inventor_city": "Mountain View",
      "inventor_state": "CA",
      "inventor_country": "US"
    }
  ],
  "title": "COGNITIVE ENTERPRISE SYSTEM",
  "decision": "PENDING",
  "_processing_info": {
    "original_size": 80078,
    "optimized_size": 3055,
    "reduction_percent": 96.18
  }
}