{
  "patent_number": "None",
  "application_number": "15450395",
  "date_published": "20170914",
  "date_produced": "20170830",
  "filing_date": "20170306",
  "main_ipcr_label": "G06N308",
  "abstract": "A risk prediction method executed by a computer of a risk predictor using a convolutional neural network, the method including making the convolutional neural network acquire an input image taken by an in-vehicle camera installed on a vehicle, making the convolutional neural network estimate a risk area and a feature of the risk area, the risk area being in the acquired input image, the risk area having a possibility that a moving object may appear from the risk area into a travelling path of the vehicle and the moving object may collide with the vehicle in a case where the vehicle simply continues running, and making the convolutional neural network output the estimated risk area and the estimated feature of the risk area as a risk predicted for the input image.",
  "publication_number": "US20170262750A1-20170914",
  "summary": "<SOH> SUMMARY <EOH>In one general aspect, the techniques disclosed here feature a risk prediction method executed by a computer of a risk predictor using a convolutional neural network, the method including making the convolutional neural network acquire an input image taken by an in-vehicle camera installed on a vehicle, making the convolutional neural network estimate a risk area and a feature of the risk area, the risk area being in the acquired input image, the risk area having a possibility that a moving object may appear from the risk area into a travelling path of the vehicle and the moving object may collide with the vehicle in a case where the vehicle simply continues running, and then making the convolutional neural network output the estimated risk area and the estimated feature of the risk area as a risk predicted for the input image. The present disclosure makes it possible to realize a risk prediction method capable of predicting a risk area having a possibility of causing a dangerous situation for a running vehicle. It should be noted that general or specific embodiments may be implemented as a system, a method, an integrated circuit, a computer program, a storage medium, or any selective combination thereof. Additional benefits and advantages of the disclosed embodiments will become apparent from the specification and drawings. The benefits and/or advantages may be individually obtained by the various embodiments and features of the specification and drawings, which need not all be provided in order to obtain one or more of such benefits and/or advantages.",
  "ipcr_labels": [
    "G06N308",
    "G08G116",
    "G06K900",
    "G06K966",
    "G06N504",
    "H04N718"
  ],
  "inventor_list": [
    {
      "inventor_name_last": "KOZUKA",
      "inventor_name_first": "KAZUKI",
      "inventor_city": "Osaka",
      "inventor_state": "",
      "inventor_country": "JP"
    },
    {
      "inventor_name_last": "ISHII",
      "inventor_name_first": "YASUNORI",
      "inventor_city": "Osaka",
      "inventor_state": "",
      "inventor_country": "JP"
    },
    {
      "inventor_name_last": "SAITO",
      "inventor_name_first": "MASAHIKO",
      "inventor_city": "Osaka",
      "inventor_state": "",
      "inventor_country": "JP"
    },
    {
      "inventor_name_last": "FUCHIKAMI",
      "inventor_name_first": "TETSUJI",
      "inventor_city": "Osaka",
      "inventor_state": "",
      "inventor_country": "JP"
    }
  ],
  "title": "RISK PREDICTION METHOD",
  "decision": "PENDING",
  "_processing_info": {
    "original_size": 65063,
    "optimized_size": 3357,
    "reduction_percent": 94.84
  }
}