{
  "patent_number": "None",
  "application_number": "15457001",
  "date_published": "20170921",
  "date_produced": "20170906",
  "filing_date": "20170313",
  "main_ipcr_label": "G06N700",
  "abstract": "It is an object to attain both of a privacy protection and an elimination of a timing gap. The object is accomplished by providing: an estimating unit for estimating use possibility of a service for each user; a classifying unit for classifying a plurality of users into groups on the basis of a similarity between the use possibility and context information of the plurality of users according to the service; and a generating unit for generating disclosure information which is disclosed to a providing source side of the service for each group on the basis of the context information of the users included in the group.",
  "publication_number": "US20170270422A1-20170921",
  "summary": "<SOH> SUMMARY OF THE INVENTION <EOH>According to an aspect of the invention, there is provided an information processing apparatus comprising: an estimating unit configured to estimate use possibility of a service for each user; a classifying unit configured to classify a plurality of users into groups on the basis of a similarity between the use possibility and context information of the plurality of users according to the service; and a generating unit configured to generate disclosure information which is disclosed to a providing source side of the service for each of the groups on the basis of the context information of the users included in the group. According to the invention, both of the protection of privacy and the elimination of the timing gap can be attained. Further features of the present invention will become apparent from the following description of exemplary embodiments with reference to the attached drawings.",
  "ipcr_labels": [
    "G06N700",
    "G06N9900"
  ],
  "inventor_list": [
    {
      "inventor_name_last": "Sorakado",
      "inventor_name_first": "Hideki",
      "inventor_city": "Tokyo",
      "inventor_state": "",
      "inventor_country": "JP"
    }
  ],
  "title": "INFORMATION PROCESSING APPARATUS, INFORMATION PROCESSING METHOD, AND PROGRAM",
  "decision": "PENDING",
  "_processing_info": {
    "original_size": 100158,
    "optimized_size": 2133,
    "reduction_percent": 97.87
  }
}