{
  "patent_number": "None",
  "application_number": "15469389",
  "date_published": "20170713",
  "date_produced": "20170627",
  "filing_date": "20170324",
  "main_ipcr_label": "G06N504",
  "abstract": "A computer-based system and associated processes are disclosed for making personality-related recommendations to an entity. The system receives indications of one or more personality attributes of an entity. The system acquires indications of one or more personality attributes of a desired partner of the entity. The system applies a mathematical model to the one or more personality attributes of the entity and the one or more personality attributes of the desired partner of the entity. The mathematical model calculates one or more recommended changes to the personality attributes of the entity to increase a predicted relationship satisfaction score between the entity and the desired partner. The system selects a recommended action from a database of recommended actions, based at least in part on the recommended changes to the personality attributes of the entity. The system presents the recommended action.",
  "publication_number": "US20170200086A1-20170713",
  "summary": "<SOH> SUMMARY <EOH>Advances in mathematics, data analysis, and computer technology make possible automated predictions and recommendations that may be brought to bear in the area of matchmaking and relationship guidance. Disclosed herein are various systems and methods of processing personality information, to provide such useful outputs as recommendations for individuals, appropriate matches with potential partners, and other advice and insights. The outputs may be personally tailored to particular attributes of individuals through automatic computer analysis and the application of data models incorporating potentially vast quantities of historical and other input data. Additionally, modern technology enables the presentation of effective and accessible user interfaces where individuals may take advantage of the aforementioned data analysis, recommendations, guidance, and insights in a convenient and efficient manner. Disclosed aspects include the generation and application of statistical, mathematical, and/or other models for assessing relationship satisfaction based on attributes, such as personality attributes. For example, metrics for two individuals relating to five personality attributes, namely openness, conscientiousness, extraversion, agreeableness and neuroticism, may be used to predict a likelihood of relationship satisfaction for either of the two individuals, through such models. The models may be implemented and operated through various computing devices and systems. Such models may then be applied to produce practical and useful information, in various embodiments. One such useful application of these models is to generate recommendations for individuals as to how to improve their compatibilities with potential or hypothetical partners. For example, referring to the five attributes identified previously, an individual may provide personality attributes for that individual and a desired partner, and the models may be used to determine that the individ...",
  "ipcr_labels": [
    "G06N504",
    "G06F1750",
    "G06F1730"
  ],
  "inventor_list": [
    {
      "inventor_name_last": "Margines",
      "inventor_name_first": "Edward Y.",
      "inventor_city": "Santa Ana",
      "inventor_state": "CA",
      "inventor_country": "US"
    }
  ],
  "title": "SYSTEMS AND METHODS OF PROCESSING PERSONALITY INFORMATION",
  "decision": "PENDING",
  "_processing_info": {
    "original_size": 70474,
    "optimized_size": 3494,
    "reduction_percent": 95.04
  }
}