{
  "patent_number": "None",
  "application_number": "15468218",
  "date_published": "20170713",
  "date_produced": "20170627",
  "filing_date": "20170324",
  "main_ipcr_label": "G06N300",
  "abstract": "A succession of conversations is facilitated between a user of a device and a non-human companion portrayed on the device, to develop a relationship between the user and the nonhuman companion over a time period that spans the successive conversations. The relationship is developed between the user and the non-human companion to cause a change in a state of the user over the time period. A conversation is facilitated by presenting a segment of speech of the non-human companion to the user and detecting a segment of speech of the user, the segments including a portion of the conversation. At the device, information is received from an intelligent agent about a next segment of speech to be presented to the user, as determined by the intelligent agent based on intelligent processes applied to the segment of speech of the user and to the change in state to be caused.",
  "publication_number": "US20170200075A1-20170713",
  "summary": "<SOH> SUMMARY <EOH>In general, in an aspect, successive conversations are facilitated between a user of a device and a non-human companion portrayed on the device, to develop a relationship between the user and the non-human companion over a time period that spans the successive conversations. The relationship is developed between the user and the non-human companion to cause a change in a state of the user over the time period. Each of the successive conversations is facilitated by actions that include the following. A segment of speech of the non-human companion is presented to the user. A segment of speech of the user is detected. The user's segment of speech and the segment of speech presented to the user include portion of the conversation. At the device, information is received from an intelligent agent about a next segment of speech to be presented to the user, as determined by the intelligent agent based on intelligent processes applied to the segment of speech of the user and to the change in state to be caused. Implementations may include one or a combination of any two or more of the following features. The companion is portrayed through speech and images or video. The companion is portrayed as an animated character. The relationship is caused to change over time. Characteristics or behavior or both of the companion change over time based on intelligent processes of the intelligent agent. The time period over which the relationship is developed is at least a year. The change in state includes an improvement in a diagnosed psychological or behavioral condition. The developing of the relationship to cause the change of state includes therapy. The therapy includes affinity therapy and the user is autistic. Non-interaction with the user is facilitated. The non-speech interaction includes presenting information to the user. The information is presented on a display of the device. The non-speech interaction includes receiving input from the user. The intelligen...",
  "ipcr_labels": [
    "G06N300",
    "G09B1904",
    "G10L1522",
    "G06N504",
    "G10L1308",
    "G10L13033"
  ],
  "inventor_list": [
    {
      "inventor_name_last": "Suskind",
      "inventor_name_first": "Ronald Steven",
      "inventor_city": "Cambridge",
      "inventor_state": "MA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Suskind",
      "inventor_name_first": "H. Owen",
      "inventor_city": "Cambridge",
      "inventor_state": "MA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Suskind",
      "inventor_name_first": "Cornelia Kennedy",
      "inventor_city": "Cambridge",
      "inventor_state": "MA",
      "inventor_country": "US"
    }
  ],
  "title": "DIGITAL COMPANIONS FOR HUMAN USERS",
  "decision": "PENDING",
  "_processing_info": {
    "original_size": 70581,
    "optimized_size": 3773,
    "reduction_percent": 94.65
  }
}