{
  "patent_number": "None",
  "application_number": "15461250",
  "date_published": "20170921",
  "date_produced": "20170906",
  "filing_date": "20170316",
  "main_ipcr_label": "G06N308",
  "abstract": "Examples of the present disclosure provide systems and methods relating to a machine comprehension test with a learning-based approach, harnessing neural networks arranged in a parallel hierarchy. This parallel hierarchy enables the model to compare the passage, question, and answer from a variety of perspectives, as opposed to using a manually designed set of features. Perspectives may range from the word level to sentence fragments to sequences of sentences, and networks operate on word-embedding representations of text. A training methodology for small data is also provided.",
  "publication_number": "US20170270409A1-20170921",
  "summary": "<SOH> SUMMARY <EOH>A machine comprehension system with a learning-based approach, harnessing neural networks arranged in a parallel hierarchy is provided. This parallel hierarchy enables the model to compare the passage, question, and answer from a variety of perspectives, as opposed to using a manually designed set of features. Perspectives may range from the word level to sentence fragments to sequences of sentences, and networks operate on word-embedding representations of text. A training methodology for small data is also provided. This Summary is provided to introduce a selection of concepts in a simplified form that are further described below in the Detailed Description. This Summary is not intended to identify key features or essential features of the claimed subject matter, nor is it intended to be used to limit the scope of the claimed subject matter. Additional aspects, features, and/or advantages of examples will be set forth in part in the description which follows and, in part, will be apparent from the description, or may be learned by practice of the disclosure.",
  "ipcr_labels": [
    "G06N308",
    "G06F1727",
    "G06N502"
  ],
  "inventor_list": [
    {
      "inventor_name_last": "Trischler",
      "inventor_name_first": "Adam",
      "inventor_city": "Montreal",
      "inventor_state": "",
      "inventor_country": "CA"
    },
    {
      "inventor_name_last": "Ye",
      "inventor_name_first": "Zheng",
      "inventor_city": "Wuhan",
      "inventor_state": "",
      "inventor_country": "CN"
    },
    {
      "inventor_name_last": "Yuan",
      "inventor_name_first": "Xingdi",
      "inventor_city": "Montreal",
      "inventor_state": "",
      "inventor_country": "CA"
    },
    {
      "inventor_name_last": "Bachman",
      "inventor_name_first": "Philip",
      "inventor_city": "Montreal",
      "inventor_state": "",
      "inventor_country": "CA"
    }
  ],
  "title": "PARALLEL-HIERARCHICAL MODEL FOR MACHINE COMPREHENSION ON SMALL DATA",
  "decision": "PENDING",
  "_processing_info": {
    "original_size": 58453,
    "optimized_size": 2676,
    "reduction_percent": 95.42
  }
}