{
  "patent_number": "None",
  "application_number": "15461748",
  "date_published": "20170706",
  "date_produced": "20170621",
  "filing_date": "20170317",
  "main_ipcr_label": "G06N504",
  "abstract": "A method for inferring patterns in multi-dimensional image data comprises providing a recursive network of sub-networks with a parent feature node and at least two child feature nodes; wherein each sub-network is associated with a distinct subset of the space; configuring nodes of the sub-networks with posterior distribution component; receiving image data feature input at the final child feature nodes; propagating node activation through the network layer hierarchy in a manner consistent with node connections of sub-networks of the network and the posterior prediction of child nodes; and outputting parent feature node selection to an inferred output.",
  "publication_number": "US20170193374A1-20170706",
  "summary": "<SOH> BRIEF DESCRIPTION OF THE FIGURES <EOH>FIGS. 1A and 1B are schematic representations of systems of a preferred embodiment; FIG. 2 is a schematic representation of a generalized representation of a system of a preferred embodiment; FIG. 3 is a schematic representation of a sub-network of a preferred embodiment; FIG. 4 is a schematic representation of a sub-network for generating patterns with lateral constraint nodes of a preferred embodiment; FIG. 5 is a schematic representation of a sub-network for generating patterns with external constraint nodes of a preferred embodiment; FIG. 6 is a schematic representation of a sub-network for generating patterns with temporal constraint nodes of a preferred embodiment; FIG. 7 is a schematic representation of a sub-network for inferring patterns of a preferred embodiment; FIG. 8 is a schematic representation of a network variation with two sub-networks sharing child feature nodes of a preferred embodiment; FIG. 9 is an exemplary schematic representation of a network variation with multiple sub-networks divided between two layers, some of which share child feature nodes; FIG. 10 is a schematic representation of a method for creating a network of a preferred embodiment; FIG. 11 is an exemplary implementation of a method for creation of a network; FIG. 12 is a schematic representation of a method for generating a pattern of a preferred embodiment; FIG. 13 is a schematic representation of a method for inferring patterns from a network of a preferred embodiment; FIG. 14 is a schematic representation of a network with a variety of constraint nodes. detailed-description description=\"Detailed Description\" end=\"lead\"?",
  "ipcr_labels": [
    "G06N504",
    "G06K966",
    "G06N304"
  ],
  "inventor_list": [
    {
      "inventor_name_last": "George",
      "inventor_name_first": "Dileep",
      "inventor_city": "Union City",
      "inventor_state": "CA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Kansky",
      "inventor_name_first": "Kenneth",
      "inventor_city": "Union City",
      "inventor_state": "CA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Phoenix",
      "inventor_name_first": "D. Scott",
      "inventor_city": "Union City",
      "inventor_state": "CA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Marthi",
      "inventor_name_first": "Bhaskara",
      "inventor_city": "Union City",
      "inventor_state": "CA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Laan",
      "inventor_name_first": "Christopher",
      "inventor_city": "Union City",
      "inventor_state": "CA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Lehrach",
      "inventor_name_first": "Wolfgang",
      "inventor_city": "Union City",
      "inventor_state": "CA",
      "inventor_country": "US"
    }
  ],
  "title": "SYSTEM AND METHOD FOR A RECURSIVE CORTICAL NETWORK",
  "decision": "PENDING",
  "_processing_info": {
    "original_size": 93657,
    "optimized_size": 3655,
    "reduction_percent": 96.1
  }
}