{
  "patent_number": "None",
  "application_number": "15464254",
  "date_published": "20180208",
  "date_produced": "20180124",
  "filing_date": "20170320",
  "main_ipcr_label": "G06N9900",
  "abstract": "A problem of finding unknown associations between ‘concepts’ in a given text corpus is addressed. A new framework for computing and visualizing the association between concepts using the generic association measures and the public knowledge available in data sources such as Wikipedia. Indirect association analysis extends the utility of the proposed framework to a broader class of association mining applications including the interesting area of new hypothesis generation.",
  "publication_number": "US20180039909A1-20180208",
  "summary": "<SOH> SUMMARY <EOH>This document describes systems and methods for mining associations of concepts gathered from large-scale unstructured data, and providing visualizations of those mined associations of concepts. Generally, the problem addressed can be described as follows: given a large-scale dictionary of concepts, and a text corpus, pairs of concepts which are “associated” to each other can be determined. The association can be interpreted in a particular domain of study. For instance, a disease is associated with its symptoms, or a drug is associated with the disease(s) it can cure or the side effects resulted by using the drug. The text corpus given as the reference knowledge contains information about the concepts contained in the input dictionary in the format of text. It is then determined whether two given concepts are associated. Implementations of the current subject matter can include, but are not limited to, systems and methods consistent with implementations described herein, as well as articles that comprise a tangibly embodied machine-readable medium operable to cause one or more machines (e.g., computers, etc.) to result in operations described herein. Similarly, computer systems are also described that may include one or more processors and one or more memories coupled to the one or more processors. A memory, which can include a computer-readable storage medium, may include, encode, store, or the like one or more programs that cause one or more processors to perform one or more of the operations described herein. Computer implemented methods consistent with one or more implementations of the current subject matter can be implemented by one or more data processors residing in a single computing system or multiple computing systems. Such multiple computing systems can be connected and can exchange data and/or commands or other instructions or the like via one or more connections, including but not limited to a connection over a network (e.g. the Int...",
  "ipcr_labels": [
    "G06N9900",
    "G06K962",
    "G06F1730",
    "G06F1924"
  ],
  "inventor_list": [
    {
      "inventor_name_last": "Sadoddin",
      "inventor_name_first": "Reza",
      "inventor_city": "San Jose",
      "inventor_state": "CA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Driollet",
      "inventor_name_first": "Osvaldo A.",
      "inventor_city": "San Diego",
      "inventor_state": "CA",
      "inventor_country": "US"
    }
  ],
  "title": "Mining and Visualizing Associations of Concepts on a Large-scale Unstructured Data",
  "decision": "PENDING",
  "_processing_info": {
    "original_size": 48012,
    "optimized_size": 3256,
    "reduction_percent": 93.22
  }
}