{
  "patent_number": "None",
  "application_number": "15465412",
  "date_published": "20170928",
  "date_produced": "20170915",
  "filing_date": "20170321",
  "main_ipcr_label": "G06N300",
  "abstract": "Techniques and architectures for analyzing conversations between users and virtual assistants to identify instances where the virtual assistants have not satisfied user requests are described. The techniques and architectures may use such analysis to tag conversations regarding unsatisfied user requests, provide information to users regarding conversations with unsatisfied user requests, learn conversation or contextual data for unsatisfied user requests, and/or perform a variety to other processes to improve the virtual assistants.",
  "publication_number": "US20170277993A1-20170928",
  "summary": "<SOH> BRIEF DESCRIPTION OF THE DRAWINGS <EOH>The detailed description is set forth with reference to the accompanying figures. In the figures, the left-most digit(s) of a reference number identifies the figure in which the reference number first appears. The use of the same reference numbers in different figures indicates similar or identical items or features. FIG. 1 illustrates an example architecture in which techniques described herein may be implemented. FIG. 2 illustrates an example process for learning data associated with a failure of a virtual assistant. FIG. 3 illustrates an example process for learning data associated with an escalation to a human representative and escalating a conversation based on such learning. FIGS. 4A-4B illustrate an example process to filter conversations and/or turns. FIG. 5 illustrates details of an example virtual assistant service. FIG. 6 illustrates details of an example smart device. detailed-description description=\"Detailed Description\" end=\"lead\"?",
  "ipcr_labels": [
    "G06N300",
    "G06N9900"
  ],
  "inventor_list": [
    {
      "inventor_name_last": "Beaver",
      "inventor_name_first": "Ian",
      "inventor_city": "Spokane Valley",
      "inventor_state": "WA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Brown",
      "inventor_name_first": "Fred A.",
      "inventor_city": "Colbert",
      "inventor_state": "WA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Freeman",
      "inventor_name_first": "Cynthia",
      "inventor_city": "Albuquerque",
      "inventor_state": "NM",
      "inventor_country": "US"
    }
  ],
  "title": "VIRTUAL ASSISTANT ESCALATION",
  "decision": "PENDING",
  "_processing_info": {
    "original_size": 92274,
    "optimized_size": 2372,
    "reduction_percent": 97.43
  }
}