{
  "patent_number": "None",
  "application_number": "15469647",
  "date_published": "20171005",
  "date_produced": "20170920",
  "filing_date": "20170327",
  "main_ipcr_label": "G06N300",
  "abstract": "A personalized data backup application logs all user actions performed with the user's electronic files. During operation, all files modified by user actions, such as sending messages, uploading images or videos, taking pictures/videos, posting on social networks or in the chats, activating voice or sensory devices, are detected. These files can be located on user's mobile device or computer system. Then, the user backups reflecting data modified by the user on different devices are used to identify user actions based on the modified user data. The user actions are then used to create and/or train a personal behavior avatar that can act as the user to perform some online or electronic action based on the user heuristic patterns stored into the avatar.",
  "publication_number": "US20170286824A1-20171005",
  "summary": "<SOH> SUMMARY <EOH>Accordingly, the present disclosure is related to a system and method for backup and recovery of personalized user data that substantially obviates one or more of the disadvantages of the related art. Moreover, the present disclosure provides a system and method that creates a user behavioral avatar based on the actions related to the personalized user data. In one aspect of the disclosure, a personalized data backup application logs all user actions performed with the user's electronic files. During operation, all files modified by user actions, such as sending messages, uploading images or videos, taking pictures/videos, posting on social networks or in the chats, activating voice or sensory devices, are detected. These files can be located on user's mobile device or computer system. Then, the user backups reflecting data modified by the user on different devices are used to identify user actions based on the modified user data. The user actions are then used to create and/or train a personal behavior avatar that can act as the user to perform some online or electronic action based on the user heuristic patterns used to generate and train the user behavioral avatar, which can be a software algorithm, for example. According to another exemplary aspect, a method is provided for generating a user behavioral avatar for a user based on backup of personalized user data. In this aspect, the method includes storing, in electronic memory of at least one electronic device, a plurality of user data items; tracking, by at least one processor, user actions on the at least one electronic device and user actions on external resources communicatively coupled to the at least one electronic device to detect at least one modified user data item of the plurality of user data items that is modified directly or indirectly by the user actions on the at least one electronic device and on the external resources; converting, by the at least one processor, the at least on...",
  "ipcr_labels": [
    "G06N300",
    "G06N9900"
  ],
  "inventor_list": [
    {
      "inventor_name_last": "Tormasov",
      "inventor_name_first": "Alexander",
      "inventor_city": "Moscow",
      "inventor_state": "",
      "inventor_country": "RU"
    },
    {
      "inventor_name_last": "Protasov",
      "inventor_name_first": "Stanislav S.",
      "inventor_city": "Moscow",
      "inventor_state": "",
      "inventor_country": "RU"
    },
    {
      "inventor_name_last": "Beloussov",
      "inventor_name_first": "Serguei M.",
      "inventor_city": "Costa Del Sol",
      "inventor_state": "",
      "inventor_country": "SG"
    },
    {
      "inventor_name_last": "Shmulevich",
      "inventor_name_first": "Mark",
      "inventor_city": "Moscow",
      "inventor_state": "",
      "inventor_country": "RU"
    }
  ],
  "title": "SYSTEM AND METHOD FOR GENERATING USER BEHAVIORAL AVATAR BASED ON PERSONALIZED BACKUP",
  "decision": "PENDING",
  "_processing_info": {
    "original_size": 76853,
    "optimized_size": 3796,
    "reduction_percent": 95.06
  }
}