{
  "patent_number": "None",
  "application_number": "15467362",
  "date_published": "20180308",
  "date_produced": "20180222",
  "filing_date": "20170323",
  "main_ipcr_label": "G06N9900",
  "abstract": "A system (e.g., content management system), a recommender system, a storage device, and various methods are described herein that improves with the aid of human (expert) judgment the online-learning for item-item similarity (e.g., movie-movie similarity).",
  "publication_number": "US20180068232A1-20180308",
  "summary": "<SOH> SUMMARY <EOH>A system, a recommender system, a storage device, and various methods which address the aforementioned problem are described in the independent claims. Advantageous embodiments of the system, the recommender system, the storage device, and the various method are further described in the dependent claims. In one aspect, the present disclosure provides a system (e.g., content management system) which comprises a recommender system, a first GUI (which is used by a human operator-expert), and a storage device. The first GUI is configured to transmit metadata of a media item to the recommender system. The recommender system is configured to use the metadata of the media item and a similarity model to find at least one of: (1) suggested similar items associated with the media item, and (2) suggested items from same series associated with the media item. The recommender system is further configured to send a first fetch command to the storage device to have the at least one of: (1) the suggested similar items associated with the media item, and (2) the suggested items from same series associated with the media item sent to the first GUI. The first GUI is configured to display the at least one of: (1) the suggested similar items associated with the media item, and (2) the suggested items from same series associated with the media item and further configured to enable an operator to correct the at least one of: (1) the suggested similar items associated with the media item, and (2) the suggested items from same series associated with the media item to provide at least one of: (1) corrected similar items associated with the media item, and (2) corrected items from same series associated with the media item. The first GUI is further configured to send the at least one of: (1) the corrected similar items associated with the media item, and (2) the corrected items from same series associated with the media item to the recommender system. The recommender system...",
  "ipcr_labels": [
    "G06N9900",
    "G06F1730",
    "G06F30482"
  ],
  "inventor_list": [
    {
      "inventor_name_last": "Hari Haran",
      "inventor_name_first": "Alvin Jude",
      "inventor_city": "Sunnyvale",
      "inventor_state": "CA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Forgeat",
      "inventor_name_first": "Julien",
      "inventor_city": "San Jose",
      "inventor_state": "CA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Brodin",
      "inventor_name_first": "Per-Erik",
      "inventor_city": "Los Gatos",
      "inventor_state": "CA",
      "inventor_country": "US"
    }
  ],
  "title": "EXPERT-ASSISTED ONLINE-LEARNING FOR MEDIA SIMILARITY",
  "decision": "PENDING",
  "_processing_info": {
    "original_size": 115475,
    "optimized_size": 3127,
    "reduction_percent": 97.29
  }
}