{
  "patent_number": "None",
  "application_number": "15462696",
  "date_published": "20180510",
  "date_produced": "20180425",
  "filing_date": "20170317",
  "main_ipcr_label": "G06N304",
  "abstract": "A neuromorphic device includes a pre-synaptic neuron, a synapse electrically coupled to the pre-synaptic neuron through a row line, and a post-synaptic neuron electrically coupled to the synapse through a column line. The post-synaptic neuron includes an integrator, a comparator, and an error corrector including an error detector and a correction signal generator. The comparator and the error corrector receive an output of the integrator.",
  "publication_number": "US20180129932A1-20180510",
  "summary": "<SOH> SUMMARY <EOH>Embodiments of the present disclosure provide a neuromorphic device having an error corrector. Embodiments of the present disclosure provide a neuromorphic device having an error correction function. Embodiments of the present disclosure provide a learning method of a neuromorphic device for correcting an error using an error corrector. Embodiments of the present disclosure provide an error correction method and a learning method of a neuromorphic device. Technical objects to be achieved by the present disclosure are not limited to the aforementioned objects, and those skilled in the art to which the present disclosure pertains may evidently understand other technical objects from the following description. In an embodiment, a neuromorphic device in accordance with an embodiment of the inventive concepts may include a pre-synaptic neuron, a synapse electrically coupled to the pre-synaptic neuron through a row line and a post-synaptic neuron electrically coupled to the synapse through a column line. The post-synaptic neuron may include an integrator, a comparator, and an error corrector. The error corrector may include an error detector and a correction signal generator. The comparator and the error corrector may receive an output of the integrator. The error detector may include a positive input terminal receiving an expected value and a negative input terminal receiving the output of the comparator. The error detector may include a first output terminal providing an error value to the correction signal generator. The neuromorphic device may further include a pre-synaptic neuron controller. The error detector may include a second output terminal providing the error value to the pre-synaptic neuron controller. The pre-synaptic neuron controller may include an adder. The pre-synaptic neuron controller may include an output terminal electrically coupled to the pre-synaptic neuron. The pre-synaptic neuron may include a buffer unit storing a pre-synapt...",
  "ipcr_labels": [
    "G06N304",
    "G06N308"
  ],
  "inventor_list": [
    {
      "inventor_name_last": "LEE",
      "inventor_name_first": "Hyung-Dong",
      "inventor_city": "Hwaseong",
      "inventor_state": "",
      "inventor_country": "KR"
    }
  ],
  "title": "NEUROMORPHIC DEVICE HAVING AN ERROR CORRECTOR",
  "decision": "PENDING",
  "_processing_info": {
    "original_size": 58344,
    "optimized_size": 2985,
    "reduction_percent": 94.88
  }
}