{
  "patent_number": "None",
  "application_number": "15469720",
  "date_published": "20170928",
  "date_produced": "20170915",
  "filing_date": "20170327",
  "main_ipcr_label": "G06N504",
  "abstract": "Disclosed herein are computer systems, devices, and methods for improving the technology related to asset condition monitoring. In accordance with the present disclosure, an asset data platform may be configured to receive data related to asset operation, ingest, process, and analyze the received data, and then provide a set of advanced tools that enable a user to monitor asset operation and take action based on that asset operation. The set of advanced tools may include (1) an interactive visualization tool, (2) a task creation tool, (3) a rule creation tool, and/or (4) a metadata tool.",
  "publication_number": "US20170278004A1-20170928",
  "summary": "<SOH> BRIEF DESCRIPTION OF THE DRAWINGS <EOH>FIG. 1 depicts an example network configuration in which example embodiments may be implemented. FIG. 2 depicts a simplified block diagram of an example asset. FIG. 3 depicts a conceptual illustration of example abnormal-condition indicators and sensor criteria. FIG. 4 depicts a structural diagram of an example platform. FIG. 5 is a functional block diagram of an example platform. FIG. 6 is an example flow diagram that depicts an example method for creating event snapshot data. FIG. 7A is an example flow diagram that depicts an example method for creating and handling aggregated signal data. FIG. 7B is a conceptual diagram of a data structure including stored aggregated data. FIG. 8 is an example flow diagram that depicts an example method for populating a timeline of an example interactive visualization tool. FIG. 9 depicts an example graphical user interface displaying an empty timeline. FIG. 10 depicts a portion of another example GUI displaying a populated timeline. FIG. 11 depicts the portion of the GUI of FIG. 10 after an input to a selectable scrubber element. FIG. 12 depicts an example task creation GUI. detailed-description description=\"Detailed Description\" end=\"lead\"?",
  "ipcr_labels": [
    "G06N504"
  ],
  "inventor_list": [
    {
      "inventor_name_last": "McElhinney",
      "inventor_name_first": "Adam",
      "inventor_city": "Chicago",
      "inventor_state": "IL",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Horrell",
      "inventor_name_first": "Michael",
      "inventor_city": "Chicago",
      "inventor_state": "IL",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Liang",
      "inventor_name_first": "Dennis",
      "inventor_city": "Chicago",
      "inventor_state": "IL",
      "inventor_country": "US"
    }
  ],
  "title": "Computer Systems and Methods for Creating Asset-Related Tasks Based on Predictive Models",
  "decision": "PENDING",
  "_processing_info": {
    "original_size": 185797,
    "optimized_size": 2705,
    "reduction_percent": 98.54
  }
}