{
  "patent_number": "None",
  "application_number": "15464268",
  "date_published": "20180208",
  "date_produced": "20180124",
  "filing_date": "20170320",
  "main_ipcr_label": "G06N504",
  "abstract": "Remote computing resource service providers allow customers to execute virtual computer systems in a virtual environment on hardware provided by the computing resource service provider. The hardware may be distributed between various geographic locations connected by a network. The distributed environment may increase latency of various operations of the virtual computer systems executed by the customer. To reduce latency of various operations predictive modeling is used to predict the occurrence of various operations and initiate the operations before they may occur, thereby reducing the amount of latency perceived by the customer.",
  "publication_number": "US20180039899A1-20180208",
  "summary": "<SOH> BRIEF DESCRIPTION OF THE DRAWINGS <EOH>Various embodiments in accordance with the present disclosure will be described with reference to the drawings, in which: FIG. 1 shows a diagram illustrating various aspects of the present disclosure; FIG. 2 shows an example of a customer connected to a computing resource service provider; FIG. 3 shows an illustrative example of an environment in which various embodiments of the present disclosure may be practiced; FIG. 4 shows a diagram illustrating a manner in which virtual machine data may be stored in accordance with at least one embodiment; FIG. 5 shows an illustrative example of a process for creating a predictive model in accordance with at least one embodiment; FIG. 6 shows an illustrative example of a process for performing a serialization event in accordance with at least one embodiment; FIG. 7 shows an illustrative example of a process for performing a serialization event in accordance with at least one embodiment; FIG. 8 shows an illustrative example of a process for predicting a serialization event in accordance with at least one embodiment; and FIG. 9 illustrates an environment in which various embodiments can be implemented. detailed-description description=\"Detailed Description\" end=\"lead\"?",
  "ipcr_labels": [
    "G06N504",
    "G06N9900"
  ],
  "inventor_list": [
    {
      "inventor_name_last": "Biemueller",
      "inventor_name_first": "Sebastian Martin",
      "inventor_city": "Dresden",
      "inventor_state": "",
      "inventor_country": "DE"
    },
    {
      "inventor_name_last": "de Kadt",
      "inventor_name_first": "Christopher Richard Jacques",
      "inventor_city": "Cape Town",
      "inventor_state": "",
      "inventor_country": "ZA"
    },
    {
      "inventor_name_last": "Daniel",
      "inventor_name_first": "Mathew",
      "inventor_city": "Johannesburg",
      "inventor_state": "",
      "inventor_country": "ZA"
    },
    {
      "inventor_name_last": "Meyers",
      "inventor_name_first": "Adi",
      "inventor_city": "Cape Town",
      "inventor_state": "",
      "inventor_country": "ZA"
    },
    {
      "inventor_name_last": "Greenfield",
      "inventor_name_first": "James Alfred Gordon",
      "inventor_city": "Cape Town",
      "inventor_state": "",
      "inventor_country": "ZA"
    },
    {
      "inventor_name_last": "Friebel",
      "inventor_name_first": "Thomas",
      "inventor_city": "Hainichen",
      "inventor_state": "",
      "inventor_country": "DE"
    },
    {
      "inventor_name_last": "Bauer",
      "inventor_name_first": "Jean-Paul",
      "inventor_city": "Cape Town",
      "inventor_state": "",
      "inventor_country": "ZA"
    },
    {
      "inventor_name_last": "Van Der Merwe",
      "inventor_name_first": "Benjamin",
      "inventor_city": "Cape Town",
      "inventor_state": "",
      "inventor_country": "ZA"
    }
  ],
  "title": "PREDICTIVE INSTANCE SUSPENSION AND RESUMPTION",
  "decision": "PENDING",
  "_processing_info": {
    "original_size": 85033,
    "optimized_size": 3533,
    "reduction_percent": 95.85
  }
}