{
  "patent_number": "None",
  "application_number": "15468727",
  "date_published": "20170803",
  "date_produced": "20170719",
  "filing_date": "20170324",
  "main_ipcr_label": "G06N300",
  "abstract": "The operation of an application on a first device may be guided by a user operating a second device. The application on the first device may present a character on a display of the first device and obtain an audio signal of speech of a user of the first device. Audio data may be transmitted to the second device and corresponding audio may be played from speakers of the second device. The second device may present suggestions of phrases to be spoken by the character displayed on the first device. A user of the second device may select a phrase to be spoken by the character. Phrase data may be transmitted to the first device, and the first device may generate audio of the character speaking the phrase using a text-to-speech voice associated with the character.",
  "publication_number": "US20170220922A1-20170803",
  "summary": "<SOH> BRIEF DESCRIPTION OF THE FIGURES <EOH>The invention and the following detailed description of certain embodiments thereof may be understood by reference to the following figures: FIG. 1 illustrates a system for allowing a Coach and Hero to interact via a guided personal assistant. FIG. 2A illustrates an example display of a Hero device when the Coach is not available. FIG. 2B illustrates an example display of a Hero device when the Coach is available. FIG. 2C illustrates an example display of a Hero device with a transcript of a session. FIG. 2D illustrates an example display of a Hero device with a video playing. FIG. 3A illustrates an example display of a Coach device for selecting parameters for guiding a personal companion. FIG. 3B illustrates an example display of a Coach device for guiding a personal companion when the Hero is not available. FIG. 3C illustrates an example display of a Coach device for guiding a personal companion when the Hero is available. FIG. 3D illustrates an example display of a Coach device for guiding a companion assistant with a transcript. FIG. 4 is a flowchart showing an example implementation of guiding a personal companion. FIG. 5 illustrates components of one implementation of a computing device that may be used to guide a personal companion. FIG. 6 illustrates a system with multiple Coaches and Heroes communicating via a guided personal companion. detailed-description description=\"Detailed Description\" end=\"lead\"?",
  "ipcr_labels": [
    "G06N300",
    "G09B506",
    "G10L1304",
    "G09B1904"
  ],
  "inventor_list": [
    {
      "inventor_name_last": "Suskind",
      "inventor_name_first": "Ronald Steven",
      "inventor_city": "Cambridge",
      "inventor_state": "MA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Nguyen",
      "inventor_name_first": "John",
      "inventor_city": "Lexington",
      "inventor_state": "MA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Patterson",
      "inventor_name_first": "Stuart R.",
      "inventor_city": "Hingham",
      "inventor_state": "MA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Springer",
      "inventor_name_first": "Stephen R.",
      "inventor_city": "Needham",
      "inventor_state": "MA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Fanty",
      "inventor_name_first": "Mark Alan",
      "inventor_city": "Norfolk",
      "inventor_state": "MA",
      "inventor_country": "US"
    }
  ],
  "title": "GUIDED PERSONAL COMPANION",
  "decision": "PENDING",
  "_processing_info": {
    "original_size": 84788,
    "optimized_size": 3400,
    "reduction_percent": 95.99
  }
}