{
  "patent_number": "None",
  "application_number": "15468748",
  "date_published": "20170928",
  "date_produced": "20170915",
  "filing_date": "20170324",
  "main_ipcr_label": "G06N504",
  "abstract": "Provided is a state determination apparatus that appropriately performs pattern classification processing and/or pattern determination processing even when a map generated by the SOM technique includes discontinuous image regions (e.g., split image regions). In the state determination apparatus, the matching processing unit obtains adaptability data indicating a correlation degree between template data indicating a predetermined state and the SOM output data. The state determination unit determines a state of an input data. This allows for appropriately performing pattern classification processing and/or pattern determination processing even when a map generated by the SOM technique includes discontinuous image regions (e.g., split image regions).",
  "publication_number": "US20170278006A1-20170928",
  "summary": "<SOH> SUMMARY <EOH>To solve the above problem, a first aspect of the present invention provides a state determination apparatus including feature vector obtaining circuitry, mapping conversion circuitry, matching processing circuitry, and state determination circuitry. The feature vector obtaining circuitry is configured to obtain feature vector data from measured data obtained by measuring an event with an unknown state. The mapping conversion circuitry is configured to obtain SOM output data by mapping the feature vector data into a space whose dimension differs from a dimension of the feature vector data. The matching processing circuitry is configured to obtain adaptability data indicating a correlation degree between template data indicating a predetermined state and the SOM output data obtained by the mapping conversion circuitry. The state determination circuitry is configured to determine a state indicated by the measured data based on the adaptability data obtained by the matching processing circuitry.",
  "ipcr_labels": [
    "G06N504",
    "G06N9900"
  ],
  "inventor_list": [
    {
      "inventor_name_last": "HASEGAWA",
      "inventor_name_first": "Hiromu",
      "inventor_city": "Osaka",
      "inventor_state": "",
      "inventor_country": "JP"
    }
  ],
  "title": "STATE ESTIMATION APPARATUS, STATE ESTIMATION METHOD, AND INTEGRATED CIRCUIT",
  "decision": "PENDING",
  "_processing_info": {
    "original_size": 177294,
    "optimized_size": 2352,
    "reduction_percent": 98.67
  }
}