{
  "patent_number": "None",
  "application_number": "15462312",
  "date_published": "20170921",
  "date_produced": "20170906",
  "filing_date": "20170317",
  "main_ipcr_label": "G06N9900",
  "abstract": "Exemplary embodiments relate to a Health Care Fraud Waste and Abuse predictive analytics projects sharing network where analytic models can be shared and used directly with minimum changes. The shared/passed Models and Rules on the network are directly applied to datasets from different customers by mapping and creating useful results electronically within a healthcare claims space. A drag-and-drop graphical user interface simplifies the creation of models by associating one or more data sources with one or more pre-defined plug-and-play application graphically.",
  "publication_number": "US20170270435A1-20170921",
  "summary": "<SOH> SUMMARY OF VARIOUS EMBODIMENTS <EOH>In accordance with one embodiment of the invention, a healthcare fraud detection system comprises a user interface, a core processing system coupled to the user interface and also coupled to a database storage, and a data input providing healthcare data, the data input being user selectable from at least one data source, the data input being coupled to the core processing system. The core processing system comprises a set of stored pre-defined plug-and-play applications configured to manipulate the data, and the core processing system is configured to permit, via the user interface, drag-and-drop selection and interconnection of at least one data source and at least one pre-defined plug-and-play application by a user to produce a healthcare fraud detection model and to display, via the user interface, fraud analytics data produced by the healthcare fraud detection model. In various alternative embodiments, the user interface may be a web-browser interface. The core processing system may display the least one data source and the at least one pre-defined plug-and-play application as interconnected icons on the user interface. The core processing system may include a deep learning engine, such as a machine learning engine, configured to process the data. The deep learning engine may be configured to automatically determine a set of performance metrics and a plurality of algorithms to use for the at least one data source and create therefrom an ensemble of models, where each component in the ensemble is a deep learning model focusing on a specific type of fraud. The deep learning engine may be configured to detect medical claim fraud in real time, or substantially in real time, from a stream of medical claims. In other embodiments, graphs and/or dashboards may be reusable artifacts that are part of a template that can be integrated with data sources, filters and models to build a complete template. The core processing system may...",
  "ipcr_labels": [
    "G06N9900",
    "H04L2908",
    "G06F1750",
    "H04L1224"
  ],
  "inventor_list": [
    {
      "inventor_name_last": "Gallardo",
      "inventor_name_first": "Kleber",
      "inventor_city": "Woburn",
      "inventor_state": "MA",
      "inventor_country": "US"
    }
  ],
  "title": "Analytics Engine for Detecting Medical Fraud, Waste, and Abuse",
  "decision": "PENDING",
  "_processing_info": {
    "original_size": 87469,
    "optimized_size": 3156,
    "reduction_percent": 96.39
  }
}