{
  "patent_number": "None",
  "application_number": "15465682",
  "date_published": "20170706",
  "date_produced": "20170621",
  "filing_date": "20170322",
  "main_ipcr_label": "G06N300",
  "abstract": "Mechanisms are provided for validating a candidate answer to an input question. A candidate answer to an input question is identified using a natural language processing of the input question and a corpus of information from which the candidate answer is identified. A validator is selected to apply to the candidate answer based on a characteristic of a correct answer for the input question. The validator is applied to the candidate answer to evaluate whether or not criteria of the validator are met by the candidate answer. Validation information is generated based the evaluation of whether or not criteria of the validator are met by the candidate answer. The validation information is stored in a validation status object associated with the input question.",
  "publication_number": "US20170193350A1-20170706",
  "summary": "<SOH> SUMMARY <EOH>In one illustrative embodiment, a method, in a data processing system comprising a processor and a memory, for validating a candidate answer to an input question. The method comprises generating, by the data processing system, a candidate answer to an input question using a natural language processing of the input question and a corpus of information from which the candidate answer is identified. The method further comprises selecting, by the data processing system, a validator to apply to the candidate answer based on a characteristic of a correct answer for the input question. In addition, the method comprises applying, by the data processing system, the validator to the candidate answer to evaluate whether or not criteria of the validator are met by the candidate answer. Moreover, the method comprises generating, by the data processing system, validation information based the evaluation of whether or not criteria of the validator are met by the candidate answer. Additionally, the method comprises storing, by the data processing system, the validation information in a validation status object associated with the input question. In other illustrative embodiments, a computer program product comprising a computer useable or readable medium having a computer readable program is provided. The computer readable program, when executed on a computing device, causes the computing device to perform various ones of, and combinations of, the operations outlined above with regard to the method illustrative embodiment. In yet another illustrative embodiment, a system/apparatus is provided. The system/apparatus may comprise one or more processors and a memory coupled to the one or more processors. The memory may comprise instructions which, when executed by the one or more processors, cause the one or more processors to perform various ones of, and combinations of, the operations outlined above with regard to the method illustrative embodiment. These and other...",
  "ipcr_labels": [
    "G06N300",
    "G06N700",
    "G06F1727"
  ],
  "inventor_list": [
    {
      "inventor_name_last": "Allen",
      "inventor_name_first": "Corville O.",
      "inventor_city": "Morrisville",
      "inventor_state": "NC",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Bennett",
      "inventor_name_first": "Ian M.",
      "inventor_city": "San Jose",
      "inventor_state": "CA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Bittner",
      "inventor_name_first": "Torsten",
      "inventor_city": "San Jose",
      "inventor_state": "CA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Mueller",
      "inventor_name_first": "Kay",
      "inventor_city": "Dublin",
      "inventor_state": "",
      "inventor_country": "IE"
    }
  ],
  "title": "Extensible Validation Framework for Question and Answer Systems",
  "decision": "PENDING",
  "_processing_info": {
    "original_size": 100480,
    "optimized_size": 3781,
    "reduction_percent": 96.24
  }
}