{
  "patent_number": "None",
  "application_number": "15477959",
  "date_published": "20171012",
  "date_produced": "20170927",
  "filing_date": "20170403",
  "main_ipcr_label": "G06N9900",
  "abstract": "A system and methods for suggesting beneficial actions may include generating a first predictive model to estimate a user profile, collecting user data pertinent to a user's circumstance or action at a point in time, collecting a database associating user profiles with sequences of user circumstances and user actions over time for one or more users, and generating a second predictive model to suggest an action or circumstance or a sequence of actions and circumstances to be communicated to a user based upon the estimated user profile and user data and the database of sequences of user circumstances and actions. The system delivers the suggested action or circumstance to a device carried by or worn by a user in the form of advice or a story, using text, speech, images, or video.",
  "publication_number": "US20170293860A1-20171012",
  "summary": "<SOH> SUMMARY <EOH>The following summary is included in order to provide a basic understanding of some aspects and features of the invention. This summary is not an extensive overview of the invention and as such it is not intended to particularly identify key or critical elements of the invention or to delineate the scope of the invention. Its sole purpose is to present some concepts of the invention in a simplified form as a prelude to the more detailed description that is presented below. Embodiments of the invention provide an affordable solution to offer life-coach-like advice to help individuals achieve improved circumstances by learning sequences of activities and circumstances from many users on a large scale, and also offering advice tailored to the specific situation or circumstance of each individual. In particular, a technological solution is provided to bring life-coach-like benefits to individuals, on a large scale reaching potentially millions of users, using machine learning and mobile computing devices. Embodiments of the invention are directed to a system that monitors a user's actions and circumstance, and suggests beneficial actions that the user could take, which may be in the form of advice or stories illustrating the action and expected benefits, and may be delivered to a device carried or worn by a user using text, speech, images, or video. A system for suggesting beneficial actions acquires a machine representation of a user's actions and circumstance is disclosed. Data is collected by one or more devices carried by or associated with the user. A user may rate their happiness or self-actualization as a function of circumstance by providing feedback on present circumstances, or by filling out surveys or questionnaires, or by selecting or listing goals or circumstances they would consider beneficial. The system may prompt a user to state his or her intentions or describe his or her circumstances. A predictive model is constructed as a user pro...",
  "ipcr_labels": [
    "G06N9900",
    "G06N504",
    "G06F1730"
  ],
  "inventor_list": [
    {
      "inventor_name_last": "FYFFE",
      "inventor_name_first": "Graham",
      "inventor_city": "Los Angeles",
      "inventor_state": "CA",
      "inventor_country": "US"
    }
  ],
  "title": "SYSTEM AND METHODS FOR SUGGESTING BENEFICIAL ACTIONS",
  "decision": "PENDING",
  "_processing_info": {
    "original_size": 62026,
    "optimized_size": 3355,
    "reduction_percent": 94.59
  }
}