{
  "patent_number": "None",
  "application_number": "15472061",
  "date_published": "20180705",
  "date_produced": "20180620",
  "filing_date": "20170328",
  "main_ipcr_label": "G06N304",
  "abstract": "A data storage device includes a memory array for storing data; a host interface for providing an interface with a host computer running an application; a central control unit configured to receive a command in a submission queue from the application and initiate a search process in response to a search query command; a preprocessor configured to reformat data contained in the search query command and generate a reformatted data; and one or more data processing units configured to extract one or more features from the reformatted data and perform a data operation on the data stored in the memory array in response to the search query command and return matching data from the data stored in the memory array to the application via the host interface.",
  "publication_number": "US20180189635A1-20180705",
  "summary": "<SOH> SUMMARY <EOH>According to one embodiment, a data storage device includes a memory array for storing data; a host interface for providing an interface with a host computer running an application; a central control unit configured to receive a command in a submission queue from the application and initiate a search process in response to a search query command; a preprocessor configured to reformat data contained in the search query command based on a type of the data and generate a reformatted data; and one or more data processing units configured to extract one or more features from the reformatted data and perform a data operation on the data stored in the memory array in response to the search query command and return matching data from the data stored in the memory array to the application via the host interface. A method for operating a data storage device includes: receiving a command in a submission queue from an application running on a host computer; initiating a search process in response to a search query command; generating a reformatted data by changing a format of data contained in the search query command based on a type of the data; extracting one or more features from the reformatted data; performing a data operation on data stored in a memory array of the data storage device in response to the search query command; and returning matching data from the data stored in the memory array to the application via a host interface established between the host computer and the data storage device. The above and other preferred features, including various novel details of implementation and combination of events, will now be more particularly described with reference to the accompanying figures and pointed out in the claims. It will be understood that the particular systems and methods described herein are shown by way of illustration only and not as limitations. As will be understood by those skilled in the art, the principles and features described her...",
  "ipcr_labels": [
    "G06N304",
    "G06F1730",
    "G06N308"
  ],
  "inventor_list": [
    {
      "inventor_name_last": "Olarig",
      "inventor_name_first": "Sompong P.",
      "inventor_city": "Pleasanton",
      "inventor_state": "CA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Worley",
      "inventor_name_first": "Fred",
      "inventor_city": "San Jose",
      "inventor_state": "CA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Farahpour",
      "inventor_name_first": "Nazanin",
      "inventor_city": "Los Angeles",
      "inventor_state": "CA",
      "inventor_country": "US"
    }
  ],
  "title": "METHOD AND APPARATUS FOR SUPPORTING MACHINE LEARNING ALGORITHMS AND DATA PATTERN MATCHING IN ETHERNET SSD",
  "decision": "PENDING",
  "_processing_info": {
    "original_size": 59407,
    "optimized_size": 3676,
    "reduction_percent": 93.81
  }
}