{
  "patent_number": "None",
  "application_number": "15470754",
  "date_published": "20170713",
  "date_produced": "20170627",
  "filing_date": "20170327",
  "main_ipcr_label": "G06N312",
  "abstract": "Provided are nucleic acid translators capable of carrying out logic operations with improved efficiency, maximized output and reduced off-target effects, in particular in a biological system. Methods of using these translators to transduce signal are also provided.",
  "publication_number": "US20170200080A1-20170713",
  "summary": "<SOH> SUMMARY <EOH>In accordance with one aspect of the present invention, provided is a composition comprising a first and a second nucleic acid complexes each comprising a first, a second, a third, and a fourth nucleic acid strands, each of the strands comprising, sequentially, a first, a second and a third fragments, wherein the nucleic strands are defined as B-X-D, C - X -Ā, D - Y -Ē and F-Y-C for the first, second, third and fourth strands of the first complex, respectively, and C - Y - F , E-Y-D, F-Z-G, H - Z -Ē for the first, second, third and fourth strands of the second complex, respectively, wherein each letter denotes a fragment and each string of letters connected by “-” denotes a strand, and wherein: each of the first and the second complexes comprises a first duplex region formed between the second fragments of the first and second strands (X:: X and Y ::Y, in the first and second complexes, respectively), a second duplex region formed between the second fragments of the third and fourth strands (Y:: Y and Z:: Z ), a third duplex region formed between the third fragment of the first strand and the first fragment of the third strand (D:: D and F ::F), and a fourth duplex region formed between the first fragment of the second strand and the third fragment of the fourth strand ( C ::C and E::Ē); in each of the first and second complexes, the first fragment (B and C , in the first and second complexes, respectively) of the first strand, the third fragment (Ā and D) of the second strand, the third fragment (Ē and G) of the third strand and the first fragment (F and H ) of the fourth strand are single-stranded; the third strand of the first complex ( D - Y -Ē) has suitable sequence complementarity to the second strand of the second complex (E-Y-D) to allow binding therebetween under hybridizing conditions; and the fourth strand of the first complex (F-Y-C) has suitable sequence complementarity to the first strand of the second complex ( C - Y - F ) to allow ...",
  "ipcr_labels": [
    "G06N312",
    "C07H2104",
    "C12N1511",
    "C12Q168",
    "G06N300",
    "C12N15113"
  ],
  "inventor_list": [
    {
      "inventor_name_last": "Kleinbaum",
      "inventor_name_first": "Daniel J.",
      "inventor_city": "Redwood City",
      "inventor_state": "CA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Frezza",
      "inventor_name_first": "Brian M.",
      "inventor_city": "Redwood City",
      "inventor_state": "CA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Bond",
      "inventor_name_first": "Brad",
      "inventor_city": "Palo Alto",
      "inventor_state": "CA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Leung",
      "inventor_name_first": "Jonathan",
      "inventor_city": "Sunnyvale",
      "inventor_state": "CA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Fraser",
      "inventor_name_first": "George W.",
      "inventor_city": "Mountain View",
      "inventor_state": "CA",
      "inventor_country": "US"
    }
  ],
  "title": "ROTATIONALLY SEQUESTERED TRANSLATORS",
  "decision": "PENDING",
  "_processing_info": {
    "original_size": 106620,
    "optimized_size": 3500,
    "reduction_percent": 96.72
  }
}