{
  "patent_number": "None",
  "application_number": "15476487",
  "date_published": "20180419",
  "date_produced": "20180404",
  "filing_date": "20170331",
  "main_ipcr_label": "G06N700",
  "abstract": "A disclosed example method to predict an injury for a target player on a target date includes determining a first probability of injury of the target player based on probabilities of injuries of second players having similarities with the target player; determining a second probability of injury of the target player based on injuries of the target player; determining a third probability of injury of the target player based on the first probability of injury of the target player and the second probability of injury of the target player; and generating, by executing an instruction with the processor, a report of a predicted probability of injury of the target player for the target date based on the third probability of injury of the target player.",
  "publication_number": "US20180107936A1-20180419",
  "summary": "<SOH> BRIEF DESCRIPTION OF THE DRAWINGS <EOH>FIG. 1 depicts an example apparatus to predict sports injuries in accordance with the teachings of this disclosure. FIGS. 2A and 2B illustrate an example injury prediction report showing predictions of injuries for target participants. FIG. 3 illustrates an example prediction performance table showing accuracies of injury predictions generated by the example apparatus of FIG. 1 . FIG. 4 illustrates an example graph showing true-positive rates (TPRs) relative to corresponding injury predictions determined by the example apparatus of FIG. 1 . FIG. 5 illustrates an example graph showing false-negative rates (FNRs) relative to corresponding injury predictions determined by the example apparatus of FIG. 1 . FIG. 6 illustrates an example graph showing false-positive rates (FPRs) relative to corresponding injury predictions determined by the example apparatus of FIG. 1 . FIG. 7 is a flow diagram representative of example machine readable instructions that may be executed by a processor to predict and/or validate probabilities of sports injuries in accordance with the teachings of this disclosure. FIG. 8 is a flow diagram representative of example machine readable instructions that may be executed by a processor to perform a predictive analytics process to predict probabilities of sports injuries in accordance with the teachings of this disclosure. FIG. 9 is an example processor platform capable of executing the example computer readable instructions represented by FIGS. 7 and 8 to implement the example apparatus of FIG. 1 in accordance with teachings of this disclosure to predict and/or validate probabilities of sports injuries. detailed-description description=\"Detailed Description\" end=\"lead\"? The figures are not to scale. Wherever possible, the same reference numbers will be used throughout the drawing(s) and accompanying written description to refer to the same or like parts.",
  "ipcr_labels": [
    "G06N700",
    "A63B2400"
  ],
  "inventor_list": [
    {
      "inventor_name_last": "Chattopadhyay",
      "inventor_name_first": "Rita",
      "inventor_city": "Chandler",
      "inventor_state": "AZ",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Algotar",
      "inventor_name_first": "Kalpana A.",
      "inventor_city": "Chandler",
      "inventor_state": "AZ",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Ashrafi",
      "inventor_name_first": "Ali",
      "inventor_city": "Chapel Hill",
      "inventor_state": "NC",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Pilkin",
      "inventor_name_first": "John",
      "inventor_city": "Cary",
      "inventor_state": "NC",
      "inventor_country": "US"
    }
  ],
  "title": "METHODS AND APPARATUS TO PREDICT SPORTS INJURIES",
  "decision": "PENDING",
  "_processing_info": {
    "original_size": 79377,
    "optimized_size": 3697,
    "reduction_percent": 95.34
  }
}