{
  "patent_number": "10007876",
  "application_number": "15476809",
  "date_published": "20180628",
  "date_produced": "20180613",
  "filing_date": "20170331",
  "main_ipcr_label": "G06N304",
  "abstract": "Systems, methods, and apparatus, including computer programs encoded on a computer storage medium for processing a network input through a neural network having one or more initial neural network layers followed by a softmax output layer. In one aspect, the methods include obtaining a layer output generated by the one or more initial neural network layers and processing the layer output through the softmax output layer to generate a neural network output. Processing the layer output through the softmax output layer includes determining, for each possible output value, a number of occurrences in the layer output values; for each possible output value occurring in the layer output values, determining a respective exponentiation measure; determining a normalization factor for the layer output by combining the exponentiation measures in accordance with the number of occurrences of the possible output values; and determining, for each of layer output values, a softmax probability value.",
  "publication_number": "US20180181859A1-20180628",
  "summary": "<SOH> SUMMARY <EOH>This specification describes how a system can process the output of a neural network. To do so, the system determines the number of occurrences of each member of a finite set of potential output values among the output generated by the initial neural network layers of the neural network. The system determines a softmax layer output for each value occurring in the output of the initial neural network layers by determining a respective exponentiation measure for each occurring value. In general, one innovative aspect of the subject matter described in this specification can be embodied in methods of processing a network input through a neural network having one or more initial neural network layers followed by a softmax output that include the actions of obtaining a layer output generated by processing the network input through the one or more initial neural network layers, the layer output having a plurality of layer output values and each layer output value being a respective one of a predetermined finite set of possible output values; and processing the layer output through the softmax output layer to generate a neural network output for the network input, including determining, for each possible output value in the predetermined finite set, a number of occurrences of the possible output value in the plurality of layer output values; for each possible output value occurring in the plurality of layer output values, determining a respective exponentiation measure of the possible output value; determining a normalization factor for the layer output by combining the exponentiation measures in accordance with the number of occurrences of the possible output values; and determining, for each of the plurality of layer output values, a softmax probability value from the respective exponentiation measure for the layer output value and the normalization factor. Other embodiments of this aspect include corresponding computer systems, apparatus, and computer...",
  "ipcr_labels": [
    "G06N304"
  ],
  "inventor_list": [
    {
      "inventor_name_last": "Young",
      "inventor_name_first": "Reginald Clifford",
      "inventor_city": "Palo Alto",
      "inventor_state": "CA",
      "inventor_country": "US"
    }
  ],
  "title": "GENERATING AN OUTPUT FOR A NEURAL NETWORK OUTPUT LAYER",
  "decision": "ACCEPTED",
  "_processing_info": {
    "original_size": 52255,
    "optimized_size": 3554,
    "reduction_percent": 93.2
  }
}