{
  "patent_number": "None",
  "application_number": "15478910",
  "date_published": "20171005",
  "date_produced": "20170920",
  "filing_date": "20170404",
  "main_ipcr_label": "G06N504",
  "abstract": "A method and system for probability distribution forecast evaluation are disclosed. The present disclosure is directed to embodiments of a system that evaluates probability distribution forecasts by acquiring one or more of a probability distribution forecast, a probability distribution realization, and a prior knowledge of the probability distribution forecast. The system disclosed herein may then compute an accuracy score and an information score based on the acquired forecast, realization, and prior knowledge. In evaluating the forecast, a performance score may also be computed based on the accuracy score and the information score.",
  "publication_number": "US20170286840A1-20171005",
  "summary": "<SOH> SUMMARY <EOH>A system and method to enable probability distribution forecast evaluation are disclosed. The probability distribution forecast evaluation system comprises at least one processor and at least one memory device. The at least one memory device may store a plurality of instructions which, when executed by the at least one processor, cause the at least one processor to operate with the at least one memory device to acquire one or more of a probability distribution forecast, a probability distribution realization corresponding to the probability distribution forecast, and a prior knowledge of the probability distribution forecast; compute an accuracy score based on the one or more of a probability distribution forecast, a probability distribution realization corresponding to the probability distribution forecast, and a prior knowledge of the probability distribution forecast; compute an information score based on the one or more of a probability distribution forecast, a probability distribution realization corresponding to the probability distribution forecast, and a prior knowledge of the probability distribution forecast; and compute a performance score based on the accuracy score and the information score. The accuracy score may be computed based on the probability distribution forecast and the probability distribution realization. The accuracy score may further be computed by calculating a dissimilarity score between the probability distribution forecast and the probability distribution realization. The probability distribution forecast evaluation system may calculate a dissimilarity score that is either (1) the Kullback-Leibler (KL) divergence between the probability distribution forecast and the probability distribution realization, or (2) a quadratic approximation of the KL divergence between the probability distribution forecast and the probability distribution realization. The probability distribution forecast evaluation system may compute the...",
  "ipcr_labels": [
    "G06N504",
    "G06F1711",
    "G06N502"
  ],
  "inventor_list": [
    {
      "inventor_name_last": "Zhang",
      "inventor_name_first": "Xiaoping",
      "inventor_city": "Toronto",
      "inventor_state": "",
      "inventor_country": "CA"
    },
    {
      "inventor_name_last": "Kedmey",
      "inventor_name_first": "David",
      "inventor_city": "Brooklyn",
      "inventor_state": "NY",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Wang",
      "inventor_name_first": "Fang",
      "inventor_city": "Toronto",
      "inventor_state": "",
      "inventor_country": "CA"
    }
  ],
  "title": "SYSTEM AND METHOD FOR PERFORMANCE EVALUATION OF PROBABILITY FORECAST",
  "decision": "PENDING",
  "_processing_info": {
    "original_size": 47796,
    "optimized_size": 3503,
    "reduction_percent": 92.67
  }
}