{
  "patent_number": "None",
  "application_number": "15480422",
  "date_published": "20170727",
  "date_produced": "20170713",
  "filing_date": "20170406",
  "main_ipcr_label": "G06N312",
  "abstract": "According to one embodiment, a method for generating a plurality of candidate visualizations. The method may include receiving a scenario description. The method may also include collecting a plurality of expert data using a training system based on the received scenario description. The method may further include generating at least one predictive model based on the collected plurality of expert data in order to execute the at least one generated predictive model during an application of a plurality of genetic algorithms.",
  "publication_number": "US20170213135A1-20170727",
  "summary": "<SOH> SUMMARY <EOH>According to one embodiment, a method for generating a plurality of candidate visualizations. The method may include receiving a scenario description. The method may also include collecting a plurality of expert data using a training system based on the received scenario description. The method may further include generating at least one predictive model based on the collected plurality of expert data in order to execute the at least one generated predictive model during an application of a plurality of genetic algorithms. According to another embodiment, a computer system for generating a plurality of candidate visualizations. The computer system may include one or more processors, one or more computer-readable memories, one or more computer-readable tangible storage devices, and program instructions stored on at least one of the one or more storage devices for execution by at least one of the one or more processors via at least one of the one or more memories, whereby the computer system is capable of performing a method. The computer system may include receiving a scenario description. The computer system may also include collecting a plurality of expert data using a training system based on the received scenario description. The computer system may further include generating at least one predictive model based on the collected plurality of expert data in order to execute the at least one generated predictive model during an application of a plurality of genetic algorithms. According to yet another embodiment, a computer program product for generating a plurality of candidate visualizations. The computer program product may include one or more computer-readable storage devices and program instructions stored on at least one of the one or more tangible storage devices, the program instructions executable by a processor. The computer program product may include program instructions to receive a scenario description. The computer program product m...",
  "ipcr_labels": [
    "G06N312",
    "G06T1120",
    "G06N504"
  ],
  "inventor_list": [
    {
      "inventor_name_last": "Keahey",
      "inventor_name_first": "T. Alan",
      "inventor_city": "Naperville",
      "inventor_state": "IL",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Rope",
      "inventor_name_first": "Daniel J.",
      "inventor_city": "Reston",
      "inventor_state": "VA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Wills",
      "inventor_name_first": "Graham J.",
      "inventor_city": "Naperville",
      "inventor_state": "IL",
      "inventor_country": "US"
    }
  ],
  "title": "CANDIDATE VISUALIZATION TECHNIQUES FOR USE WITH GENETIC ALGORITHMS",
  "decision": "PENDING",
  "_processing_info": {
    "original_size": 61198,
    "optimized_size": 3403,
    "reduction_percent": 94.44
  }
}