{
  "patent_number": "None",
  "application_number": "15483118",
  "date_published": "20170727",
  "date_produced": "20170713",
  "filing_date": "20170410",
  "main_ipcr_label": "G06N9900",
  "abstract": "Various embodiments described herein provide for methods and systems of providing related information from a data source. For example, a method may include responding to a natural language query with a natural language response that includes and describes data related to the natural language query. The related data may correspond to the numerical data or text discovered from various data sources. Further, a database trained with a machine-learning algorithm may be utilized to identify time series related data that is associated with the natural language query and that is used within the generated natural language response. The methods and systems described herein may be utilized by a message bot when responding to questions posed by an online user during a chat session.",
  "publication_number": "US20170213157A1-20170727",
  "summary": "<SOH> BRIEF DESCRIPTION OF THE DRAWINGS <EOH>The present disclosure illustrates various embodiments by way of example and not limitation in the figures of the accompanying drawings. In the drawings, like references indicate similar elements and in which: FIG. 1 is a high-level client-server-based network architecture, in accordance with an example embodiment, configured to identify data related to a source document; FIG. 2 shows a Graphical User Interface (GUI) to provide data related to a source document; FIG. 3 shows a further example of the GUI of FIG. 2 including example source text and displaying data related to the source text; FIG. 4 shows a yet further example of the GUI of FIG. 2 including example source text and displaying data related to the source text; FIG. 5 shows the example GUI of FIG. 2 comparing some of the related data shown in FIG. 2 and FIG. 3 ; FIG. 6 shows a GUI, in accordance with an example embodiment, displaying a spreadsheet including a search field to identify related data for populating cells of the spreadsheet; FIG. 7 shows the GUI of FIG. 6 including example source text and displaying data related to the source text; FIG. 8 is a flowchart of a method, in accordance with an example embodiment, for providing discovered claims and data related a source document; FIG. 9 is a block diagram illustrating components of a server machine, in accordance with an example embodiment, configured to provide discovered claims and data related a source document; FIG. 10 is a diagram illustrating an example syntax tree used in the method of FIG. 8 ; FIG. 11 is an example dependency tree used by the method of FIG. 8 ; FIG. 12 is a flowchart of a method, in accordance with an example embodiment, for claim extraction from a corpus stored in a database; FIG. 13 is a block diagram illustrating components of a server machine, in accordance with an example embodiment, configured to perform extraction from a corpus; FIG. 14 is a flowchart of a method, in accorda...",
  "ipcr_labels": [
    "G06N9900",
    "G06F1727",
    "G06F30484",
    "G06F1730"
  ],
  "inventor_list": [
    {
      "inventor_name_last": "Bugay",
      "inventor_name_first": "Vladimir",
      "inventor_city": "Perm",
      "inventor_state": "",
      "inventor_country": "RU"
    },
    {
      "inventor_name_last": "Firsov",
      "inventor_name_first": "Anton",
      "inventor_city": "Perm",
      "inventor_state": "",
      "inventor_country": "RU"
    },
    {
      "inventor_name_last": "Sytin",
      "inventor_name_first": "Vitalii",
      "inventor_city": "Perm",
      "inventor_state": "",
      "inventor_country": "RU"
    },
    {
      "inventor_name_last": "Eskin",
      "inventor_name_first": "Vladimir",
      "inventor_city": "McLean",
      "inventor_state": "VA",
      "inventor_country": "US"
    }
  ],
  "title": "METHOD AND SYSTEM TO PROVIDE RELATED DATA",
  "decision": "PENDING",
  "_processing_info": {
    "original_size": 161623,
    "optimized_size": 3767,
    "reduction_percent": 97.67
  }
}