{
  "patent_number": "None",
  "application_number": "15489764",
  "date_published": "20180614",
  "date_produced": "20180530",
  "filing_date": "20170418",
  "main_ipcr_label": "G06N504",
  "abstract": "The present disclosure is related to predicting application response lime based on metrics. An example machine-readable medium may store instructions executable by a processing resource to determine a particular response time and an average response time of an application based on a plurality of relevant performance metrics associated with the application during a first period of time, classify the particular response time into a group based on the average response time, and determine a relationship between the plurality of relevant performance metrics and the particular response time of the application. The example machine-readable medium may further store instructions executable by the processing resource to determine whether a response time of the application is likely to change sufficiently to change the classification to a different group during a second period of time based on the relationship.",
  "publication_number": "US20180165584A1-20180614",
  "summary": "<SOH> BRIEF DESCRIPTION OF THE DRAWINGS <EOH>FIG. 1 is a diagram of a host for predicting application response time based on metrics according to the present disclosure. FIG. 2 is a diagram of a system for predicting application response time based on metrics according to the present disclosure. FIG. 3 is a diagram of a machine for predicting application response time based on metrics according to (he present disclosure. FIG. 4 is a flow diagram illustrating a training phase for predicting application response lime based on metrics according to the present disclosure. FIG. 5 is a flow diagram illustrating a prediction phase for predicting application response time based on metrics according to the present disclosure. FIG. 6 is a diagram of a system including a plurality of hosts for predicting application response time based on metrics according to (he present disclosure. FIG. 7 is a diagram of a non-transitory machine readable medium storing instructions for predicting application response time based on metrics according to the present disclosure. FIG. 8 is a flow diagram illustrating a method for predicting application response time based on metrics according lo the present disclosure. detailed-description description=\"Detailed Description\" end=\"lead\"?",
  "ipcr_labels": [
    "G06N504"
  ],
  "inventor_list": [
    {
      "inventor_name_last": "JHA",
      "inventor_name_first": "RITESH",
      "inventor_city": "Bangalore",
      "inventor_state": "",
      "inventor_country": "IN"
    },
    {
      "inventor_name_last": "SATHYAMURTHY",
      "inventor_name_first": "DATTATHREYA",
      "inventor_city": "Bangalore",
      "inventor_state": "",
      "inventor_country": "IN"
    },
    {
      "inventor_name_last": "SAHU",
      "inventor_name_first": "PRATEEK",
      "inventor_city": "Bangalore",
      "inventor_state": "",
      "inventor_country": "IN"
    },
    {
      "inventor_name_last": "AGRAWAL",
      "inventor_name_first": "NUPUR",
      "inventor_city": "Bangalore",
      "inventor_state": "",
      "inventor_country": "IN"
    },
    {
      "inventor_name_last": "KAPUR",
      "inventor_name_first": "AGAM",
      "inventor_city": "Bangalore",
      "inventor_state": "",
      "inventor_country": "IN"
    }
  ],
  "title": "PREDICTING APPLICATION RESPONSE TIME BASED ON METRICS",
  "decision": "PENDING",
  "_processing_info": {
    "original_size": 60089,
    "optimized_size": 3312,
    "reduction_percent": 94.49
  }
}