{
  "patent_number": "None",
  "application_number": "15481121",
  "date_published": "20171012",
  "date_produced": "20170927",
  "filing_date": "20170406",
  "main_ipcr_label": "G06N504",
  "abstract": "Domain expert heuristics are captured within a computational framework for a task scheduling system. One or more classifiers are trained to predict (i) whether a first action should be scheduled instead of a second action using pairwise comparisons between actions scheduled by a demonstrator at particular times and actions not scheduled by the demonstrator at the particular times, and (ii) whether a particular action should be scheduled for a particular agent at a particular time. The system then generates a schedule for a set of actions to be performed by a plurality of agents using a plurality of resources over a plurality of time steps, by using the one or more classifiers to determine (i) a highest priority action in the set of actions, and (ii) whether the highest priority action should be scheduled for a particular agent at a particular time step.",
  "publication_number": "US20170293844A1-20171012",
  "summary": "<SOH> SUMMARY <EOH>Coordinating agents to complete a set of tasks with intercoupled temporal and resource constraints is computationally challenging, yet human domain experts can solve these difficult scheduling problems using paradigms learned through years of apprenticeship. A process for manually codifying this domain knowledge within a computational framework is necessary to scale beyond the “single-expert, single-trainee” apprenticeship model. However, human domain experts often have difficulty describing their decision-making processes, causing the codification of this knowledge to become laborious. Herein we describe a technique, which we call “apprenticeship scheduling,” to capture this domain knowledge in the form of a scheduling policy. Our objective is to learn scheduling policies through expert demonstration and validate that schedules produced by these policies are of comparable quality to those generated by human or synthetic experts. We describe a new approach for capturing domain-expert heuristics through a pairwise ranking formulation. Our approach is model-free and does not require enumerating or iterating through a large state-space. We empirically demonstrate that this approach accurately learns multifaceted heuristics on a synthetic data set incorporating job-shop scheduling and vehicle routing problems, as well as on real-world data sets. We also demonstrate that policies learned from human scheduling demonstration via apprenticeship learning can substantially improve the efficiency of a branch-and-bound search for an optimal schedule by a computing device. Our research has shown that this human-machine collaborative optimization technique can be employed on real-world problems to generate solutions substantially superior to those produced by human domain experts at rates faster than an optimization approach, and can be applied to optimally solve problems more complex than those solved by a human demonstrator. In one aspect, a method for task s...",
  "ipcr_labels": [
    "G06N504",
    "G06N9900"
  ],
  "inventor_list": [
    {
      "inventor_name_last": "Gombolay",
      "inventor_name_first": "Matthew Craig",
      "inventor_city": "Cambridge",
      "inventor_state": "MA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Shah",
      "inventor_name_first": "Julie Ann",
      "inventor_city": "Boston",
      "inventor_state": "MA",
      "inventor_country": "US"
    }
  ],
  "title": "HUMAN-MACHINE COLLABORATIVE OPTIMIZATION VIA APPRENTICESHIP SCHEDULING",
  "decision": "PENDING",
  "_processing_info": {
    "original_size": 93214,
    "optimized_size": 3610,
    "reduction_percent": 96.13
  }
}