{
  "patent_number": "None",
  "application_number": "15487268",
  "date_published": "20180510",
  "date_produced": "20180425",
  "filing_date": "20170413",
  "main_ipcr_label": "G06N504",
  "abstract": "Systems, methods, and software for developing application usage information are provided herein. An exemplary method includes identifying data sources that relate to application usage activity of one or more users, determining activity signals related to at least data analysis by the one or more users from among the application usage activity, and applying the activity signals to a knowledge graphing service that infers data analysis preferences from among the activity signals. The method also includes providing ones of the data analysis preferences for use by data insight services that establish data insight objects visualizing target datasets based at least on the ones of the data analysis preferences.",
  "publication_number": "US20180129946A1-20180510",
  "summary": "<SOH> BRIEF DESCRIPTION OF THE DRAWINGS <EOH>Many aspects of the disclosure can be better understood with reference to the following drawings. While several implementations are described in connection with these drawings, the disclosure is not limited to the implementations disclosed herein. On the contrary, the intent is to cover all alternatives, modifications, and equivalents. FIG. 1 illustrates a data insight environment in an example. FIG. 2 illustrates operations of data insight environments in an example. FIG. 3 illustrates operations of data insight environments in an example. FIG. 4 illustrates operations of data insight environments in an example. FIG. 5 illustrates operations of data insight environments in an example. FIG. 6 illustrates operations of data insight environments in an example. FIG. 7 illustrates a data insight environment in an example. FIG. 8 illustrates operations of data insight environments in an example. FIG. 9 illustrates an operational knowledge environment in an example. FIG. 10 illustrates a computing system suitable for implementing any of the architectures, processes, and operational scenarios disclosed herein. detailed-description description=\"Detailed Description\" end=\"lead\"?",
  "ipcr_labels": [
    "G06N504",
    "H04L2908",
    "G06F1730"
  ],
  "inventor_list": [
    {
      "inventor_name_last": "Ellis",
      "inventor_name_first": "Charles David",
      "inventor_city": "Seattle",
      "inventor_state": "WA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Fortier",
      "inventor_name_first": "Dominique",
      "inventor_city": "Issaquah",
      "inventor_state": "WA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Xue",
      "inventor_name_first": "Liyin",
      "inventor_city": "Kirkland",
      "inventor_state": "WA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Sharma",
      "inventor_name_first": "Ashvini",
      "inventor_city": "Redmond",
      "inventor_state": "WA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Nielsen",
      "inventor_name_first": "Jakob Peter",
      "inventor_city": "Redmond",
      "inventor_state": "WA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Otero",
      "inventor_name_first": "Carlos Augusto",
      "inventor_city": "Seattle",
      "inventor_state": "WA",
      "inventor_country": "US"
    }
  ],
  "title": "APPLICATION USAGE SIGNAL INFERENCE AND REPOSITORY",
  "decision": "PENDING",
  "_processing_info": {
    "original_size": 112813,
    "optimized_size": 3254,
    "reduction_percent": 97.12
  }
}