{
  "patent_number": "None",
  "application_number": "15485057",
  "date_published": "20171012",
  "date_produced": "20170927",
  "filing_date": "20170411",
  "main_ipcr_label": "G06N504",
  "abstract": "A system for predicting and detecting urination events of users is disclosed. The system can include any number of wearable devices, mobile devices, hubs, computing devices, and servers to collect, share, process, and interpret data, as well as to provide stimuli to users and caregivers. Biometric and/or environmental data associated with a user can be collected and applied to a urination model to determine a predicted urination time. The user or a caregiver can be provided with direct or environmental stimuli conveying information about predicted urination times. Ongoing biometric and/or environmental data collection can be used to identify, and provide stimuli warning of, imminent urination events. Voluntary and involuntary feedback of actual urination events, as well as continued biometric and/or environmental data collection, can be used to train individual and collective urination models.",
  "publication_number": "US20170293846A1-20171012",
  "summary": "<SOH> BRIEF DESCRIPTION OF THE DRAWINGS <EOH>The specification makes reference to the following appended figures, in which use of like reference numerals in different figures is intended to illustrate like or analogous components. FIG. 1 is a schematic diagram depicting a urination detection and prediction ecosystem according to certain aspects of the present disclosure. FIG. 2 is a schematic diagram of a hub according to certain aspects of the present disclosure. FIG. 3 is a schematic diagram of a wearable device according to certain aspects of the present disclosure. FIG. 4 is a schematic diagram depicting a urination detection sensor according to certain aspects of the present disclosure. FIG. 5 is a flowchart depicting a process for initiating a urination model according to certain aspects of the present disclosure. FIG. 6 is a flowchart depicting a process for updating an expected urination time according to certain aspects of the present disclosure. FIG. 7 is a flowchart depicting a process for updating a urination model according to certain aspects of the present disclosure. FIG. 8 is a flowchart depicting a process for generating baseline urination models and initializing user urination models according to certain aspects of the present disclosure. detailed-description description=\"Detailed Description\" end=\"lead\"?",
  "ipcr_labels": [
    "G06N504",
    "G06N9900"
  ],
  "inventor_list": [
    {
      "inventor_name_last": "Zyglowicz",
      "inventor_name_first": "Steven",
      "inventor_city": "Leesburg",
      "inventor_state": "VA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Baker",
      "inventor_name_first": "Tim",
      "inventor_city": "Beaverdam",
      "inventor_state": "VA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Coble",
      "inventor_name_first": "Jon",
      "inventor_city": "Glen Allen",
      "inventor_state": "VA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Franco",
      "inventor_name_first": "Israel",
      "inventor_city": "Chappaqua",
      "inventor_state": "NY",
      "inventor_country": "US"
    }
  ],
  "title": "Urination Prediction and Monitoring",
  "decision": "PENDING",
  "_processing_info": {
    "original_size": 119599,
    "optimized_size": 3223,
    "reduction_percent": 97.31
  }
}