{
  "patent_number": "None",
  "application_number": "15489762",
  "date_published": "20180118",
  "date_produced": "20180103",
  "filing_date": "20170418",
  "main_ipcr_label": "G06N9900",
  "abstract": "An electronic device includes a memory device storing data and a system-on-a-chip using the memory device as a working memory. The system-on-a-chip performs software training on a second memory area of the memory device by loading a training code to a first memory area of the memory device, and executing the loaded training code.",
  "publication_number": "US20180018583A1-20180118",
  "summary": "<SOH> SUMMARY <EOH>Embodiments of the inventive concept provide an electronic device that performs channel training on a memory, and a memory training method thereof. According to an aspect of an embodiment, that is provided an electronic device which includes a memory device configured to store data, and a system-on-a-chip that uses the memory device as a working memory. The system-on-a-chip loads a training code into a first memory area of the memory device, and performs software training on a second memory area of the memory device by executing the loaded training code. According to another aspect of an embodiment, there is provided a software training method of an electronic device that drives a memory device managed in units of channels as a working memory. The method includes: loading a training code into a first memory area of the memory device corresponding to a first channel of the memory device and loading training data into a second memory area of the memory device corresponding to a second channel of the memory device, accessing the training data stored in the second memory area in response to execution of the training code loaded into the first memory area, evaluating the training data read from the second memory area to ascertain an optimum value for an access parameter of the second channel, and setting an operating condition of the second channel by using the ascertained optimum value for the access parameter. According to still another aspect of an embodiment, there is provided a computing system which includes a memory device that is driven as a working memory and a host connected to a plurality of channels and configured to load data to the memory device via the plurality of channels and to fetch the data from the memory device. The host performs software training on a second channel of the plurality of channels by: loading a training code into a memory area of the memory device corresponding to a first channel of the plurality of channels, and ex...",
  "ipcr_labels": [
    "G06N9900",
    "G06F306"
  ],
  "inventor_list": [
    {
      "inventor_name_last": "CHA",
      "inventor_name_first": "GYU-HWAN",
      "inventor_city": "SUWON-SI",
      "inventor_state": "",
      "inventor_country": "KR"
    }
  ],
  "title": "ELECTRONICS DEVICE PERFORMING SOFTWARE TRAINING ON MEMORY CHANNEL AND MEMORY CHANNEL TRAINING METHOD THEREOF",
  "decision": "PENDING",
  "_processing_info": {
    "original_size": 66101,
    "optimized_size": 2937,
    "reduction_percent": 95.56
  }
}