{
  "patent_number": "None",
  "application_number": "15483206",
  "date_published": "20171012",
  "date_produced": "20170927",
  "filing_date": "20170410",
  "main_ipcr_label": "G06N9900",
  "abstract": "The present invention is directed at a system and method for searching and matching content over social networks relevant to a specific individual. In an aspect, the individual relevant content search system provides search results and information that is relevant to the individual's perspective.",
  "publication_number": "US20170293864A1-20171012",
  "summary": "<SOH> SUMMARY OF THE INVENTION <EOH>The present invention is directed at a system and method for searching and matching content over social networks relevant to a specific individual. In an aspect, the individual relevant content search system provides search results and information that is relevant to the individual's perspective. In other words, the system provides information from the user's point of view, whereas other prior art systems offer a global point of view. In an aspect, the individual relevant content search (IRCS) system is configured to return information specific to the individual by communicating with at least one user device associated with the individual and social media servers with which the individual utilizes, obtain information from the user device and social media accounts associated with the individual to create a data stream; and analyze the data stream to determine insights of the individual. In an aspect, the IRCS system can create the data stream by taking data related to the individual from the social media accounts associated with the individual and assembling the data into a normalized data representation. In another aspect, the IRCS system assembles the data further by assembling structured and unstructured data into the data stream. In another aspect, the IRCS system can use APIs to acquire the structured data and a scraper to acquire the unstructured data. In another aspect, the IRCS system to can assemble the data by using domain specific information and metadata to create packets that separate the metadata and content to form the data stream. In an aspect, the IRCS system analyzes the data by learning about the data and analyzing the data. In such aspects, the IRCS system can learn about the data by comprises applying concept dictionaries on the data and mapping patterns based upon the concept dictionaries. In such aspects, the IRCS system can apply personal preferences of an individual to the pattern maps, and/or build persona...",
  "ipcr_labels": [
    "G06N9900",
    "G06F1730"
  ],
  "inventor_list": [
    {
      "inventor_name_last": "Oh",
      "inventor_name_first": "Sanggyoon",
      "inventor_city": "Las Vegas",
      "inventor_state": "NV",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Nevarez",
      "inventor_name_first": "Carlos A.",
      "inventor_city": "Las Vegas",
      "inventor_state": "NV",
      "inventor_country": "US"
    }
  ],
  "title": "System and Method for Searching and Matching Content Over Social Networks Relevant to an Individual",
  "decision": "PENDING",
  "_processing_info": {
    "original_size": 86840,
    "optimized_size": 3049,
    "reduction_percent": 96.49
  }
}