{
  "patent_number": "None",
  "application_number": "15487281",
  "date_published": "20171019",
  "date_produced": "20171004",
  "filing_date": "20170413",
  "main_ipcr_label": "G06N304",
  "abstract": "A neuromorphic device may include: pre-synaptic neurons; row lines extending in a first direction from the pre-synaptic neurons, respectively; post-synaptic neurons; column lines extending in a second direction from the post-synaptic neurons, respectively, the second direction crossing the first direction; and synapses arranged in intersection regions between the row lines and the column lines. The synapses may include resistor interconnections having various fixed resistance values. The synapses may be programmed with at least one pattern based on the various fixed resistance values.",
  "publication_number": "US20170300806A1-20171019",
  "summary": "<SOH> SUMMARY <EOH>Various embodiments are directed to synapses having fixed resistance values. Also, various embodiments are directed to a neuromorphic device including synapses having fixed resistance values. Also, various embodiments are directed to a neuromorphic device including a plurality of synapse layers having fixed resistance values. In an embodiment, a neuromorphic device may include: pre-synaptic neurons; row lines extending in a first direction from the pre-synaptic neurons, respectively; post-synaptic neurons; column lines extending in a second direction from the post-synaptic neurons, respectively, the second direction crossing the first direction; and synapses arranged in intersection regions between the row lines and the column lines. The synapses may include resistor interconnections having various fixed resistance values, the synapses being programmed with at least one pattern based on the various fixed resistance values. The various fixed resistance values may include at least four levels. The resistor interconnections may be disposed in a substrate. The synapses may include resistor interconnections that include conductive paths having different lengths, the different lengths respectively providing the various fixed resistance values. The synapses may include resistor interconnections that contain ions doped at various concentrations, the various concentrations providing the various fixed resistance values. The resistor interconnections may include silicon doped with N-type or P-type ions. The resistor interconnections may be doped with N-type ions, the N-type ions including P (phosphorous) or As (arsenic) ions. Each of the resistor interconnections may include one or more doping regions having different doping concentrations. Each of the resistor interconnections may include one or more of a low-concentration doping region, a middle-concentration doping region, and a high-concentration doping region. Each of the resistor interconnections may i...",
  "ipcr_labels": [
    "G06N304",
    "H01L23522",
    "H01L23522",
    "H01L23528",
    "G06N308"
  ],
  "inventor_list": [
    {
      "inventor_name_last": "LEE",
      "inventor_name_first": "Hyung-Dong",
      "inventor_city": "Hwaseong",
      "inventor_state": "",
      "inventor_country": "KR"
    }
  ],
  "title": "NEUROMORPHIC DEVICE INCLUDING SYNAPSES HAVING FIXED RESISTANCE VALUES",
  "decision": "PENDING",
  "_processing_info": {
    "original_size": 46651,
    "optimized_size": 3197,
    "reduction_percent": 93.15
  }
}