{
  "patent_number": "None",
  "application_number": "15488419",
  "date_published": "20180621",
  "date_produced": "20180608",
  "filing_date": "20170414",
  "main_ipcr_label": "G06N3063",
  "abstract": "A neuromorphic device for the analog computation of a linear combination of input signals, for use, for example, in an artificial neuron. The neuromorphic device provides non-volatile programming of the weights, and fast evaluation and programming, and is suitable for fabrication at high density as part of a plurality of neuromorphic devices. The neuromorphic device is implemented as a vertical stack of flash-like cells with a common control gate contact and individually contacted source-drain (SD) regions. The vertical stacking of the cells enables efficient use of layout resources.",
  "publication_number": "US20180174034A1-20180621",
  "summary": "<SOH> SUMMARY <EOH>Aspects of embodiments of the present disclosure are directed toward a neuromorphic device for the analog computation of a linear combination of input signals, for use, for example, in an artificial neuron. The neuromorphic device provides non-volatile programming of the weights, and fast evaluation and programming, and is suitable for fabrication at high density as part of a plurality of neuromorphic devices. The neuromorphic device is implemented as a vertical stack of flash-like cells with a common control gate contact and individually contacted source-drain (SD) regions. The vertical stacking of the cells enables efficient use of layout resources. According to an embodiment of the present invention there is provided a neuromorphic device, including: a substrate, the substrate being substantially planar, a first floating-gate transistor on the substrate, the first floating-gate transistor having: a channel; a floating gate; and a control gate; and a second floating-gate transistor, vertically stacked on the first floating-gate transistor, the second floating-gate transistor having: a channel; a floating gate; and a control gate directly connected to the control gate of the first floating-gate transistor, the neuromorphic device having: a gate contact connected to: the control gate of the first floating-gate transistor, and the control gate of the second floating-gate transistor, a first source-drain contact connected to a first end of the channel of the first floating-gate transistor a second source-drain contact connected to a second end, opposite the first end, of the channel of the first floating-gate transistor and to a first end of the channel of the second floating-gate transistor, and a third source-drain contact connected to a second end of the channel of the second floating-gate transistor. In one embodiment, the channel of the first floating-gate transistor and the channel of the second floating-gate transistor are parts of one contin...",
  "ipcr_labels": [
    "G06N3063",
    "H01L29808",
    "H01L2966"
  ],
  "inventor_list": [
    {
      "inventor_name_last": "Obradovic",
      "inventor_name_first": "Borna J.",
      "inventor_city": "Leander",
      "inventor_state": "TX",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Rakshit",
      "inventor_name_first": "Titash",
      "inventor_city": "Austin",
      "inventor_state": "TX",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Rodder",
      "inventor_name_first": "Mark S.",
      "inventor_city": "Dallas",
      "inventor_state": "TX",
      "inventor_country": "US"
    }
  ],
  "title": "HIGH-DENSITY NEUROMORPHIC COMPUTING ELEMENT",
  "decision": "PENDING",
  "_processing_info": {
    "original_size": 58909,
    "optimized_size": 3442,
    "reduction_percent": 94.16
  }
}