{
  "patent_number": "None",
  "application_number": "15487117",
  "date_published": "20171019",
  "date_produced": "20171004",
  "filing_date": "20170413",
  "main_ipcr_label": "G06N308",
  "abstract": "An information processing system, which includes a control system and an artificial neural network, is disclosed. The artificial neural network includes a group of neurons and a group of synapses, which includes a first portion and a second portion. The control system selects one of a group of operating modes. The group of neurons processes information. The group of synapses provide connectivity to each of the group of neurons. During a first operating mode of the group of operating modes, the first portion of the group of synapses is enabled and the second portion of the group of synapses is enabled. During a second operating mode of the group of operating modes, the first portion of the group of synapses is enabled and the second portion of the group of synapses is disabled.",
  "publication_number": "US20170300815A1-20171019",
  "summary": "<SOH> SUMMARY <EOH>An information processing system, which includes a control system and an artificial neural network, is disclosed according to one embodiment of the present disclosure. The artificial neural network includes a group of neurons and a group of synapses, which includes a first portion and a second portion. The control system selects one of a group of operating modes. The group of neurons processes information. The group of synapses provides connectivity to each of the group of neurons. During a first operating mode of the group of operating modes, the first portion of the group of synapses is enabled and the second portion of the group of synapses is enabled. During a second operating mode of the group of operating modes, the first portion of the group of synapses is enabled and the second portion of the group of synapses is disabled. Those skilled in the art will appreciate the scope of the present disclosure and realize additional aspects thereof after reading the following detailed description of the preferred embodiments in association with the accompanying drawing figures.",
  "ipcr_labels": [
    "G06N308",
    "G06N304"
  ],
  "inventor_list": [
    {
      "inventor_name_last": "Seo",
      "inventor_name_first": "Jae-sun",
      "inventor_city": "Tempe",
      "inventor_state": "AZ",
      "inventor_country": "US"
    }
  ],
  "title": "STATIC AND DYNAMIC PRECISION ADAPTATION FOR HARDWARE LEARNING AND CLASSIFICATION",
  "decision": "PENDING",
  "_processing_info": {
    "original_size": 43612,
    "optimized_size": 2467,
    "reduction_percent": 94.34
  }
}