{
  "patent_number": "None",
  "application_number": "15485211",
  "date_published": "20180426",
  "date_produced": "20180411",
  "filing_date": "20170411",
  "main_ipcr_label": "G06N504",
  "abstract": "To clear a blindspot in the way business leaders, analysts and investors make decisions about capital investments in various businesses, the present inventors devised, among other things, a machine learning based composite classification, search, and analysis systems and methods. One exemplary system automatically classifies businesses based on quantitative and qualitative business data according to a 4-class framework that spans traditional industry boundaries. This classification are based on a combination of spending patterns, financial metrics, and language to identify each firm's business model. The resulting business model is then utilized in conjunction with additional financial and non-financial metrics, securities analysis, leading and lagging indicators, and/or industry comparison to produce a score which can be used to compare business performance within and across classifications to generate superior performance and mitigate risks for business leaders and investment manager...",
  "publication_number": "US20180114128A1-20180426",
  "summary": "<SOH> SUMMARY <EOH>To address this and/or other needs, the present inventors devised, among other things, exemplary systems, engines, databases, methods, and related components for classifying, scoring, searching, and/or analyzing businesses based on business model and/or related asset allocation and revenue patterns. Various embodiments of the invention stem from the recognition that all organizations and their leaders draw upon the same five types of assets, but what differentiates each organization are the decisions leaders make in how to use or invest them. Based on these asset allocations, a company's business model emerges. By categorizing and indexing businesses based on their business models rather than traditional industry classifications, market capitalization, or other common metrics, leaders and investors can uncover new insights about competitiveness and value in a digital world. More specifically, one embodiment uses machine learning to categorize organizations based on the participation in four cross-industry business model classes, specifically an asset builder class, a service provider class, a technology creator class, and a network orchestrator class, based on key performance metrics and textual descriptions for publicly traded businesses. Variants of this embodiment measure capital allocation data within the business and statistically correlate the business, using logistical regression analysis, with each of the four cross-industry business model classes, ultimately determining a composite business model score. Another embodiment utilizes the classification system and related insights to produce an index score, such as a Universal Business Model Score, which can be used to compare and rank business performance within and across multiple businesses regardless of industry, size, or geography. Moreover, some embodiments monitor key business model indicators and alert business leaders if indicators suggest a business model evolving in an unintended w...",
  "ipcr_labels": [
    "G06N504",
    "G06N9900",
    "G06F1730",
    "G06Q4000"
  ],
  "inventor_list": [
    {
      "inventor_name_last": "Libert",
      "inventor_name_first": "Barry D.",
      "inventor_city": "Sherborn",
      "inventor_state": "MA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Beck",
      "inventor_name_first": "Megan",
      "inventor_city": "Dallas",
      "inventor_state": "TX",
      "inventor_country": "US"
    }
  ],
  "title": "Method and system for composite scoring, classification, and decision making based on machine learning",
  "decision": "PENDING",
  "_processing_info": {
    "original_size": 88081,
    "optimized_size": 3772,
    "reduction_percent": 95.72
  }
}