{
  "patent_number": "None",
  "application_number": "15499454",
  "date_published": "20171102",
  "date_produced": "20171018",
  "filing_date": "20170427",
  "main_ipcr_label": "G06N9900",
  "abstract": "A method for privatizing an iteratively reweighted least squares (IRLS) solution includes perturbing a first moment of a dataset by adding noise and perturbing a second moment of the dataset by adding noise. The method also includes obtaining the IRLS solution based on the perturbed first moment and the perturbed second moment. The method further includes generating a differentially private output based on the IRLS solution.",
  "publication_number": "US20170316346A1-20171102",
  "summary": "<SOH> SUMMARY <EOH>In one aspect of the present disclosure, a method for privatizing an iteratively reweighted least squares (IRLS) solution is disclosed. The method includes perturbing a first moment of a dataset by adding noise. The method also includes perturbing a second moment of the dataset by adding noise. The method further includes obtaining the IRLS solution based on the perturbed first moment and the perturbed second moment. The method still further includes generating a differentially private output based on the IRLS solution. Another aspect of the present disclosure is directed to an apparatus including means for perturbing a first moment of a dataset by adding noise. The apparatus also includes means for perturbing a second moment of the dataset by adding noise. The apparatus further includes means for obtaining the IRLS solution based on the perturbed first moment and the perturbed second moment. The apparatus still further includes means for generating a differentially private output based on the IRLS solution. In another aspect of the present disclosure, a non-transitory computer-readable medium with program code recorded thereon is disclosed. The program code for privatizing an IRLS solution is executed by a processor and includes program code to perturb a first moment of a dataset by adding noise. The program code also includes program code to perturb a second moment of the dataset by adding noise. The program code further includes program code to obtain the IRLS solution based on the perturbed first moment and the perturbed second moment. The program code still further includes program code to generate a differentially private output based on the IRLS solution. Another aspect of the present disclosure is directed to an apparatus for privatizing an IRLS solution, the apparatus having a memory unit and one or more processors coupled to the memory unit. The processor(s) is configured to perturb a first moment of a dataset by adding noise. The proces...",
  "ipcr_labels": [
    "G06N9900"
  ],
  "inventor_list": [
    {
      "inventor_name_last": "PARK",
      "inventor_name_first": "Mijung",
      "inventor_city": "Amsterdam",
      "inventor_state": "",
      "inventor_country": "NL"
    },
    {
      "inventor_name_last": "WELLING",
      "inventor_name_first": "Max",
      "inventor_city": "Bussum",
      "inventor_state": "",
      "inventor_country": "NL"
    }
  ],
  "title": "DIFFERENTIALLY PRIVATE ITERATIVELY REWEIGHTED LEAST SQUARES",
  "decision": "PENDING",
  "_processing_info": {
    "original_size": 60172,
    "optimized_size": 3114,
    "reduction_percent": 94.82
  }
}