{
  "patent_number": "None",
  "application_number": "15497658",
  "date_published": "20170810",
  "date_produced": "20170726",
  "filing_date": "20170426",
  "main_ipcr_label": "G06N504",
  "abstract": "An approach for a computer to evaluate a predictive model includes identifying features of training samples in a set of training samples. The approach selects evaluation metrics from a set of evaluation metrics as available metrics using identified features and includes determining recommended metrics using the predictive model, the available metrics, and a predetermined set of user-preferred metrics. The approach applies the predictive model created using the set of training samples to a set of test samples to calculate values of the available metrics. The approach evaluates the predictive model by using the available metrics and the values of the available metrics to evaluate the predictive model by evaluating the predictive model using the recommended metrics and the values of the recommended metrics.",
  "publication_number": "US20170228652A1-20170810",
  "summary": "<SOH> SUMMARY <EOH>Embodiments of the present invention disclose a method, a computer program product, and a system for one or more computer processors to evaluate a predictive model. The method includes one or more computer processors identifying features of training samples in a set of training samples. The method includes one or more computer processors selecting at least one evaluation metric from a set of evaluation metrics as one or more available metrics based on the identified features where selecting includes determining one or more recommended metrics based on the predictive model, the one or more available metrics, and a predetermined first set of user-preferred metrics. Additionally, the method includes one or more computer processors applying the predictive model created based on the set of training samples to a set of test samples so as to calculate values of the one or more available metrics, where applying a predictive model created based on the set of training samples to a set of test samples to calculate values of the one or more available metrics includes determining values of the one or more recommended metrics based on the values of the one or more available metrics. Furthermore, the method includes one or more computer processors evaluating the predictive model by using the one or more available metrics and the values of the one or more available metrics, wherein evaluating the predictive model comprises evaluating the predictive model by using the one or more recommended metrics and the values of the one or more recommended metrics.",
  "ipcr_labels": [
    "G06N504",
    "G06N9900"
  ],
  "inventor_list": [
    {
      "inventor_name_last": "Dong",
      "inventor_name_first": "Wei S.",
      "inventor_city": "Beijing",
      "inventor_state": "",
      "inventor_country": "CN"
    },
    {
      "inventor_name_last": "Tian",
      "inventor_name_first": "Chunhua",
      "inventor_city": "Beijing",
      "inventor_state": "",
      "inventor_country": "CN"
    },
    {
      "inventor_name_last": "Wang",
      "inventor_name_first": "Yu",
      "inventor_city": "Beijing",
      "inventor_state": "",
      "inventor_country": "CN"
    },
    {
      "inventor_name_last": "Wang",
      "inventor_name_first": "Yu",
      "inventor_city": "Shanghai",
      "inventor_state": "",
      "inventor_country": "CN"
    },
    {
      "inventor_name_last": "Yan",
      "inventor_name_first": "Junchi",
      "inventor_city": "Shanghai",
      "inventor_state": "",
      "inventor_country": "CN"
    },
    {
      "inventor_name_last": "Zhang",
      "inventor_name_first": "Chao",
      "inventor_city": "Beijing",
      "inventor_state": "",
      "inventor_country": "CN"
    }
  ],
  "title": "METHOD AND APPARATUS FOR EVALUATING PREDICTIVE MODEL",
  "decision": "PENDING",
  "_processing_info": {
    "original_size": 63339,
    "optimized_size": 3638,
    "reduction_percent": 94.26
  }
}