{
  "patent_number": "None",
  "application_number": "15496179",
  "date_published": "20171026",
  "date_produced": "20171011",
  "filing_date": "20170425",
  "main_ipcr_label": "G06N504",
  "abstract": "An artificial intelligence (AI) combination platform or orchestration module is described that orchestrates and automates the processes of selecting, building, testing, and delivering new or integrated computer vision, detection, sensor and perception algorithms that can be published or leveraged in near real time by sensors, hardware or applications. The AI combination platform includes one or more of the following engines: algorithm mixer engine, retrospective search engine, algorithm recommendation engine, quality assurance engine, certification engine, and perception engine.",
  "publication_number": "US20170308800A1-20171026",
  "summary": "<SOH> BRIEF SUMMARY <EOH>This section is for the purpose of summarizing some aspects of the present disclosure and to briefly introduce some preferred embodiments. Simplifications or omissions may be made to avoid obscuring the purpose of the section. Such simplifications or omissions are not intended to limit the scope of the present disclosure. Consistent with the principles of the present disclosure as embodied and broadly described herein, embodiments of an artificial intelligence (AI) combination platform provide for the efficient and effective utilization of these algorithms. In particular, the AI combination platform (which includes one or more of an algorithm mixer engine, retrospective search engine, algorithm recommendation engine, quality assurance engine, algorithm certification engine, and perception engine) orchestrates and automates the processes of selecting, building, testing, and delivering new or integrated algorithms (e.g., vision and other algorithms) that can be published or leveraged in near real time by sensors, hardware or applications. In some embodiments, the algorithm mixer engine allows user input to select one or more algorithms, e.g., vision algorithms. Based on the selection, the algorithm mixer engine creates a custom algorithm package (e.g., a machine vision algorithm package), and thereby generates an algorithm list that reflects the custom machine vision package. The algorithm mixer engine processes the custom machine vision package as an overlay to run on connected machine vision devices. The algorithm mixer engine further processes the package for use in the selection process. Finally, the AI combination platform publishes the algorithm package for public or proprietary use. In some embodiments, the algorithm mixer engine allows automated provisioning based on the algorithm list. Based on the algorithm list, the processor verifies that the algorithm package selected is not a duplicate. If it is a duplicate, the existing package ...",
  "ipcr_labels": [
    "G06N504",
    "G06T1160",
    "G06N9900"
  ],
  "inventor_list": [
    {
      "inventor_name_last": "CICHON",
      "inventor_name_first": "Chris",
      "inventor_city": "Kansas City",
      "inventor_state": "MO",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "BLACKBURN",
      "inventor_name_first": "Isaiah",
      "inventor_city": "Kansas City",
      "inventor_state": "MO",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "ADAMS",
      "inventor_name_first": "Casey",
      "inventor_city": "Kansas City",
      "inventor_state": "MO",
      "inventor_country": "US"
    }
  ],
  "title": "Interchangeable Artificial Intelligence Perception Systems and Methods",
  "decision": "PENDING",
  "_processing_info": {
    "original_size": 92187,
    "optimized_size": 3468,
    "reduction_percent": 96.24
  }
}