{
  "patent_number": "None",
  "application_number": "15498201",
  "date_published": "20171102",
  "date_produced": "20171018",
  "filing_date": "20170426",
  "main_ipcr_label": "G06N9900",
  "abstract": "Methods, systems, and apparatus, including computer programs encoded on computer storage media, for implementing an intelligence aggregation system. One of the methods includes receiving, by an agent, one or more goal criteria. A search to identify one or more other agents in the system is performed. Connections with the one or more other agents are established, with each connection having an initial weight. Data outputs generated by each connected agent are received to iteratively update a model using the received data outputs and associated weights. If the current model generated from current weights for the connections of the one or more connected agents satisfies the one or more goal criteria, the output of the current model is published to a search engine.",
  "publication_number": "US20170316345A1-20171102",
  "summary": "<SOH> SUMMARY <EOH>This specification describes a distributed computing system for aggregating and automating machine learning technologies. In this specification, such a system will be referred to as an intelligence aggregation system, or for brevity, an aggregation system. The intelligence aggregation system aggregates machine learning technologies in the sense that it combines and connects multiple heterogeneous machine learning subsystems within a single distributed system. The system also aggregates the data that is consumed and produced by such heterogeneous subsystems and other subsystems. To do so, the system can transform this data into a common format. The intelligence aggregation system automates machine learning technologies in the sense that it employs intelligent coordinating agents that automatically control the training and application of machine-learned models to accomplish particular goals. To solve goals that the agents are given, the agents search for other agents, establish connections with other agents, and train machine-learned models using the outputs generated by the agents with whom they have connected as features for the model. Particular embodiments of the subject matter described in this specification can be implemented so as to realize one or more of the following advantages. An intelligence aggregation system allows users to harness the power of machine learning without requiring knowledge of programming or cloud computing. Many different heterogeneous algorithms and data streams can be aggregated into the same system. The combined data and algorithms reinforce each other to solve complex tasks. Data streams in the system include labeled data that is easy to understand. Agents in the system automatically solve problems by establishing connections with other agents in the system. The details of one or more embodiments of the subject matter of this specification are set forth in the accompanying drawings and the description below. Other ...",
  "ipcr_labels": [
    "G06N9900",
    "G06N504",
    "G06F1730"
  ],
  "inventor_list": [
    {
      "inventor_name_last": "Palmer",
      "inventor_name_first": "Douglas A.",
      "inventor_city": "San Diego",
      "inventor_state": "CA",
      "inventor_country": "US"
    }
  ],
  "title": "MACHINE LEARNING AGGREGATION",
  "decision": "PENDING",
  "_processing_info": {
    "original_size": 82178,
    "optimized_size": 3317,
    "reduction_percent": 95.96
  }
}