{
  "patent_number": "None",
  "application_number": "15497149",
  "date_published": "20180823",
  "date_produced": "20180808",
  "filing_date": "20170425",
  "main_ipcr_label": "G06N9900",
  "abstract": "A system, method and apparatus for executing a bioinformatics analysis on genetic sequence data includes a quantum computing device formed of a set of hardwired quantum logic circuits interconnected by a plurality of superconducting connections to process information represented as a quantum state that is configured as a set of one or more qubits. The hardwired quantum logic circuits may be arranged as a set of processing engines, each processing engine being formed of a subset of the hardwired quantum logic circuits to perform one or more steps in the bioinformatics analysis on the reads of genomic data. Each subset of the hardwired quantum logic circuits may be formed in a wired configuration to perform the one or more steps in the bioinformatics analysis.",
  "publication_number": "US20180240032A1-20180823",
  "summary": "<SOH> SUMMARY OF THE DISCLOSURE <EOH>The present disclosure is directed to devices, systems, and methods for employing the same in the performance of one or more genomics and/or bioinformatics protocols on data generated through a primary processing procedure, such as on genetic sequence data. For instance, in various aspects, the devices, systems, and methods herein provided are configured for performing secondary and/or tertiary analysis protocols on genetic data, such as data generated by the sequencing of RNA and/or DNA, e.g., by a Next Gen Sequencer (“NGS”). In particular embodiments, one or more secondary processing pipelines for processing genetic sequence data is provided. In other embodiments, one or more tertiary processing pipelines for processing genetic sequence data is provided, such as where the pipelines, and/or individual elements thereof, deliver superior sensitivity and improved accuracy on a wider range of sequence derived data than is currently available in the art. For example, provided herein is a system, such as for executing one or more of a sequence and/or genomic analysis pipeline on genetic sequence data and/or other data derived therefrom. In various embodiments, the system may include one or more of an electronic data source that provides digital signals representing a plurality of reads of genetic and/or genomic data, such as where each of the plurality of reads of genomic data include a sequence of nucleotides. The system may further include a memory, e.g., a DRAM, or a cache, such as for storing one or more of the sequenced reads, one or a plurality of genetic reference sequences, and one or more indices of the one or more genetic reference sequences. The system may additionally include one or more integrated circuits, such as a FPGA, ASIC, or sASIC, and/or a CPU and/or a GPU, which integrated circuit, e.g., with respect to the FPGA, ASIC, or sASIC may be formed of a set of hardwired digital logic circuits that are interconnected by ...",
  "ipcr_labels": [
    "G06N9900",
    "G06F1918",
    "G06N700",
    "G06K962"
  ],
  "inventor_list": [
    {
      "inventor_name_last": "van Rooyen",
      "inventor_name_first": "Pieter",
      "inventor_city": "La Jolla",
      "inventor_state": "CA",
      "inventor_country": "US"
    }
  ],
  "title": "BIOINFORMATICS SYSTEMS, APPARATUSES, AND METHODS EXECUTED ON A QUANTUM PROCESSING PLATFORM",
  "decision": "PENDING",
  "_processing_info": {
    "original_size": 729940,
    "optimized_size": 3396,
    "reduction_percent": 99.53
  }
}