{
  "patent_number": "None",
  "application_number": "15499202",
  "date_published": "20170907",
  "date_produced": "20170823",
  "filing_date": "20170427",
  "main_ipcr_label": "G06N300",
  "abstract": "Described herein are novel biological converter switches that utilize modular components, such as genetic toggle switches and single invertase memory modules (SIMMs), for converting analog inputs to digital outputs, and digital inputs to analog outputs, in cells and cellular systems. Flexibility in these biological converter switches is provided by combining individual modular components, i.e., SIMMs and genetic toggle switches, together. These biological converter switches can be combined in a variety of network topologies to create circuits that act, for example, as switchboards, and regulate the production of an output product(s) based on the combination and nature of input signals received.",
  "publication_number": "US20170255857A1-20170907",
  "summary": "<SOH> SUMMARY OF THE INVENTION <EOH>We have created novel biological converter switches that provide modular systems for converting analog inputs to digital outputs, and digital inputs to analog outputs, for use in biological systems, such as cells. Most signals in the natural environment are analog, i.e., they can take on any continuous value which is usually represented as a real number. Digital signals, on the other hand, have discrete levels, are typically represented in binary numerals, and can be derived from analog signals by the application of thresholds. The biological converter switches and component modules provided herein, are useful for the detection and output of both analog and digital signals. Provided herein are analog-to-digital biological converter switches for use in biological systems, and switchboard systems and methods for converting analog signals to digital signals. To provide analog-to-digital conversion, the analog signal is fed into a bank of modular analog-to-digital biological converter switches, each module having a different threshold. Thus, depending on the strength of the analog signal, a different number of switches are flipped, thus yielding a digital output which is represented in the combination of switches that are toggled. Also provided herein are digital-to-analog biological converter switches for use in biological systems, and switchboard systems and methods for converting analog signals to digital signals. To provide digital-to-analog conversion, the digital input is represented in a bank of switches in binary format. Each of these switches drives a transcriptional promoter of differing strengths, with the switch representing the least significant bit driving a promoter of least strength and the switch representing the most significant bit driving a promoter of the greatest strength. These promoters express identical outputs such as proteins, including fluorescent reporters, transcriptional activators, and transcriptional r...",
  "ipcr_labels": [
    "G06N300",
    "H03M174",
    "H03M136"
  ],
  "inventor_list": [
    {
      "inventor_name_last": "Collins",
      "inventor_name_first": "James J.",
      "inventor_city": "Newton",
      "inventor_state": "MA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Lu",
      "inventor_name_first": "Timothy Kuan-Ta",
      "inventor_city": "Charlestown",
      "inventor_state": "MA",
      "inventor_country": "US"
    }
  ],
  "title": "BIOLOGICAL ANALOG-TO-DIGITAL AND DIGITAL-TO-ANALOG CONVERTERS",
  "decision": "PENDING",
  "_processing_info": {
    "original_size": 362956,
    "optimized_size": 3429,
    "reduction_percent": 99.06
  }
}