{
  "patent_number": "None",
  "application_number": "15498006",
  "date_published": "20171102",
  "date_produced": "20171018",
  "filing_date": "20170426",
  "main_ipcr_label": "G06N700",
  "abstract": "Provided is a state determination apparatus that appropriately performs pattern classification processing and/or pattern determination processing even when a map generated by the SOM technique includes discontinuous image regions. In the state determination apparatus, the matching processing unit obtains adaptability data indicating a correlation degree between template data indicating a state and the SOM output data. The state determination unit obtains a state evaluation value based on an activity value obtained by the activity value obtaining unit and the adaptability value. The time series estimation unit determines a state of an input data based on the state evaluation value and state transition probability between states. This allows for appropriately performing pattern classification processing and/or pattern determination processing even when a map generated by the SOM technique includes discontinuous image regions.",
  "publication_number": "US20170316332A1-20171102",
  "summary": "<SOH> SUMMARY <EOH>To solve the above problem, a first aspect of the present invention provides a state determination apparatus including feature vector obtaining circuitry, normalization circuitry, mapping conversion circuitry, matching processing circuitry, state determination circuitry, and time series estimation circuitry. The feature vector obtaining circuitry is configured to obtain feature vector data from measured data obtained by measuring an event with an unknown state. The normalization circuitry is configured to obtain a norm of the feature vector data and obtain normalized feature vector data by normalizing the feature vector data. The mapping conversion circuitry is configured to obtain SOM output data by mapping the feature vector data into a space whose dimension differs from a dimension of the feature vector data. The matching processing circuitry is configured to obtain adaptability data indicating a correlation degree between template data indicating a state and the SOM output data obtained by the mapping conversion circuitry. The state determination circuitry is configured to obtain a state evaluation value based on the adaptability data obtained by the matching processing circuitry. The time series estimation circuitry is configured to estimate a state indicated by the measured data based on the state evaluation value and state transition probability between states.",
  "ipcr_labels": [
    "G06N700",
    "G06N9900"
  ],
  "inventor_list": [
    {
      "inventor_name_last": "IKOMA",
      "inventor_name_first": "Norikazu",
      "inventor_city": "Fukuoka",
      "inventor_state": "",
      "inventor_country": "JP"
    },
    {
      "inventor_name_last": "HASEGAWA",
      "inventor_name_first": "Hiromu",
      "inventor_city": "Osaka",
      "inventor_state": "",
      "inventor_country": "JP"
    }
  ],
  "title": "STATE DETERMINATION APPARATUS, STATE DETERMINATION METHOD, AND INTEGRATED CIRCUIT",
  "decision": "PENDING",
  "_processing_info": {
    "original_size": 145217,
    "optimized_size": 3065,
    "reduction_percent": 97.89
  }
}