{
  "patent_number": "None",
  "application_number": "15495633",
  "date_published": "20171019",
  "date_produced": "20171004",
  "filing_date": "20170424",
  "main_ipcr_label": "G06N304",
  "abstract": "In certain embodiments, a neural net computer system may include a plurality of computing nodes. At least some of the computing nodes are associated with a first layer of a neural net. At least some of the computing nodes are associated with a second layer of the neural net. The computing nodes may each include (i) one or more processors, (ii) memory, and (iii) a wireless or optical communication unit. For each of the computing nodes: (i) the processors, the memory, and the wireless or optical communication unit of the computing node are on-die components of the computing node, and (ii) the processors of the computing node (a) transmit signals to other ones of the computing nodes via the wireless or optical communication unit of the computing node and (b) receive signals from other ones of the computing nodes via the wireless or optical communication unit of the computing node.",
  "publication_number": "US20170300807A1-20171019",
  "summary": "<SOH> SUMMARY OF THE INVENTION <EOH>Aspects of the invention relate to methods, apparatuses, and/or systems for facilitating wireless or optical communication between neural net computing nodes. In certain embodiments, a neural net computer system may include a plurality of computing nodes. At least some of the computing nodes are associated with a first layer of a neural net. At least some of the computing nodes are associated with a second layer of the neural net. The computing nodes may each include (i) one or more processors, (ii) memory, and (iii) a wireless or optical communication unit. For each of the computing nodes: (i) the processors, the memory, and the wireless or optical communication unit of the computing node are on-die components of the computing node, and (ii) the processors of the computing node (a) transmit signals to other ones of the computing nodes via the wireless or optical communication unit of the computing node and (b) receive signals from other ones of the computing nodes via the wireless or optical communication unit of the computing node. In some embodiments, at least computing nodes may be formed on a substrate by, for each of the computing nodes on the substrate, forming one or more processors, memory, and a wireless or optical communication unit on the substrate. One or more wireless or optical cavities may be formed around at least some of the computing nodes on the substrate such that each of the one or more wireless or optical cavities reduces signal attenuation for signals transmitted by at least one transmitting component of each computing node within the wireless or optical cavity. At least some of the computing nodes are configured to be associated with a first layer of a neural net. At least some of the computing nodes are configured to be associated with a second layer of the neural net. For each of the computing nodes, the processors of the computing node are configured to (i) wirelessly or optically transmit signals to ot...",
  "ipcr_labels": [
    "G06N304",
    "G06N3067"
  ],
  "inventor_list": [
    {
      "inventor_name_last": "HU",
      "inventor_name_first": "Bob Sueh-chien",
      "inventor_city": "Los Altos Hills",
      "inventor_state": "CA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "POON",
      "inventor_name_first": "Ada Shuk-Yan",
      "inventor_city": "Redwood City",
      "inventor_state": "CA",
      "inventor_country": "US"
    }
  ],
  "title": "NEURAL NET COMPUTER SYSTEM WITH WIRELESS OR OPTICAL CONNECTIONS BETWEEN NEURAL NET COMPUTING NODES",
  "decision": "PENDING",
  "_processing_info": {
    "original_size": 47897,
    "optimized_size": 3653,
    "reduction_percent": 92.37
  }
}