{
  "patent_number": "None",
  "application_number": "15499423",
  "date_published": "20171102",
  "date_produced": "20171018",
  "filing_date": "20170427",
  "main_ipcr_label": "G06N504",
  "abstract": "Systems, methods, and computer-readable media for simulating the course of an event or for collecting data for the simulation are provided. A processing unit can receive attributes of synthetic populations and corresponding forecasts of progress of an event, e.g., an epidemic. The processing unit can determine a disease model based on the forecasts and historical data of the event. The disease model can be associated with at least one attribute of each of the synthetic populations. The processing unit can determine a forecast of the progress of the event based on the received forecasts and weights associated with user accounts. In some examples, the processing unit can receive the attributes, present via a user interface a plurality of candidate forecasts of an epidemic, and receive via the user interface a forecast, e.g., rankings or data, of the epidemic with respect to the synthetic population indicated by the attributes.",
  "publication_number": "US20170316324A1-20171102",
  "summary": "<SOH> BRIEF DESCRIPTION OF THE DRAWINGS <EOH>The detailed description is set forth with reference to the accompanying figures. In the figures, the left-most digit(s) of a reference number identifies the figure in which the reference number first appears. The use of the same reference numbers in different figures indicates similar or identical items. The attached drawings are for purposes of illustration and are not necessarily to scale. For brevity of illustration, in the diagrams herein, an arrow beginning with a diamond connects a first component or operation (at the diamond end) to at least one second component or operation that is or can be included in the first component or operation. FIG. 1 is a block diagram illustrating a data-collection or analysis system according to some implementations. FIG. 2 is a block diagram illustrating components of a data-collection or analysis system according to some implementations. FIG. 3 shows an example system architecture. FIG. 4 is a dataflow diagram of an example process for determining a disease model. FIG. 5 is a dataflow diagram of an example process for determining a disease model. FIG. 6 is a dataflow diagram of an example process for determining a disease model or an epidemic forecast. FIG. 7 is a dataflow diagram of an example process for determining a disease model. FIG. 8 is a dataflow diagram of an example process for determining a forecast of progress of an event (e.g., an epidemic). FIG. 9 is a dataflow diagram of an example process for determining a forecast of progress of an event. FIG. 10 is a dataflow diagram of an example process for collecting forecasts of an epidemic. FIG. 11 is a dataflow diagram of an example process for collecting forecasts of an epidemic. FIG. 12 illustrates example process(es), data items, and components, for collecting and processing forecasts. FIG. 13 shows an example user interface including a ranking widget. FIG. 14 shows an example user interface including a different ranking ...",
  "ipcr_labels": [
    "G06N504"
  ],
  "inventor_list": [
    {
      "inventor_name_last": "Barrett",
      "inventor_name_first": "Christopher L.",
      "inventor_city": "Blacksburg",
      "inventor_state": "VA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Marathe",
      "inventor_name_first": "Madhav V.",
      "inventor_city": "Blacksburg",
      "inventor_state": "VA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Lewis",
      "inventor_name_first": "Bryan",
      "inventor_city": "Blacksburg",
      "inventor_state": "VA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Akupatni",
      "inventor_name_first": "Vivek Bharath",
      "inventor_city": "Jersey City",
      "inventor_state": "NJ",
      "inventor_country": "US"
    }
  ],
  "title": "Computerized Event-Forecasting System and User Interface",
  "decision": "PENDING",
  "_processing_info": {
    "original_size": 223312,
    "optimized_size": 3949,
    "reduction_percent": 98.23
  }
}