{
  "patent_number": "None",
  "application_number": "15494346",
  "date_published": "20171026",
  "date_produced": "20171011",
  "filing_date": "20170421",
  "main_ipcr_label": "G06N502",
  "abstract": "A prediction system provided with an integrated communications interface may include at least one processor configured to scrape the Internet to identify a currently pending legislative bill and information about legislators slated to vote on the pending bill. The processor may parse the information to determine a tendency position for each legislator. The processor may transmit for display to a system user a virtual whipboard that groups legislators into a plurality of groups based on determined tendency positions. The processor may receive a selected one of the plurality of groups of legislators for a communication interaction based on the determined tendency position of the group and access a legislator database that includes legislative communication addresses of legislative personnel scraped from the Internet and divided into a plurality of legislative function categories and receive from the system user a selection of at least one of the plurality of legislative function categori...",
  "publication_number": "US20170308795A1-20171026",
  "summary": "<SOH> SUMMARY <EOH>Embodiments consistent with the present disclosure provide systems and methods that incorporate machine-learning and data aggregation techniques to provide policymaking analyses and predictions. The policymaking analyses and predictions may encompass a wide range of policymaking processes (e.g., legislative, regulatory, and judicial processes) and may provide more accurate and targeted predictions. There are many possible applications for such capabilities. For example, organizations that cannot afford analysts, government relations experts, or traditional lobbyists and organizations that engage in in-house lobbying may benefit from the disclosed systems and methods. In addition, the disclosed systems and methods may eliminate redundancies when analyzing data across governmental levels and units. According to an aspect of the present disclosure, a hybrid prediction system is disclosed for aggregating electronic data from at least one Internet server and proprietary data, to identify and initially predict an outcome of a future event and to subsequently update the initial prediction. The system may comprise at least one processor configured to execute instructions and a memory storing the instructions. The instructions may comprise instructions to access data scraped from the Internet. The data may be associated with at least one future event. The instructions may further comprise instructions to store the scraped data and determine, from the scraped data, an initial prediction of the outcome of the at least one future event. The instructions may further comprise instructions to generate, from the scraped data, an initial likelihood indication associated with the initial prediction and transmit the initial prediction and the initial likelihood indication to a device. The device may be associated with one or more users. The instructions may further comprise instructions to receive proprietary information, store the proprietary information, and deter...",
  "ipcr_labels": [
    "G06N502",
    "G06Q5026"
  ],
  "inventor_list": [
    {
      "inventor_name_last": "Grom",
      "inventor_name_first": "Brian",
      "inventor_city": "Lake Worth",
      "inventor_state": "FL",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Argyle",
      "inventor_name_first": "Daniel",
      "inventor_city": "Alexandria",
      "inventor_state": "VA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Zoshak",
      "inventor_name_first": "John",
      "inventor_city": "Washington",
      "inventor_state": "DC",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Eidelman",
      "inventor_name_first": "Vladimir",
      "inventor_city": "Chevy Chase",
      "inventor_state": "MD",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Maglasang",
      "inventor_name_first": "Dan",
      "inventor_city": "Elkridge",
      "inventor_state": "MD",
      "inventor_country": "US"
    }
  ],
  "title": "SYSTEMS AND METHODS FOR PROVIDING A VIRTUAL WHIPBOARD",
  "decision": "PENDING",
  "_processing_info": {
    "original_size": 342969,
    "optimized_size": 4148,
    "reduction_percent": 98.79
  }
}