{
  "patent_number": "None",
  "application_number": "15494323",
  "date_published": "20171026",
  "date_produced": "20171011",
  "filing_date": "20170421",
  "main_ipcr_label": "G06N504",
  "abstract": "An Internet-based agenda data analysis system may include at least one processor configured to maintain a list of user-selectable agenda issues, present to a user via a user interface, the list of user-selectable agenda issues, and receive via the user interface, based on a selection from the list, agenda issues of interest to an organization. The processor may be configured to access information scraped from the Internet to determine, for a plurality of policymakers, individual policymaker data from which an alignment position of each policymaker on each of the agenda issues is determinable, calculate alignment position data from the individual policymaker data, the alignment position data corresponding to relative positions of each of the plurality of policymakers on each of the plurality of selected issues, and transform the alignment position data into a graphical display that presents the alignment positions of multiple policymakers.",
  "publication_number": "US20170308797A1-20171026",
  "summary": "<SOH> SUMMARY <EOH>Embodiments consistent with the present disclosure provide systems and methods that incorporate machine-learning and data aggregation techniques to provide policymaking analyses and predictions. The policymaking analyses and predictions may encompass a wide range of policymaking processes (e.g., legislative, regulatory, and judicial processes) and may provide more accurate and targeted predictions. There are many possible applications for such capabilities. For example, organizations that cannot afford analysts, government relations experts, or traditional lobbyists and organizations that engage in in-house lobbying may benefit from the disclosed systems and methods. In addition, the disclosed systems and methods may eliminate redundancies when analyzing data across governmental levels and units. According to an aspect of the present disclosure, a hybrid prediction system is disclosed for aggregating electronic data from at least one Internet server and proprietary data, to identify and initially predict an outcome of a future event and to subsequently update the initial prediction. The system may comprise at least one processor configured to execute instructions and a memory storing the instructions. The instructions may comprise instructions to access data scraped from the Internet. The data may be associated with at least one future event. The instructions may further comprise instructions to store the scraped data and determine, from the scraped data, an initial prediction of the outcome of the at least one future event. The instructions may further comprise instructions to generate, from the scraped data, an initial likelihood indication associated with the initial prediction and transmit the initial prediction and the initial likelihood indication to a device. The device may be associated with one or more users. The instructions may further comprise instructions to receive proprietary information, store the proprietary information, and deter...",
  "ipcr_labels": [
    "G06N504",
    "G06F30482",
    "G06Q5026",
    "G06F30484",
    "G06T1120"
  ],
  "inventor_list": [
    {
      "inventor_name_last": "Palombi",
      "inventor_name_first": "Bill",
      "inventor_city": "Washington",
      "inventor_state": "DC",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Argyle",
      "inventor_name_first": "Daniel",
      "inventor_city": "Alexandria",
      "inventor_state": "VA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Eidelman",
      "inventor_name_first": "Vladimir",
      "inventor_city": "Chevy Chase",
      "inventor_state": "MD",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Pinto",
      "inventor_name_first": "Jervis",
      "inventor_city": "Silver Spring",
      "inventor_state": "MD",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Grom",
      "inventor_name_first": "Brian",
      "inventor_city": "Lake Worth",
      "inventor_state": "FL",
      "inventor_country": "US"
    }
  ],
  "title": "SYSTEMS AND METHODS FOR ANALYZING POLICYMAKER ALIGNMENT WITH ORGANIZATIONAL POSTURE",
  "decision": "PENDING",
  "_processing_info": {
    "original_size": 341312,
    "optimized_size": 4170,
    "reduction_percent": 98.78
  }
}