{
  "patent_number": "None",
  "application_number": "15497913",
  "date_published": "20170810",
  "date_produced": "20170726",
  "filing_date": "20170426",
  "main_ipcr_label": "G06N504",
  "abstract": "Systems and methods for predicting power output from photo-voltaic power generation resources are disclosed. An analytics server is communicatively connected to a data acquisition component and a virtual system model database. The analytics server is operable to receive real-time data via the data acquisition component from an electrical system comprising photo-voltaic power generation resources; generate predicted data based on a virtual model of the electrical system provided by the virtual system model database; continuously and automatically synchronize the virtual model with the electrical system based on a difference between the real-time data and the predicted data; receive solar irradiance forecast data; and forecast a power output of the photo-voltaic power generation resources based on the virtual model and the solar irradiance forecast data. The photo-voltaic power generation resources include at least one photo-voltaic inverter.",
  "publication_number": "US20170228653A1-20170810",
  "summary": "<SOH> SUMMARY <EOH>Systems and methods for filtering and interpreting real-time sensory data from an electrical system comprising a non-traditional power generator are disclosed. In an embodiment, a system for predicting power output from a photo-voltaic power generator is disclosed. The system comprises at least one hardware processor; and one or more software modules that are configured to, when executed by the at least one hardware processor, receive real-time data from one or more sensors of an electrical system comprising a photo-voltaic power generator, generate predicted data based on a virtual model of the electrical system that replicates operation of the one or more sensors, continuously and automatically synchronize the virtual model with the electrical system based on a difference between the real-time data and the predicted data, receive solar irradiance forecast data, and forecast a power output of the photo-voltaic power generator based on the virtual model and the solar irradiance forecast data. In another embodiment, a method for predicting power output from a photo-voltaic power generator is disclosed. The method comprises using at least one hardware processor to: receive real-time data from one or more sensors of an electrical system comprising a photo-voltaic power generator, generate predicted data based on a virtual model of the electrical system that replicates operation of the one or more sensors, continuously and automatically synchronize the virtual model with the electrical system based on a difference between the real-time data and the predicted data, receive solar irradiance forecast data, and forecast a power output of the photo-voltaic power generator based on the virtual model and the solar irradiance forecast data. These and other features, aspects, and embodiments of the invention are described below in the section entitled “Detailed Description.”",
  "ipcr_labels": [
    "G06N504",
    "G06N9900",
    "G06F1750"
  ],
  "inventor_list": [
    {
      "inventor_name_last": "Meagher",
      "inventor_name_first": "Kevin",
      "inventor_city": "Raleigh",
      "inventor_state": "NC",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Radibratovic",
      "inventor_name_first": "Branislav",
      "inventor_city": "San Deigo",
      "inventor_state": "CA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Chudgar",
      "inventor_name_first": "Raj",
      "inventor_city": "Raleigh",
      "inventor_state": "NC",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Koopman",
      "inventor_name_first": "Rodger",
      "inventor_city": "Raleigh",
      "inventor_state": "NC",
      "inventor_country": "US"
    }
  ],
  "title": "Systems And Methods For Model-Based Solar Power Management",
  "decision": "PENDING",
  "_processing_info": {
    "original_size": 170977,
    "optimized_size": 3888,
    "reduction_percent": 97.73
  }
}