{
  "patent_number": "None",
  "application_number": "15499208",
  "date_published": "20171102",
  "date_produced": "20171018",
  "filing_date": "20170427",
  "main_ipcr_label": "G06N504",
  "abstract": "A system and method that includes receiving a problem request and publishing the problem request through a computing platform; accepting a set of responses to the problem request during an ideation stage; at a similarity engine of the computing platform, consolidating the set of responses to a set of base responses; retrieving judgments on base response comparisons of the set of base responses during a judgment stage; and generating a response report for the problem request.",
  "publication_number": "US20170316326A1-20171102",
  "summary": "<SOH> BRIEF DESCRIPTION OF THE FIGURES <EOH>FIG. 1 is a schematic representation of the system of a preferred embodiment; FIG. 2 is a schematic representation of an exemplary problem request interface; FIG. 3 is a schematic representation of an exemplary problem response interface; FIG. 4 is a schematic representation of an exemplary response judgment interface; FIGS. 5A and 5B are a schematic representations of exemplary reporting interfaces; FIG. 6 is a flowchart representation of a method of a preferred embodiment; FIG. 7 is a schematic representation of an implementation of a method of a preferred embodiment; FIG. 8 is a schematic representation of each combination of a base response comparisons being distributed to each participant; FIG. 9 is a schematic representation of base response comparisons distributed across participants; FIG. 10 is a schematic representation of base response comparisons distributed across participants of corresponding participant classifications; FIG. 11 is a flowchart representation of assigning a participant classification; FIG. 12 is a schematic representation of consolidating exemplary responses; and FIG. 13 is a flowchart representation of distributing pairwise judgments across participants. detailed-description description=\"Detailed Description\" end=\"lead\"?",
  "ipcr_labels": [
    "G06N504",
    "G06N504"
  ],
  "inventor_list": [
    {
      "inventor_name_last": "Ricketts",
      "inventor_name_first": "Mark Steven",
      "inventor_city": "Woodstock",
      "inventor_state": "",
      "inventor_country": "GB"
    },
    {
      "inventor_name_last": "Fielder-White",
      "inventor_name_first": "Jonathan Richard",
      "inventor_city": "Woodstock",
      "inventor_state": "",
      "inventor_country": "GB"
    },
    {
      "inventor_name_last": "Barnes",
      "inventor_name_first": "Denise",
      "inventor_city": "Woodstock",
      "inventor_state": "",
      "inventor_country": "GB"
    }
  ],
  "title": "SYSTEM AND METHOD FOR AUTOMATED DECISION MAKING",
  "decision": "PENDING",
  "_processing_info": {
    "original_size": 60136,
    "optimized_size": 2653,
    "reduction_percent": 95.59
  }
}