{
  "patent_number": "None",
  "application_number": "15499029",
  "date_published": "20171207",
  "date_produced": "20171121",
  "filing_date": "20170427",
  "main_ipcr_label": "G06N9900",
  "abstract": "A learning model difference providing method that causes a computer to execute a process which includes: calculating a mismatch degree between prediction data about arbitrary data included in a plurality of pieces of data that are input by using an application program, the prediction data being obtained by the plurality of pieces of data and a learning model in accordance with a purpose of use of the application program, and data that are specified for the arbitrary data; assessing whether or not the calculated mismatch degree exceeds a first degree; and transmitting the mismatch degree to a providing source of the learning model in a case where the mismatch degree is assessed as exceeding the first degree.",
  "publication_number": "US20170351972A1-20171207",
  "summary": "<SOH> SUMMARY <EOH>According to an aspect of the invention, a learning model difference providing method that causes a computer to execute a process. The process includes: calculating a mismatch degree between prediction data about arbitrary data included in a plurality of pieces of data that are input by using an application program, the prediction data being obtained by the plurality of pieces of data and a learning model in accordance with a purpose of use of the application program, and data that are specified for the arbitrary data; assessing whether or not the calculated mismatch degree exceeds a first degree; and transmitting the mismatch degree to a providing source of the learning model in a case where the mismatch degree is assessed as exceeding the first degree. The object and advantages of the invention will be realized and attained by means of the elements and combinations particularly pointed out in the claims. It is to be understood that both the foregoing general description and the following detailed description are exemplary and explanatory and are not restrictive of the invention, as claimed.",
  "ipcr_labels": [
    "G06N9900",
    "G06N502"
  ],
  "inventor_list": [
    {
      "inventor_name_last": "Kaniwa",
      "inventor_name_first": "Tomo",
      "inventor_city": "Kawasaki",
      "inventor_state": "",
      "inventor_country": "JP"
    },
    {
      "inventor_name_last": "Sato",
      "inventor_name_first": "Mitsuru",
      "inventor_city": "Kawasaki",
      "inventor_state": "",
      "inventor_country": "JP"
    }
  ],
  "title": "PROGRAM STORAGE MEDIUM, METHOD, AND SYSTEM FOR PROVIDING LEARNING MODEL DIFFERENCE",
  "decision": "PENDING",
  "_processing_info": {
    "original_size": 115533,
    "optimized_size": 2563,
    "reduction_percent": 97.78
  }
}