{
  "patent_number": "9990591",
  "application_number": "15490060",
  "date_published": "20171019",
  "date_produced": "20171004",
  "filing_date": "20170418",
  "main_ipcr_label": "G06N9900",
  "abstract": "Invoking an agent during a dialog between a user and an automated assistant. Some implementations are directed to receiving, during a human-to-automated assistant dialog, natural language input of the user that indicates a desire to engage an agent, but that fails to indicate a particular agent to be engaged. Those implementations are further directed to selecting a particular agent from a plurality of available agents, and transmitting an invocation request to the selected particular agent. In some implementations an agent selection model can be utilized in selecting the particular agent, such as a machine learning model. The machine learning model can be trained to enable generation of output that indicates, for each of a plurality of available agents (and optionally intent(s) for those agents), a probability that the available agent (and optionally intent) will generate appropriate responsive content.",
  "publication_number": "US20170300831A1-20171019",
  "summary": "<SOH> SUMMARY <EOH>This specification is directed generally to methods, systems, and computer-readable media for invoking an agent during a dialog between a user and an automated assistant. Invoking an agent can include transmitting (e.g., utilizing an application programming interface (API)) an invocation request that includes value(s) for invocation parameter(s) (e.g., a value for an intent parameter, value(s) for intent slot parameter(s), and/or value(s) for other parameter(s)), and that causes the agent to generate content for presentation to the user via one or more user interface output devices (e.g., via one or more of the user interface output devices utilized in the dialog with the automated assistant). The responsive content generated by the agent can be tailored to the invocation parameters of the invocation request. Some implementations are directed to receiving, during a human-to-automated assistant dialog, natural language input of the user that indicates a desire to engage an agent, but that fails to indicate a particular agent to be engaged. For example, “book me a hotel in Chicago” indicates a desire to engage an agent with a “hotel booking” intent parameter and a “Chicago” location parameter, but fails to specify the particular agent to invoke. Those implementations are further directed to selecting a particular agent from a plurality of available agents, and transmitting an invocation request to the selected particular agent. For example, the invocation request can be transmitted to the selected particular agent without transmission of the invocation request to any other of the available agents. In some of those implementations, a particular agent and a particular intent for the particular agent are selected (e.g., when the particular agent is operable to generate responsive content in response to any one of multiple disparate intents). In some of the implementations that select a particular agent from a plurality of available agents, an agent sel...",
  "ipcr_labels": [
    "G06N9900",
    "G06N300",
    "G10L1518",
    "G10L1522",
    "G10L1530",
    "G10L1522"
  ],
  "inventor_list": [
    {
      "inventor_name_last": "Gelfenbeyn",
      "inventor_name_first": "Ilya Gennadyevich",
      "inventor_city": "Sunnyvale",
      "inventor_state": "CA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Goncharuk",
      "inventor_name_first": "Artem",
      "inventor_city": "Mountain View",
      "inventor_state": "CA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Sirotin",
      "inventor_name_first": "Pavel",
      "inventor_city": "Sunnyvale",
      "inventor_state": "CA",
      "inventor_country": "US"
    }
  ],
  "title": "AUTOMATED ASSISTANT INVOCATION OF APPROPRIATE AGENT",
  "decision": "ACCEPTED",
  "_processing_info": {
    "original_size": 147566,
    "optimized_size": 3867,
    "reduction_percent": 97.38
  }
}