{
  "patent_number": "None",
  "application_number": "15508225",
  "date_published": "20171005",
  "date_produced": "20170920",
  "filing_date": "20170302",
  "main_ipcr_label": "G06N504",
  "abstract": "Provided are a leave of absence prediction system and the like capable of predicting whether an employees, etc. will take a leave of absence in a predetermined time. A leave of absence prediction system according to an aspect of the present invention is provided with: prediction rule learning means for generating a prediction rule regarding prediction of a likelihood of a leave of absence based on first attendance management information including a time-series factor concerning an employee and on information indicating presence or absence of the leave of absence concerning the employee relating to each piece of the first attendance management information, the likelihood of the leave of absence being a likelihood of the employee taking the leave of absence in a predetermined time; and prediction means for predicting the likelihood of the employee as a target of prediction taking the leave of absence based on second attendance management information including a time-series factor with re...",
  "publication_number": "US20170286842A1-20171005",
  "summary": "<SOH> SUMMARY OF INVENTION <EOH>",
  "ipcr_labels": [
    "G06N504",
    "G06Q1010",
    "G06N9900"
  ],
  "inventor_list": [
    {
      "inventor_name_last": "TAMANO",
      "inventor_name_first": "Hiroshi",
      "inventor_city": "Tokyo",
      "inventor_state": "",
      "inventor_country": "JP"
    },
    {
      "inventor_name_last": "SHINKAI",
      "inventor_name_first": "Atsushi",
      "inventor_city": "Tokyo",
      "inventor_state": "",
      "inventor_country": "JP"
    },
    {
      "inventor_name_last": "NAKAMICHI",
      "inventor_name_first": "Masashi",
      "inventor_city": "Tokyo",
      "inventor_state": "",
      "inventor_country": "JP"
    }
  ],
  "title": "LEAVE OF ABSENCE PREDICTION SYSTEM, PREDICTION RULE LEARNING DEVICE, PREDICTION DEVICE, LEAVE OF ABSENCE PREDICTION METHOD, AND COMPUTER-READABLE RECORDING MEDIUM",
  "decision": "PENDING",
  "_processing_info": {
    "original_size": 77200,
    "optimized_size": 1990,
    "reduction_percent": 97.42
  }
}