{
  "patent_number": "None",
  "application_number": "15500073",
  "date_published": "20170824",
  "date_produced": "20170809",
  "filing_date": "20170130",
  "main_ipcr_label": "G06N3063",
  "abstract": "A device according to examples of the present disclosure includes a crossbar array including a cell. The cell includes a first resistance switch and a second resistance switch connected in series with the first resistance switch. The first and second resistance switches have different switching characteristics. One of the first and second resistance switches may act as a switch, while the other of the first and second resistance switches may weight the switching behavior of the one that acts as the switch.",
  "publication_number": "US20170243109A1-20170824",
  "summary": "<SOH> BRIEF DESCRIPTION OF THE DRAWINGS <EOH>For a detailed description of various examples, reference will now be made to the accompanying drawings in which: FIG. 1 is a circuit diagram of a portion of a crossbar array with cells incorporating spatial and temporal functions, according to examples of the present disclosure; FIG. 2 is a circuit diagram of a memristor-based spatio-temporal synapse (MST) in a crossbar array, according to examples of the present disclosure; FIG. 3 is a circuit diagram of a MST in a crossbar array, according to examples of the present disclosure; FIG. 4 is a cross sectional view of the MST illustrated in FIG. 3 , according to examples of the present disclosure; FIG. 5 illustrates current as a function of voltage through a MST illustrated in FIGS. 3 and 4 and through two memristors in the MST, at a small voltage and at a larger voltage, for two different initialization states, according to examples of the present disclosure; FIG. 6 is a state diagram describing the behavior of the MST of FIG. 3 , according to examples of the present disclosure; FIG. 7 illustrates voltage, conductance, and charge as a function of time for the MST illustrated in FIGS. 3 and 4 , in the case where the input neuron fires much faster than the output neuron, according to examples of the present disclosure; FIG. 8 illustrates voltage, conductance, and charge as a function of time for the MST illustrated in FIGS. 3 and 4 , in the case where the input neuron and the output neuron are strongly correlated, such that their firing events alternate, according to examples of the present disclosure; FIG. 9 illustrates voltage, conductance, and charge as a function of time for the MST illustrated in FIGS. 3 and 4 , in the case where the output neuron fires more quickly and more frequently than the input neuron, according to examples of the present disclosure; FIG. 10 illustrates the tunability of the MST of FIGS. 3 and 4 , according to examples of the present disclosure; F...",
  "ipcr_labels": [
    "G06N3063",
    "G06N308",
    "G06N304"
  ],
  "inventor_list": [
    {
      "inventor_name_last": "HU",
      "inventor_name_first": "Miao",
      "inventor_city": "Palo Alto",
      "inventor_state": "CA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "YANG",
      "inventor_name_first": "Jianhua",
      "inventor_city": "Palo Alto",
      "inventor_state": "CA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "GE",
      "inventor_name_first": "Ning",
      "inventor_city": "Palo Alto",
      "inventor_state": "CA",
      "inventor_country": "US"
    }
  ],
  "title": "DEVICE WITH MULTIPLE RESISTANCE SWITCHES WITH DIFFERENT SWITCHING CHARACTERISTICS",
  "decision": "PENDING",
  "_processing_info": {
    "original_size": 43082,
    "optimized_size": 3386,
    "reduction_percent": 92.14
  }
}