{
  "patent_number": "9830553",
  "application_number": "15502528",
  "date_published": "20170824",
  "date_produced": "20170809",
  "filing_date": "20170208",
  "main_ipcr_label": "G06N312",
  "abstract": "A code book is generated for mapping source to target code words which allows encoding source data at reduced probability of incorrect decoding, e.g. for DNA storage. The target code words are grouped (102) into subsets and comprise identifying and remaining portions. The identifying portions of target code words corresponding to a same subset are identical. A first code symbol set of source code words is selected (103) for addressing the subsets. For the subsets, neighboring subsets are determined (104). The identifying portions of the target code words of neighboring subsets differ from those of the corresponding subset by up to a predetermined amount of symbols. Source code words are assigned (105) where the corresponding first code symbols address the same subset to said subset such that an amount of target code words of said subset having their remaining portions identical to their neighboring subsets corresponds to an optimization criterion.",
  "publication_number": "US20170243115A1-20170824",
  "summary": "<SOH> SUMMARY <EOH>According to an aspect of the present principles, a computer-implemented code book generation method for mapping a plurality of source code words to a plurality of target code words comprises providing a plurality of source code words and a plurality of target code words; grouping the plurality of target code words into a plurality of subsets of the target code words, the target code words comprising an identifying portion and a remaining portion, wherein the identifying portions of the target code words corresponding to a same subset of the plurality of subsets are identical; selecting a first set of code symbols of the source code words for addressing the plurality of subsets; determining for the subsets one or more corresponding neighboring subsets within the plurality of subsets, wherein the identifying portions of the target code words of the one or more neighboring subsets differ from the identifying portion of the target code words of the corresponding subset by up to a predetermined amount of code symbols; and assigning source code words where the corresponding first set of code symbols addresses the same subset, to target code words of said subset such that an amount of the target code words of said subset said source code words are assigned to, having their remaining portions identical to the corresponding remaining portions of the target code words of their neighboring subsets corresponds to an optimization criterion, e.g. is maximized. Accordingly, a code generating apparatus for mapping a plurality of source code words to a plurality of target code words comprises a first input ( 501 ) for receiving target code words and a second input ( 502 ) for receiving source code words; a code word grouping unit configured to group the plurality of target code words into a plurality of subsets of the target code words, the target code words comprising an identifying portion and a remaining portion, wherein the identifying portions of the target ...",
  "ipcr_labels": [
    "G06N312",
    "G11C1300",
    "H03M514"
  ],
  "inventor_list": [
    {
      "inventor_name_last": "CHEN",
      "inventor_name_first": "Xiaoming",
      "inventor_city": "Hannover",
      "inventor_state": "",
      "inventor_country": "DE"
    },
    {
      "inventor_name_last": "BLAWAT",
      "inventor_name_first": "Melnolf",
      "inventor_city": "Hannover",
      "inventor_state": "",
      "inventor_country": "DE"
    },
    {
      "inventor_name_last": "GAEDKE",
      "inventor_name_first": "KIaus",
      "inventor_city": "Schaumannweg 22",
      "inventor_state": "",
      "inventor_country": "DE"
    },
    {
      "inventor_name_last": "HUETTER",
      "inventor_name_first": "Ingo",
      "inventor_city": "Pattensen",
      "inventor_state": "",
      "inventor_country": "DE"
    }
  ],
  "title": "CODE GENERATION METHOD, CODE GENERATING APPARATUS AND COMPUTER READABLE STORAGE MEDIUM",
  "decision": "ACCEPTED",
  "_processing_info": {
    "original_size": 112438,
    "optimized_size": 3999,
    "reduction_percent": 96.44
  }
}