{
  "patent_number": "None",
  "application_number": "15504717",
  "date_published": "20170817",
  "date_produced": "20170802",
  "filing_date": "20170217",
  "main_ipcr_label": "G06N504",
  "abstract": "Method for configuring an apparatus or method for prediction of a malfunction of a unit, includes providing components of the unit; providing single malfunctions for each component; providing probabilities for the single malfunctions of each component; providing a parameter of each component for each single malfunction of this component; dividing each parameter into discrete value states; providing values of the parameters; determining a transition matrix for each parameter on the basis of the measurements of this parameter, wherein the transition matrix includes for the plurality of discrete value states of each parameter the probabilities to switch from one of the discrete value states to another of the discrete value states within a certain time period; determining the probabilities of the discrete value states on the basis of the measurements of the parameters; and providing the conditional probabilities of the discrete value states given the corresponding single malfunction.",
  "publication_number": "US20170236064A1-20170817",
  "summary": "<SOH> BRIEF SUMMARY OF THE INVENTION <EOH>One aim of the invention is to find a method for predicting a malfunction of a technical entity, where the method is independent of component types and can compute the probability of this malfunction for any future point in time. Another aim of the invention is to find a computationally-efficient method for predicting a malfunction of a component and/or unit. Another aim of the invention is to find a method that reduces the model creation and configuration effort required to predict a component malfunction. Another aim of the invention is to find a method to configure such a method/apparatus for predicting a malfunction of a component/unit of a technical entity. Another aim of the invention is to find a method for predicting a malfunction of a component based on the component's available condition and process parameters. The invention achieves these aims through a method, computer program or apparatus for predicting component malfunctions comprised of the following steps: determining a conditional probability distribution for a parameter of the component for a future point in time given the current value of the parameter based on the current value of the parameter, which is preferably a discrete value; determining a conditional probability for a malfunction at the future point in time given the current value of the parameter based on the conditional probability distribution of the parameter for the future point in time given the current value of the parameter and on a conditional probability distribution for the malfunction given the parameter. In other words, this problem is solved by determining a conditional probability distribution P t0+Δt (a|a(t 0 )) for a parameter a of the component for a future point in time t 0 +Δt given the current value a(t 0 ) of the parameter based on the current value of the parameter a(t 0 ); and by determining a conditional probability P t0+Δt (M|a(t 0 )) for a malfunction M at the future poi...",
  "ipcr_labels": [
    "G06N504",
    "F02D4122",
    "F01D2100"
  ],
  "inventor_list": [
    {
      "inventor_name_last": "Kirschnick",
      "inventor_name_first": "Frank",
      "inventor_city": "Adliswil",
      "inventor_state": "",
      "inventor_country": "CH"
    }
  ],
  "title": "CONFIGURATION OF MALFUNCTION PREDICTION FOR COMPONENTS AND UNITS OF TECHNICAL ENTITIES",
  "decision": "PENDING",
  "_processing_info": {
    "original_size": 96709,
    "optimized_size": 3608,
    "reduction_percent": 96.27
  }
}