{
  "patent_number": "None",
  "application_number": "15509512",
  "date_published": "20171005",
  "date_produced": "20170920",
  "filing_date": "20170308",
  "main_ipcr_label": "G06N312",
  "abstract": "The present invention discloses a micro-grid distributed energy resource bidding method based on artificial immunity including the following steps: processing the collected information by a bidding unit agent to form artificial immune antigen of quotation environmental; performing solving based on artificial immune algorithm to obtain antibody meeting the interest of a distributed energy resource; and decoding the antibody to obtain a bidding scheme of the distributed energy resource. The present invention utilizes artificial immune intelligent algorithm with strong ability of information processing and self-adaption, thus solving the problem of uncontrollable bidding under complicated environment. Uncertainty problem resulted by the intermittent power supply is overcomed by the capability of self-adaption and defect tolerance of artificial immunity during bidding process. In addition, the coordination of entire micro-grid MAS is improves by coordinated evolution of artificial immunity...",
  "publication_number": "US20170286834A1-20171005",
  "summary": "<SOH> SUMMARY OF THE INVENTION <EOH>The present invention provides a micro-grid distributed energy resource bidding method based on artificial immunity. It can solve the existing problems such as conflict in interest distribution inside the micro-grid especially when devices therein belong to different owners or when public micro-grid is involved. The present method provides guidance to optimized operation of the micro-grid by market mechanism of bidding. The method is described as follows. A micro-grid distributed energy resource bidding method based on the artificial immunity includes the following steps: Process the collected information by a bidding unit agent to form the quotation environmental antigen of artificial immune; Perform solving based on artificial immune algorithm to obtain the antibody meeting self-interests of a distributed energy resource; and Decode the antibody to obtain a bidding scheme of the distributed energy resource. The steps of solving based on artificial immune algorithm to obtain antibody meeting self-interests of a distributed energy resource, and decoding the antibody to obtain a bidding scheme of the distributed energy resource may be divided into the following sub steps: (1) Establish an antigen knowledge base based on typical characteristics of a bidding device and typical external environment; (2) Initiate a gene base based on history bidding strategy of the bidding process; (3) Identify the antigen and compare it with a typical antigen stored in the antigen knowledge base, if a matched antigen is found, then perform step (4), otherwise perform step (5); (4) Perform a secondary artificial immunity response, take an antibody corresponding to the antigen in the antigen knowledge base as an antibody representative, and perform step (6); (5) Perform a primary response to a mismatched antigen to achieve an antibody meeting affinity as an antibody representative, and store the matched antigen and antibody representative as a scene int...",
  "ipcr_labels": [
    "G06N312",
    "H02J346",
    "H02J338",
    "G06N502",
    "G06N700"
  ],
  "inventor_list": [
    {
      "inventor_name_last": "KONG",
      "inventor_name_first": "Xiangyu",
      "inventor_city": "Tianjin",
      "inventor_state": "",
      "inventor_country": "CN"
    }
  ],
  "title": "BIDDING METHOD OF DISTRIBUTED ENERGY RESOURCE IN MICRO-GRID BASED ON ARTIFICIAL IMMUNITY",
  "decision": "PENDING",
  "_processing_info": {
    "original_size": 59871,
    "optimized_size": 3619,
    "reduction_percent": 93.96
  }
}