{
  "patent_number": "None",
  "application_number": "15513749",
  "date_published": "20171019",
  "date_produced": "20171004",
  "filing_date": "20170323",
  "main_ipcr_label": "G06N504",
  "abstract": "A time-series prediction apparatus 10, which is an information processing apparatus that predicts transition of time-series data on a matter, calculates a relevance level which is an index of strength of a causal relation between a plurality of matters including a prediction target matter, based on time-series data relevant to each of the matters and on time-series data relevant to the causal relation between the matters, and predicts transition of the time-series data relevant to the matter based on the calculated relevance level. The time-series prediction apparatus 10 calculates the relevance level based on collocation frequency of terms relevant to the respective matters in the time-series data relevant to the causal relation between the matters. The time-series prediction apparatus 10 builds multiple prediction models for predicting the transition of the time-series data relevant to the prediction target matter based on time-series data relevant to a matter which is in a causal re...",
  "publication_number": "US20170300819A1-20171019",
  "summary": "<SOH> SUMMARY OF INVENTION <EOH>",
  "ipcr_labels": [
    "G06N504"
  ],
  "inventor_list": [
    {
      "inventor_name_last": "HAYASHI",
      "inventor_name_first": "Yu",
      "inventor_city": "Tokyo",
      "inventor_state": "",
      "inventor_country": "JP"
    },
    {
      "inventor_name_last": "TOMITA",
      "inventor_name_first": "Naofumi",
      "inventor_city": "Tokyo",
      "inventor_state": "",
      "inventor_country": "JP"
    },
    {
      "inventor_name_last": "ISHIGURO",
      "inventor_name_first": "Masao",
      "inventor_city": "Tokyo",
      "inventor_state": "",
      "inventor_country": "JP"
    },
    {
      "inventor_name_last": "HIROI",
      "inventor_name_first": "Kazushige",
      "inventor_city": "Tokyo",
      "inventor_state": "",
      "inventor_country": "JP"
    }
  ],
  "title": "Time-Series Prediction Apparatus and Time-Series Prediction Method",
  "decision": "PENDING",
  "_processing_info": {
    "original_size": 52527,
    "optimized_size": 2005,
    "reduction_percent": 96.18
  }
}