{
  "patent_number": "None",
  "application_number": "15518221",
  "date_published": "20171026",
  "date_produced": "20171011",
  "filing_date": "20170410",
  "main_ipcr_label": "G06N9900",
  "abstract": "An approach is provided for adiabatic quantum annealing (computing, AQC). There is disclosed an apparatus comprising a first quantum dot and a second quantum dot forming a first kind of double quantum dot; and a third quantum dot and a fourth quantum dot forming a second kind of double quantum dot. The apparatus also comprises a first control element for adjusting a capacitance of a capacitive element; a second control element for supplying a control voltage to the first kind of double quantum dot; a metallic or superconducting contact to capacitively couple the first kind of double quantum dot to the fourth quantum dot; and an electric charge sensor for providing an indication of the state of the first kind of double quantum dot. The present invention also relates to a method for controlling the apparatus.",
  "publication_number": "US20170308804A1-20171026",
  "summary": "<SOH> BRIEF DESCRIPTION OF THE DRAWINGS <EOH>The embodiments of the invention are illustrated by way of example, and not by way of limitation, in the figures of the accompanying drawings: FIG. 1 is an illustration of an example of a coupling between two double quantum dot charge qubits via a capacitive bus according to an exemplary embodiment; FIG. 2 is an illustration of an example of coupling between N double quantum dot charge qubits via a capacitive bus according to an exemplary embodiment; FIG. 3 illustrates how a variable capacitance may be mediated by an additional conductor; FIG. 4 is an illustration of a possible realization of the capacitive coupling; FIG. 5 is another illustration of a possible realization of the capacitive coupling; FIG. 6 depicts an example of a layout of a Boltzmann machine incorporating several layers; FIG. 7 is an illustration of a possible connectivity involving several bus couplers; FIG. 8 depicts an example of an arrangement of gates that enables tuning of the variable capacitance and the bias for the qubit; FIG. 9 depicts an example of a multiplexer; FIG. 10 depicts an example implementation of a multiplexer; FIG. 11 depicts an example of a qubit readout mechanism using a quantum point contact; FIG. 12 depicts an example of an electrical circuit diagram of a readout mechanism; FIG. 13 illustrates of an example of operation of a readout scheme; FIG. 14 depicts an example layout of a functional 8 bit quantum annealing cell; FIG. 15 is an illustration of a structure of a set of qubits of an adiabatic quantum annealing processor and some interactions between the qubits; FIG. 16 is an illustration of changing from an initial Hamiltonian to a final problem Hamiltonian with a computationally relevant ground state; FIG. 17 is a diagram of some components of a computing apparatus comprising one or more sets of qubits according to an exemplary embodiment; FIG. 18 is another diagram of some components of a computing apparatus comprising one...",
  "ipcr_labels": [
    "G06N9900",
    "H01L3922",
    "H01L2718"
  ],
  "inventor_list": [
    {
      "inventor_name_last": "WABNIG",
      "inventor_name_first": "Joachim",
      "inventor_city": "Cambridge",
      "inventor_state": "",
      "inventor_country": "GB"
    },
    {
      "inventor_name_last": "NISKANEN",
      "inventor_name_first": "Antti",
      "inventor_city": "Espoo",
      "inventor_state": "",
      "inventor_country": "FI"
    }
  ],
  "title": "METHOD AND APPARATUS FOR ADIABATIC QUANTUM ANNEALING",
  "decision": "PENDING",
  "_processing_info": {
    "original_size": 53327,
    "optimized_size": 3526,
    "reduction_percent": 93.39
  }
}