{
  "patent_number": "None",
  "application_number": "15512042",
  "date_published": "20171130",
  "date_produced": "20171115",
  "filing_date": "20170316",
  "main_ipcr_label": "G06N9900",
  "abstract": "An information processing apparatus includes a control unit that creates a plurality of learning information items including an input image and a teacher image as an expected value by image-processing the input image in accordance with a scenario described with a program code, and supplies the created plurality of learning information items to a machine learning module that composes an image processing algorithm by machine learning.",
  "publication_number": "US20170344907A1-20171130",
  "summary": "<SOH> BRIEF DESCRIPTION OF DRAWINGS <EOH>FIG. 1 is a diagram showing a configuration of a design device of an image processing algorithm in a first embodiment according to the present technology. FIG. 2 describes creation of a learning information item by a physical simulator 20 . FIG. 3 is a block diagram showing a configuration of a design device of an image processing algorithm in a second embodiment according to the present technology. FIG. 4 is a diagram showing a configuration of a dimension reduction function. FIG. 5 is a diagram showing an example of a self-organization function. FIG. 6 is a diagram showing a configuration example of a combination type function of dimension reduction and self-organization. FIG. 7 is a diagram showing an example of a typical machine learning. FIG. 8 is a diagram showing an example of the machine learning by the combination type function of dimension reduction and self-organization in FIG. 6 . FIG. 9 is a diagram showing a configuration upon the machine learning by a composite type function. FIG. 10 is a diagram showing a configuration upon data processing by the composite type function. FIG. 11 is a diagram showing a configuration upon the machine learning by a machine learning module in a combination type of a recursive type function and a composite type function. FIG. 12 is a diagram showing a configuration upon image processing by the machine learning module in a combination type of a recursive type function and a composite type function shown in FIG. 11 . FIG. 13 is a diagram showing a configuration of a machine learning module where an empirical rule accumulation type function is plugged in. FIG. 14 is a diagram illustrating a method of accumulating information on the basis of an empirical rule. FIG. 15 is also a diagram illustrating a method of accumulating information on the basis of an empirical rule. FIG. 16 is a diagram showing a configuration of an orthogonal control type function. FIG. 17 is a diagram showing a co...",
  "ipcr_labels": [
    "G06N9900",
    "G06T700"
  ],
  "inventor_list": [
    {
      "inventor_name_last": "ARAI",
      "inventor_name_first": "HIROSHI",
      "inventor_city": "KANAGAWA",
      "inventor_state": "",
      "inventor_country": "JP"
    }
  ],
  "title": "INFORMATION PROCESSING APPARATUS, INFORMATION PROCESSING METHOD AND PROGRAM",
  "decision": "PENDING",
  "_processing_info": {
    "original_size": 47385,
    "optimized_size": 3009,
    "reduction_percent": 93.65
  }
}