{
  "patent_number": "None",
  "application_number": "15524149",
  "date_published": "20171109",
  "date_produced": "20171025",
  "filing_date": "20170503",
  "main_ipcr_label": "G06N700",
  "abstract": "A plurality of binary support vector machines (SVM) are trained to vote between two of a plurality of classes. Each of the binary SVMs vote between a different pair of the plurality of classes. A set of validated samples is input to each of the binary SVMs. The set of validated samples includes samples of each of the classes. Likelihood estimates are determined based on votes of the binary SVMs. A prior probability distribution (prior) is assigned for each of the classes. A posterior probability is calculated for each of the classes based on the determined likelihood estimates and the assigned priors.",
  "publication_number": "US20170323217A1-20171109",
  "summary": "<SOH> BRIEF DESCRIPTION OF THE DRAWINGS <EOH>The following detailed description references the drawings, wherein: FIG. 1 is an example block diagram of a system to calculate a posterior probability of a plurality of classes; FIG. 2 is another example block diagram of a system to calculate a posterior probability of a plurality of classes; FIG. 3 is an example block diagram of a computing device including instructions for calculating a posterior probability of a plurality of classes; and FIG. 4 is an example flowchart of a method for calculating a posterior probability of a plurality of classes. detailed-description description=\"Detailed Description\" end=\"lead\"?",
  "ipcr_labels": [
    "G06N700",
    "G06N9900"
  ],
  "inventor_list": [
    {
      "inventor_name_last": "SAKLATVALA",
      "inventor_name_first": "George",
      "inventor_city": "Cambridge",
      "inventor_state": "",
      "inventor_country": "GB"
    },
    {
      "inventor_name_last": "CAMERON",
      "inventor_name_first": "Pashmina",
      "inventor_city": "Cambridge",
      "inventor_state": "",
      "inventor_country": "GB"
    }
  ],
  "title": "CALCULATING POSTERIOR PROBABILITY OF CLASSES",
  "decision": "PENDING",
  "_processing_info": {
    "original_size": 35436,
    "optimized_size": 1973,
    "reduction_percent": 94.43
  }
}