{
  "patent_number": "None",
  "application_number": "15520108",
  "date_published": "20171102",
  "date_produced": "20171018",
  "filing_date": "20170419",
  "main_ipcr_label": "G06N9900",
  "abstract": "An ion trap device is provided as well as a method of manufacturing the ion trap device including a substrate, central DC electrode, RF electrode, side electrode and an insulating layer. Disposed over the substrate, the central DC electrode includes DC connector pad and DC rail connected thereto. The RF electrode includes RF rail adjacent to the DC rail and RF pad connected to RF rail. The side electrode has RF electrode disposed between thereof and the central DC electrode. The insulating layer supports one of the central DC electrode, RF electrode and side electrode, on a top surface of the substrate. The insulating layer includes first insulating layer and second insulating layer disposed over the first insulating layer, and the second insulating layer includes an overhang protruding with respect to the first insulating layer in a width direction of the ion trap device.",
  "publication_number": "US20170316335A1-20171102",
  "summary": "<SOH> SUMMARY <EOH>In accordance with some embodiments of the present disclosure, an apparatus an ion trap device includes a substrate, at least one central DC electrode, an RF electrode, at least one side electrode, at least one side electrode and an insulating layer. The at least one central DC electrode is disposed over the substrate includes a DC connector pad, and a DC rail connected to the DC connector pad. The RF electrode is disposed over the substrate and includes at least one RF rail located adjacent to the DC rail, and an RF pad connected to the at least one RF rail. The at least one side electrode is disposed over the substrate with the RF electrode disposed between the central DC electrode and the side electrode. The insulating layer is configured to support at least one of the central DC electrode, the RF electrode or the side electrode, on a top surface of the substrate. The insulating layer includes a first insulating layer and a second insulating layer disposed over the first insulating layer, and the second insulating layer includes an overhang that protrudes with respect to the first insulating layer in a width direction of the ion trap device. In accordance with some embodiments of the present disclosure, the central DC electrode includes a first central DC electrode having a first DC rail and a second central DC electrode having a second DC rail. The first DC rail and the second DC rail may be spaced apart from each other to form a trap region therebetween, and an entire thickness of the substrate may be removed at a region corresponding to the trap region. In accordance with some embodiments of the present disclosure, the second insulating layer that supports the electrode close to the trap region includes the overhang. The overhang may protrude in a direction heading for the trap region. In accordance with some embodiments of the present disclosure, the at least one side electrode includes a plurality of side electrodes disposed at predetermin...",
  "ipcr_labels": [
    "G06N9900",
    "H01L4900"
  ],
  "inventor_list": [
    {
      "inventor_name_last": "KIM",
      "inventor_name_first": "Taehyun",
      "inventor_city": "Seoul",
      "inventor_state": "",
      "inventor_country": "KR"
    },
    {
      "inventor_name_last": "CHO",
      "inventor_name_first": "Dongil",
      "inventor_city": "Seoul",
      "inventor_state": "",
      "inventor_country": "KR"
    },
    {
      "inventor_name_last": "HONG",
      "inventor_name_first": "Seokjun",
      "inventor_city": "Seoul",
      "inventor_state": "",
      "inventor_country": "KR"
    },
    {
      "inventor_name_last": "LEE",
      "inventor_name_first": "Minjae",
      "inventor_city": "Seoul",
      "inventor_state": "",
      "inventor_country": "KR"
    },
    {
      "inventor_name_last": "CHEON",
      "inventor_name_first": "Hongjin",
      "inventor_city": "Seoul",
      "inventor_state": "",
      "inventor_country": "KR"
    }
  ],
  "title": "ION TRAPPING DEVICE WITH INSULATING LAYER EXPOSURE PREVENTION AND METHOD FOR MANUFACTURING SAME",
  "decision": "PENDING",
  "_processing_info": {
    "original_size": 50815,
    "optimized_size": 4032,
    "reduction_percent": 92.07
  }
}