{
  "date_produced": "20170524",
  "publication_number": "US20170161609A1-20170608",
  "main_ipcr_label": "G06N308",
  "decision": "PENDING",
  "application_number": "15530345",
  "inventor_list": [
    {
      "inventor_name_last": "Wood",
      "inventor_name_first": "Samuel Frederick",
      "inventor_city": "Los Altos Hills",
      "inventor_state": "CA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Wood",
      "inventor_name_first": "Samuel Bennett",
      "inventor_city": "Los Altos Hills",
      "inventor_state": "CA",
      "inventor_country": "US"
    }
  ],
  "abstract": "This application discloses a neural network that also functions as a packet data network using an MPLS-type label switching technology. The neural network uses its intelligence to build and manage label switched paths (LSPs) to transport user packets and solve complex mathematical problems. This architecture is well suited to interconnect large numbers of processors or computers into a neural network exhibiting advanced intelligence which can be used for complex activities such as managing the power grid. However, the methods taught here can be applied to other data networks including ad-hoc, mobile, Information Centric, Content Centric, Sensor, and traditional IP packet networks, cell or frame-switched networks, time-slot networks and the like.",
  "filing_date": "20161228",
  "patent_number": "None",
  "summary": "<SOH> SUMMARY OF THE INVENTION <EOH>A previous application, now U.S. Pat. No. 8,547,981, to which this application is a continuation-in-part, called an SRP network, demonstrated a neural network capable of making complex path selection decisions for a packet data network. This application enhances that system to allow it to exhibit more general purpose neural network functionality including the solving of complex mathematical optimization problems. In order to understand the specialized terms used in this application, a glossary is provided.",
  "date_published": "20170608",
  "title": "Data neural network system and method",
  "ipcr_labels": [
    "G06N308",
    "H04L12751"
  ],
  "_processing_info": {
    "original_size": 113426,
    "optimized_size": 2011,
    "reduction_percent": 98.23
  }
}