{
  "patent_number": "None",
  "application_number": "15532982",
  "date_published": "20171123",
  "date_produced": "20171108",
  "filing_date": "20170602",
  "main_ipcr_label": "G06N700",
  "abstract": "Example embodiments relate to scalable web data extraction. In example embodiments, a joint potential function is defined for data record segments of web data extracted from a web page, where the joint potential function models data record segmentation of the web data and dependencies between pairs of data segments in the data record segments. At this stage, a principal record segment and several related record segments are identified from the data record segments, where each of the plurality of related record segments is associated with the principal record segment. A related attribute is determined for each related record segment. Next, the joint potential function is applied to the principal record segment and each corresponding related segment to determine a relationship label that describes a data relationship between the principal record segment and the corresponding related segment.",
  "publication_number": "US20170337484A1-20171123",
  "summary": "<SOH> BRIEF DESCRIPTION OF THE DRAWINGS <EOH>The following detailed description references the drawings, wherein: FIG. 1 is a block diagram of an example computing device for providing scalable web data extraction; FIG. 2 is a block diagram of an example computing device in communication with web servers for providing scalable web data extraction; FIG. 3 is a flowchart of an example method for execution by a computing device for providing scalable web data extraction; and FIG. 4 is a diagram of example relationship labels resulting from analysis of data record segments in web data. detailed-description description=\"Detailed Description\" end=\"lead\"?",
  "ipcr_labels": [
    "G06N700",
    "G06F1718",
    "G06F1730"
  ],
  "inventor_list": [
    {
      "inventor_name_last": "Yu",
      "inventor_name_first": "Xiaofeng",
      "inventor_city": "Beijing",
      "inventor_state": "",
      "inventor_country": "CN"
    },
    {
      "inventor_name_last": "Xie",
      "inventor_name_first": "Jun Qing",
      "inventor_city": "Beijing",
      "inventor_state": "",
      "inventor_country": "CN"
    }
  ],
  "title": "SCALABLE WEB DATA EXTRACTION",
  "decision": "PENDING",
  "_processing_info": {
    "original_size": 42010,
    "optimized_size": 2236,
    "reduction_percent": 94.68
  }
}