{
  "patent_number": "None",
  "application_number": "15546708",
  "date_published": "20180125",
  "date_produced": "20180109",
  "filing_date": "20170727",
  "main_ipcr_label": "G06N700",
  "abstract": "[Object] To provide an information processing apparatus, an information processing method, and a program, each of which is capable of providing, by using a prediction result regarding a certain user, useful information to another user. [Solution] The information processing apparatus includes an output control unit configured to output, to a first user, prediction information indicating a prediction result of context information of a second user, the prediction information being related to the context information of the first user and being generated on the basis of a history of the context information of the second user.",
  "publication_number": "US20180025283A1-20180125",
  "summary": "<SOH> BRIEF DESCRIPTION OF DRAWINGS <EOH>FIG. 1 is a view for describing an outline of an information processing system according to the present embodiment. FIG. 2 is a block diagram showing an example of a logical configuration of the information processing system according to the present embodiment. FIG. 3 is a view for describing a display example performed by the information processing system according to the present embodiment. FIG. 4 is a view for describing a display example performed by the information processing system according to the present embodiment. FIG. 5 is a view for describing a display example performed by the information processing system according to the present embodiment. FIG. 6 is a view for describing a display example performed by the information processing system according to the present embodiment. FIG. 7 is a view for describing a display example performed by the information processing system according to the present embodiment. FIG. 8 is a view for describing a display example performed by the information processing system according to the present embodiment. FIG. 9 is a view for describing a display example performed by the information processing system according to the present embodiment. FIG. 10 is a view for describing a display example performed by the information processing system according to the present embodiment. FIG. 11 is a view for describing a display example performed by the information processing system according to the present embodiment. FIG. 12 is a view for describing a display example performed by the information processing system according to the present embodiment. FIG. 13 is a flowchart showing an example of a flow of learning processing of a predictor executed in a server according to the present embodiment. FIG. 14 is a flowchart showing an example of a flow of display processing of prediction information executed in the server according to the present embodiment. FIG. 15 is a flowchart showing an example of a...",
  "ipcr_labels": [
    "G06N700",
    "G06N502"
  ],
  "inventor_list": [
    {
      "inventor_name_last": "KOBAYASHI",
      "inventor_name_first": "Yoshiyuki",
      "inventor_city": "Tokyo",
      "inventor_state": "",
      "inventor_country": "JP"
    },
    {
      "inventor_name_last": "KURATA",
      "inventor_name_first": "Masatomo",
      "inventor_city": "Tokyo",
      "inventor_state": "",
      "inventor_country": "JP"
    },
    {
      "inventor_name_last": "TAKAOKA",
      "inventor_name_first": "Tomohisa",
      "inventor_city": "Kanagawa",
      "inventor_state": "",
      "inventor_country": "JP"
    }
  ],
  "title": "INFORMATION PROCESSING APPARATUS, INFORMATION PROCESSING METHOD, AND PROGRAM",
  "decision": "PENDING",
  "_processing_info": {
    "original_size": 91950,
    "optimized_size": 3494,
    "reduction_percent": 96.2
  }
}