{
  "patent_number": "None",
  "application_number": "15544593",
  "date_published": "20180111",
  "date_produced": "20171227",
  "filing_date": "20170719",
  "main_ipcr_label": "G06N304",
  "abstract": "A cognitive computing system for enhancing workflow performance in the oil and gas industry, in some embodiments, comprises: neurosynaptic processing logic including multiple electronic neurons operating in parallel; input and output interfaces coupled to the neurosynaptic processing logic; and one or more information repositories accessible to the neurosynaptic processing logic, wherein the neurosynaptic processing logic receives a workflow enhancement request via the input interface, accesses the one or more information repositories to obtain information pertaining to the request, uses said information to perform a probability analysis, produces an option relating to the workflow enhancement request based on said probability analysis, and presents said option via the output interface.",
  "publication_number": "US20180012122A1-20180111",
  "summary": "<SOH> BRIEF DESCRIPTION OF THE DRAWINGS <EOH>Accordingly, there are disclosed in the drawings and in the following description cognitive computing systems and methods that enhance workflow performance in the oil and gas industry. In the drawings: FIG. 1A is an illustration of a pair of biological neurons communicating via a synapse. FIG. 1B is a mathematical representation of an electronic neuron. FIG. 1C is a schematic diagram of a neurosynaptic tile for use in a cognitive computer. FIG. 1D is a schematic diagram of a circuit that embodies an electronic synapse. FIG. 1E is a schematic diagram of an electronic neuron. FIG. 1F is a block diagram of an electronic neuron spiking logic. FIG. 2 is a schematic diagram of a neurosynaptic core for use in a cognitive computer. FIG. 3 is a schematic diagram of a multi-core neurosynaptic chip for use in a cognitive computer. FIG. 4 is a detailed schematic diagram of a dual-core neurosynaptic chip for use in a cognitive computer. FIGS. 5 and 6 are conceptual diagrams of scalable corelets used for programming neurosynaptic processing logic. FIG. 7 is a block diagram of a cognitive computing system that has access to multiple information repositories. FIG. 8 is a flow diagram of a method used to enhance workflow performance using cognitive computers. detailed-description description=\"Detailed Description\" end=\"lead\"? It should be understood, however, that the specific embodiments given in the drawings and detailed description thereto do not limit the disclosure. On the contrary, they provide the foundation for one of ordinary skill to discern the alternative forms, equivalents, and modifications that are encompassed together with one or more of the given embodiments in the scope of the appended claims.",
  "ipcr_labels": [
    "G06N304",
    "G06Q1006",
    "G06N308",
    "G06Q5002",
    "G06N3063"
  ],
  "inventor_list": [
    {
      "inventor_name_last": "WILLIAMS",
      "inventor_name_first": "Robert Lynn",
      "inventor_city": "Spring",
      "inventor_state": "TX",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "JAMISON",
      "inventor_name_first": "Dale E.",
      "inventor_city": "Humble",
      "inventor_state": "TX",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "BAR",
      "inventor_name_first": "Amir",
      "inventor_city": "Houston",
      "inventor_state": "TX",
      "inventor_country": "US"
    }
  ],
  "title": "ENHANCING WORKFLOW PERFORMANCE WITH COGNITIVE COMPUTING",
  "decision": "PENDING",
  "_processing_info": {
    "original_size": 64297,
    "optimized_size": 3447,
    "reduction_percent": 94.64
  }
}