{
  "patent_number": "None",
  "application_number": "15548508",
  "date_published": "20180118",
  "date_produced": "20180103",
  "filing_date": "20170803",
  "main_ipcr_label": "G06N504",
  "abstract": "A computer implemented method is disclosed of providing an artificial intelligence architecture for controlling data and performing decisions relating to an object and/or an environment of the object. The method comprises executing on one or more processors the steps of: processing data from one or more sensors to identify first and second states of the object and/or the object's environment; analyze the first state and second state of the object and/or the object's environment to discover an apparent causal relationship between the first and second states of the environment; and making a change to the data relating to an object and/or the object's environment based on the apparent causal relationship to affect subsequent states of the object and/or the object's environment.",
  "publication_number": "US20180018571A1-20180118",
  "summary": "<SOH> SUMMARY OF THE INVENTION <EOH>In accordance with an embodiment of the present disclosure, a system and method are disclosed for using artificial intelligence in making decisions. In accordance with an embodiment of the present disclosure, a computer implemented method is disclosed of providing an artificial intelligence architecture for controlling data and performing decisions relating to an object and/or an environment of the object. The method comprises executing on one or more processors the steps of processing data from one or more sensors to identify first and second states of the object and/or the object's environment, analyze the first state and second state of the object and/or the object's environment to discover an apparent causal relationship between the first and second states of the environment; and making a change to the data relating to an object and/or the object's environment based on the apparent causal relationship to affect subsequent states of the object and/or the object's environment. In accordance with another embodiment of the present disclosure, a system is disclosed for providing an artificial intelligence architecture for controlling data and performing decisions relating to an object and/or an environment of the object. The system comprise (a) a data store to storing data relating to an object and/or the object's environment, and (b) one or more processors coupled to the data store and programmed to (i) process data from one or more sensors to identify first and second states of the object and/or the object's environment, (ii) analyze the first state and second state of the environment to discover an apparent causal relationship between the first and second states of the environment; and make a change to the data relating to an object and/or the object's environment based on the causal relationship to affect subsequent states of the object and/or the object's environment. In accordance with yet another embodiment of the present di...",
  "ipcr_labels": [
    "G06N504"
  ],
  "inventor_list": [
    {
      "inventor_name_last": "Schwartz",
      "inventor_name_first": "Noah Z.",
      "inventor_city": "Alameda",
      "inventor_state": "CA",
      "inventor_country": "US"
    }
  ],
  "title": "SYSTEM AND METHOD FOR USING ARTIFICIAL INTELLIGENCE IN MAKING DECISIONS",
  "decision": "PENDING",
  "_processing_info": {
    "original_size": 52242,
    "optimized_size": 3346,
    "reduction_percent": 93.6
  }
}