{
  "patent_number": "None",
  "application_number": "15553047",
  "date_published": "20180201",
  "date_produced": "20180117",
  "filing_date": "20170823",
  "main_ipcr_label": "G06N9900",
  "abstract": "Some aspects are directed to a method of operating an apparatus, the apparatus comprising a first quantum system having a plurality of coherent quantum states, the first quantum system being coupled to a second quantum system, the method comprising providing an input energy signal to the second quantum system that stimulates energy transfer between the first quantum system and the second quantum system and that causes net dissipation of energy to be output from the second quantum system, wherein the input energy signal includes at least two components having different frequencies and each having an amplitude and a phase, and adiabatically varying the amplitude and the phase of the at least two components of the input energy signal to cause a change in one or more of the plurality of coherent quantum states of the first quantum system.",
  "publication_number": "US20180032895A1-20180201",
  "summary": "<SOH> SUMMARY <EOH>Some aspects are directed to a method of operating an apparatus, the apparatus comprising a first quantum system having a plurality of coherent quantum states, the first quantum system being coupled to a second quantum system, the method comprising providing an input energy signal to the second quantum system that stimulates energy transfer between the first quantum system and the second quantum system and that causes net dissipation of energy to be output from the second quantum system, wherein the input energy signal includes at least two components having different frequencies and each having an amplitude and a phase, and adiabatically varying the amplitude and the phase of the at least two components of the input energy signal to cause a change in one or more of the plurality of coherent quantum states of the first quantum system. According to some embodiments, the change in the one or more of the plurality of coherent quantum states of the first quantum system is a phase change of a first coherent quantum state of the plurality of coherent quantum states relative to the other coherent quantum states of the plurality of coherent quantum states. According to some embodiments, the change in the one or more of the plurality of coherent quantum states of the first quantum system is a population transfer between a second coherent quantum state of the plurality of coherent quantum states and a third coherent quantum state of the plurality of coherent quantum states. According to some embodiments, said adiabatic variation of the amplitude and the phase of the at least two components of the input energy signal is performed such that each of the amplitude and the phase of each of the at least two components of the input energy signal has the same initial and final value before and after the adiabatic variation. According to some embodiments, the first quantum system is coupled to the second quantum system via a non-linear element. According to some emb...",
  "ipcr_labels": [
    "G06N9900",
    "H04B1070"
  ],
  "inventor_list": [
    {
      "inventor_name_last": "Jiang",
      "inventor_name_first": "Liang",
      "inventor_city": "Guilford",
      "inventor_state": "CT",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Schoelkopf, III",
      "inventor_name_first": "Robert J.",
      "inventor_city": "Madison",
      "inventor_state": "CT",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Devoret",
      "inventor_name_first": "Michel",
      "inventor_city": "New Haven",
      "inventor_state": "CT",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Albert",
      "inventor_name_first": "Victor V.",
      "inventor_city": "New Haven",
      "inventor_state": "CT",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Krastanov",
      "inventor_name_first": "Stefan",
      "inventor_city": "New Haven",
      "inventor_state": "CT",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Shen",
      "inventor_name_first": "Chao",
      "inventor_city": "New Haven",
      "inventor_state": "CT",
      "inventor_country": "US"
    }
  ],
  "title": "TECHNIQUES FOR UNIVERSAL QUANTUM CONTROL OF QUANTUM COHERENT STATES AND RELATED SYSTEMS AND METHODS",
  "decision": "PENDING",
  "_processing_info": {
    "original_size": 57348,
    "optimized_size": 4193,
    "reduction_percent": 92.69
  }
}