{
  "patent_number": "None",
  "application_number": "15552998",
  "date_published": "20180830",
  "date_produced": "20180815",
  "filing_date": "20170823",
  "main_ipcr_label": "G06N9900",
  "abstract": "According to some aspects, a method is provided of operating a circuit quantum electrodynamics system that includes a physical qubit dispersively coupled to a quantum mechanical oscillator, the method comprising applying a first electromagnetic pulse to the physical qubit based on a number state of the quantum mechanical oscillator, wherein the first electromagnetic pulse causes a change in state of the quantum mechanical oscillator, and applying, subsequent to application of the first electromagnetic pulse, a second electromagnetic pulse to the quantum mechanical oscillator that coherently adds or removes energy from the quantum mechanical oscillator.",
  "publication_number": "US20180247217A1-20180830",
  "summary": "<SOH> SUMMARY <EOH>Some aspects are directed to a method of operating a circuit quantum electrodynamics system that includes a physical qubit dispersively coupled to a quantum mechanical oscillator, the method comprising applying a first electromagnetic pulse to the physical qubit based on a number state of the quantum mechanical oscillator, wherein the first electromagnetic pulse causes a change in state of the quantum mechanical oscillator, and applying, subsequent to application of the first electromagnetic pulse, a second electromagnetic pulse to the quantum mechanical oscillator that coherently adds or removes energy from the quantum mechanical oscillator. According to some embodiments, the method further comprises driving the physical qubit to a ground state prior to application of the first electromagnetic pulse, and driving the physical qubit to the ground state after application of the first electromagnetic pulse. According to some embodiments, the method further comprises measuring a parity of the quantum mechanical oscillator by applying a third electromagnetic pulse to the physical qubit based on the number state of the quantum mechanical oscillator. According to some embodiments, the method further comprises measuring the number state of the quantum mechanical oscillator by applying a fourth electromagnetic pulse to the physical qubit. According to some embodiments, a frequency of the first electromagnetic pulse is based on the number state of the quantum mechanical oscillator. According to some embodiments, an amplitude of the first electromagnetic pulse is less than a magnitude of a dispersive coupling between the physical qubit and the quantum mechanical oscillator. According to some embodiments, the change in state of the quantum mechanical oscillator caused by the first electromagnetic pulse is a quantum phase change of one or more Fock state components of the quantum mechanical oscillator. According to some embodiments, a qubit frequency shift per...",
  "ipcr_labels": [
    "G06N9900",
    "H03B518",
    "H03K19195"
  ],
  "inventor_list": [
    {
      "inventor_name_last": "Heeres",
      "inventor_name_first": "Reinier",
      "inventor_city": "New Haven",
      "inventor_state": "CT",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Vlastakis",
      "inventor_name_first": "Brian",
      "inventor_city": "New Havenct",
      "inventor_state": "CT",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Albert",
      "inventor_name_first": "Victor V.",
      "inventor_city": "New Haven",
      "inventor_state": "CT",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Krastanov",
      "inventor_name_first": "Stefan",
      "inventor_city": "New Haven",
      "inventor_state": "CT",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Jiang",
      "inventor_name_first": "Liang",
      "inventor_city": "Guilford",
      "inventor_state": "CT",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Schoelkopf III",
      "inventor_name_first": "Robert J",
      "inventor_city": "Madison",
      "inventor_state": "CT",
      "inventor_country": "US"
    }
  ],
  "title": "TECHNIQUES OF OSCILLATOR CONTROL FOR QUANTUM INFORMATION PROCESSING AND RELATED SYSTEMS AND METHODS",
  "decision": "PENDING",
  "_processing_info": {
    "original_size": 61065,
    "optimized_size": 4025,
    "reduction_percent": 93.41
  }
}