{
  "patent_number": "None",
  "application_number": "15566221",
  "date_published": "20181115",
  "date_produced": "20181031",
  "filing_date": "20171013",
  "main_ipcr_label": "G06N304",
  "abstract": "The present disclosure relates to a method and system for determining a load status of a vehicle. The load status of the vehicle indicates whether the vehicle is available to accept an order. The method includes establishing a communication with a mobile terminal associated with the vehicle and a server; obtaining a record of a first prior order corresponding to a first prior transaction associated with the terminal by the server; determining an estimated end time of the first prior transaction by the server; and determining the load status of the vehicle based on a current time and the estimated end time of the first prior transaction by the server.",
  "publication_number": "US20180330225A1-20181115",
  "summary": "<SOH> SUMMARY <EOH>In one aspect of the present disclosure, a system is provided. The system includes a processor and a computer-readable storage medium storing a first set of instructions for determining a load status of a vehicle. When executing the first set of instructions, the processor is detected to: establish a communication with a terminal associated with the vehicle; obtain a record of a first prior order corresponding to a first prior transaction associated with the terminal; determine an estimated end time of the first prior transaction; and determine the load status of the vehicle based on a current time and the estimated end time of the first prior transaction. In another aspect of the present disclosure, a method is provide. The method is related to the method of determining a load status of a vehicle. The load status of the vehicle indicates whether the vehicle is available to accept an order. The method includes establishing a communication with a terminal associated with the vehicle and a server; obtaining a record of a first prior order corresponding to a first prior transaction associated with the terminal by the server; determining an estimated end time of the first prior transaction by the server; and determining the load status of the vehicle based on a current time and the estimated end time of the first prior transaction by the server. Additional features will be set forth in part in the description which follows, and in part will become apparent to those skilled in the art upon examination of the following and the accompanying drawings or may be learned by production or operation of the examples. The features of the present disclosure may be realized and attained by practice or use of various aspects of the methodologies, instrumentalities and combinations set forth in the detailed examples discussed below.",
  "ipcr_labels": [
    "G06N304",
    "G06F1730",
    "G07C500",
    "G07C502",
    "G08G101",
    "G06Q1004",
    "G06Q5030",
    "G01C2130",
    "H04W402",
    "H04W4029",
    "H04W440"
  ],
  "inventor_list": [
    {
      "inventor_name_last": "ZHUO",
      "inventor_name_first": "Chengxiang",
      "inventor_city": "Beijing",
      "inventor_state": "",
      "inventor_country": "CN"
    }
  ],
  "title": "SYSTEM AND METHOD FOR DETERMINING VEHICLE LOAD STATUS",
  "decision": "PENDING",
  "_processing_info": {
    "original_size": 109353,
    "optimized_size": 3174,
    "reduction_percent": 97.1
  }
}