{
  "patent_number": "None",
  "application_number": "15565873",
  "date_published": "20180419",
  "date_produced": "20180404",
  "filing_date": "20171011",
  "main_ipcr_label": "G06N9900",
  "abstract": "The present disclosure provides a method of operation of a quantum processing element and an advanced processing apparatus comprising a plurality of quantum processing elements operated in accordance with the method. Embodiments of the methods disclosed allow using the quantum properties of an MOS structure and a donor atom embedded in the semiconductor to implement electron and nuclear spin qubits and provide multi-qubit coupling, including coupling at longer distances facilitated by a resonator.",
  "publication_number": "US20180107938A1-20180419",
  "summary": "<SOH> SUMMARY OF THE INVENTION <EOH>Embodiments of the invention propose a method to manipulate spin qubits with electric fields. The qubits manipulated in accordance with the method can be separated by hundreds of nanometres while preserving coupling capabilities. This substantially relaxes the precision requirements for fabrication. Advantageously, the schemes are compatible with the accuracy in donor placement achieved with ion implantation, as well as with scanning tunnelling microscope lithography. In accordance with a first aspect, the present invention provides a method of operation of a quantum processing element, the processing element comprising: a semiconductor and a dielectric material forming an interface with the semiconductor; a donor atom embedded in the semiconductor at a distance from the interface; and a conductive electrode disposed on the dielectric material; the method comprising the steps of: applying a magnetic field to the quantum processing element to separate the energy of the spin states associated with an electron and a nucleus of the donor atom; and applying an electric field in the region between the interface and the donor atom to modulate a hyperfine interaction between the electron and the nucleus and control the quantum state of a quantum bit associated with a pair of electron-nuclear spin eigenstates of the electron and the nucleus. The pair of electron-nuclear spin eigenstates comprises the ‘electron spin up-nuclear spin down’ and ‘electron spin down-nuclear spin up’ eigenstates. This type of qubit can be referred to as flip-flop qubit. The electric field in the region between the interface and the donor atom may be applied by applying an oscillating electric signal to the electrode. The electrode may be an independent electrode or part of a structure suitable for addressing multiple processing elements. In an embodiment, the frequency of the oscillating electric signal is selected based on the amplitude of the applied continuous...",
  "ipcr_labels": [
    "G06N9900",
    "H01L2718",
    "H01L3902",
    "H01L3922"
  ],
  "inventor_list": [
    {
      "inventor_name_last": "Morello",
      "inventor_name_first": "Andrea",
      "inventor_city": "Newton, New South Wales",
      "inventor_state": "",
      "inventor_country": "AU"
    },
    {
      "inventor_name_last": "Tosi",
      "inventor_name_first": "Guilherme",
      "inventor_city": "Maroubra, New South Wales",
      "inventor_state": "",
      "inventor_country": "AU"
    },
    {
      "inventor_name_last": "Mohiyaddin",
      "inventor_name_first": "Fahd A.",
      "inventor_city": "Kensington, New South Wales",
      "inventor_state": "",
      "inventor_country": "AU"
    }
  ],
  "title": "A QUANTUM PROCESSING APPARATUS AND A METHOD OF OPERATING A QUANTUM PROCESSING APPARATUS",
  "decision": "PENDING",
  "_processing_info": {
    "original_size": 103061,
    "optimized_size": 3479,
    "reduction_percent": 96.62
  }
}