{
  "patent_number": "None",
  "application_number": "15566327",
  "date_published": "20180322",
  "date_produced": "20180308",
  "filing_date": "20171013",
  "main_ipcr_label": "G06N308",
  "abstract": "There is provided an information processing device to improve generalization performance of the neural network, the information processing device including: a control unit configured to control display related to a setting of a parameter related to physical simulation; a communication unit configured to transmit the parameter to a physical simulator and receive image information obtained in the physical simulation from the physical simulator; and a machine learning unit configured to perform machine learning on the basis of the image information. The control unit causes a display unit to display a learning result obtained by the machine learning unit and the parameter in association with each other.",
  "publication_number": "US20180082178A1-20180322",
  "summary": "<SOH> BRIEF DESCRIPTION OF DRAWINGS <EOH>FIG. 1 is a conceptual diagram illustrating an overview of machine learning according to the present disclosure. FIG. 2 is a conceptual diagram illustrating a functional configuration of an information processing device according to the present disclosure. FIG. 3 is a system configuration example according to a first embodiment of the present disclosure. FIG. 4 is a functional block diagram of an information processing device according to the embodiment. FIG. 5 is a configuration example of a user interface according to the embodiment. FIG. 6 is a display example of an original image display region according to the embodiment. FIG. 7 is a display example of a parameter setting region according to the embodiment. FIG. 8 is a display example of a physical simulation image display region according to the embodiment. FIG. 9 is a display example of a generated image display region according to the embodiment. FIG. 10 is a display example of a determination result display region according to the embodiment. FIG. 11 is a setting example of a new parameter according to the embodiment. FIG. 12 is a display example of a plurality of recognition results according to the embodiment. FIG. 13 is a display example of a three-dimensional model parameter setting region according to the embodiment. FIG. 14 is a flowchart illustrating the flow of control performed by the information processing device according to the embodiment. FIG. 15 is a functional block diagram of a machine learning device according to a second embodiment of the present disclosure. FIG. 16 is a display example of a learning result display region. FIG. 17 is a hardware configuration example according to the present disclosure. detailed-description description=\"Detailed Description\" end=\"lead\"?",
  "ipcr_labels": [
    "G06N308",
    "G06F1750",
    "G06T340",
    "G06T1705",
    "G01V9900"
  ],
  "inventor_list": [
    {
      "inventor_name_last": "NAKAMURA",
      "inventor_name_first": "Akira",
      "inventor_city": "Kanagawa",
      "inventor_state": "",
      "inventor_country": "JP"
    },
    {
      "inventor_name_last": "NARIHIRA",
      "inventor_name_first": "Takuya",
      "inventor_city": "Tokyo",
      "inventor_state": "",
      "inventor_country": "JP"
    },
    {
      "inventor_name_last": "FUJITA",
      "inventor_name_first": "Takuya",
      "inventor_city": "Kanagawa",
      "inventor_state": "",
      "inventor_country": "JP"
    }
  ],
  "title": "INFORMATION PROCESSING DEVICE",
  "decision": "PENDING",
  "_processing_info": {
    "original_size": 89560,
    "optimized_size": 3375,
    "reduction_percent": 96.23
  }
}