{
  "patent_number": "None",
  "application_number": "15565693",
  "date_published": "20180315",
  "date_produced": "20180228",
  "filing_date": "20171011",
  "main_ipcr_label": "G06N700",
  "abstract": "A method for incident detection in a time-evolving system (TOS), having a plurality of objects moving in time and space along predefined paths, is performed in a memory available to a computation device. The method includes, in a step a), providing predictions of at least two system parameters by using for each prediction a different prediction procedure based on observations. In a step b), the predictions are combined to a prediction ensemble. In a step c), the prediction ensemble is corrected based on an abnormal change of the system having occurred, wherein: the abnormal change is detected by monitoring distributions of deviations from the prediction ensemble, and the prediction ensemble is corrected incrementally based on a real-time learning procedure. In a step d), an incident is detected based on a result of step c).",
  "publication_number": "US20180075362A1-20180315",
  "summary": "<SOH> SUMMARY <EOH>In an embodiment, the present invention provides a method for incident detection in a time-evolving system (TOS), comprising a plurality of objects moving in time and space along predefined paths, which is performed in a memory available to a computation device. The method includes, in a step a), providing predictions of at least two system parameters by using for each prediction a different prediction procedure based on observations. In a step b), the at least two predictions are combined to a prediction ensemble. In a step c), the prediction ensemble is corrected based on an abnormal change of the system having occurred, wherein: the abnormal change is detected by monitoring distributions of deviations from the prediction ensemble, and the prediction ensemble is corrected incrementally based on a real-time learning procedure. In a step d), an incident is detected based on a result of step c).",
  "ipcr_labels": [
    "G06N700",
    "G06N308",
    "G06F1718",
    "G06N9900",
    "G06F1730",
    "G06F1711"
  ],
  "inventor_list": [
    {
      "inventor_name_last": "Moreira-Matias",
      "inventor_name_first": "Luis",
      "inventor_city": "Heidelberg",
      "inventor_state": "",
      "inventor_country": "DE"
    },
    {
      "inventor_name_last": "Alesiani",
      "inventor_name_first": "Francesco",
      "inventor_city": "Heidelberg",
      "inventor_state": "",
      "inventor_country": "DE"
    }
  ],
  "title": "METHOD FOR INCIDENT DETECTION IN A TIME-EVOLVING SYSTEM",
  "decision": "PENDING",
  "_processing_info": {
    "original_size": 60171,
    "optimized_size": 2517,
    "reduction_percent": 95.82
  }
}