{
  "patent_number": "None",
  "application_number": "15566284",
  "date_published": "20180322",
  "date_produced": "20180308",
  "filing_date": "20171013",
  "main_ipcr_label": "G06N9900",
  "abstract": "There is provided an information processing device capable of intuitively adding a hardware resource intended to execute the learning, the information processing device including: a display control unit configured to control display of information indicating progress of a learning process and an addition button used to add dynamically a second hardware resource intended to execute the learning process to a first hardware resource on which the learning process is being executed.",
  "publication_number": "US20180082214A1-20180322",
  "summary": "<SOH> BRIEF DESCRIPTION OF DRAWINGS <EOH>FIG. 1 is a diagram illustrating a configuration example of an information processing system according to an embodiment of the present disclosure. FIG. 2 is a block diagram illustrating a functional configuration example of an information processing device according to the present embodiment. FIG. 3 is a block diagram illustrating a functional configuration example of an information providing device according to the present embodiment. FIG. 4 is a diagram illustrating a first example of a screen displayed on the information processing device. FIG. 5 is a flowchart illustrating an operation example in a case where a distributed computation resource addition button is detected to be pressed. FIG. 6 is a flowchart illustrating an example of a learning process executed after adding a distributed computation node. FIG. 7 is a diagram illustrating a second example of a screen displayed on the information processing device. FIG. 8 is a flowchart illustrating an operation example in a case where a parallel computation resource addition button is detected to be pressed. FIG. 9 is a flowchart illustrating an example of a learning process executed after adding a parallel computation node. FIG. 10 is a diagram illustrating an example of a point purchase screen. FIG. 11 is a diagram illustrated to describe an example of addition process to an earned point by publishing a learning result. FIG. 12 is a diagram illustrating an example of a learned network purchase screen. FIG. 13 is a diagram illustrated to describe addition of a label to input data. FIG. 14 is a diagram illustrating an example of a condition input screen. FIG. 15 is a diagram illustrating an example of the relationship between an elapsed time from start of a learning process and the performance of a network. FIG. 16 is a block diagram illustrating a hardware configuration example of the information processing device. FIG. 17 is a block diagram illustrating a hardware config...",
  "ipcr_labels": [
    "G06N9900",
    "G06F950"
  ],
  "inventor_list": [
    {
      "inventor_name_last": "KOBAYASHI",
      "inventor_name_first": "Yoshiyuki",
      "inventor_city": "Tokyo",
      "inventor_state": "",
      "inventor_country": "JP"
    },
    {
      "inventor_name_last": "FUKUI",
      "inventor_name_first": "Akira",
      "inventor_city": "Kanagawa",
      "inventor_state": "",
      "inventor_country": "JP"
    },
    {
      "inventor_name_last": "IDE",
      "inventor_name_first": "Naoki",
      "inventor_city": "Tokyo",
      "inventor_state": "",
      "inventor_country": "JP"
    },
    {
      "inventor_name_last": "OOBUCHI",
      "inventor_name_first": "Yukio",
      "inventor_city": "Kanagawa",
      "inventor_state": "",
      "inventor_country": "JP"
    },
    {
      "inventor_name_last": "TAKAMATSU",
      "inventor_name_first": "Shingo",
      "inventor_city": "Tokyo",
      "inventor_state": "",
      "inventor_country": "JP"
    }
  ],
  "title": "INFORMATION PROCESSING DEVICE, METHOD OF PROCESSING INFORMATION, AND METHOD OF PROVIDING INFORMATION",
  "decision": "PENDING",
  "_processing_info": {
    "original_size": 82681,
    "optimized_size": 3651,
    "reduction_percent": 95.58
  }
}