{
  "patent_number": "None",
  "application_number": "15560510",
  "date_published": "20180301",
  "date_produced": "20180213",
  "filing_date": "20170922",
  "main_ipcr_label": "G06N700",
  "abstract": "Disclosed is a method for determining tactical actions for protecting a reference entity with respect to a plurality of entities in a battlefield environment, the method including: segmenting the battlefield environment into a plurality of layers; associating actable deterrent systems with each layer; obtaining data representative of the probability, for each deterrent system, that the considered deterrent system deters an entity in the associated layer; providing, for each entity, the level of threat of the entity; and computing a cost function for determining the deterrent systems to be engaged by the reference entity for rendering extremal the cost function, the cost function being a function depending from the provided level of threat and the obtained data.",
  "publication_number": "US20180060751A1-20180301",
  "summary": "<SOH> BRIEF SUMMARY OF THE INVENTION <EOH>The invention aims at solving the problems of obtaining a reliable decision support tool. To this end, the invention concerns a method for determining tactical actions for protecting a reference entity with respect to a plurality of entities in a battlefield environment, the method comprising segmenting the battlefield environment into a plurality of layers, associating actable deterrent systems with each layer, obtaining data representative of the probability, for each deterrent system, that the considered deterrent system deters an entity in the associated layer, providing, for each entity, the level of threat of said entity, and computing a cost function for determining the deterrent systems to be engaged by the reference entity for rendering extremal the cost function, the cost function being a function depending from the provided level of threat and the obtained data. Thanks to the invention, reliable data relative to the most favorable plan engagements can be obtained. This enables to provide to an operator a reliable decision support tool since it provides to the plan engagement with a chance estimation. According to further aspects of the invention that are advantageous but not compulsory, the method for evaluating might incorporate one or several of the following features, taken in any technically admissible combination: at the obtaining step, data representative of the nature of the entity are obtained. at the computing step, the cost function depends at least from the product of the provided level of threat and the obtained data. at the obtaining step, data representative of the consumption of the considered deterrent system are obtained. at the computing step, the imposed engagement policies are taken into account. the method further comprises a step of associating with each layer a category of tactical actions that may be engaged by the reference entity. the method further comprises a step of associating at leas...",
  "ipcr_labels": [
    "G06N700",
    "G06F950"
  ],
  "inventor_list": [
    {
      "inventor_name_last": "LABREUCHE",
      "inventor_name_first": "Christophe Camille",
      "inventor_city": "PALAISEAU CEDEX",
      "inventor_state": "",
      "inventor_country": "FR"
    },
    {
      "inventor_name_last": "POUYLLAU",
      "inventor_name_first": "Helia",
      "inventor_city": "PALAISEAU CEDEX",
      "inventor_state": "",
      "inventor_country": "FR"
    },
    {
      "inventor_name_last": "SAVEANT",
      "inventor_name_first": "Pierre",
      "inventor_city": "PALAISEAU CEDEX",
      "inventor_state": "",
      "inventor_country": "FR"
    },
    {
      "inventor_name_last": "SEMET",
      "inventor_name_first": "Yann",
      "inventor_city": "PALAISEAU CEDEX",
      "inventor_state": "",
      "inventor_country": "FR"
    },
    {
      "inventor_name_last": "HAMMING",
      "inventor_name_first": "Jan-Egbert",
      "inventor_city": "Hengelo",
      "inventor_state": "",
      "inventor_country": "NL"
    },
    {
      "inventor_name_last": "HOUTSMA",
      "inventor_name_first": "Maurice",
      "inventor_city": "Hengelo",
      "inventor_state": "",
      "inventor_country": "NL"
    }
  ],
  "title": "METHOD FOR DETERMINING TACTICAL ACTIONS",
  "decision": "PENDING",
  "_processing_info": {
    "original_size": 59730,
    "optimized_size": 4074,
    "reduction_percent": 93.18
  }
}