{
  "patent_number": "None",
  "application_number": "15573786",
  "date_published": "20180510",
  "date_produced": "20180425",
  "filing_date": "20171113",
  "main_ipcr_label": "G06N700",
  "abstract": "An exemplary system, method and computer-accessible medium for generating a model(s), can include, for example, receiving first information related to raw data, generating second information by formatting the first information, generating third information related to a feature set(s) of the second information, generating the model(s) based on the second and third information. Fourth information related to a user-defined regularization of the second information can be received, fifth information can be generated based on a reformatting of the second information using the fourth information. A prediction(s) can be generated based on the model(s). The prediction(s) can be generated based on a time horizon(s).",
  "publication_number": "US20180129961A1-20180510",
  "summary": "<SOH> SUMMARY OF EXEMPLARY EMBODIMENTS <EOH>An exemplary system, method and computer-accessible medium for generating a model(s), can include, for example, receiving first information related to raw data, generating second information by formatting the first information, generating third information related to a feature set(s) of the second information, generating the model(s) based on the second and third information. Fourth information related to a user-defined regularization of the second information can be received, fifth information can be generated based on a reformatting of the second information using the fourth information. A prediction(s) can be generated based on the model(s). The prediction(s) can be generated based on a time horizon(s). In certain exemplary embodiments of the present disclosure, fourth information related to a potential information value for the second information can be determined based on the third information. The fourth information can be determined using a simple regression procedure(s) or a correlation analysis. The second information can include a plurality of discrete data columns, and a plurality of equations can be generated based on a plurality of combinations of a set of data columns of the data columns. The second information can include a plurality of discrete data columns, and fifth information related to how a first data column of the data columns can be linked with at least one further data column of the data columns can be determined In some exemplary embodiments of the present disclosure, the third information can be generated based on the second information. A score can be assigned to each set of the feature sets based on a correlation of each respective one of the feature sets to the prediction(s). A particular feature set can be selected based on the score. The model(s) can be generated using an islanding procedure based on the first information and the second information. The islanding procedure can include genera...",
  "ipcr_labels": [
    "G06N700",
    "G06Q3002",
    "G06N9900",
    "G06F1730"
  ],
  "inventor_list": [
    {
      "inventor_name_last": "KAILAS",
      "inventor_name_first": "GEORGE",
      "inventor_city": "New York",
      "inventor_state": "NY",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "HANNLEY",
      "inventor_name_first": "SEAN",
      "inventor_city": "Tucson",
      "inventor_state": "AZ",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "MISHRA",
      "inventor_name_first": "BHUBANESWAR",
      "inventor_city": "Great Neck",
      "inventor_state": "NY",
      "inventor_country": "US"
    }
  ],
  "title": "SYSTEM, METHOD AND COMPUTER-ACCESSIBLE MEDIUM FOR MAKING A PREDICTION FROM MARKET DATA",
  "decision": "PENDING",
  "_processing_info": {
    "original_size": 83347,
    "optimized_size": 3621,
    "reduction_percent": 95.66
  }
}