{
  "patent_number": "nan",
  "application_number": "15576156",
  "date_published": "20180517",
  "date_produced": "20180503",
  "filing_date": "20171121",
  "main_ipcr_label": "G06N300",
  "abstract": "A system for facilitating meetings, in some embodiments, comprises: neurosynaptic processing logic; and one or more information repositories accessible to the neurosynaptic processing logic, wherein, during a meeting of participants that includes the neurosynaptic processing logic, the neurosynaptic processing logic accesses resources from the one or more information repositories to perform a probabilistic analysis, and wherein, based on said probabilistic analysis, the neurosynaptic processing logic answers a question from one or more of the participants, asks a question of the participants, makes a statement to the participants, or provides a suggestion to the participants.",
  "publication_number": "US20180137402A1-20180517",
  "summary": "<SOH> BRIEF DESCRIPTION OF THE DRAWINGS <EOH>Accordingly, there are disclosed in the drawings and in the following description various embodiments of a cognitive computing meeting facilitator that may be used in numerous applications, including the oil and gas context. In the drawings: FIG. 1A is an illustration of a pair of biological neurons communicating via a synapse. FIG. 1B is a mathematical representation of an electronic neuron. FIG. 1C is a schematic diagram of a neurosynaptic tile for use in a cognitive computer. FIG. 1D is a schematic diagram of a circuit that embodies an electronic synapse. FIG. 1E is a schematic diagram of an electronic neuron. FIG. 1F is a block diagram of an electronic neuron spiking logic. FIG. 2 is a schematic diagram of a neurosynaptic core for use in a cognitive computer. FIG. 3 is a schematic diagram of a multi-core neurosynaptic chip for use in a cognitive computer. FIG. 4 is a detailed schematic diagram of a dual-core neurosynaptic chip for use in a cognitive computer. FIGS. 5 and 6 are conceptual diagrams of scalable corelets used for programming neurosynaptic processing logic. FIG. 7 is a block diagram of a cognitive computing system that has access to multiple information repositories. FIG. 8 is an illustration of an exemplary meeting environment with multiple human participants and a cognitive computing participant. FIG. 9A is a flow diagram of an illustrative method used to facilitate meetings using cognitive computers. FIG. 9B is a flow diagram of another illustrative method used to facilitate meetings using cognitive computers. detailed-description description=\"Detailed Description\" end=\"lead\"? It should be understood, however, that the specific embodiments given in the drawings and detailed description thereto do not limit the disclosure. On the contrary, they provide the foundation for one of ordinary skill to discern the alternative forms, equivalents, and modifications that are encompassed together with one or more o...",
  "ipcr_labels": [
    "G06N300",
    "G06N3063",
    "G06N304",
    "G06N308"
  ],
  "inventor_list": [
    {
      "inventor_name_last": "BAR",
      "inventor_name_first": "Amir",
      "inventor_city": "Houston",
      "inventor_state": "TX",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "JAMISON",
      "inventor_name_first": "Dale E.",
      "inventor_city": "Humble",
      "inventor_state": "TX",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "WILLIAMS",
      "inventor_name_first": "Robert L.",
      "inventor_city": "Spring",
      "inventor_state": "TX",
      "inventor_country": "US"
    }
  ],
  "title": "COGNITIVE COMPUTING MEETING FACILITATOR",
  "decision": "PENDING",
  "_processing_info": {
    "original_size": 77509,
    "optimized_size": 3537,
    "reduction_percent": 95.44
  }
}