{
  "patent_number": "None",
  "application_number": "15587814",
  "date_published": "20171109",
  "date_produced": "20171025",
  "filing_date": "20170505",
  "main_ipcr_label": "G06N504",
  "abstract": "An article of manufacture for predicting the popularity of media may include at least one processor readable storage medium and instructions stored on the at least one medium. The instructions may be configured to be readable from the at least one medium by at least one processor and may thereby cause the at least one processor to operate so as to determine a publication time associated with digital media, set a predetermined time threshold based on the publication time, analyze the digital media to determine at least one feature associated with the digital media, compile the determined at least one feature, predict a popularity associated with the digital media based on the compiled at least one feature, and output the predicted popularity. The at least one feature associated with the digital media may be determined before the predetermined time threshold.",
  "publication_number": "US20170323210A1-20171109",
  "summary": "<SOH> SUMMARY OF THE DISCLOSURE <EOH>In some embodiments, an article of manufacture for predicting the popularity of media may include at least one processor readable storage medium and instructions stored on the at least one medium. The instructions may be configured to be readable from the at least one medium by at least one processor and may thereby cause the at least one processor to operate so as to determine a publication time associated with digital media, set a predetermined time threshold based on the publication time, analyze the digital media to determine at least one feature associated with the digital media, compile the determined at least one feature, predict a popularity associated with the digital media based on the compiled at least one feature, and output the predicted popularity. The at least one feature associated with the digital media may be determined before the predetermined time threshold. In some embodiments, the at least one feature may include one or more of a temporal feature, social feature, contextual feature, and metadata feature associated with the digital media. In some embodiments, the temporal feature may include a time difference between a publishing time of the digital media and a first view of the digital media. In some embodiments, the temporal feature may include a number of views of the digital media within a first time period after publication. In some embodiments, the temporal feature may include a rate at which the digital media is read within a first time period after publication. In some embodiments, the temporal feature may include a time series of views of the digital media in a first time period after publication. In some embodiments, the social feature may include a time difference between the publication time of the digital media and the first post or interaction on one or more social media platforms regarding the digital media. In some embodiments, the social feature may include a number of posts on one or more so...",
  "ipcr_labels": [
    "G06N504",
    "H04L2908",
    "H04L2908"
  ],
  "inventor_list": [
    {
      "inventor_name_last": "WANG",
      "inventor_name_first": "Shuguang",
      "inventor_city": "Washington",
      "inventor_state": "DC",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "HAN",
      "inventor_name_first": "Eui-Hong",
      "inventor_city": "Washington",
      "inventor_state": "DC",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "KENESHLOO",
      "inventor_name_first": "Yaser",
      "inventor_city": "Arlington",
      "inventor_state": "VA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "RAMAKRISHNAN",
      "inventor_name_first": "Naren",
      "inventor_city": "Arlington",
      "inventor_state": "VA",
      "inventor_country": "US"
    }
  ],
  "title": "TECHNIQUES FOR PREDICTION OF POPULARITY OF MEDIA",
  "decision": "PENDING",
  "_processing_info": {
    "original_size": 67033,
    "optimized_size": 3879,
    "reduction_percent": 94.21
  }
}