{
  "patent_number": "None",
  "application_number": "15589008",
  "date_published": "20170824",
  "date_produced": "20170809",
  "filing_date": "20170508",
  "main_ipcr_label": "G06N502",
  "abstract": "For confidence weighting relationships between complex entities in unstructured data an expressed relationship between a subset of a set of tokens is extracted from a knowledge graph corresponding to the unstructured data. The knowledge graph includes the set of tokens. The tokens in the subset of tokens are related in the expressed relationship by a set of predicates. A number of occurrences of the set of predicates in the unstructured data is determined. A number of occurrences of the expressed relationship in the unstructured data is determined. Using the number of occurrences of the set of predicates and the number of occurrences of the expressed relationship, a confidence value is computed and assigned to the expressed relationship.",
  "publication_number": "US20170243118A1-20170824",
  "summary": "<SOH> SUMMARY <EOH>The illustrative embodiments provide a method, system, and computer program product for confidence weighting of complex relationships in unstructured data. An embodiment includes a method for confidence weighting relationships between complex entities in unstructured data. The embodiment extracts, from a knowledge graph corresponding to the unstructured data wherein the knowledge graph comprises a set of tokens, an expressed relationship between a subset of the set of tokens, wherein tokens in the subset of tokens are related in the expressed relationship by a set of predicates. The embodiment determines, in the unstructured data, a number of occurrences of the set of predicates. The embodiment determines, in the unstructured data, a number of occurrences of the expressed relationship. The embodiment computes, using a processor and a memory, and using the number of occurrences of the set of predicates and the number of occurrences of the expressed relationship, a confidence value. The embodiment assigns the confidence value to the expressed relationship. Another embodiment includes a computer program product for confidence weighting relationships between complex entities in unstructured data. Another embodiment includes a computer system for confidence weighting relationships between complex entities in unstructured data.",
  "ipcr_labels": [
    "G06N502",
    "G06F1730"
  ],
  "inventor_list": [
    {
      "inventor_name_last": "Nassar",
      "inventor_name_first": "Ahmed M.A.",
      "inventor_city": "Katy",
      "inventor_state": "TX",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Odeyemi",
      "inventor_name_first": "Victoria O.",
      "inventor_city": "Toronto",
      "inventor_state": "",
      "inventor_country": "CA"
    },
    {
      "inventor_name_last": "Omar",
      "inventor_name_first": "Eman",
      "inventor_city": "Katy",
      "inventor_state": "TX",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Trim",
      "inventor_name_first": "Craig M.",
      "inventor_city": "Sylmar",
      "inventor_state": "CA",
      "inventor_country": "US"
    }
  ],
  "title": "CONFIDENCE WEIGHTING OF COMPLEX RELATIONSHIPS  IN UNSTRUCTURED DATA",
  "decision": "PENDING",
  "_processing_info": {
    "original_size": 81681,
    "optimized_size": 3104,
    "reduction_percent": 96.2
  }
}