{
  "patent_number": "None",
  "application_number": "15587357",
  "date_published": "20171109",
  "date_produced": "20171025",
  "filing_date": "20170504",
  "main_ipcr_label": "G06N504",
  "abstract": "A digital marking processing apparatus includes a central control unit, and a processing quality prediction unit, a processing unit and a marking unit which are respectively connected with the central control unit electrically. The processing quality prediction unit can implement a virtual processing quality prediction method to predict the processing quality of the workpiece, output an accurate data of quality to the central control unit and generate tool path for the processing unit to process the workpiece. The central control unit is able to compile the data of quality from the processing quality in prediction unit into file information, so that the marking unit can then utilize the file information to correspondingly mark barcode or other digital pattern on the workpiece, which facilitate workpiece management and information disclosure.",
  "publication_number": "US20170323213A1-20171109",
  "summary": "<SOH> SUMMARY OF THE PRESENT INVENTION <EOH>Therefore, an object of the present invention is to provide a digital marking processing apparatus that can digitally mark a workpiece. Accordingly, the digital marking processing apparatus according to the present invention comprises a central control unit, and a processing quality prediction unit, a processing unit and a marking unit which are respectively connected with the central control unit electrically. The processing quality prediction unit can implement a virtual processing quality prediction method to predict the processing quality of the workpiece, output an accurate data of quality to the central control unit and generate tool path for the processing unit to process the workpiece. The central control unit is able to compile the data of quality from the processing quality prediction unit into file information, so that the marking unit can then utilize the file information to correspondingly mark barcode or other digital pattern on the workpiece, which facilitate workpiece management and information disclosure. Still further objects and advantages will become apparent from a consideration of the ensuing description and drawings. These and other objectives, features, and advantages of the present invention will become apparent from the following detailed description, the accompanying drawings, and the appended claims.",
  "ipcr_labels": [
    "G06N504",
    "G06K112",
    "G06N502"
  ],
  "inventor_list": [
    {
      "inventor_name_last": "SU",
      "inventor_name_first": "PO CHENG",
      "inventor_city": "Chiayi County",
      "inventor_state": "",
      "inventor_country": "TW"
    },
    {
      "inventor_name_last": "Hou",
      "inventor_name_first": "Hsin Hong",
      "inventor_city": "Chiayi County",
      "inventor_state": "",
      "inventor_country": "TW"
    },
    {
      "inventor_name_last": "Cheng",
      "inventor_name_first": "Fan Tien",
      "inventor_city": "Chiayi County",
      "inventor_state": "",
      "inventor_country": "TW"
    },
    {
      "inventor_name_last": "Yang",
      "inventor_name_first": "Haw Ching",
      "inventor_city": "Chiayi County",
      "inventor_state": "",
      "inventor_country": "TW"
    },
    {
      "inventor_name_last": "Tieng",
      "inventor_name_first": "Hao",
      "inventor_city": "Chiayi County",
      "inventor_state": "",
      "inventor_country": "TW"
    }
  ],
  "title": "Digital Marking Processing Apparatus",
  "decision": "PENDING",
  "_processing_info": {
    "original_size": 15487,
    "optimized_size": 3384,
    "reduction_percent": 78.15
  }
}