{
  "patent_number": "9934462",
  "application_number": "15584984",
  "date_published": "20180405",
  "date_produced": "20180322",
  "filing_date": "20170502",
  "main_ipcr_label": "G06N304",
  "abstract": "Deep neural networks can be visualized. For example, first values for a first layer of nodes in a neural network, second values for a second layer of nodes in the neural network, and/or third values for connections between the first layer of nodes and the second layer of nodes can be received. A quilt graph can be output that includes (i) a first set of symbols having visual characteristics representative of the first values and representing the first layer of nodes along a first axis; (ii) a second set of symbols having visual characteristics representative of the second values and representing the second layer of nodes along a second axis; and/or (iii) a matrix of blocks between the first axis and the second axis having visual characteristics representative of the third values and representing the connections between the first layer of nodes and the second layer of nodes.",
  "publication_number": "US20180096241A1-20180405",
  "summary": "<SOH> SUMMARY <EOH>In one example, a non-transitory computer readable medium comprising program code executable by a processor is provided. The program code can cause the processor to receive a first plurality of values for a first layer of nodes in a neural network, a second plurality of values for a second layer of nodes in the neural network, and a third plurality of values for connections between the first layer of nodes and the second layer of nodes. The program code can cause the processor to cause a display device to output a quilt graph. The quilt graph can include a first plurality of symbols representing the first layer of nodes along a first axis. The first plurality of symbols can have visual characteristics representative of the first plurality of values. The quilt graph can include a second plurality of symbols representing the second layer of nodes along a second axis. The second plurality of symbols can have visual characteristics representative of the second plurality of values. The quilt graph can include a matrix of blocks between the first axis and the second axis representing the connections between the first layer of nodes and the second layer of nodes. The matrix of blocks can have visual characteristics representative of the third plurality of values. In another example, a system is provided that can include a processing device and a memory device. The memory device can include instructions executable by the processing device for causing the processing device to receive a first plurality of values for a first layer of nodes in a neural network, a second plurality of values for a second layer of nodes in the neural network, and a third plurality of values for connections between the first layer of nodes and the second layer of nodes. The instructions can cause the processing device to cause a display device to output a quilt graph. The quilt graph can include a first plurality of symbols representing the first layer of nodes along a first axis...",
  "ipcr_labels": [
    "G06N304"
  ],
  "inventor_list": [
    {
      "inventor_name_last": "HEALEY",
      "inventor_name_first": "CHRISTOPHER GRAHAM",
      "inventor_city": "Cary",
      "inventor_state": "NC",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "NIE",
      "inventor_name_first": "SHAOLIANG",
      "inventor_city": "Raleigh",
      "inventor_state": "NC",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "PADIA",
      "inventor_name_first": "KALPESH",
      "inventor_city": "Raleigh",
      "inventor_state": "NC",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "DEVARAJAN",
      "inventor_name_first": "RAVINDER",
      "inventor_city": "Cary",
      "inventor_state": "NC",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "CAIRA",
      "inventor_name_first": "DAVID JAMES",
      "inventor_city": "Chapel Hill",
      "inventor_state": "NC",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "BENSON",
      "inventor_name_first": "JORDAN RILEY",
      "inventor_city": "Ellerbe",
      "inventor_state": "NC",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "SETHI",
      "inventor_name_first": "SARATENDU",
      "inventor_city": "Raleigh",
      "inventor_state": "NC",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "COX",
      "inventor_name_first": "JAMES ALLEN",
      "inventor_city": "Cary",
      "inventor_state": "NC",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "LEWIS",
      "inventor_name_first": "LAWRENCE E.",
      "inventor_city": "Raleigh",
      "inventor_state": "NC",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "LEEMAN-MUNK",
      "inventor_name_first": "SAMUEL PAUL",
      "inventor_city": "Cary",
      "inventor_state": "NC",
      "inventor_country": "US"
    }
  ],
  "title": "VISUALIZING DEEP NEURAL NETWORKS",
  "decision": "ACCEPTED",
  "_processing_info": {
    "original_size": 161275,
    "optimized_size": 4751,
    "reduction_percent": 97.05
  }
}