{
  "patent_number": "None",
  "application_number": "15583098",
  "date_published": "20180426",
  "date_produced": "20180411",
  "filing_date": "20170501",
  "main_ipcr_label": "G06N504",
  "abstract": "An emotion estimating system includes a learning model and an estimation unit. The learning model accepts external information and biological information as input, and outputs an emotion of a user. The estimation unit changes a weighting applied to external information about the user detected by a first detector and a weighting applied to biological information about the user detected by a second detector in accordance with a situation around the user, and estimates the emotion output as a result of inputting external information and biological information changed by the respective weightings into the learning model as the emotion of the user.",
  "publication_number": "US20180114125A1-20180426",
  "summary": "<SOH> SUMMARY <EOH>According to an aspect of the invention, there is provided an emotion estimating system including a learning model and an estimation unit. The learning model accepts external information and biological information as input, and outputs an emotion of a user. The estimation unit changes a weighting applied to external information about the user detected by a first detector and a weighting applied to biological information about the user detected by a second detector in accordance with a situation around the user, and estimates the emotion output as a result of inputting external information and biological information changed by the respective weightings into the learning model as the emotion of the user.",
  "ipcr_labels": [
    "G06N504",
    "G10L2563",
    "G06N9900",
    "G06N300",
    "B25J1100",
    "A61B50205",
    "A61B516",
    "A61B500",
    "A61B704",
    "A61B511"
  ],
  "inventor_list": [
    {
      "inventor_name_last": "ICHIBOSHI",
      "inventor_name_first": "Akira",
      "inventor_city": "Kanagawa",
      "inventor_state": "",
      "inventor_country": "JP"
    },
    {
      "inventor_name_last": "THAPLIYA",
      "inventor_name_first": "Roshan",
      "inventor_city": "Kanagawa",
      "inventor_state": "",
      "inventor_country": "JP"
    }
  ],
  "title": "EMOTION ESTIMATING SYSTEM",
  "decision": "PENDING",
  "_processing_info": {
    "original_size": 54169,
    "optimized_size": 2141,
    "reduction_percent": 96.05
  }
}