{
  "patent_number": "None",
  "application_number": "15586604",
  "date_published": "20171116",
  "date_produced": "20171103",
  "filing_date": "20170504",
  "main_ipcr_label": "G06N304",
  "abstract": "A driving assistance system for a vehicle includes a processor of the vehicle operable to process data for the driving assistance system. The driving assistance system determines a priority for various processing tasks required by one or more systems of the vehicle. Responsive to the determination of the priority of various processing tasks required by one or more systems of the vehicle, the processor determines a task with a higher priority than other lower priority tasks and is operable to process the higher priority task and to shift processing of lower priority tasks to other processors within the vehicle.",
  "publication_number": "US20170330067A1-20171116",
  "summary": "<SOH> SUMMARY OF THE INVENTION <EOH>The present invention provides a driver or driving assistance system or vision system or imaging system for a vehicle that utilizes one or more cameras (preferably one or more CMOS cameras) to capture image data representative of images exterior of the vehicle, and provides processing of data in a manner that, responsive to a determination of a priority of various processing tasks required by one or more systems or modules or control units of the vehicle, processes a higher priority task and shifts processing of lower priority tasks to other processors or modules within the vehicle or to one or more remote processors, such as via the cloud. The system may compare real-time data and profiles from remote processors, and may utilize artificial intelligence engines for data analysis. These and other objects, advantages, purposes and features of the present invention will become apparent upon review of the following specification in conjunction with the drawings.",
  "ipcr_labels": [
    "G06N304",
    "B60R16023",
    "G05D100",
    "G06K900"
  ],
  "inventor_list": [
    {
      "inventor_name_last": "Lu",
      "inventor_name_first": "John",
      "inventor_city": "Grand Blanc",
      "inventor_state": "MI",
      "inventor_country": "US"
    }
  ],
  "title": "VEHICLE DRIVING ASSIST SYSTEM WITH ENHANCED DATA PROCESSING",
  "decision": "PENDING",
  "_processing_info": {
    "original_size": 24396,
    "optimized_size": 2201,
    "reduction_percent": 90.98
  }
}