{
  "patent_number": "None",
  "application_number": "15581286",
  "date_published": "20171102",
  "date_produced": "20171018",
  "filing_date": "20170428",
  "main_ipcr_label": "G06N504",
  "abstract": "Systems and methods for probability forecasts and an energy transmission and/or energy distribution network are provided. Operational management may be carried out using a network control system with systematic consideration of forecast uncertainties. The probability of a distribution network being operable in a stable manner (e.g., with N-1 certainty) in a planning period is included. The system includes a forecaster for forecasts for a planning period, a forecast analyzer connected to the forecasts from the at least one forecaster, and elements for further information for outputting estimated forecast uncertainties. The system also includes a stability probability analyzer connected to the forecasts from the at least one forecaster, the estimated forecast uncertainties from the forecast analyzer, and elements for further information for outputting at least one item of information relating to an N-1 stability of the distribution network in the planning period.",
  "publication_number": "US20170316325A1-20171102",
  "summary": "<SOH> SUMMARY AND DESCRIPTION <EOH>The scope of the present invention is defined solely by the appended claims and is not affected to any degree by the statements within this summary. The present embodiments may obviate one or more of the drawbacks or limitations in the related art. Embodiments provide a device for probability forecasts and an energy transmission and/or energy distribution network and a method for operating the network that is optimized so that operational management may be carried out using a network control system with systematic consideration of forecast uncertainties. In an embodiment, the device includes at least one forecast module (FM) that is connected to data provision devices and provides forecasts for a planning period from the data provided by the data provision devices. The device includes a forecast analysis module (AM) configured to access the forecasts from the at least one forecast module (FM), access to elements for past forecasts, and access to elements for past recorded system data for outputting estimated forecast uncertainties from the data obtained from the connections. The devices includes a stability probability analysis module (PSA) configured to access the forecasts from the at least one forecast module (FM), access to the estimated forecast uncertainties from the forecast analysis module (AM), access to elements in an unpredictability list containing unpredictabilities and access to maintenance devices and elements for information relating to maintenance durations for outputting at least one item of information relating to an N-1 stability in a planning period. In an embodiment, the system includes a network control system that is connected to the at least one forecast module that is connected to data provision devices. The network control system provides forecasts for a planning period from the data relating to future network states provided by the data provision devices, for changing the energy transmission and/or energ...",
  "ipcr_labels": [
    "G06N504",
    "H02J300",
    "G05B1502",
    "H02J300",
    "H02J300"
  ],
  "inventor_list": [
    {
      "inventor_name_last": "Duckheim",
      "inventor_name_first": "Mathias",
      "inventor_city": "Erlangen",
      "inventor_state": "",
      "inventor_country": "DE"
    },
    {
      "inventor_name_last": "Amthor",
      "inventor_name_first": "Arvid",
      "inventor_city": "Grabfeld OT Nordheim",
      "inventor_state": "",
      "inventor_country": "DE"
    },
    {
      "inventor_name_last": "Reischböck",
      "inventor_name_first": "Markus",
      "inventor_city": "Erlangen",
      "inventor_state": "",
      "inventor_country": "DE"
    }
  ],
  "title": "DEVICE FOR PROBABILITY FORECASTS, ENERGY TRANSMISSION AND/OR ENERGY DISTRIBUTION NETWORK",
  "decision": "PENDING",
  "_processing_info": {
    "original_size": 37283,
    "optimized_size": 3905,
    "reduction_percent": 89.53
  }
}