{
  "patent_number": "None",
  "application_number": "15597976",
  "date_published": "20171228",
  "date_produced": "20171213",
  "filing_date": "20170517",
  "main_ipcr_label": "G06N9900",
  "abstract": "A processor obtains a first measurement value representing prediction performance of a model that has been learned by using a first parameter value and training data of first size. The processor calculates a first expected value and a first variance degree of prediction performance of a model that would be learned by using the first parameter value and training data of second size. The processor also obtains a second measurement value representing prediction performance of a model that has been learned by using a second parameter value and training data of the first size. The processor calculates a second expected value and a second variance degree of prediction performance of a model that would be learned by using the second parameter value and training data of the second size.",
  "publication_number": "US20170372229A1-20171228",
  "summary": "<SOH> SUMMARY <EOH>In one aspect, there is provided a non-transitory computer-readable medium storing a program that causes a computer to perform a procedure including: obtaining a first measurement value representing prediction performance of a model that has been learned by using a first parameter value and training data of first size, the first parameter value being among a set of parameter values applicable to a machine learning algorithm; calculating, based on the first measurement value, a first expected value and a first variance degree of prediction performance of a model that would be learned by using the first parameter value and training data of second size; obtaining a second measurement value representing prediction performance of a model that has been learned by using a second parameter value and training data of the first size, the second parameter value being among the set of parameter values; calculating, based on the second measurement value, a second expected value and a second variance degree of prediction performance of a model that would be learned by using the second parameter value and training data of the second size; and calculating, based on the first and second expected values and the first and second variance degrees, a third expected value and a third variance degree of prediction performance of a model that would be learned by using a third parameter value and training data of the second size, the third parameter value being among the set of parameter values. The object and advantages of the invention will be realized and attained by means of the elements and combinations particularly pointed out in the claims. It is to be understood that both the foregoing general description and the following detailed description are exemplary and explanatory and are not restrictive of the invention.",
  "ipcr_labels": [
    "G06N9900",
    "G06N504"
  ],
  "inventor_list": [
    {
      "inventor_name_last": "URA",
      "inventor_name_first": "Akira",
      "inventor_city": "Yokohama",
      "inventor_state": "",
      "inventor_country": "JP"
    },
    {
      "inventor_name_last": "KOBAYASHI",
      "inventor_name_first": "Kenichi",
      "inventor_city": "Kawasaki",
      "inventor_state": "",
      "inventor_country": "JP"
    },
    {
      "inventor_name_last": "Ueda",
      "inventor_name_first": "Haruyasu",
      "inventor_city": "Ichikawa",
      "inventor_state": "",
      "inventor_country": "JP"
    }
  ],
  "title": "METHOD AND APPARATUS FOR MANAGING MACHINE LEARNING PROCESS",
  "decision": "PENDING",
  "_processing_info": {
    "original_size": 153229,
    "optimized_size": 3478,
    "reduction_percent": 97.73
  }
}