{
  "patent_number": "None",
  "application_number": "15596957",
  "date_published": "20170831",
  "date_produced": "20170816",
  "filing_date": "20170516",
  "main_ipcr_label": "G06N504",
  "abstract": "A system that enables development and execution of predictive models comprises a centralized data management system, a data extraction tool a model validation tool and a model execution tool. In embodiments, a data management system includes a data management server that can be accessed via a web browser that stores data in the form of a flat file. An extraction tool extracts data. A model validation tool validates a model by scoring an analytical environment data set and a production environment data set. A model execution tool allows a user to select when and how often a model is scored.",
  "publication_number": "US20170249556A1-20170831",
  "summary": "<SOH> SUMMARY OF THE INVENTION <EOH>An infrastructure and architecture according to an embodiment of the present invention enables the rapid development and execution of predictive models. Exemplary embodiments provide solutions in the system design and process flow integration of model development, implementation, and execution for customer marketing campaigns. Exemplary embodiments enable the rapid implementation of customer marketing models, rules, and segmentation strategies by logically integrating the three phases of customer marketing modeling. This enables significant reduction in the time-to-market of new strategies by reducing model deployment time. This reduced time-to-market allows companies to learn and respond to marketplace changes faster (e.g. adjust balance-transfer pricing to reflect reduction in prime rate). In the execution phase, rapid assessments can occur using current data readily usable on demand. Further, exemplary embodiments can execute multiple models in a short time period using the most current customer data. This ensures ever-ready “scores” for customer marketing solutions. Exemplary embodiments can include quality controls built into the execution process that proactively track and notify input data anomalies and model volatility. Increases in model coverage across various channels/products complemented by rich, fresh, and accurate data provide major improvements in response rates and ultimately generate higher returns. For example, models may incorporate customer contact and product preferences enabling customized offers that generate higher response. Execution in exemplary embodiments allows businesses to respond immediately to changes in customer behavior. For example, customers who start showing an improved credit profile can be targeted selectively, in a much faster manner, for line increase offers. In an embodiment, a system that enables development and execution of predictive models includes a centralized data management syste...",
  "ipcr_labels": [
    "G06N504",
    "G06Q3002",
    "G06F1730"
  ],
  "inventor_list": [
    {
      "inventor_name_last": "MURTHY",
      "inventor_name_first": "NARASIMHA",
      "inventor_city": "EAST WINDSOR",
      "inventor_state": "NJ",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "ORALEVICH",
      "inventor_name_first": "MICKEY S.",
      "inventor_city": "GREAT NECK",
      "inventor_state": "NY",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "SACHETI",
      "inventor_name_first": "SANDEEP",
      "inventor_city": "EDISON",
      "inventor_state": "NJ",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "THOMAS",
      "inventor_name_first": "DEEP",
      "inventor_city": "E. BRUNSWICK",
      "inventor_state": "NJ",
      "inventor_country": "US"
    }
  ],
  "title": "PREDICTIVE MODELING",
  "decision": "PENDING",
  "_processing_info": {
    "original_size": 55665,
    "optimized_size": 3592,
    "reduction_percent": 93.55
  }
}