{
  "patent_number": "None",
  "application_number": "15592342",
  "date_published": "20171116",
  "date_produced": "20171103",
  "filing_date": "20170511",
  "main_ipcr_label": "G06N502",
  "abstract": "Methods and systems for analyzing data. The data analysis method includes generating a case data set corresponding to the data analysis request; collecting and storing raw data corresponding to the case data set; generating a knowledge package based on the raw data; generating a knowledge package library based on the knowledge package; and providing the user with the knowledge package library. Also, the case data set includes first selection parameters, and the knowledge package library includes second selection parameters different from the first selection parameters. According to the embodiments of the present disclosure, a deep understanding of business and ecosystem which is previously obtained from big data analysis and insights about data group selection, modeling, and analysis method can be provided, such that a big data analysis can be performed with enhanced efficiency.",
  "publication_number": "US20170330086A1-20171116",
  "summary": "<SOH> SUMMARY <EOH>Accordingly, exemplary embodiments of the present disclosure are provided to substantially obviate one or more problems due to limitations and disadvantages of the related art. Exemplary embodiments of the present disclosure provide data analysis method and system that provide, in a form of knowledge package library, a deep understanding of business and ecosystem which is previously obtained from big data analysis and insights about data group selection, modeling, and analysis method. Exemplary embodiments of the present disclosure also provide data analysis method and system that enable the user to easily access a data analysis and obtain results of the data analysis by providing the user with a similar knowledge package from previously-stored knowledge packages as well as a knowledge package including analyzed data. Technical objects of the present disclosure are not limited to the aforementioned technical objects and other technical objects which are not mentioned will be apparently appreciated by those skilled in the art from the following description. In order to achieve the above-described objective, an aspect of the present disclosure provides a method for analyzing data. The data analysis method may comprise receiving a data analysis request from a user; generating a case data set corresponding to the data analysis request; collecting and storing raw data corresponding to the case data set; generating a knowledge package based on the raw data; generating a knowledge package library based on the knowledge package; and providing the user with the knowledge package library, wherein the case data set includes first selection parameters, and the knowledge package library includes second selection parameters different from the first selection parameters. The generating a knowledge package library may comprise measuring satisfaction levels of previously-stored knowledge packages based on the case data set; selecting knowledge packages whose satis...",
  "ipcr_labels": [
    "G06N502"
  ],
  "inventor_list": [
    {
      "inventor_name_last": "DOH",
      "inventor_name_first": "Yoon Mee",
      "inventor_city": "Daejeon",
      "inventor_state": "",
      "inventor_country": "KR"
    },
    {
      "inventor_name_last": "YU",
      "inventor_name_first": "Jae Hak",
      "inventor_city": "Daejeon",
      "inventor_state": "",
      "inventor_country": "KR"
    },
    {
      "inventor_name_last": "LEE",
      "inventor_name_first": "Kye Seon",
      "inventor_city": "Daejeon",
      "inventor_state": "",
      "inventor_country": "KR"
    }
  ],
  "title": "METHOD AND SYSTEM FOR ANALYZING DATA",
  "decision": "PENDING",
  "_processing_info": {
    "original_size": 49119,
    "optimized_size": 3693,
    "reduction_percent": 92.48
  }
}