{
  "patent_number": "None",
  "application_number": "15597143",
  "date_published": "20171116",
  "date_produced": "20171103",
  "filing_date": "20170516",
  "main_ipcr_label": "G06N9900",
  "abstract": "Apparatuses, systems, methods, and computer program products are disclosed for drift detection and correction for predictive analytics. A prediction module applies a model to workload data to produce one or more predictive results. Workload data may include one or more records. A model may include one or more learned functions based on training data. A drift detection module detects a drift phenomenon relating to one or more predictive results. A predict-time fix module may modify at least one predictive result in response to a drift phenomenon.",
  "publication_number": "US20170330109A1-20171116",
  "summary": "<SOH> SUMMARY <EOH>Apparatuses are presented for drift detection and correction for predictive analytics. In one embodiment, a prediction module applies a model to workload data to produce one or more predictive results. In certain embodiments, workload data may include one or more records. In further embodiments, a model may include one or more learned functions based on training data. In one embodiment, a drift detection module detects a drift phenomenon relating to one or more predictive results. In a certain embodiment, a predict-time fix module modifies at least one predictive result in response to a drift phenomenon. Methods are presented for drift detection and correction for predictive analytics. In one embodiment, a method includes generating one or more predictive results by applying a model to workload data. In certain embodiments, workload data may include one or more records. In further embodiments, a model may include one or more learned functions based on training data. In one embodiment, a method includes detecting a drift phenomenon relating to one or more predictive results. In a certain embodiment, a method includes retraining a model based on updated training data, in response to detecting a drift phenomenon. Computer program products are presented for drift detection and correction for predictive analytics. In various embodiments, a computer program product includes a computer readable storage medium storing computer usable program code executable to perform operations. In certain embodiments, an operation includes applying a model to workload data to produce one or more predictive results. In further embodiments, workload data may include one or more records. In some embodiments, a model may include one or more learned functions based on training data. In a certain embodiment, an operation includes detecting a drift phenomenon relating to one or more predictive results. In a further embodiment, an operation includes modifying at least one predi...",
  "ipcr_labels": [
    "G06N9900",
    "G06N504"
  ],
  "inventor_list": [
    {
      "inventor_name_last": "Maughan",
      "inventor_name_first": "Jason",
      "inventor_city": "Sandy",
      "inventor_state": "UT",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Lovell",
      "inventor_name_first": "James",
      "inventor_city": "Provo",
      "inventor_state": "UT",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Wellman",
      "inventor_name_first": "Richard W.",
      "inventor_city": "Park City",
      "inventor_state": "UT",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Phillipps",
      "inventor_name_first": "Kelly D.",
      "inventor_city": "Salt Lake City",
      "inventor_state": "UT",
      "inventor_country": "US"
    }
  ],
  "title": "PREDICTIVE DRIFT DETECTION AND CORRECTION",
  "decision": "PENDING",
  "_processing_info": {
    "original_size": 142967,
    "optimized_size": 3541,
    "reduction_percent": 97.52
  }
}