{
  "patent_number": "None",
  "application_number": "15594439",
  "date_published": "20171123",
  "date_produced": "20171108",
  "filing_date": "20170512",
  "main_ipcr_label": "G06N304",
  "abstract": "An artificial neural network device that utilizes one or more non-volatile memory arrays as the synapses. The synapses are configured to receive inputs and to generate therefrom outputs. Neurons are configured to receive the outputs. The synapses include a plurality of memory cells, wherein each of the memory cells includes spaced apart source and drain regions formed in a semiconductor substrate with a channel region extending there between, a floating gate disposed over and insulated from a first portion of the channel region and a non-floating gate disposed over and insulated from a second portion of the channel region. Each of the plurality of memory cells is configured to store a weight value corresponding to a number of electrons on the floating gate. The plurality of memory cells are configured to multiply the inputs by the stored weight values to generate the outputs.",
  "publication_number": "US20170337466A1-20171123",
  "summary": "<SOH> BRIEF SUMMARY OF THE INVENTION <EOH>The aforementioned problems and needs are addressed by an artificial neural network device that utilizes one or more non-volatile memory arrays as the synapses. The neural network device includes a first plurality of synapses configured to receive a first plurality of inputs and to generate therefrom a first plurality of outputs, and a first plurality of neurons configured to receive the first plurality of outputs. The first plurality of synapses includes a plurality of memory cells, wherein each of the memory cells includes spaced apart source and drain regions formed in a semiconductor substrate with a channel region extending there between, a floating gate disposed over and insulated from a first portion of the channel region and a non-floating gate disposed over and insulated from a second portion of the channel region. Each of the plurality of memory cells is configured to store a weight value corresponding to a number of electrons on the floating gate. The plurality of memory cells are configured to multiply the first plurality of inputs by the stored weight values to generate the first plurality of outputs. Other objects and features of the present invention will become apparent by a review of the specification, claims and appended figures.",
  "ipcr_labels": [
    "G06N304",
    "G06F306"
  ],
  "inventor_list": [
    {
      "inventor_name_last": "Bayat",
      "inventor_name_first": "Farnood Merrikh",
      "inventor_city": "Goleta",
      "inventor_state": "CA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Guo",
      "inventor_name_first": "Xinjie",
      "inventor_city": "Goleta",
      "inventor_state": "CA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Strukov",
      "inventor_name_first": "Dmitri",
      "inventor_city": "Goleta",
      "inventor_state": "CA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Do",
      "inventor_name_first": "Nhan",
      "inventor_city": "Saratoga",
      "inventor_state": "CA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Tran",
      "inventor_name_first": "Hieu Van",
      "inventor_city": "San Jose",
      "inventor_state": "CA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Tiwari",
      "inventor_name_first": "Vipin",
      "inventor_city": "Dublin",
      "inventor_state": "CA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Reiten",
      "inventor_name_first": "Mark",
      "inventor_city": "Alamo",
      "inventor_state": "CA",
      "inventor_country": "US"
    }
  ],
  "title": "Deep Learning Neural Network Classifier Using Non-volatile Memory Array",
  "decision": "PENDING",
  "_processing_info": {
    "original_size": 79416,
    "optimized_size": 3626,
    "reduction_percent": 95.43
  }
}