{
  "patent_number": "None",
  "application_number": "15591508",
  "date_published": "20171026",
  "date_produced": "20171011",
  "filing_date": "20170510",
  "main_ipcr_label": "G06N9900",
  "abstract": "Systems, devices, and methods are described for detecting an embolus, thrombus, or a deep vein thrombus in a biological subject.",
  "publication_number": "US20170308813A1-20171026",
  "summary": "<SOH> SUMMARY <EOH>In one aspect, the present disclosure is directed to, among other things, an occlusion-monitoring system. The occlusion-monitoring system includes, but is not limited to, a body structure configured for wear by a user. In an embodiment, the body structure includes an optical energy emitter component. In an embodiment, the optical energy emitter component is configured to direct an ex vivo generated pulsed optical energy stimulus along an optical path for a time sufficient to interact with one or more regions within the biological subject. In an embodiment, the optical energy emitter component is configured to direct a pulsed optical energy stimulus along an optical path in an amount and for a time sufficient to elicit the formation of acoustic waves associated with changes in a biological mass present along the optical path. In an embodiment, the body can include, but is not limited to, an optical energy sensor component. In an embodiment, the optical energy sensor component is configured to detect (e.g., assess, calculate, evaluate, determine, gauge, measure, monitor, quantify, resolve, sense, or the like) at least one of an emitted optical energy or a remitted optical energy and to generate a first response based on the detected at least one of the emitted optical energy or the remitted optical energy. The occlusion-monitoring system can include, but is not limited to, one or more computer-readable memory media having blood vessel occlusion information configured as a data structure. In an embodiment, the data structure includes, but is not limited to, a characteristic spectral signature information section. In an embodiment, the characteristic spectral signature information includes at least one of characteristic embolus spectral signature information representative of the presence of at least a partial occlusion in a blood vessel, characteristic arterial embolus spectral signature information representative of the presence of at least a partia...",
  "ipcr_labels": [
    "G06N9900",
    "A61B502",
    "A61B5021",
    "A61B500"
  ],
  "inventor_list": [
    {
      "inventor_name_last": "Boyden",
      "inventor_name_first": "Edward S.",
      "inventor_city": "Chestnut Hill",
      "inventor_state": "MA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Leuthardt",
      "inventor_name_first": "Eric C.",
      "inventor_city": "St. Louis",
      "inventor_state": "MO",
      "inventor_country": "US"
    }
  ],
  "title": "SYSTEMS, DEVICES, AND METHODS FOR DETECTING OCCLUSIONS IN A BIOLOGICAL SUBJECT INCLUDING SPECTRAL LEARNING",
  "decision": "PENDING",
  "_processing_info": {
    "original_size": 295310,
    "optimized_size": 2917,
    "reduction_percent": 99.01
  }
}