{
  "patent_number": "None",
  "application_number": "15595832",
  "date_published": "20180628",
  "date_produced": "20180613",
  "filing_date": "20170515",
  "main_ipcr_label": "G06N304",
  "abstract": "A neuromorphic device may include: a pre-synaptic neuron; a synapse electrically connected with the pre-synaptic neuron through a row line; and a post-synaptic neuron electrically connected with the synapse through a column line. The post-synaptic neuron may include a first inverter, the first inverter comprising a first pull-up transistor and a first pull-down transistor, a body of the first pull-up transistor and a body of the first pull-down transistor being electrically connected with a first output node of the first inverter.",
  "publication_number": "US20180181856A1-20180628",
  "summary": "<SOH> SUMMARY <EOH>Various embodiments are directed to a neuromorphic device having a synapse array which has a smooth output. For example, the smooth output may be similar to a sigmoid function. Also, various embodiments are directed to pre-synaptic neurons with inverting circuits, post-synaptic neurons with inverting circuits, and an inter-synapse circuit. Also, various embodiments are directed to inverting circuits having various circuit configurations. In an embodiment, a neuromorphic device may include: a pre-synaptic neuron; a synapse electrically connected with the pre-synaptic neuron through a row line; and a post-synaptic neuron electrically connected with the synapse through a column line. The post-synaptic neuron may include a first inverter, the first inverter comprising a first pull-up transistor and a first pull-down transistor, a body of the first pull-up transistor and a body of the first pull-down transistor being electrically connected with a first output node of the first inverter. The first pull-up transistor may include: a source electrode electrically connected with a supply voltage node; a drain electrode electrically connected with the output node; and a gate electrode electrically connected with the column line. The first pull-down transistor may include: a source electrode electrically connected with a ground voltage node; a drain electrode electrically connected with the output node; and a gate electrode electrically connected with the column line. The post-synaptic neuron may further include a second inverter. The second inverter may include a second pull-up transistor and a second pull-down transistor. A gate electrode of the second pull-up transistor and a gate electrode of the second pull-down may be electrically connected with the first output node. The second pull-up transistor may include: a source electrode electrically connected with the supply voltage node; and a drain electrode electrically connected with an output terminal. The...",
  "ipcr_labels": [
    "G06N304"
  ],
  "inventor_list": [
    {
      "inventor_name_last": "LEE",
      "inventor_name_first": "Hyung-Dong",
      "inventor_city": "Hwaseong",
      "inventor_state": "",
      "inventor_country": "KR"
    }
  ],
  "title": "NEUROMORPHIC DEVICE INCLUDING A SYNAPSE ARRAY WITH INVERTING CIRCUITS",
  "decision": "PENDING",
  "_processing_info": {
    "original_size": 50028,
    "optimized_size": 3092,
    "reduction_percent": 93.82
  }
}