{
  "patent_number": "None",
  "application_number": "15597815",
  "date_published": "20171207",
  "date_produced": "20171121",
  "filing_date": "20170517",
  "main_ipcr_label": "G06N502",
  "abstract": "A system, method and a computer program product may be provided for automatically creating and parameterizing a semantically-enriched diagnosis model for an entity. The system receives a list of data points, from sensors or a database, to be used to create a diagnosis model. The system automatically creates the diagnosis model based on the received list of data points and data stored in a database and parameterizes the diagnosis model. The parameterized diagnosis model reflects rules that determine one or more potential causes of one or more abnormalities of one or more physical conditions in the entity.",
  "publication_number": "US20170351957A1-20171207",
  "summary": "<SOH> SUMMARY <EOH>A computing system, a method and a computer program product may be provided for automatically deriving a semantically enriched diagnosis model from a list of data points. The computing system receives a list of data points, from sensors or a database or a knowledge base to be used to create a diagnosis model. The computing system automatically creates the diagnosis model based on the received list of data points and data from additional knowledge base. The automatically created diagnosis model describes rules that associates one or more potential causes with one or more abnormalities of one or more conditions in a system. The computing system parameterizes the diagnosis model by running a statistical or data mining technique over historical or real-time time series data of the received data points and the data in the knowledge base(s).",
  "ipcr_labels": [
    "G06N502",
    "G06F1730"
  ],
  "inventor_list": [
    {
      "inventor_name_last": "Lecue",
      "inventor_name_first": "Freddy",
      "inventor_city": "Dublin",
      "inventor_state": "",
      "inventor_country": "IE"
    },
    {
      "inventor_name_last": "Ploennigs",
      "inventor_name_first": "Joern",
      "inventor_city": "Dublin",
      "inventor_state": "",
      "inventor_country": "IE"
    },
    {
      "inventor_name_last": "Schumann",
      "inventor_name_first": "Anika",
      "inventor_city": "Dublin",
      "inventor_state": "",
      "inventor_country": "IE"
    }
  ],
  "title": "AUTOMATED CREATION OF SEMANTICALLY-ENRICHED DIAGNOSIS MODELS",
  "decision": "PENDING",
  "_processing_info": {
    "original_size": 43801,
    "optimized_size": 2316,
    "reduction_percent": 94.71
  }
}