{
  "patent_number": "None",
  "application_number": "15593890",
  "date_published": "20171116",
  "date_produced": "20171103",
  "filing_date": "20170512",
  "main_ipcr_label": "G06N308",
  "abstract": "A method and system for deep learning based cardiac electrophysiological model personalization is disclosed. Electrophysiological measurements of a patient, such as an ECG trace, are received. A computational cardiac electrophysiology model is personalized by calculating patient-specific values for a parameter of the computational cardiac electrophysiology model based at least on the electrophysiological measurements of the patient using a trained deep neural network (DNN). The parameter of the computational cardiac electrophysiology model corresponds to a spatially varying electrical cardiac tissue property.",
  "publication_number": "US20170330075A1-20171116",
  "summary": "<SOH> BRIEF SUMMARY OF THE INVENTION <EOH>The present invention provides a method and system for deep learning based cardiac electrophysiological model personalization. Embodiments of the present invention utilize a trained deep neural network (DNN) to estimate spatially varying personalized parameters of a cardiac electrophysiological model based on medical images and electrophysiological measurements of a patient. The personalized cardiac electrophysiological model can be used as a diagnostic tool for diagnosing cardiac conditions of the patient or a predictive tool to simulate various cardiac interventions and/or intervention parameters for the patient. In one embodiment of the present invention, electrophysiological measurements of a patient are received. A computational cardiac electrophysiology model is personalized by calculating patient-specific values for a parameter of the computational cardiac electrophysiology model based at least on the electrophysiological measurements of the patient using a trained deep neural network (DNN). The parameter of the computational cardiac electrophysiology model corresponds to a spatially varying electrical cardiac tissue property. These and other advantages of the invention will be apparent to those of ordinary skill in the art by reference to the following detailed description and the accompanying drawings.",
  "ipcr_labels": [
    "G06N308",
    "G06F1750",
    "G06F1900",
    "G06F1900"
  ],
  "inventor_list": [
    {
      "inventor_name_last": "Tuysuzoglu",
      "inventor_name_first": "Ahmet",
      "inventor_city": "Plainsboro",
      "inventor_state": "NJ",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Passerini",
      "inventor_name_first": "Tiziano",
      "inventor_city": "Plainsboro",
      "inventor_state": "NJ",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Miao",
      "inventor_name_first": "Shun",
      "inventor_city": "Princeton",
      "inventor_state": "NJ",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Mansi",
      "inventor_name_first": "Tommaso",
      "inventor_city": "Plainsboro",
      "inventor_state": "NJ",
      "inventor_country": "US"
    }
  ],
  "title": "SYSTEM AND METHOD FOR DEEP LEARNING BASED CARDIAC ELECTROPHYSIOLOGY MODEL PERSONALIZATION",
  "decision": "PENDING",
  "_processing_info": {
    "original_size": 85116,
    "optimized_size": 3048,
    "reduction_percent": 96.42
  }
}