{
  "patent_number": "None",
  "application_number": "15605939",
  "date_published": "20180104",
  "date_produced": "20171219",
  "filing_date": "20170525",
  "main_ipcr_label": "G06N3063",
  "abstract": "A deep learning neuromorphic system includes an electronic circuit having input ports and an output port. The input ports are configured to receive differential photon detector outputs as circuit inputs. The electronic circuit is configured to apply unsupervised deep learning rules to the circuit inputs to provide a current mirror output. The output port is configured to provide the current mirror output to a plotter. A method of deep learning neuromorphic application includes receiving differential photon detector outputs as inputs to an electronic circuit. The electronic circuit applies unsupervised deep learning rules to the inputs to provide a current mirror output. The current mirror output is provided to a plotter.",
  "publication_number": "US20180005109A1-20180104",
  "summary": "<SOH> BRIEF SUMMARY OF THE INVENTION <EOH>According to an aspect of the invention, a deep learning neuromorphic system includes an electronic circuit having input ports and an output port. The input ports are configured to receive differential photon detector outputs as circuit inputs. The electronic circuit is configured to apply unsupervised deep learning rules to the circuit inputs to provide a current mirror output. The output port is configured to provide the current mirror output to a plotter. The differential photon detector outputs can be associated with a minimum free energy of a subject brain. The unsupervised deep learning rules can predict the glial cell force voltage of the subject brain. The current mirror output can relate to the glial cell force voltage. The system can include the photon detector. The photon detector can be configured to receive a video input and provide a corresponding differential output. The electronic circuit can include three-port semiconductor devices. The system can include the plotter. The electronic circuit can be configured as a system-on-chip. According to another aspect of the invention, a method of deep learning neuromorphic application includes receiving differential photon detector outputs as inputs to an electronic circuit. The electronic circuit applies unsupervised deep learning rules to the inputs to provide a current mirror output. The current mirror output is provided to a plotter. The method can include associating a minimum free energy of a subject brain with the differential photon detector outputs. The method can include using the unsupervised deep learning rules to predict the glial cell force voltage of the subject brain. The method can include relating the current mirror output to the glial cell force voltage. The method can include using a photon detector to receive a video input and provide a corresponding differential output. The electronic circuit can include three-port semiconductor devices. The elect...",
  "ipcr_labels": [
    "G06N3063",
    "G06N308",
    "G06N502",
    "G06F1750"
  ],
  "inventor_list": [
    {
      "inventor_name_last": "Szu",
      "inventor_name_first": "Harold",
      "inventor_city": "Bethesda",
      "inventor_state": "MD",
      "inventor_country": "US"
    }
  ],
  "title": "Deep Learning Neuromorphic Engineering",
  "decision": "PENDING",
  "_processing_info": {
    "original_size": 42152,
    "optimized_size": 3289,
    "reduction_percent": 92.2
  }
}