{
  "patent_number": "None",
  "application_number": "15600644",
  "date_published": "20171005",
  "date_produced": "20170920",
  "filing_date": "20170519",
  "main_ipcr_label": "G06N700",
  "abstract": "Systems and methods are provided herein for generating personalized timeline-based feeds to a user. A computer-implemented method for generating feeds to a user may be provided. The method may include generating a timeline comprising a plurality of milestones and needs associated with an event, and providing the feeds based on community wisdom. The feeds may be provided for each milestone on the time-line specific to the user, and may be configured to address the user's needs at each milestone.",
  "publication_number": "US20170286857A1-20171005",
  "summary": "<SOH> SUMMARY <EOH>In some instances, a user may be faced with an event such as a significant life transition. During those moments, the user may lack the experience and tools to make informed decisions at an appropriate time, in a quick and efficient manner. Accordingly, a need exists to identify an event based on input from the user, and to determine a plurality of milestones associated with the event. Another need exists to provide personalized insights to the user to address each milestone. A further need exists to predict the user's next milestones, so that the insights can be further personalized and dynamically provided in real-time to the user. The insights may be provided depending on the user's needs at each milestone. The milestones may be charted along a timeline of the event for the user. The insights may be crowd-sourced insights provided by a community of people who have experience going through the event. The insights may be further edited, curated and rated by a group of experts before the insights are provided to the user. The insights, milestones, and timeline can help the user to navigate through an event requiring important decision-making. In addition, the insights, milestones, and timeline can help users to improve their decision-making process, and assist them in making informed decisions at any given moment. The event navigation system disclosed herein addresses at least the above needs. According to some embodiments of the disclosure, a computer-implemented method for predicting a user's needs is provided. The method includes: receiving input data associated with a user; and predicting the user's needs at a plurality of milestones of a significant life transition (SLT) event associated with the input data associated with the user. The input data may further include data that is directly inputted by the user. In some embodiments, the input data may be a question. Alternatively, the input data may be an online social interaction. In some embo...",
  "ipcr_labels": [
    "G06N700",
    "H04L2908"
  ],
  "inventor_list": [
    {
      "inventor_name_last": "Gaon",
      "inventor_name_first": "Boaz",
      "inventor_city": "Herzliya",
      "inventor_state": "",
      "inventor_country": "IL"
    },
    {
      "inventor_name_last": "Engel",
      "inventor_name_first": "Ido Jonathan",
      "inventor_city": "Herzliya",
      "inventor_state": "",
      "inventor_country": "IL"
    },
    {
      "inventor_name_last": "Gilon",
      "inventor_name_first": "Arik",
      "inventor_city": "Herzliya",
      "inventor_state": "",
      "inventor_country": "IL"
    },
    {
      "inventor_name_last": "Gofer",
      "inventor_name_first": "Arie",
      "inventor_city": "Herzliya",
      "inventor_state": "",
      "inventor_country": "IL"
    }
  ],
  "title": "METHODS AND SYSTEMS FOR DYNAMICALLY GENERATING REAL-TIME RECOMMENDATIONS",
  "decision": "PENDING",
  "_processing_info": {
    "original_size": 201409,
    "optimized_size": 3496,
    "reduction_percent": 98.26
  }
}