{
  "patent_number": "None",
  "application_number": "15604895",
  "date_published": "20171214",
  "date_produced": "20171129",
  "filing_date": "20170525",
  "main_ipcr_label": "G06N502",
  "abstract": "An information processing apparatus includes circuitry to acquire information relating to an actual usage record of an output device in a customer environment, and predict an amount of usage of the output device for a predetermined period of time of a target year based on the acquired information. In predicting, the circuitry calculates an amount of usage of the output device for a year-ago predetermined period of time corresponding to the predetermined period of time of the target year, and predicts the amount of usage of the output device for the predetermined period of time of the target year as being equal to the calculated amount of usage of the output device for the-year ago predetermined period of time.",
  "publication_number": "US20170357902A1-20171214",
  "summary": "<SOH> SUMMARY <EOH>An information processing apparatus includes circuitry to acquire information relating to an actual usage record of an output device in a customer environment, and predict an amount of usage of the output device for a predetermined period of time of a target year based on the acquired information. In predicting, the circuitry calculates an amount of usage of the output device for a year-ago predetermined period of time corresponding to the predetermined period of time of the target year, and predicts the amount of usage of the output device for the predetermined period of time of the target year as being equal to the calculated amount of usage of the output device for the-year ago predetermined period of time.",
  "ipcr_labels": [
    "G06N502"
  ],
  "inventor_list": [
    {
      "inventor_name_last": "NAGAMORI",
      "inventor_name_first": "Akira",
      "inventor_city": "Kanagawa",
      "inventor_state": "",
      "inventor_country": "JP"
    }
  ],
  "title": "INFORMATION PROCESSING APPARATUS, INFORMATION PROCESSING SYSTEM, AND METHOD FOR PREDICTING AMOUNT OF USAGE",
  "decision": "PENDING",
  "_processing_info": {
    "original_size": 55128,
    "optimized_size": 2047,
    "reduction_percent": 96.29
  }
}