{
  "patent_number": "None",
  "application_number": "15609691",
  "date_published": "20180315",
  "date_produced": "20180228",
  "filing_date": "20170531",
  "main_ipcr_label": "G06N308",
  "abstract": "Technical solutions are described for improving efficiency of training a resistive processing unit (RPU) array using a neural network training methodology. An example method includes reducing asymmetric RPUs from the RPU array by determining an asymmetric value of an RPU from the RPU array, and burning the RPU in response to the asymmetry value being above a predetermined threshold. The RPU can be burned by causing an electric voltage across the RPU to be above a predetermined limit. The method further includes initiating the training methodology for the RPU array after the asymmetric RPUs from the RPU array are reduced.",
  "publication_number": "US20180075350A1-20180315",
  "summary": "<SOH> SUMMARY <EOH>According to one or more embodiments, resistive processing unit (RPU) array includes a set of conductive row wires, a set of conductive column wires configured to form crosspoints at intersections between the set of conductive row wires and the set of conductive column wires, and multiple two-terminal RPUs, wherein a two-terminal RPU is located at each of the plurality of crosspoints, wherein a conduction state of an RPU identifies a weight of a training methodology applied to said RPU. The RPU array unit receives one or more electric signals that burn a selected subset of RPUs from the plurality of the RPUs. According to one or more embodiments, a neuron control system facilitating training a resistive processing unit (RPU) array, includes the RPU array, which includes multiple of RPUs, and a processor that controls electric voltage across each RPU from the RPU array. The processor further reduces asymmetric RPUs from the RPU array by determining an asymmetric value of an RPU from the RPU array, and burning the RPU in response to the asymmetry value being above a predetermined threshold. The processor burns the RPU by causing the electric voltage across the RPU to be above a predetermined limit. According to one or more embodiments, computer program product for training a resistive processing unit (RPU) array, includes computer readable storage medium with computer executable instructions embedded therein. The computer readable storage medium includes instructions to reduce asymmetric RPUs from the RPU array by determining an asymmetric value of an RPU from the RPU array, and burning the RPU in response to the asymmetry value being above a predetermined threshold. The RPU is burned by causing an electric voltage across the RPU to be above a predetermined limit. The computer readable storage medium also includes instructions to initiate a training methodology for the RPU array after the asymmetric RPUs from the RPU array are reduced. Additional fe...",
  "ipcr_labels": [
    "G06N308"
  ],
  "inventor_list": [
    {
      "inventor_name_last": "Gokmen",
      "inventor_name_first": "Tayfun",
      "inventor_city": "Briarcliff Manor",
      "inventor_state": "NY",
      "inventor_country": "US"
    }
  ],
  "title": "KILLING ASYMMETRIC RESISTIVE PROCESSING UNITS FOR NEURAL NETWORK TRAINING",
  "decision": "PENDING",
  "_processing_info": {
    "original_size": 89335,
    "optimized_size": 3197,
    "reduction_percent": 96.42
  }
}