{
  "patent_number": "None",
  "application_number": "15603352",
  "date_published": "20171019",
  "date_produced": "20171004",
  "filing_date": "20170523",
  "main_ipcr_label": "G06N9900",
  "abstract": "A method, system, and computer program product for advertising portfolio management. The method form processes steps for determining effectiveness of marketing stimulations in a plurality of marketing channels included in a marketing campaign. The method commences upon receiving data comprising a plurality of marketing stimulations and respective measured responses, then determining from the marketing stimulations and the respective measured responses, a set of cross-channel weights to apply to the respective measured responses, where the cross-channel weights are indicative of the influence that a particular stimulation applied to a first channel has on the measure responses of other channels. The cross-channel weights are used in calculating the effectiveness of a particular marketing stimulation over an entire marketing campaign. The marketing campaign can comprise stimulations quantified as a number of direct mail pieces, a number or frequency of TV spots, a number of web impressio...",
  "publication_number": "US20170300832A1-20171019",
  "summary": "<SOH> SUMMARY <EOH>The present disclosure provides an improved method, system, and computer program product suited to address the aforementioned issues with legacy approaches. More specifically, the present disclosure provides a detailed description of techniques used in methods, systems, and computer program products for media spend optimization using a cross-channel predictive model. A method, system, and computer program product for advertising portfolio management is disclosed. The method forms process steps for determining the effectiveness of marketing stimulations in a plurality of marketing channels included in a marketing campaign. The method commences upon receiving data comprising a plurality of marketing stimulations and respective measured responses, then determining from the marketing stimulations and the respective measured responses, a set of cross-channel weights to apply to the respective measured responses, where the cross-channel weights are indicative of the influence that a particular stimulation applied to a first channel has on the measure responses of other channels. The cross-channel weights are used in calculating the effectiveness of a particular marketing stimulation over an entire marketing campaign. The marketing campaign can comprise stimulations quantified as a number of direct mail pieces, a number or frequency of TV spots, a number of web impressions, a number of coupons printed, etc. Further details of aspects, objectives, and advantages of the disclosure are described below and in the detailed description, drawings, and claims. Both the foregoing general description of the background and the following detailed description are exemplary and explanatory, and are not intended to be limiting as to the scope of the claims.",
  "ipcr_labels": [
    "G06N9900",
    "G06Q3002",
    "G06N504"
  ],
  "inventor_list": [
    {
      "inventor_name_last": "Chittilappilly",
      "inventor_name_first": "Anto",
      "inventor_city": "Waltham",
      "inventor_state": "MA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Bharadwaj",
      "inventor_name_first": "Madan",
      "inventor_city": "Billerica",
      "inventor_state": "MA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Jose",
      "inventor_name_first": "Darius",
      "inventor_city": "Thrissur",
      "inventor_state": "",
      "inventor_country": "IN"
    }
  ],
  "title": "CROSS-CHANNEL PREDICTIVE MODEL",
  "decision": "PENDING",
  "_processing_info": {
    "original_size": 77255,
    "optimized_size": 3623,
    "reduction_percent": 95.31
  }
}