{
  "patent_number": "None",
  "application_number": "15605527",
  "date_published": "20170914",
  "date_produced": "20170830",
  "filing_date": "20170525",
  "main_ipcr_label": "G06N504",
  "abstract": "A method and system for providing contextually appropriate overlays. The method includes causing the generation of at least one signature for each of at least one input multimedia content element, wherein each signature represents a concept, wherein each concept is a collection of signatures and metadata describing the concept; correlating the concepts represented by the generated signatures to determine at least one context of the at least one input multimedia content element; determining, based on the at least one context of the at least one input multimedia content element, at least one contextually relevant reference multimedia content element, wherein each contextually relevant multimedia content element has a context matching at least one of the determined at least one context above a predetermined threshold; and causing an overlay of the at least one contextually relevant reference multimedia content element on the at least one input multimedia content element.",
  "publication_number": "US20170262760A1-20170914",
  "summary": "<SOH> SUMMARY <EOH>A summary of several example aspects of the disclosure follows. This summary is provided for the convenience of the reader to provide a basic understanding of such embodiments and does not wholly define the breadth of the disclosure. This summary is not an extensive overview of all contemplated embodiments, and is intended to neither identify key or critical elements of all aspects nor delineate the scope of any or all aspects. Its sole purpose is to present some concepts of one or more embodiments in a simplified form as a prelude to the more detailed description that is presented later. For convenience, the term some embodiments may be used herein to refer to a single embodiment or multiple embodiments of the disclosure. Certain embodiments disclosed herein include a method and system for providing contextually appropriate overlays. The method comprises causing the generation of at least one signature for each of at least one input multimedia content element, wherein each signature represents a concept, wherein each concept is a collection of signatures and metadata describing the concept; correlating the concepts represented by the generated signatures to determine at least one context of the at least one input multimedia content element; determining, based on the at least one context of the at least one input multimedia content element, at least one contextually relevant reference multimedia content element, wherein each contextually relevant multimedia content element has a context matching at least one of the determined at least one context above a predetermined threshold; and causing an overlay of the at least one contextually relevant reference multimedia content element on the at least one input multimedia content element. Certain embodiments disclosed herein also include a non-transitory computer readable medium having stored thereon instructions for causing a processing circuitry to perform a process, the process including causing the g...",
  "ipcr_labels": [
    "G06N504",
    "G06F1730",
    "H04H6046",
    "H04H6056",
    "H04N7173",
    "H04N21258",
    "H04N212668",
    "H04N21466",
    "H04N2181",
    "G06Q3002",
    "G06N700",
    "H04H6037"
  ],
  "inventor_list": [
    {
      "inventor_name_last": "Raichelgauz",
      "inventor_name_first": "Igal",
      "inventor_city": "Tel Aviv",
      "inventor_state": "",
      "inventor_country": "IL"
    },
    {
      "inventor_name_last": "Odinaev",
      "inventor_name_first": "Karina",
      "inventor_city": "Tel Aviv",
      "inventor_state": "",
      "inventor_country": "IL"
    },
    {
      "inventor_name_last": "Zeevi",
      "inventor_name_first": "Yehoshua Y",
      "inventor_city": "Haifa",
      "inventor_state": "",
      "inventor_country": "IL"
    }
  ],
  "title": "SYSTEM AND METHOD FOR PROVIDING CONTEXTUALLY APPROPRIATE OVERLAYS",
  "decision": "PENDING",
  "_processing_info": {
    "original_size": 51545,
    "optimized_size": 3960,
    "reduction_percent": 92.32
  }
}