{
  "patent_number": "None",
  "application_number": "15604821",
  "date_published": "20171228",
  "date_produced": "20171213",
  "filing_date": "20170525",
  "main_ipcr_label": "G06N9900",
  "abstract": "A machine learning management apparatus calculates, for each of a plurality of second models that are generated by model searches by a plurality of algorithms using a plurality of sets of second training data and based on prediction performance of first models, an index value used to determine whether to generate each second model. The machine learning management apparatus then sets the number of second models that are generated using a set of second training data and have an index value at least equal to a threshold as the priority for caching that second training data. The machine learning management apparatus then decides, when a model search has been executed using second training data, whether to cache the second training data based on the priority and stores the second training data in a memory when the decision to cache the data is taken.",
  "publication_number": "US20170372230A1-20171228",
  "summary": "<SOH> SUMMARY <EOH>According to one aspect, there is provided a non-transitory computer-readable storage medium storing a computer program that causes a computer to perform a procedure including: generating a plurality of first models by executing a model search according to each of a plurality of machine learning algorithms using first training data out of a plurality of sets of training data that have different sampling rates; calculating, based on a prediction performance of each of the plurality of first models, an index value to be used to determine whether to generate each of a plurality of second models, which are generated by model searches according to the plurality of algorithms using a plurality of sets of second training data that are included in the plurality of training data but differ from the first training data, the index value being separately calculated for each of the plurality of second models; setting, for each of the plurality of sets of second training data, the number of second models for which the index value is equal to or above a threshold, out of the second models generated using the second training data, as a priority for caching the second training data; deciding, when a model search has been executed using a new set of second training data that is not cached, whether to cache the new set of second training data based on the priority of the new set of second training data; and storing, when the deciding has decided to cache the new set of second training data, the new set of second training data in a memory. The object and advantages of the invention will be realized and attained by means of the elements and combinations particularly pointed out in the claims. It is to be understood that both the foregoing general description and the following detailed description are exemplary and explanatory and are not restrictive of the invention.",
  "ipcr_labels": [
    "G06N9900",
    "G06N504",
    "G06F1711"
  ],
  "inventor_list": [
    {
      "inventor_name_last": "KUROMATSU",
      "inventor_name_first": "Nobuyuki",
      "inventor_city": "Kawasaki",
      "inventor_state": "",
      "inventor_country": "JP"
    },
    {
      "inventor_name_last": "Ueda",
      "inventor_name_first": "Haruyasu",
      "inventor_city": "Ichikawa",
      "inventor_state": "",
      "inventor_country": "JP"
    }
  ],
  "title": "MACHINE LEARNING MANAGEMENT METHOD AND MACHINE LEARNING MANAGEMENT APPARATUS",
  "decision": "PENDING",
  "_processing_info": {
    "original_size": 128289,
    "optimized_size": 3487,
    "reduction_percent": 97.28
  }
}