{
  "patent_number": "None",
  "application_number": "15608103",
  "date_published": "20171228",
  "date_produced": "20171213",
  "filing_date": "20170530",
  "main_ipcr_label": "G06N504",
  "abstract": "A determination process control apparatus includes a processor configured to select a first condition on which a determination is to be performed with respect to first data from among a plurality of conditions included in a rule, on basis of first pass efficiency of each of the plurality of conditions. The processor is configured to select a second condition on which a next determination is to be performed with respect to second data from the plurality of conditions on basis of a second pass efficiency of each of the plurality of conditions. The processor is configured to determine, upon determining that the first condition is satisfied, whether the second condition is satisfied with respect to the second data. The processor is configured to output, upon determining that all the plurality of conditions are satisfied, a notification indicating an action to be performed. The action is defined in the rule.",
  "publication_number": "US20170372209A1-20171228",
  "summary": "<SOH> SUMMARY <EOH>According to an aspect of the present invention, provided is a determination process control apparatus including a memory and a processor coupled to the memory. The processor is configured to select a first condition on which a determination is to be performed with respect to first data to be subject to the determination from among a plurality of conditions included in a rule, on basis of first pass efficiency of each of the plurality of conditions. The processor is configured to select a second condition on which a next determination is to be performed with respect to second data to be subject to the next determination from the plurality of conditions on basis of a second pass efficiency of each of the plurality of conditions. The processor is configured to determine whether the first condition is satisfied with respect to the first data. The processor is configured to determine, upon determining that the first condition is satisfied, whether the second condition is satisfied with respect to the second data. The processor is configured to output, upon determining that all the plurality of conditions are satisfied, a notification indicating an action to be performed. The action is defined in the rule. The object and advantages of the invention will be realized and attained by means of the elements and combinations particularly pointed out in the claims. It is to be understood that both the foregoing general description and the following detailed description are exemplary and explanatory and are not restrictive of the invention, as claimed.",
  "ipcr_labels": [
    "G06N504",
    "G06N502"
  ],
  "inventor_list": [
    {
      "inventor_name_last": "KOBAYASHI",
      "inventor_name_first": "Kenji",
      "inventor_city": "Kawasaki",
      "inventor_state": "",
      "inventor_country": "JP"
    }
  ],
  "title": "DETERMINATION PROCESS CONTROL METHOD AND DETERMINATION PROCESS CONTROL APPARATUS",
  "decision": "PENDING",
  "_processing_info": {
    "original_size": 68776,
    "optimized_size": 3076,
    "reduction_percent": 95.53
  }
}