{
  "patent_number": "None",
  "application_number": "15608258",
  "date_published": "20171130",
  "date_produced": "20171115",
  "filing_date": "20170530",
  "main_ipcr_label": "G06N504",
  "abstract": "A virtual cognitive agent (VCA) system comprises social media communication channels integrated with machine cognition engines. The VCA system connects to an external message platform and accesses posted messages. An intent is determined and sentiment analysis is performed on text elements from the intercepted messages to determine handling of the message. The integrated machine cognition engines determine a response to the captured message. The VCA system may access a corpus or exchange data with the originator of the post or another entity to determine the response. The integrated social media communication channels may connect to an external query response platform and communicate the response to the query response platform.",
  "publication_number": "US20170344889A1-20171130",
  "summary": "<SOH> BRIEF DESCRIPTION OF THE DRAWINGS <EOH>FIG. 1 shows an example of a global network architecture. FIG. 2 illustrates an example implementation of a virtual cognitive agent system. FIG. 3 shows a data flow diagram of the data moving through a virtual cognitive agent system. FIG. 4 shows an integration interface for connecting the virtual cognitive agent system to a data platform. FIG. 5 shows an example architecture of a virtual cognitive agent system. FIG. 6 shows logic for automatically responding to posted comments or queries by a virtual cognitive agent system. detailed-description description=\"Detailed Description\" end=\"lead\"?",
  "ipcr_labels": [
    "G06N504",
    "G06F1728",
    "G06Q5000",
    "H04L2908"
  ],
  "inventor_list": [
    {
      "inventor_name_last": "Sengupta",
      "inventor_name_first": "Shiladitya",
      "inventor_city": "Bangalore",
      "inventor_state": "",
      "inventor_country": "IN"
    },
    {
      "inventor_name_last": "Contractor",
      "inventor_name_first": "Gopali Raval",
      "inventor_city": "Mumbai",
      "inventor_state": "",
      "inventor_country": "IN"
    },
    {
      "inventor_name_last": "Gupta",
      "inventor_name_first": "Deepmala",
      "inventor_city": "Bangalore",
      "inventor_state": "",
      "inventor_country": "IN"
    },
    {
      "inventor_name_last": "Lopes",
      "inventor_name_first": "Maria",
      "inventor_city": "Mumbai",
      "inventor_state": "",
      "inventor_country": "IN"
    },
    {
      "inventor_name_last": "Sarkar",
      "inventor_name_first": "Rahul",
      "inventor_city": "Bangalore",
      "inventor_state": "",
      "inventor_country": "IN"
    }
  ],
  "title": "INTEGRATED VIRTUAL COGNITIVE AGENTS AND MESSAGE COMMUNICATION ARCHITECTURE",
  "decision": "PENDING",
  "_processing_info": {
    "original_size": 50386,
    "optimized_size": 2566,
    "reduction_percent": 94.91
  }
}