{
  "patent_number": "None",
  "application_number": "15600802",
  "date_published": "20171130",
  "date_produced": "20171115",
  "filing_date": "20170522",
  "main_ipcr_label": "G06N300",
  "abstract": "An electronic device is provided. The electronic device comprises: a storage for storing interaction setting information and behavior setting information; an interaction interface; and a processor electrically connected to the storage and the interaction interface. When the processor receives a behavior-driving command from the interaction interface, the processor is configured to select the behavior setting information and the interaction setting information according to the behavior-driving command. The processor is configured to perform a behavior according to the behavior setting information. The processor is further configured to perform an interaction operation based on the behavior according to the behavior setting information and the interaction setting information when the behavior is had. A control method and a non-transitory computer readable storage medium are also provided.",
  "publication_number": "US20170344875A1-20171130",
  "summary": "<SOH> BRIEF SUMMARY OF THE INVENTION <EOH>According to a first aspect of the disclosure, an electronic device is provided. The electronic device comprises a storage, an interaction interface and a processor. The storage is configured to store interaction setting information and behavior setting information. The processor is electrically connected to the storage and the interaction interface. When the processor receives a behavior-driving command from the interaction interface, the processor is configured to select the behavior setting information and the interaction setting information according to the behavior-driving command. The processor is configured to perform a behavior according to the behavior setting information. The processor is further configured to perform an interaction operation corresponding to the behavior based on the behavior setting information and the interaction setting information when the behavior is had. According to a second aspect of the disclosure, a control method is provided. The control method is applied to an electronic device. The control method comprises: receiving a behavior-driving command; selecting behavior setting information and interaction setting information according to the behavior-driving command; performing a behavior according to the behavior setting information; and performing an interaction operation corresponding to the behavior based on the interaction setting information and the behavior setting information when the behavior is had. According to a third aspect of the disclosure, a non-transitory computer readable storage medium for storing a program command is provided. After the program command is loaded on the electronic device, the electronic device performs steps of: receiving a behavior setting information; selecting behavior setting information and interaction setting information according to the behavior-driving command; performing a behavior according to the behavior setting information; and performing an i...",
  "ipcr_labels": [
    "G06N300",
    "G06K900",
    "G06F30487",
    "G10L1508"
  ],
  "inventor_list": [
    {
      "inventor_name_last": "LEE",
      "inventor_name_first": "Wei-Long",
      "inventor_city": "TAIPEI",
      "inventor_state": "",
      "inventor_country": "TW"
    },
    {
      "inventor_name_last": "KU",
      "inventor_name_first": "Mei-Chieh",
      "inventor_city": "TAIPEI",
      "inventor_state": "",
      "inventor_country": "TW"
    },
    {
      "inventor_name_last": "KUNG",
      "inventor_name_first": "Tzu-Yu",
      "inventor_city": "TAIPEI",
      "inventor_state": "",
      "inventor_country": "TW"
    },
    {
      "inventor_name_last": "WU",
      "inventor_name_first": "Chung-Yi",
      "inventor_city": "TAIPEI",
      "inventor_state": "",
      "inventor_country": "TW"
    },
    {
      "inventor_name_last": "LIN",
      "inventor_name_first": "Tai-Yin",
      "inventor_city": "TAIPEI",
      "inventor_state": "",
      "inventor_country": "TW"
    },
    {
      "inventor_name_last": "CHOU",
      "inventor_name_first": "Jia-Wei",
      "inventor_city": "TAIPEI",
      "inventor_state": "",
      "inventor_country": "TW"
    },
    {
      "inventor_name_last": "HUANG",
      "inventor_name_first": "Chao-Yang",
      "inventor_city": "TAIPEI",
      "inventor_state": "",
      "inventor_country": "TW"
    }
  ],
  "title": "CONTROL METHOD, ELECTRONIC DEVICE AND NON-TRANSITORY COMPUTER READABLE STORAGE MEDIUM",
  "decision": "PENDING",
  "_processing_info": {
    "original_size": 40400,
    "optimized_size": 4349,
    "reduction_percent": 89.24
  }
}