{
  "patent_number": "None",
  "application_number": "15615488",
  "date_published": "20171207",
  "date_produced": "20171121",
  "filing_date": "20170606",
  "main_ipcr_label": "G06N502",
  "abstract": "A passenger's activity at the normal entry and exit points to the transit system may be recorded and linked, using a transit ticking system, along with the passenger's transit time and onward travel mode (bike hire, taxi, etc.). These records can be linked to other parameters such as the time, day of the week, season of the year, weather, and/or other such parameters. Furthermore, the passenger may use the transit ticketing system to make onward travel reservations such a bike hire or taxi. Such reservations will also be linked with the entry and exit and other parameters. The passenger's entry and exit on subsequent visits may be recorded and aggregated with past travel parameters. Thus, when a user enters the transit system, the records for that user can be used to predict how long they may be in transit, where they may exit the transit system, and what type of onward travel they may use.",
  "publication_number": "US20170351955A1-20171207",
  "summary": "<SOH> BRIEF SUMMARY OF THE INVENTION <EOH>A system of one or more computers can be configured to perform particular operations or actions by virtue of having software, firmware, hardware, or a combination of them installed on the system that in operation causes or cause the system to perform the actions. One or more computer programs can be configured to perform particular operations or actions by virtue of including instructions that, when executed by data processing apparatus, cause the apparatus to perform the actions. One general aspect includes a processor-based method for forecasting onward-travel demand in a transit system, the method including: continuously receiving, over a network and at a transit server, one or more user records from an onward-travel server, where each user record of the one or more user records includes a departure time from one of a plurality of departure locations; an arrival time of one or more arrival times, to one of one or more arrival locations; and an onward-travel type of one or more onward-travel types; The method also includes processing, by the transit server, the one or more user records, for each arrival location of one or more arrival locations, and for each arrival time of one or more arrival times at each location, and for each onward-travel type of one or more travel types at each location at each arrival time, the processing including determining an onward-travel count of one or more onward-travel counts for one or more users, where the one or more users need an onward-travel type; generating a request of one or more requests, for an onward-travel count of the onward-travel type; and transmitting, over the network, the request of the one or more requests to an onward transportation resource. Other embodiments of this aspect include corresponding computer systems, apparatus, and computer programs recorded on one or more computer storage devices, each configured to perform the actions of the methods. Implementations may ...",
  "ipcr_labels": [
    "G06N502"
  ],
  "inventor_list": [
    {
      "inventor_name_last": "Fletcher",
      "inventor_name_first": "Graham Paul",
      "inventor_city": "Stanford in the Vale",
      "inventor_state": "",
      "inventor_country": "GB"
    }
  ],
  "title": "INTERMODAL DEMAND ESTIMATION TO TRANSIT ENTRY MONITORING",
  "decision": "PENDING",
  "_processing_info": {
    "original_size": 120947,
    "optimized_size": 3464,
    "reduction_percent": 97.14
  }
}