{
  "patent_number": "None",
  "application_number": "15614767",
  "date_published": "20180301",
  "date_produced": "20180213",
  "filing_date": "20170606",
  "main_ipcr_label": "G06N502",
  "abstract": "A data conversion method performed by a computer, the method is configured to cause the computer to; when the computer receives a plurality of data, acquire first information and second information from a storage, the first information designating any data among the plurality of data, the second information designating a predetermined number of data, data formats of which are collectively converted among the plurality of data; acquire, based on the acquired first information and the acquired second information, the predetermined number of conversion target data from the received plurality of data; extract each pieces of specific information embedded in each of the acquired predetermined number of conversion target data; and convert the data format of each of the respective predetermined number of conversion target data by using the extracted predetermined number of pieces of the specific information.",
  "publication_number": "US20180060741A1-20180301",
  "summary": "<SOH> SUMMARY <EOH>According to an aspect of the invention, a data conversion method performed by a computer, the method is configured to cause the computer to; when the computer receives a plurality of data, acquire first information and second information from a storage, the first information designating any data among the plurality of data, the second information designating a predetermined number of data, data formats of which are collectively converted among the plurality of data; acquire, based on the acquired first information and the acquired second information, the predetermined number of conversion target data from the received plurality of data; extract each pieces of specific information embedded in each of the acquired predetermined number of conversion target data; and convert the data format of each of the respective predetermined number of conversion target data by using the extracted predetermined number of pieces of the specific information. The object and advantages of the invention will be realized and attained by means of the elements and combinations particularly pointed out in the claims. It is to be understood that both the foregoing general description and the following detailed description are exemplary and explanatory and are not restrictive of the invention, as claimed.",
  "ipcr_labels": [
    "G06N502",
    "G06F1730",
    "G06F2178",
    "H04L1240",
    "H04L12879"
  ],
  "inventor_list": [
    {
      "inventor_name_last": "Sakai",
      "inventor_name_first": "Takafumi",
      "inventor_city": "Kawasaki",
      "inventor_state": "",
      "inventor_country": "JP"
    }
  ],
  "title": "MEDIUM STORING DATA CONVERSION PROGRAM, DATA CONVERSION DEVICE, AND DATA CONVERSION METHOD",
  "decision": "PENDING",
  "_processing_info": {
    "original_size": 77092,
    "optimized_size": 2854,
    "reduction_percent": 96.3
  }
}