{
  "patent_number": "None",
  "application_number": "15618817",
  "date_published": "20180503",
  "date_produced": "20180418",
  "filing_date": "20170609",
  "main_ipcr_label": "G06N304",
  "abstract": "The present application discloses a data processing method and apparatus. A specific implementation of the method includes: receiving floating point data sent from an electronic device; converting the received floating point data into fixed point data according to a data length and a value range of the received floating point data; performing calculation on the obtained fixed point data according to a preset algorithm to obtain result data in a fixed point form; and converting the obtained result data in the fixed point form into result data in a floating point form and sending the result data in the floating point form to the electronic device. This implementation improves the data processing efficiency.",
  "publication_number": "US20180121789A1-20180503",
  "summary": "<SOH> SUMMARY <EOH>An objective of the present application is to provide an improved method and apparatus for processing data, in order to solve the technical problem mentioned in the Background. According to a first aspect, the present application provides a data processing method. The method includes: receiving floating point data sent from an electronic device; converting the received floating point data into fixed point data according to a data length and a value range of the received floating point data; performing calculation on the obtained fixed point data according to a preset algorithm to obtain result data in a fixed point form; and converting the obtained result data in the fixed point form into result data in a floating point form and sending the result data in the floating point form to the electronic device. According to a second aspect, the present application provides a data processing apparatus. The apparatus includes: a receiving unit, configured to receive floating point data sent from an electronic device; a conversion unit, configured to convert the received floating point data into fixed point data according to a data length and a value range of the received floating point data; a calculation unit, configured to perform calculation on the obtained fixed point data according to a preset algorithm to obtain result data in fixed point form; and a sending unit, configured to convert the obtained result data in the fixed point form into result data in a floating point form and send the result data in the floating point form to the electronic device. With the data processing method and apparatus provided in the present application, floating point data sent from an electronic device is received; the received floating point data is converted into fixed point data according to a data length and a value range of the received floating point data; calculation is performed on the obtained fixed point data according to a preset algorithm to obtain result da...",
  "ipcr_labels": [
    "G06N304",
    "G06F7483",
    "G06F501"
  ],
  "inventor_list": [
    {
      "inventor_name_last": "OUYANG",
      "inventor_name_first": "Jian",
      "inventor_city": "Beijing",
      "inventor_state": "",
      "inventor_country": "CN"
    },
    {
      "inventor_name_last": "QI",
      "inventor_name_first": "Wei",
      "inventor_city": "Beijing",
      "inventor_state": "",
      "inventor_country": "CN"
    },
    {
      "inventor_name_last": "WANG",
      "inventor_name_first": "Yong",
      "inventor_city": "Beijing",
      "inventor_state": "",
      "inventor_country": "CN"
    },
    {
      "inventor_name_last": "LIU",
      "inventor_name_first": "Lin",
      "inventor_city": "Beijing",
      "inventor_state": "",
      "inventor_country": "CN"
    }
  ],
  "title": "DATA PROCESSING METHOD AND APPARATUS",
  "decision": "PENDING",
  "_processing_info": {
    "original_size": 58613,
    "optimized_size": 3668,
    "reduction_percent": 93.74
  }
}