{
  "patent_number": "None",
  "application_number": "15615080",
  "date_published": "20180104",
  "date_produced": "20171219",
  "filing_date": "20170606",
  "main_ipcr_label": "G06N304",
  "abstract": "A method of continuous decoding of motion for a direct neural interface. The method of decoding estimates a motion variable from an observation variable obtained by a time-frequency transformation of the neural signals. The observation variable is modelled using a HMM model whose hidden states include at least an active state and an idle state. The motion variable is estimated using a Markov mixture of experts where each expert is associated with a state of the model. For a sequence of observation vectors, the probability that the model is in a given state is estimated, and from this a weighting coefficient is deduced for the prediction generated by the expert associated with this state. The motion variable is then estimated by combination of the estimates of the different experts with these weighting coefficients.",
  "publication_number": "US20180005105A1-20180104",
  "summary": "<SOH> BRIEF DESCRIPTION OF THE ILLUSTRATIONS <EOH>Other characteristics and advantages of the invention will become clear after reading a preferred embodiment of the invention with reference to the attached figures among which: FIG. 1 shows a schematic of the principle of continuous decoding of motion by Markov mixture of experts used in this invention; FIG. 2 shows, in the form of a flowchart, the method of continuous decoding of motion for a direct neural interface according to one embodiment of the present invention; FIG. 3 shows examples of continuous decoding of motion according to different methods of the prior art and according to the method in FIG. 2 . detailed-description description=\"Detailed Description\" end=\"lead\"?",
  "ipcr_labels": [
    "G06N304",
    "G06T7277",
    "G06K962",
    "G06N3063"
  ],
  "inventor_list": [
    {
      "inventor_name_last": "SCHAEFFER",
      "inventor_name_first": "Marie-Caroline",
      "inventor_city": "Grenoble",
      "inventor_state": "",
      "inventor_country": "FR"
    },
    {
      "inventor_name_last": "AKSENOVA",
      "inventor_name_first": "Tetiana",
      "inventor_city": "Saint Egreve",
      "inventor_state": "",
      "inventor_country": "FR"
    }
  ],
  "title": "CONTINUOUS DECODING DIRECT NEURAL INTERFACE WHICH USES A MARKOV MIXTURE OF EXPERTS",
  "decision": "PENDING",
  "_processing_info": {
    "original_size": 38116,
    "optimized_size": 2328,
    "reduction_percent": 93.89
  }
}