{
  "patent_number": "None",
  "application_number": "15612771",
  "date_published": "20171207",
  "date_produced": "20171121",
  "filing_date": "20170602",
  "main_ipcr_label": "G06N9900",
  "abstract": "This present disclosure describes a novel computational method for assessing fee creativity of human-generated and machine-generated creative products, such as paintings, sculptures, poetry, music, etc. The proposed computational method and algorithm is based on constructing a network between creative products and using this network to infer the originality arid influence of its nodes.",
  "publication_number": "US20170351973A1-20171207",
  "summary": "<SOH> SUMMARY OF THE EMBODIMENTS <EOH>According to an aspect of the present invention, a non-transitory computer readable memory is provided that is configured to store one or more programs for execution by a processor, wherein the one or more programs has machine readable instructions that when executed by the processor cause a series of steps to be performed. The steps include inputting a first data set, via the processor, the first data set comprising a plurality of works fixed in a tangible medium and calculating, via the processor, a creativity score for each of the plurality of works, wherein calculations are performed in accordance with a creativity algorithm, and wherein the creativity algorithm comprises an originality component and an influence component. The steps further include creating a second data set, via the processor, comprising the creativity score applied to each of the components of the first data set. According to another aspect of the present invention, a method for assessing creativity of one or more artistic works is provided. The method includes inputting a first data set, via a processor, the first data set comprising a plurality of works fixed in a tangible medium and calculating, via the processor, a creativity score for each of the plurality of works, wherein calculations are performed in accordance with a creativity algorithm, and wherein the creativity algorithm comprises an originality component and an influence component. The method further includes creating a second data set, via the processor, comprising the creativity score applied to each of the components of the first data set. It is an object to provide the non-transitory computer readable memory, wherein the first data set comprises a plurality of paintings. It is an object to provide the non-transitory computer readable memory, wherein the first data set includes content associated with each of the plurality of paintings, and wherein the content is selected from the group c...",
  "ipcr_labels": [
    "G06N9900",
    "G06N502"
  ],
  "inventor_list": [
    {
      "inventor_name_last": "ELGAMMAL",
      "inventor_name_first": "AHMED",
      "inventor_city": "EAST WINDSOR",
      "inventor_state": "NJ",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "SALEH",
      "inventor_name_first": "BABAK",
      "inventor_city": "Hoboken",
      "inventor_state": "NJ",
      "inventor_country": "US"
    }
  ],
  "title": "QUANTIFYING CREATIVITY IN AUDITORY AND VISUAL MEDIUMS",
  "decision": "PENDING",
  "_processing_info": {
    "original_size": 100383,
    "optimized_size": 3090,
    "reduction_percent": 96.92
  }
}