{
  "patent_number": "None",
  "application_number": "15618935",
  "date_published": "20170928",
  "date_produced": "20170915",
  "filing_date": "20170609",
  "main_ipcr_label": "G06N502",
  "abstract": "Methods and apparatus are provided involving adaptive content inspection. In one embodiment, a content inspection processor may identify information with respect to input data and provide the information to a host controller. The host controller may adapt search criteria or other parameters and provide the adapted parameter to the content inspection processor. Other embodiments may include a content inspection processor having integrated feedback, such that results data is fed back to the content inspection processor. The results data may be processed before being provided to the content inspection processor.",
  "publication_number": "US20170278002A1-20170928",
  "summary": "<SOH> BRIEF DESCRIPTION OF DRAWINGS <EOH>FIG. 1 is a block diagram of an embodiment of an apparatus having a content inspection processor in accordance with embodiments of the present invention; FIG. 2 is a block diagram illustrating operation of a host controller and a content inspection processor in accordance with an embodiment of the present invention; FIG. 3 is a flowchart of a dynamic adaptation process for a content inspection processor in accordance with an embodiment of the present invention; FIG. 4 depicts a content inspection processor having adaptable programming according to an embodiment of the present invention; FIG. 5 depicts a second level of adaptable programming of a content inspection processor according to an embodiment of the present invention; FIG. 6 depicts a content inspection processor having integrated feedback in accordance with an embodiment of the present invention; FIG. 7 depicts a content inspection processor having integrated feedback with results processing in accordance with another embodiment of the present invention; and FIG. 8 depicts a dynamic adaptation process of a content inspection processor with integrated feedback in accordance with an embodiment of the present invention. detailed-description description=\"Detailed Description\" end=\"lead\"?",
  "ipcr_labels": [
    "G06N502",
    "H04L2906"
  ],
  "inventor_list": [
    {
      "inventor_name_last": "Dlugosch",
      "inventor_name_first": "Paul D.",
      "inventor_city": "Eagle",
      "inventor_state": "ID",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Noyes",
      "inventor_name_first": "Harold B",
      "inventor_city": "Boise",
      "inventor_state": "ID",
      "inventor_country": "US"
    }
  ],
  "title": "ADAPTIVE CONTENT INSPECTION",
  "decision": "PENDING",
  "_processing_info": {
    "original_size": 29882,
    "optimized_size": 2591,
    "reduction_percent": 91.33
  }
}