{
  "patent_number": "None",
  "application_number": "15611494",
  "date_published": "20171228",
  "date_produced": "20171213",
  "filing_date": "20170601",
  "main_ipcr_label": "G06N300",
  "abstract": "Data points, calendar entries, trends, behavioral patterns may be used to predict and pre-emptively build digital and printable products with selected collections of images without the user's active participation. The collections are selected from files on the user's device, cloud-based photo library, or other libraries shared among other individuals and grouped into thematic products. Based on analysis of the user's collections and on-line behaviors, the system may estimate types and volumes of potential media-centric products, and the resources needed for producing and distributing such media-centric products for a projected period of time. A user interface may take the form of a “virtual curator”, which is a graphical or animated persona for augmenting and managing interactions between the user and the system managing the user's stored media assets. The virtual curator can assume one of many personas, as appropriate, with each user. For example, the virtual curator can be presented ...",
  "publication_number": "US20170372192A1-20171228",
  "summary": "<SOH> SUMMARY OF THE INVENTION <EOH>According to one embodiment of the present invention, a predictive curator analyzes a user's media assets, transaction data, calendar entries, trends, behavioral patterns to predict and pre-emptively build digital media-centric products using the user's collections of images, with minimal or no active participation by the user. The user's collections of media assets may be retrieved from files on the user's device, cloud-based photo library, or other libraries shared among other individuals and grouped into thematic products. Based on analysis of the user's collections and on-line behaviors, the predictive curator may estimate types and volumes of potential media-centric products, and the resources needed for producing and distributing such media-centric products for a projected period of time. According to one embodiment of the present invention, the “virtual curator” may take the form of a graphical or animated persona for augmenting and managing interactions between the user and the system managing the user's stored media assets. The virtual curator can assume one of many personas, as appropriate, with each user. For example, the virtual curator can be presented as an avatar-animated character in an icon, or as an icon that floats around the screen. The virtual curator can also interact with the user via text messaging, or audio messaging. According to one embodiment of the present invention, the curator performs co-occurrence tagging to facilitate searching of the media assets. To provide seed terms for tagging, the curator can take advantage of knowledge embedded in social network comments, and individuals and predominate objects recognized in the media assets themselves. The curator can also take advantage of co-occurrence terms in associated users' collections for matching and correlation. The present invention is better understood upon consideration of the detailed description below in conjunction with the accompanying dra...",
  "ipcr_labels": [
    "G06N300",
    "G06F30482",
    "G06F944",
    "G06T1340"
  ],
  "inventor_list": [
    {
      "inventor_name_last": "WHRITENOR",
      "inventor_name_first": "James",
      "inventor_city": "Mendon",
      "inventor_state": "NY",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Wood",
      "inventor_name_first": "Mark",
      "inventor_city": "Penfield",
      "inventor_state": "NY",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Das",
      "inventor_name_first": "Madirakshi",
      "inventor_city": "Penfield",
      "inventor_state": "NY",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Manico",
      "inventor_name_first": "Joseph A.",
      "inventor_city": "Rochester",
      "inventor_state": "NY",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Stubler",
      "inventor_name_first": "Peter",
      "inventor_city": "Rochester",
      "inventor_state": "NY",
      "inventor_country": "US"
    }
  ],
  "title": "SYSTEM AND METHOD FOR PREDICTIVE CURATION, PRODUCTION INFRASTRUCTURE, AND PERSONAL CONTENT ASSISTANT",
  "decision": "PENDING",
  "_processing_info": {
    "original_size": 138155,
    "optimized_size": 4233,
    "reduction_percent": 96.94
  }
}