{
  "patent_number": "None",
  "application_number": "15610310",
  "date_published": "20180111",
  "date_produced": "20171227",
  "filing_date": "20170531",
  "main_ipcr_label": "G06N308",
  "abstract": "Methods, apparatuses, and embodiments related to a technique for monitoring construction of a structure. In an example, a robot with a sensor, such as a LIDAR device, enters a building and obtains sensor readings of the building. The sensor data is analyzed and components related to the building are identified. The components are mapped to corresponding components of an architect's three dimensional design of the building, and the installation of the components is checked for accuracy. When a discrepancy above a certain threshold is detected, an error is flagged and project managers are notified. Construction progress updates do not give credit for completed construction that includes an error, resulting in improved accuracy progress updates and corresponding improved accuracy for project schedule and cost estimates.",
  "publication_number": "US20180012125A1-20180111",
  "summary": "<SOH> BRIEF DESCRIPTION OF THE DRAWINGS <EOH>FIG. 1 is a system diagram illustrating an environment in which a construction monitoring system may be implemented, consistent with various embodiments. FIG. 2 is a flow diagram illustrating an example process of monitoring progress of a construction project, consistent with various embodiments. FIG. 3 is a flow diagram illustrating an example process of training a neural network, consistent with various embodiments. FIG. 4 is an illustration of a web interface that provides a milestone progress status for several groups of tasks of a construction project, consistent with various embodiments. FIG. 5 is an illustration of an application running on a mobile device that provides historic progress towards a project milestone, consistent with various embodiments. FIG. 6 is an illustration of an application running on a mobile device that enables a user to set an alert, consistent with various embodiments. FIG. 7A is an illustration of an application running on a mobile device that provides an error notification alert, consistent with various embodiments. FIG. 7B is an illustration of an application running on a mobile device that provides a messaging system for reporting errors, consistent with various embodiments. FIG. 8A is an illustration of an application running on a mobile device that enables a user to set alert notification parameters, consistent with various embodiments. FIGS. 8B and 8C are illustrations of an application running on a mobile device that provides an alert when a productivity level falls below a threshold, consistent with various embodiments FIG. 9 is an illustration of an application running on a mobile device that enables a user to upload various project-related files, consistent with various embodiments. FIG. 10 is an illustration of an application running on a mobile device that enables a user to customize project settings, consistent with various embodiments. FIG. 11 is an illustration of an applic...",
  "ipcr_labels": [
    "G06N308",
    "G01S1789",
    "G06F1750",
    "G06Q5008"
  ],
  "inventor_list": [
    {
      "inventor_name_last": "Ladha",
      "inventor_name_first": "Saurabh",
      "inventor_city": "Mountain View",
      "inventor_state": "CA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Singh",
      "inventor_name_first": "Robin",
      "inventor_city": "Mountain View",
      "inventor_state": "CA",
      "inventor_country": "US"
    }
  ],
  "title": "MONITORING CONSTRUCTION OF A STRUCTURE",
  "decision": "PENDING",
  "_processing_info": {
    "original_size": 81354,
    "optimized_size": 3544,
    "reduction_percent": 95.64
  }
}