{
  "patent_number": "None",
  "application_number": "15617317",
  "date_published": "20180510",
  "date_produced": "20180425",
  "filing_date": "20170608",
  "main_ipcr_label": "G06N504",
  "abstract": "A shelf life inference system comprising a container for a plurality of items. The container has coupled to it a tracker operative to read the ID label on each item and to track the exit from and the return to the container of each item separately and to calculate the freshness status of each item upon return to the container.",
  "publication_number": "US20180129948A1-20180510",
  "summary": "<SOH> BRIEF DESCRIPTION OF THE DRAWINGS <EOH>The accompanying drawings, which are incorporated in and constitute part of this specification, illustrate embodiments of the invention and together with the description, serve to explain the principles of the invention. The embodiments illustrated herein are presently preferred, it being understood, however, that the invention is not limited to the precise arrangements and instrumentalities shown. FIG. 1 is a pictorial illustration of a system and methodology for monitoring the shelf life of multiple vaccine vials in a container and for inferring shelf life of the vaccine for the time period a vaccine vial is away from the container. Inference of shelf life while the vaccine is away is calculated by software in an RFID reader. FIG. 2 is a pictorial illustration of a cosmetics case comprising an inner liner designed for cosmetics wherein the identity of the item is correlated to the size and shape of a cutout or marker in the inner liner. FIG. 3 is a pictorial illustration of a system and methodology for monitoring the shelf life of fruits and vegetable packaged for and sold in a farmers market. Shelf life monitoring for different varieties of vegetables and fruits is done from pack to sale using shelf life monitoring inner liners or long tags placed below the produce and a cell phone running shelf life monitoring and inference software. A software application for a cell phone supports inference calculation by the consumer at the time of consumption. FIG. 4 is a pictorial illustration of a temperature controlled mobile transport container for bio-pharmaceuticals and other temperature sensitive products, wherein shelf life monitoring of the products inside the container is done by zone locations within the container and wherein the shelf life monitoring devices are long tags comprising antenna, power and display modules attached to the outside of the container and sensor modules for monitoring zone locations inside the con...",
  "ipcr_labels": [
    "G06N504",
    "G06N9900",
    "G06Q1008"
  ],
  "inventor_list": [
    {
      "inventor_name_last": "Kaye",
      "inventor_name_first": "Stanton",
      "inventor_city": "Oxnard",
      "inventor_state": "CA",
      "inventor_country": "US"
    }
  ],
  "title": "INFERENCE ELECTRONIC SHELF LIFE DATING SYSTEM FOR PERISHABLES",
  "decision": "PENDING",
  "_processing_info": {
    "original_size": 39840,
    "optimized_size": 2898,
    "reduction_percent": 92.73
  }
}