{
  "patent_number": "None",
  "application_number": "15620689",
  "date_published": "20170928",
  "date_produced": "20170915",
  "filing_date": "20170612",
  "main_ipcr_label": "G06N502",
  "abstract": "A system and method for providing document classification suggestions is provided. Clusters of uncoded documents are obtained. One or more of the uncoded documents in one such cluster are compared to a set of reference documents. Each reference document is assigned with a classification code. Those reference documents that are similar to the one or more uncoded documents are identified. Different types of the classification codes for at least a portion of the similar reference documents are identified and a count of the classification codes assigned to the portion of similar reference documents for each classification code type is obtained. A suggestion for classification of at least one of the one or more uncoded documents is provided based on the count of classification codes for each classification type and one of a presence and absence of each classification code type.",
  "publication_number": "US20170277998A1-20170928",
  "summary": "<SOH> SUMMARY <EOH>Document review efficiency can be increased by identifying relationships between reference ESI and uncoded ESI and providing a suggestion for classification based on the relationships. A set of clusters including uncoded ESI is obtained. The uncoded ESI for a cluster are compared to a set of reference ESI. Those reference ESI most similar to the uncoded ESI are identified and inserted into the cluster. The relationship between the inserted reference ESI and uncoded ESI for the cluster are visually depicted and provide a suggestion regarding classification of the uncoded ESI. An embodiment provides a system and method for providing document classification suggestions. Clusters of uncoded documents are obtained. One or more of the uncoded documents in one such cluster are compared to a set of reference documents. Each reference document is assigned with a classification code. Those reference documents that are similar to the one or more uncoded documents are identified. Different types of the classification codes for at least a portion of the similar reference documents are identified and a count of the classification codes assigned to the portion of similar reference documents for each classification code type is obtained. A suggestion for classification of at least one of the one or more uncoded documents is provided based on the count of classification codes for each classification type and one of a presence and absence of each classification code type. Still other embodiments of the present invention will become readily apparent to those skilled in the art from the following detailed description, wherein are described embodiments by way of illustrating the best mode contemplated for carrying out the invention. As will be realized, the invention is capable of other and different embodiments and its several details are capable of modifications in various obvious respects, all without departing from the spirit and the scope of the present invention...",
  "ipcr_labels": [
    "G06N502",
    "G06N9900",
    "G06N504",
    "G06F1730",
    "G06N700"
  ],
  "inventor_list": [
    {
      "inventor_name_last": "Knight",
      "inventor_name_first": "William C.",
      "inventor_city": "Bainbridge Island",
      "inventor_state": "WA",
      "inventor_country": "US"
    }
  ],
  "title": "System And Method For Providing Document Classification Suggestions",
  "decision": "PENDING",
  "_processing_info": {
    "original_size": 70828,
    "optimized_size": 3499,
    "reduction_percent": 95.06
  }
}