{
  "patent_number": "None",
  "application_number": "15624100",
  "date_published": "20171221",
  "date_produced": "20171207",
  "filing_date": "20170615",
  "main_ipcr_label": "G06N308",
  "abstract": "Social media networks have become a primary source for news and opinions on topics ranging from sports to politics. Sentiment analysis is typically constrained to two classes—positive and negative. A computing system is herein described for building a multi-sentiment multi-label model for electronic data that uses emojis as class labels. The electronic messages are classified into six sentiment classes. The computing system collects and creates a large corpus of clean and processed training data with emoji-based sentiment classes using little-to-no manual intervention. A threshold-based formulation is used to assign one or two class labels (multi-label) to an electronic message. The multi-sentiment multi-label model produces a desirable cross validation accuracy.",
  "publication_number": "US20170364797A1-20171221",
  "summary": "<SOH> BRIEF DESCRIPTION OF THE DRAWINGS <EOH>Embodiments will now be described by way of example only with reference to the appended drawings wherein: FIG. 1 is an example embodiment of a system diagram showing electronic data including emojis being transmitted. FIG. 2 is an example embodiment of a system diagram showing a detailed view a computing system for analyzing the electronic data having emojis. FIG. 3 is a graph showing example data results of different types of emojis in experimental data. FIG. 4 is a graph showing example data results of accuracy based on experimental data. FIG. 5 is an example of computer executable or processor implemented instructions for determining sentiment of a message based on emojis. detailed-description description=\"Detailed Description\" end=\"lead\"?",
  "ipcr_labels": [
    "G06N308",
    "G06Q5000"
  ],
  "inventor_list": [
    {
      "inventor_name_last": "PAL",
      "inventor_name_first": "Koushik",
      "inventor_city": "Etobicoke",
      "inventor_state": "",
      "inventor_country": "CA"
    },
    {
      "inventor_name_last": "PADMANABHAN",
      "inventor_name_first": "Kanchana",
      "inventor_city": "Toronto",
      "inventor_state": "",
      "inventor_country": "CA"
    },
    {
      "inventor_name_last": "MAYANK",
      "inventor_name_first": "Dhruv",
      "inventor_city": "Toronto",
      "inventor_state": "",
      "inventor_country": "CA"
    }
  ],
  "title": "Computing Systems and Methods for Determining Sentiment Using Emojis in Electronic Data",
  "decision": "PENDING",
  "_processing_info": {
    "original_size": 49121,
    "optimized_size": 2452,
    "reduction_percent": 95.01
  }
}