{
  "patent_number": "None",
  "application_number": "15622285",
  "date_published": "20171228",
  "date_produced": "20171213",
  "filing_date": "20170614",
  "main_ipcr_label": "G06N9900",
  "abstract": "Techniques are described for routing service requests in a computer-implemented service environment. A received service request may be initially analyzed to determine a priority of the request. In some implementations, one or more actions may be automatically performed to provide an initial response to the requester. The text of the request may be analyzed to automatically determine a category of the request. In some implementations, a classification engine may determine the category of the request through use of a classification model that has been trained using one or more machine learning (ML) techniques and/or that employs Natural Language Processing (NLP). Based on the category, the request may be routed to agent(s) for handling. Routing may include generating a ticket that includes the request, the category, the priority, and/or other information, and the ticket may be provided to the appropriate agent(s) through a ticketing service.",
  "publication_number": "US20170372231A1-20171228",
  "summary": "<SOH> SUMMARY <EOH>Implementations of the present disclosure are generally directed to routing service requests. More specifically, implementations are directed to routing service requests in a computer-implemented service environment using an engine and/or a model that is trained through machine learning. In general, innovative aspects of the subject matter described in this specification can be embodied in methods that include operations of: receiving a request that indicates an issue to be resolved; determining at least one category of the request by applying a classification model to text data of the request, the classification model developed using at least one machine learning (ML) algorithm; determining at least one agent for resolving the issue, the at least one agent determined based at least partly on the at least one category of the request; and communicating the request to at least one agent. Implementations can optionally include one or more of the following features: the operations further include performing at least one action in response to the request, the at least one action determined by applying at least one rule to the text data of the request; the operations further include determining a priority of the request based at least partly on the text data of the request; the operations further include communicating the priority of the request to the at least one agent; the priority is further based on at least one characteristic of a requestor who submitted the request; the operations further include conditionally performing at least one action in response to the request based at least partly on the priority of the request, the at least one action determined by applying at least one rule to the text data of the request; the request is received as one or more of an email, a text message, or form data; the text data is included in the request; the request is received as audio data; the text data is generated by applying speech-to-text (STT) analysis to...",
  "ipcr_labels": [
    "G06N9900",
    "G06Q1006",
    "G06F1730",
    "G06F1728",
    "G10L1526",
    "G06F1727",
    "G06Q1010"
  ],
  "inventor_list": [
    {
      "inventor_name_last": "Ghatage",
      "inventor_name_first": "Prakash",
      "inventor_city": "Bangalore",
      "inventor_state": "",
      "inventor_country": "IN"
    },
    {
      "inventor_name_last": "Shivaram",
      "inventor_name_first": "Madhura",
      "inventor_city": "Bangalore",
      "inventor_state": "",
      "inventor_country": "IN"
    },
    {
      "inventor_name_last": "Mody",
      "inventor_name_first": "Kaushal",
      "inventor_city": "Mumbai",
      "inventor_state": "",
      "inventor_country": "IN"
    },
    {
      "inventor_name_last": "Sampat",
      "inventor_name_first": "Nirav",
      "inventor_city": "Mumbai",
      "inventor_state": "",
      "inventor_country": "IN"
    },
    {
      "inventor_name_last": "Kottha",
      "inventor_name_first": "Samatha",
      "inventor_city": "Bangalore",
      "inventor_state": "",
      "inventor_country": "IN"
    },
    {
      "inventor_name_last": "Sawarkar",
      "inventor_name_first": "Sumeet",
      "inventor_city": "Thane West",
      "inventor_state": "",
      "inventor_country": "IN"
    },
    {
      "inventor_name_last": "Jadhav",
      "inventor_name_first": "Suraj",
      "inventor_city": "Navi Mumbai",
      "inventor_state": "",
      "inventor_country": "IN"
    },
    {
      "inventor_name_last": "Sudhan H V",
      "inventor_name_first": "Madhu",
      "inventor_city": "Mysore",
      "inventor_state": "",
      "inventor_country": "IN"
    },
    {
      "inventor_name_last": "Kumar",
      "inventor_name_first": "Nagendra B.",
      "inventor_city": "Bangalore",
      "inventor_state": "",
      "inventor_country": "IN"
    }
  ],
  "title": "LEARNING BASED ROUTING OF SERVICE REQUESTS",
  "decision": "PENDING",
  "_processing_info": {
    "original_size": 75355,
    "optimized_size": 4722,
    "reduction_percent": 93.73
  }
}