{
  "patent_number": "None",
  "application_number": "15627938",
  "date_published": "20180208",
  "date_produced": "20180124",
  "filing_date": "20170620",
  "main_ipcr_label": "G06N9900",
  "abstract": "Among other things, data is received representing a case for which an output premise is to be generated. The received data is processed to generate the output premise for the case. The processing includes both analytical processing and statistical processing. The analytical processing in the statistical processing are managed so that the output premise depends on results of the analytical processing that have been affected by the statistical processing, or on results of the statistical processing that have been affected by the analytical processing, or on both.",
  "publication_number": "US20180039912A1-20180208",
  "summary": "<SOH> SUMMARY <EOH>In general, in an aspect, data is received representing a case for which an output premise is to be generated. The received data is processed to generate the output premise for the case. The processing includes both analytical processing and statistical processing. The analytical processing and the statistical processing are managed so that the output premise depends on results of the analytical processing that have been affected by the statistical processing, or on results of the statistical processing that have been affected by the analytical processing, or on both. Implementations may include one or a combination of two or more of the following features. The analytical processing and statistical processing are managed by applying a cooperation logic to results of the analytical processing and results of the statistical processing. The cooperation logic includes treating results of the analytical processing and the statistical processing as votes in a majority voting process. The cooperation logic includes treating results of the analytical processing and the statistical processing in an order of priority determined by a user. The cooperation logic includes treating results of the analytical processing and the statistical processing in accordance with a choice made by a user. The cooperation logic includes treating results of the analytical processing and the statistical processing based on confidence levels. The confidence levels are associated with ranges of the received data that are suitable for the analytical processing or the statistical processing or both. The analytical processing and the statistical processing include respective processing perspectives, and the managing of the analytical processing and the statistical processing is based on the respective processing perspectives. At least one of the respective processing perspectives includes a conservative approach to the case. At least one of the respective processing perspectives inc...",
  "ipcr_labels": [
    "G06N9900",
    "G06N502"
  ],
  "inventor_list": [
    {
      "inventor_name_last": "Baker, IV",
      "inventor_name_first": "Charles F.",
      "inventor_city": "Brookline",
      "inventor_state": "MA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Katz",
      "inventor_name_first": "Benjamin Louis Anthony",
      "inventor_city": "North Cambridge",
      "inventor_state": "MA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Liu",
      "inventor_name_first": "Tsehsin Jason",
      "inventor_city": "Wellesley",
      "inventor_state": "MA",
      "inventor_country": "US"
    }
  ],
  "title": "Premise Generation Based on Both Analytical Processes and Statistical Processes",
  "decision": "PENDING",
  "_processing_info": {
    "original_size": 69781,
    "optimized_size": 3473,
    "reduction_percent": 95.02
  }
}