{
  "patent_number": "None",
  "application_number": "15627220",
  "date_published": "20180503",
  "date_produced": "20180418",
  "filing_date": "20170619",
  "main_ipcr_label": "G06N308",
  "abstract": "Embodiments of the present disclosure disclose a method and a device for classifying questions based on artificial intelligence. The method includes: acquiring text content of a question input by a user, and performing a word segmentation process on the text content to obtain a plurality of segmentations; acquiring hidden representation vectors of the plurality of segmentations; generating a first vector of the text content according to the hidden representation vectors; and determining a target responder corresponding to the question according to the first vector and a preset classification model, and appointing the target responder to the user. The method may simplify operation steps, reduce interactions between a user and a service center, and improve efficiency of the service center.",
  "publication_number": "US20180121801A1-20180503",
  "summary": "<SOH> SUMMARY <EOH>Embodiments of the present disclosure provide a method for classifying questions based on artificial intelligence. The method includes: acquiring text content of a question input by a user, and performing a word segmentation process on the text content to obtain a plurality of segmentations; acquiring hidden representation vectors of the plurality of segmentations; generating a first vector of the text content according to the hidden representation vectors; and determining a target responder corresponding to the question according to the first vector and a preset classification model, and appointing the target responder to the user. Embodiments of the present disclosure provide a device for classifying questions based on artificial intelligence. The device includes a processor; a memory, configured to store instructions executable by the processor; in which the processor is configured to: acquire text content of a question input by a user; perform a word segmentation process on the text content to obtain a plurality of segmentations; acquire hidden representation vectors of the plurality of segmentations; generate a first vector of the text content according to the hidden representation vectors; determine a target responder corresponding to the question according to the first vector and a preset classification model; and appoint the target responder to the user. Embodiments of the present disclosure provide a non-transitory computer readable storage medium. When instructions stored in the storage medium is executed by a processor of an electronic device, a method for classifying questions based on artificial intelligence may be executed by the electronic device. The method includes: acquiring text content of a question input by a user, and performing a word segmentation process on the text content to obtain a plurality of segmentations; acquiring hidden representation vectors of the plurality of segmentations; generating a first vector of the text...",
  "ipcr_labels": [
    "G06N308",
    "G06N300",
    "G10L1504",
    "G10L1502"
  ],
  "inventor_list": [
    {
      "inventor_name_last": "ZHANG",
      "inventor_name_first": "Jun",
      "inventor_city": "Beijing",
      "inventor_state": "",
      "inventor_country": "CN"
    }
  ],
  "title": "METHOD AND DEVICE FOR CLASSIFYING QUESTIONS BASED ON ARTIFICIAL INTELLIGENCE",
  "decision": "PENDING",
  "_processing_info": {
    "original_size": 45259,
    "optimized_size": 3390,
    "reduction_percent": 92.51
  }
}