{
  "patent_number": "None",
  "application_number": "15624012",
  "date_published": "20171221",
  "date_produced": "20171207",
  "filing_date": "20170615",
  "main_ipcr_label": "G06N9900",
  "abstract": "A method, computer program product, and computer system for identifying, by a computing device, a plurality of content from at least one source. A first portion of the plurality of content may be categorized in a first feed category based on a first probabilistic model. A second portion of the plurality of content may be categorized in a second feed category based on the first probabilistic model. User feedback may be received to change the categorization of a first content of the first portion of the plurality of content in the first feed category to the second feed category. A second probabilistic model may be generated based upon, at least in part, the user feedback. The categorization of a second content of the first portion of the plurality of content in the first feed category may be reorganized to the second feed category based upon, at least in part, the second probabilistic model.",
  "publication_number": "US20170364830A1-20171221",
  "summary": "<SOH> BRIEF SUMMARY OF DISCLOSURE <EOH>In one example implementation, a method, performed by one or more computing devices, may include but is not limited to identifying, by a computing device, a plurality of content from at least one source. A first portion of the plurality of content may be categorized in a first feed category based on a first probabilistic model. A second portion of the plurality of content may be categorized in a second feed category based on the first probabilistic model. User feedback may be received to change the categorization of a first content of the first portion of the plurality of content in the first feed category to the second feed category. A second probabilistic model may be generated based upon, at least in part, the user feedback. The categorization of a second content of the first portion of the plurality of content in the first feed category may be reorganized based upon, at least in part, the second probabilistic model. One or more of the following example features may be included. The second feed category may be a sub-feed of the first feed category. Reorganizing the categorization of the second content of the first portion of the plurality of content in the first feed category may include removing the second content from the first feed category. The user feedback may be received via a user interface of a second computing device. The user feedback received via the user interface may include a gesture. Receiving the user feedback may include receiving user feedback from a plurality of users. At least one of the first probabilistic model and the second probabilistic model may be generated via machine learning. In another example implementation, a computing system may include one or more processors and one or more memories configured to perform operations that may include but are not limited to identifying a plurality of content from at least one source. A first portion of the plurality of content may be categorized in a first fe...",
  "ipcr_labels": [
    "G06N9900",
    "G06F30488",
    "G06F30482"
  ],
  "inventor_list": [
    {
      "inventor_name_last": "VIGODA",
      "inventor_name_first": "Benjamin W.",
      "inventor_city": "Winchester",
      "inventor_state": "MA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Barr",
      "inventor_name_first": "Matthew C.",
      "inventor_city": "Malden",
      "inventor_state": "MA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Neely",
      "inventor_name_first": "Jacob E.",
      "inventor_city": "Watertown",
      "inventor_state": "MA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Ring",
      "inventor_name_first": "Daniel F.",
      "inventor_city": "San Francisco",
      "inventor_state": "CA",
      "inventor_country": "US"
    }
  ],
  "title": "MACHINE LEARNING FOR AUTOMATED ORGANIZATION SYSTEM AND METHOD",
  "decision": "PENDING",
  "_processing_info": {
    "original_size": 83957,
    "optimized_size": 3932,
    "reduction_percent": 95.32
  }
}