{
  "patent_number": "None",
  "application_number": "15620510",
  "date_published": "20171214",
  "date_produced": "20171129",
  "filing_date": "20170612",
  "main_ipcr_label": "G06N9900",
  "abstract": "Methods and systems for determining past activities of a user and triggering an action accordingly are disclosed. In one aspect, the method is performed on a device and involves determining a set of historical information related to past activities of the user, according to at least one sources of historical data available through the device, determining a timeline of past activities of the user, according to the set of historical information, and triggering an action on the device, according to the timeline of past activities of the user.",
  "publication_number": "US20170357912A1-20171214",
  "summary": "<SOH> SUMMARY <EOH>In numerous situations, having access to a large amount of information related to past activities of a user is highly beneficial for improving the service provided by an automated intelligent device. However, due to very limited availability of information related to past activities of the user, automated intelligent devices are generally constrained to collect and process data related to the current activity of the user only, possibly storing said data in a model and/or in a database. As a consequence, automated intelligent devices suffer from a blank page symptom: when the automated intelligent device is employed for the first time by the user, it cannot provide any useful service since no relevant data are available. Moreover, the artificial intelligence algorithms implemented by automated intelligent devices are affected by a snowball effect: the more it knows, the more it can learn. Consequently, the efficiency of said automated intelligent devices are limited during the early stages of their exploitation by the user. It is therefore desirable to provide means, embeddable in an automated intelligent device, adapted to supply reliable information related to past activities of a user, including from the first time said user starts using said automated intelligent device and onwards, in order to significantly improve the knowledge and the ability to learn of said automated intelligent device. To that end, according to a first aspect, the described technology relates to a method for triggering, on a device, an action according to past activities of a user. The method comprises the following steps: during a first step, determining a set of historical information related to past activities of the user, according to at least one source of historical data available through the device; during a second step, determining a timeline of past activities of the user, according to the set of historical information; during a third step, triggering an action o...",
  "ipcr_labels": [
    "G06N9900",
    "G06Q1010"
  ],
  "inventor_list": [
    {
      "inventor_name_last": "HINDI",
      "inventor_name_first": "Rand",
      "inventor_city": "Paris",
      "inventor_state": "",
      "inventor_country": "FR"
    },
    {
      "inventor_name_last": "DUREAU",
      "inventor_name_first": "Joseph",
      "inventor_city": "Clichy",
      "inventor_state": "",
      "inventor_country": "FR"
    },
    {
      "inventor_name_last": "KERKHOVE",
      "inventor_name_first": "Colas",
      "inventor_city": "Paris",
      "inventor_state": "",
      "inventor_country": "FR"
    }
  ],
  "title": "METHODS AND SYSTEMS FOR DETERMINING PAST ACTIVITIES OF A USER AND TRIGGERING AN ACTION ACCORDINGLY",
  "decision": "PENDING",
  "_processing_info": {
    "original_size": 63946,
    "optimized_size": 3421,
    "reduction_percent": 94.65
  }
}