{
  "patent_number": "None",
  "application_number": "15625578",
  "date_published": "20171221",
  "date_produced": "20171207",
  "filing_date": "20170616",
  "main_ipcr_label": "G06N304",
  "abstract": "Operations of computing devices are managed using one or more deep neural networks (DNNs), which may receive, as DNN inputs, data from sensors, instructions executed by processors, and/or outputs of other DNNs. One or more DNNs, which may be generative, can be applied to the DNN inputs to generate DNN outputs based on relationships between DNN inputs. The DNNs may include DNN parameters learned using one or more computing workloads. The DNN outputs may be, for example, control signals for managing operations of computing devices, predictions for use in generating control signals, warnings indicating an acceptable state is predicted, and/or inputs to one or more neural networks. The signals enhance performance, efficiency, and/or security of one or more of the computing devices. DNNs can be dynamically trained to personalize operations by updating DNN weights or other parameters.",
  "publication_number": "US20170364792A1-20171221",
  "summary": "<SOH> SUMMARY <EOH>In one or more embodiments, a computer-implemented method for managing operations of one or more computing devices having one or more processing units involves receiving, as inputs to a first set of one or more deep neural networks (DNNs), computing environment data, which may be, for example, sensor data corresponding with operation of one or more of the computing devices, processing data corresponding with a set of one or more instructions received at one or more of the processing units for execution by the one or more processing units, and/or DNN data corresponding with DNN outputs generated by one or more DNNs involved in managing operations of the one or more computing devices. One or more DNNs may be applied to the first set of inputs to generate a first set of one or more DNN outputs based on one or more relationships between the received inputs. The one or more DNNs may include DNN parameters learned using one or more computing workloads. The first set of DNN outputs, generated by application of the one or more DNNs, may be provided as one or more signals. The signals may be, for example, control signals for managing one or more operations of one or more of the computing devices, predictions for use in generating control signals for managing one or more operations of the computing devices, the predictions corresponding to a future state of one or more of the computing devices, warnings indicating that a predicted future state of one or more components of the one or more computing devices deviates more than a threshold deviation level from an acceptable state, a second set of one or more inputs to the first set of DNNs and/or to a second set of one or more DNNs involved in managing operations of the one or more computing devices for generation of a second set of one or more DNN outputs, and/or a set of design guidelines for creating a processor to function within specified parameters. The signals provided to the one or more computing device...",
  "ipcr_labels": [
    "G06N304",
    "G06N308",
    "G06N3063"
  ],
  "inventor_list": [
    {
      "inventor_name_last": "Chai",
      "inventor_name_first": "Sek M.",
      "inventor_city": "Princeton",
      "inventor_state": "NJ",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Zhang",
      "inventor_name_first": "David C.",
      "inventor_city": "Belle Mead",
      "inventor_state": "NJ",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Amer",
      "inventor_name_first": "Mohamed R.",
      "inventor_city": "Brooklyn",
      "inventor_state": "NY",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Shields",
      "inventor_name_first": "Timothy J.",
      "inventor_city": "Houston",
      "inventor_state": "TX",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Raghavan",
      "inventor_name_first": "Aswin Nadamuni",
      "inventor_city": "Princeton",
      "inventor_state": "NJ",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Ramamurthy",
      "inventor_name_first": "Bhaskar",
      "inventor_city": "Menlo Park",
      "inventor_state": "CA",
      "inventor_country": "US"
    }
  ],
  "title": "SYSTEMS AND METHODS FOR OPTIMIZING OPERATIONS OF COMPUTING DEVICES USING DEEP NEURAL NETWORKS",
  "decision": "PENDING",
  "_processing_info": {
    "original_size": 107731,
    "optimized_size": 4251,
    "reduction_percent": 96.05
  }
}