{
  "patent_number": "None",
  "application_number": "15627258",
  "date_published": "20180111",
  "date_produced": "20171227",
  "filing_date": "20170619",
  "main_ipcr_label": "G06N9900",
  "abstract": "The present subject matter discloses system 102 and method to enable machine learning based analytics platform. The method may comprise generating a graphical user interface to enable one or more stake holders to generate and manage a model for predictive analysis. The method may further comprise enabling a business user to define the business problem, and generate models to perform predictive analysis. The method may further comprise deploying the model, in distributed environment, over a target platform. The method may further comprise monitoring the model to identify at least one error in the model and re-training the model for performing predictive analysis based on the at least one error, thereby enable machine learning based analytics platform.",
  "publication_number": "US20180012145A1-20180111",
  "summary": "<SOH> SUMMARY <EOH>This summary is provided to introduce aspects related to systems and methods for enabling machine learning based analytics platform are further described below in the detailed description. This summary is not intended to identify essential features of subject matter nor is it intended for use in determining or limiting the scope of the subject matter. In one implementation, a system for enabling machine learning based analytics platform is disclosed. The system comprises a processor and a memory coupled to the processor. The processor may execute a plurality of modules stored in the memory. The plurality of modules may comprise a graphical user interface module and a central data analysis module. The graphical user interface module may enable one or more stake holders to generate and manage a model. In one embodiment, the stakeholders may include a business user, a data scientist, a system engineer, and a system manager. Further the model may be configured to solve a business problem defined by the business user. Further, the central data analysis module may enable a business user module for enabling the business user to define the business problem and a data preparation module for enabling the service manager to configure a data source location based on the business problem, extracting source data from the data source location, and translating the source data based on ontology mapping, define by the system engineer, to generate a translated data. In one embodiment, the translated data may be stored in a distributed storage. Further, the central data analysis module may enable a model creation module for enabling the data scientist and system manager to explore and visualize the translated data, transform and standardize the translated data to generate the model, evaluate and calibrate accuracy of the model, and save the model over metadata storage. Further, the central data analysis module may enable a model deployment module configured to deploy...",
  "ipcr_labels": [
    "G06N9900",
    "G06Q1006",
    "G06N504"
  ],
  "inventor_list": [
    {
      "inventor_name_last": "MAURYA",
      "inventor_name_first": "Arvind Kumar",
      "inventor_city": "Noida",
      "inventor_state": "",
      "inventor_country": "IN"
    },
    {
      "inventor_name_last": "GUPTA",
      "inventor_name_first": "Yogesh",
      "inventor_city": "Noida",
      "inventor_state": "",
      "inventor_country": "IN"
    },
    {
      "inventor_name_last": "JAIN",
      "inventor_name_first": "Parveen",
      "inventor_city": "Noida",
      "inventor_state": "",
      "inventor_country": "IN"
    },
    {
      "inventor_name_last": "DHANYAMRAJU",
      "inventor_name_first": "S U M Prasad",
      "inventor_city": "Hyderabad",
      "inventor_state": "",
      "inventor_country": "IN"
    }
  ],
  "title": "MACHINE LEARNING BASED ANALYTICS PLATFORM",
  "decision": "PENDING",
  "_processing_info": {
    "original_size": 50842,
    "optimized_size": 3751,
    "reduction_percent": 92.62
  }
}