{
  "patent_number": "None",
  "application_number": "15628662",
  "date_published": "20180111",
  "date_produced": "20171227",
  "filing_date": "20170621",
  "main_ipcr_label": "G06N504",
  "abstract": "Method and system for behavior control of AI-based systems comprising at least one processor connected to a clock to measure time and to a memory, wherein said AI-based system is independently operable.",
  "publication_number": "US20180012133A1-20180111",
  "summary": "<SOH> SUMMARY OF THE INVENTION <EOH>The present invention overcomes the deficiencies and limitations discussed in the Background section at least in part by providing innovative systems, devices, programs and methods for behavior control of AI-based systems. Method for behavior control of an AI-based system, comprising at least one processor connected to a clock to measure time and to a memory, wherein said AI-based system is independently operable and is executing over the time at least the sequence of steps: a) sample at least one physically observable of said AI-based system; b) creation of at least one pair of variables dependent from said observables and/or from derivatives of said observables; c) transformation of said at least one pair of variables into a multidimensional phase space; d) creation of exactly one (unidimensional oriented) path within said phase space based on the sequence in time of said pairs of variables; e) detect deviations of said path (which is related to the behavior of said AI-based system); f) in the case of a deviation of the behavior of said AI-based system generate an information about the deviating behavior. By this innovative solution the real measured behavior of any AI-based system is mathematically modeled by means of statistical physics which allow a classification of the development over time of said AI-based system. Thus each deviation of the usual behavior of said AI-based system is detectable, particularly unexpected or unwanted behavior, by an independent supervising authority. These may caused by changes driven by bugs in updates of the AI-based system, or other deviations of the AI-based system over time. Particularly a behavioral authentication of an AI-based system, which might consist of an AI controlling an object with at least one mechanical actor, which might be a robotic arm or a motor to move a movable object, or any other possibility to interact with the mechanical world or more generally with the physically de...",
  "ipcr_labels": [
    "G06N504",
    "G06N9900"
  ],
  "inventor_list": [
    {
      "inventor_name_last": "Steiner",
      "inventor_name_first": "Ralf",
      "inventor_city": "Zeitz",
      "inventor_state": "",
      "inventor_country": "DE"
    },
    {
      "inventor_name_last": "Unbehaun",
      "inventor_name_first": "Elke",
      "inventor_city": "Frankleben",
      "inventor_state": "",
      "inventor_country": "DE"
    }
  ],
  "title": "Method and system for behavior control of AI-based systems.",
  "decision": "PENDING",
  "_processing_info": {
    "original_size": 44983,
    "optimized_size": 2901,
    "reduction_percent": 93.55
  }
}