{
  "patent_number": "None",
  "application_number": "15634572",
  "date_published": "20171228",
  "date_produced": "20171213",
  "filing_date": "20170627",
  "main_ipcr_label": "G06N9900",
  "abstract": "Apparatuses, systems, methods, and computer program products are disclosed for data quality detection and compensation for machine learning. A quality analysis module electronically identifies one or more data quality issues in machine learning training data. A corrective action module modifies training data by performing one or more corrective actions in response to one or more data quality issues. A predictive analytics module creates a machine learning model that includes one or more learned functions based on modified training data.",
  "publication_number": "US20170372232A1-20171228",
  "summary": "<SOH> SUMMARY <EOH>Apparatuses are presented for data quality detection and compensation for machine learning. In one embodiment, a quality analysis module electronically identifies one or more data quality issues in machine learning training data. In a certain embodiment, a corrective action module modifies training data by performing one or more corrective actions in response to one or more data quality issues. In a further embodiment, a predictive analytics module creates a machine learning model that includes one or more learned functions based on modified training data. Computer program products are presented for data quality detection and compensation for machine learning. In various embodiments, a computer program product includes a computer readable storage medium storing computer usable program code executable to perform operations. In one embodiment, operations include electronically identifying one or more data quality issues in machine learning training data. In a certain embodiment, operations include modifying training data by performing one or more corrective actions in response to one or more data quality issues. In a further embodiment, operations include creating a machine learning model including one or more learned functions based on modified training data. Methods are presented for data quality detection and compensation for machine learning. A method, in one embodiment, includes electronically identifying one or more data quality issues in machine learning training data. In a certain embodiment, a method includes modifying training data by performing one or more corrective actions in response to one or more data quality issues. In a further embodiment, a method includes creating a machine learning model including one or more learned functions based on modified training data.",
  "ipcr_labels": [
    "G06N9900",
    "G06N504",
    "G06F30482"
  ],
  "inventor_list": [
    {
      "inventor_name_last": "Maughan",
      "inventor_name_first": "Jason",
      "inventor_city": "Sandy",
      "inventor_state": "UT",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "McFall",
      "inventor_name_first": "Timothy",
      "inventor_city": "North Salt Lake",
      "inventor_state": "UT",
      "inventor_country": "US"
    }
  ],
  "title": "DATA QUALITY DETECTION AND COMPENSATION FOR MACHINE LEARNING",
  "decision": "PENDING",
  "_processing_info": {
    "original_size": 101868,
    "optimized_size": 3091,
    "reduction_percent": 96.97
  }
}