{
  "patent_number": "None",
  "application_number": "15632560",
  "date_published": "20171012",
  "date_produced": "20170927",
  "filing_date": "20170626",
  "main_ipcr_label": "G06N504",
  "abstract": "A system and method for managing location-based information associated with the oil and gas industry. The system, in one embodiment, comprises a computing device connected to a location-based service, wherein the location-based information comprises energy operations data which is associated with a specific geographic location, and wherein the computing device is associated with a graphical map interface. The graphical map interface is configured to display location based information. The graphical map interface can also be configured to display an indication of the frequency of an event. The location based information can be associated with a geofence.",
  "publication_number": "US20170293848A1-20171012",
  "summary": "<SOH> BRIEF DESCRIPTION OF THE DRAWINGS <EOH>The novel features believed characteristic of the invention are set forth in the appended claims. The invention itself, however, as well as a preferred mode of use, further objectives and advantages thereof, will be best understood by reference to the following detailed description of illustrative embodiments when read in conjunction with the accompanying drawings, wherein: FIG. 1 is a schematic of an embodiment of a system according to at least one embodiment wherein the location-based service is outside of the wireless network. FIG. 2 is a schematic of an embodiment of a system according to at least one embodiment wherein said location-based service is within the wireless network. FIG. 3 is a schematic of an embodiment of a system according to at least one embodiment wherein the wireless device is not within the wireless network. FIG. 4 is a schematic of an embodiment of a system according to at least one embodiment wherein the data management component resides within the wireless network but not within the wireless device FIG. 5 is a schematic of an embodiment of a system according to at least one embodiment wherein the location-based service and the data management component are outside of the wireless network. FIG. 6 is a schematic of an embodiment of a system according to at least one embodiment wherein the wireless device is within near proximity of the range of the wireless network. FIG. 7 is a schematic of an embodiment of a system according to at least one embodiment wherein said wireless is outside of the wireless network. FIG. 8 is a schematic of an embodiment of a system according to at least one embodiment wherein said wireless device is within the location-based service and data management component are outside of the wireless network. FIG. 9 is a schematic of an embodiment of a system according to at least one embodiment wherein the data management component is part of the location-based service. FIG. 10 i...",
  "ipcr_labels": [
    "G06N504",
    "G06T1705",
    "G06T1120",
    "E21B4100",
    "G06F1750",
    "H04L2908",
    "H04W402",
    "G06F30481",
    "G06T1160"
  ],
  "inventor_list": [
    {
      "inventor_name_last": "SORDEN",
      "inventor_name_first": "Gary",
      "inventor_city": "Celina",
      "inventor_state": "TX",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "HINSLEY",
      "inventor_name_first": "Michael",
      "inventor_city": "Midland",
      "inventor_state": "TX",
      "inventor_country": "US"
    }
  ],
  "title": "Location-based Services",
  "decision": "PENDING",
  "_processing_info": {
    "original_size": 200533,
    "optimized_size": 3411,
    "reduction_percent": 98.3
  }
}