{
  "patent_number": "None",
  "application_number": "15635302",
  "date_published": "20180104",
  "date_produced": "20171219",
  "filing_date": "20170628",
  "main_ipcr_label": "G06N304",
  "abstract": "An output value of a first neural network for input data is obtained in correspondence with each category. An output value of a second neural network generated by changing a designated unit in the first neural network is obtained for the input data in correspondence with each category. For each category, change information representing a change in the output value is obtained. Information representing contribution of the designated unit are output to a display device based on the change information.",
  "publication_number": "US20180005106A1-20180104",
  "summary": "<SOH> SUMMARY OF THE INVENTION <EOH>The present invention has been made in consideration of the above-described problems, and provides a technique of specifying a feature map or a neuron of a DNN contributing to recognition of evaluation data. According to the first aspect of the present invention, there is provided an information processing apparatus comprising: a first calculation unit configured to obtain an output value of a first neural network for input data in correspondence with each category; a second calculation unit configured to obtain an output value of a second neural network for the input data in correspondence with each category, the second neural network being generated by changing a designated unit in the first neural network; a third calculation unit configured to obtain, for each category, change information representing a change between the output value obtained by the first calculation unit and the output value obtained by the second calculation unit; and an output unit configured to output information representing contribution of the designated unit to a display device based on the change information obtained by the third calculation unit. According to the second aspect of the present invention, there is provided an information processing method performed by an information processing apparatus, comprising: performing a first calculation to obtain an output value of a first neural network for input data in correspondence with each category; performing a second calculation to obtain an output value of a second neural network for the input data in correspondence with each category, the second neural network being generated by changing a designated unit in the first neural network; performing a third calculation to obtain, for each category, change information representing a change between the output value obtained by the first calculation and the output value obtained by the second calculation; and outputting information representing contribution...",
  "ipcr_labels": [
    "G06N304",
    "G06N308"
  ],
  "inventor_list": [
    {
      "inventor_name_last": "Hachiya",
      "inventor_name_first": "Hirotaka",
      "inventor_city": "Wakayama-shi",
      "inventor_state": "",
      "inventor_country": "JP"
    }
  ],
  "title": "INFORMATION PROCESSING APPARATUS, INFORMATION PROCESSING METHOD, AND NON-TRANSITORY COMPUTER-READABLE STORAGE MEDIUM",
  "decision": "PENDING",
  "_processing_info": {
    "original_size": 91882,
    "optimized_size": 3124,
    "reduction_percent": 96.6
  }
}