{
  "patent_number": "None",
  "application_number": "15639724",
  "date_published": "20180111",
  "date_produced": "20171227",
  "filing_date": "20170630",
  "main_ipcr_label": "G06N502",
  "abstract": "Provided are a method and device for assessing a feasibility of one or more biochemical reactions in an organism. The method includes receiving an input representing the organism and input representing one or more biochemical reactions that are to be assessed; computing a reaction feasibility score for each of the one or more input biochemical reactions a knowledgebase; and selecting the biochemical reaction that is likely to occur in the organism.",
  "publication_number": "US20180012129A1-20180111",
  "summary": "<SOH> SUMMARY <EOH>Provided are methods and devices for assessing a feasibility of a biochemical reaction in an organism. Additional aspects will be set forth in part in the description which follows and, in part, will be apparent from the description, or may be learned by practice of the presented embodiments. According to an aspect of an embodiment, a method of assessing a feasibility of one or more input biochemical reactions in an organism includes: receiving an input representing the organism and input representing one or more biochemical reactions that are to be assessed; computing a reaction feasibility score for each of the one or more input biochemical reactions a knowledge base; and selecting the biochemical reaction that is to occur in the organism, based on the computed reaction feasibility score. The method may also include sorting the one or more input biochemical reactions, based on the computed reaction feasibility score. According to an aspect of another embodiment, a non-transitory computer-readable recording medium has recorded thereon a computer program for executing the method of assessing a feasibility of a biochemical reaction in an organism. According to an aspect of another embodiment, a device for assessing a feasibility of one or more input biochemical reactions in an organism includes: a processor configured to receive an input representing the organism and input representing one or more biochemical reactions that are to be assessed, compute a reaction feasibility score for each of the one or more input biochemical reactions, based on a knowledge base, sort the one or more biochemical reactions that are input, based on the computed reaction feasibility score, and select the biochemical reaction that is to occur in the organism, based on the computed reaction feasibility score; and a memory connected to the processor.",
  "ipcr_labels": [
    "G06N502"
  ],
  "inventor_list": [
    {
      "inventor_name_last": "BHADURI",
      "inventor_name_first": "Anirban",
      "inventor_city": "Bangalore",
      "inventor_state": "",
      "inventor_country": "IN"
    },
    {
      "inventor_name_last": "SIVA KUMAR",
      "inventor_name_first": "Tadi Venkata",
      "inventor_city": "Bangalore",
      "inventor_state": "",
      "inventor_country": "IN"
    },
    {
      "inventor_name_last": "KIM",
      "inventor_name_first": "Taeyong",
      "inventor_city": "Daejeon",
      "inventor_state": "",
      "inventor_country": "KR"
    }
  ],
  "title": "METHOD AND DEVICE FOR ASSESSING FEASIBILITY OF BIOCHEMICAL REACTION IN ORGANISM",
  "decision": "PENDING",
  "_processing_info": {
    "original_size": 37874,
    "optimized_size": 3189,
    "reduction_percent": 91.58
  }
}