{
  "patent_number": "None",
  "application_number": "15632109",
  "date_published": "20171012",
  "date_produced": "20170927",
  "filing_date": "20170623",
  "main_ipcr_label": "G06N9900",
  "abstract": "A fusion outcome quasiparticle may be trapped in a potential well of a topological segment. The fusion outcome quasiparticle may be the product of fusion of a first quasiparticle and a second quasiparticle, where the first and the second quasiparticles are localized at ends of a topological segment. The potential well having the fusion outcome quasiparticle trapped therein and a third quasiparticle may be moved relative to each other such that the potential well and the third quasiparticle are brought toward each other. The quasiparticles may be Majorana modes of a nanowire",
  "publication_number": "US20170293854A1-20171012",
  "summary": "<SOH> BRIEF DESCRIPTION OF THE DRAWINGS <EOH>The detailed description is described with reference to the accompanying figures. In the figures, the left-most digit(s) of a reference number identifies the figure in which the reference number first appears. The same reference numbers in different figures indicate similar or identical items. FIG. 1 is a schematic diagram of an illustrative qubit encoded with four quasiparticles. FIG. 2 is a schematic diagram of an illustrative fusion tree of a |0) basis state. FIG. 3 is a schematic diagram of an illustrative fusion tree of a |1) basis state. FIG. 4 is a schematic diagram of an illustrative topological system. FIG. 5 is an illustrative fusion tree diagram representing a qubit fusion. FIG. 6 shows illustrative diagrammetric rules (fusion “F-moves”) for quasiparticles. FIG. 7 is a flow diagram of an illustrative topological fusion process showing wire segments (in topological and non-topological phases) with their corresponding chemical potential profiles. FIG. 8 is a schematic representation of illustrative topological segments of nanowire in the context of Majorana operators. FIGS. 9A-9E are schematic illustrations of an exemplary phase gate. detailed-description description=\"Detailed Description\" end=\"lead\"?",
  "ipcr_labels": [
    "G06N9900",
    "H01L3922"
  ],
  "inventor_list": [
    {
      "inventor_name_last": "Freedman",
      "inventor_name_first": "Michael H.",
      "inventor_city": "Santa Barbara",
      "inventor_state": "CA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Wang",
      "inventor_name_first": "Zhenghan",
      "inventor_city": "Goleta",
      "inventor_state": "CA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Lutchyn",
      "inventor_name_first": "Roman M.",
      "inventor_city": "Santa Barbara",
      "inventor_state": "CA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Nayak",
      "inventor_name_first": "Chetan",
      "inventor_city": "Santa Monica",
      "inventor_state": "CA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Bonderson",
      "inventor_name_first": "Parsa",
      "inventor_city": "Santa Barbara",
      "inventor_state": "CA",
      "inventor_country": "US"
    }
  ],
  "title": "TOPOLOGICAL QUBIT FUSION",
  "decision": "PENDING",
  "_processing_info": {
    "original_size": 33714,
    "optimized_size": 3002,
    "reduction_percent": 91.1
  }
}