{
  "patent_number": "None",
  "application_number": "15630806",
  "date_published": "20180104",
  "date_produced": "20171219",
  "filing_date": "20170622",
  "main_ipcr_label": "G06N9900",
  "abstract": "A method, system, and computer program product identifies attribution of small signal stimulus in noisy response channels. Using machine-learning techniques in a computer, a small signal correlation engine correlates time series stimuli data vectors to time series response data vectors, and generates correlation coefficients that identify contributions of event notifications, including small signal attributes, to aggregated response data. Also using machine-learning techniques in a computer, a learning model simulates variations of stimuli data to predict user responses using the correlation coefficients, including computing a contribution of the small signal attributes of an event notification.",
  "publication_number": "US20180005140A1-20180104",
  "summary": "<SOH> BRIEF DESCRIPTION OF THE DRAWINGS <EOH>FIG. 1 depicts a partitioning for a system that implements techniques for identifying small signal media stimulus correlations in noisy media response channels, according to an embodiment. FIG. 2A is a portfolio schematic showing multiple media stimulus channels and response channels in environments for implementing techniques for identifying small signal media stimulus correlations in noisy media response channels, according to some embodiments. FIG. 2B is a correlation chart showing time-based and value-based correlation techniques used identify small signal media stimulus correlations in noisy media response channels, according to some embodiments. FIG. 3A presents a diagram illustrating stimulus signals and response signals for a TV media campaign. FIG. 3B presents a schematic of a signal and data flow for implementing techniques for identifying small signal media stimulus correlations in noisy media response channels FIG. 4 depicts a subsystem used to identify small signal media stimulus correlations in noisy media response channels, according to some embodiments. FIG. 5 is a flow chart showing steps used to identify small signal media stimulus correlations in noisy media response channels, according to some embodiments. FIG. 6 depicts an environment in which embodiments of the present disclosure may operate. FIG. 7 depicts an environment in which embodiments of the present disclosure may operate. FIG. 8 is a portfolio schematic showing multiple media stimulus channels and response channels in environments for implementing techniques for identifying small signal media stimulus correlations in noisy media response channels, according to some embodiments. FIG. 9 is a diagram depicting data structures used in systems for identifying small signal media stimulus correlations in noisy media response channels, according to some embodiments. FIG. 10 is a TV station attribution chart produced by systems that identify small si...",
  "ipcr_labels": [
    "G06N9900",
    "G06Q3002",
    "G06N700"
  ],
  "inventor_list": [
    {
      "inventor_name_last": "Chittilappilly",
      "inventor_name_first": "Anto",
      "inventor_city": "Waltham",
      "inventor_state": "MA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Sadegh",
      "inventor_name_first": "Payman",
      "inventor_city": "Alpharetta",
      "inventor_state": "GA",
      "inventor_country": "US"
    }
  ],
  "title": "MACHINE LEARNING TECHNIQUES THAT IDENTIFY ATTRIBUTION OF SMALL SIGNAL STIMULUS IN NOISY RESPONSE CHANNELS",
  "decision": "PENDING",
  "_processing_info": {
    "original_size": 97295,
    "optimized_size": 3475,
    "reduction_percent": 96.43
  }
}