{
  "patent_number": "None",
  "application_number": "15636802",
  "date_published": "20180125",
  "date_produced": "20180109",
  "filing_date": "20170629",
  "main_ipcr_label": "G06N504",
  "abstract": "A system for providing fuel location recommendations can include a vehicle data receiver configured to receive vehicle data from a vehicle computer, navigational system, and/or a vehicle operator, a fuel characteristic module configured to receive fuel properties of one or more fuel batches from a fuel property database, and a recommendation module configured to determine one or more recommended locations for refueling the vehicle based on received vehicle data from the vehicle data receiver and received fuel properties from the fuel property database.",
  "publication_number": "US20180025278A1-20180125",
  "summary": "<SOH> SUMMARY <EOH>In accordance with at least one aspect of this disclosure, a system for providing fuel location recommendations can include a vehicle data receiver configured to receive vehicle data from a vehicle computer, navigational system, and/or a vehicle operator, a fuel characteristic module configured to receive fuel properties of one or more fuel batches from a fuel property database, and a recommendation module configured to determine one or more recommended locations for refueling the vehicle based on received vehicle data from the vehicle data receiver and received fuel properties from the fuel property database. The vehicle data can include at least one of fuel tank volume, fuel level, vehicle speed, vehicle load, fuel consumption rate, range, odometer reading, engine performance, vehicle performance history, one or more ambient conditions, vehicle make, vehicle model, specific drivetrain information, performance related vehicle modifications, an operator profile, location, or destination. Any other suitable vehicle data is contemplated herein. The vehicle data receiver can be configured to be connected to a data port of the vehicle. In certain embodiments, the vehicle data receiver and/or any other component of the system can be integrated into the vehicle by the manufacturer, for example. The vehicle data receiver can include a memory and a processor configured to execute computer readable instructions on stored on the memory. The fuel characteristic module and the recommendation module can be embodied as software modules in the form of computer readable instructions stored on the memory of the vehicle data receiver and configured to be executed by the processor. The vehicle data receiver can be operatively connected to the navigational system to output a recommended fueling location to the navigational system to display the recommended fueling location to the vehicle operator. In certain embodiments, the vehicle data receiver can be configured to...",
  "ipcr_labels": [
    "G06N504",
    "G07C508",
    "G01C2136"
  ],
  "inventor_list": [
    {
      "inventor_name_last": "Lilik",
      "inventor_name_first": "Gregory K.",
      "inventor_city": "Media",
      "inventor_state": "PA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Noorman",
      "inventor_name_first": "Mike T.",
      "inventor_city": "Cinnaminson",
      "inventor_state": "NJ",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Koenig",
      "inventor_name_first": "Leonard R.",
      "inventor_city": "Jobstown",
      "inventor_state": "NJ",
      "inventor_country": "US"
    }
  ],
  "title": "SYSTEM AND METHOD FOR FUELING LOCATION RECOMMENDATIONS",
  "decision": "PENDING",
  "_processing_info": {
    "original_size": 64337,
    "optimized_size": 3424,
    "reduction_percent": 94.68
  }
}