{
  "patent_number": "None",
  "application_number": "15633931",
  "date_published": "20180111",
  "date_produced": "20171227",
  "filing_date": "20170627",
  "main_ipcr_label": "G06N304",
  "abstract": "According to a first aspect of the present disclosure, a method for facilitating the detection of one or more time series patterns is conceived, comprising building one or more artificial neural networks, wherein, for at least one time series pattern to be detected, a specific one of said artificial neural networks is built. According to a second aspect of the present disclosure, a corresponding computer program is provided. According to a third aspect of the present disclosure, a non-transitory computer-readable medium is provided that comprises a computer program of the kind set forth. According to a fourth aspect of the present disclosure, a corresponding system for facilitating the detection of one or more time series patterns is provided.",
  "publication_number": "US20180012120A1-20180111",
  "summary": "<SOH> SUMMARY <EOH>According to a first aspect of the present disclosure, a method for facilitating the detection of one or more time series patterns is conceived, comprising building one or more artificial neural networks, wherein, for at least one time series pattern to be detected, a specific one of said artificial neural networks is built. In one or more embodiments of the method, building said artificial neural networks comprises employing neuroevolution of augmenting topologies. In one or more embodiments of the method, the artificial neural networks are stored for subsequent use in a detection task. In one or more embodiments of the method, each time series pattern to be detected represents a class of said detection task. In one or more embodiments of the method, said time series patterns are audio patterns. In one or more embodiments, a raw time series signal is provided as an input to each artificial neural network that is built. In one or more embodiments of the method, the audio patterns include at least one of the group of: voiced speech, unvoiced speech, user-specific speech, contextual sound, a sound event. In one or more embodiments of the method, the detection of the time series patterns forms part of a speaker authentication function. In one or more embodiments, for each speaker to be authenticated, at least one artificial neural network is built for detecting speech segments of said speaker. In one or more embodiments of the method, for each speaker to be authenticated, an artificial neural network is built for detecting voiced speech segments of said speaker, and another artificial neural network is built for detecting unvoiced speech segments of said speaker. According to a second aspect of the present disclosure, a computer program is provided, comprising instructions which, when executed, carry out or control a method of the kind set forth. According to a third aspect of the present disclosure, a non-transitory computer-readable medium is provi...",
  "ipcr_labels": [
    "G06N304",
    "G10L1702",
    "G10L1718",
    "G10L1722"
  ],
  "inventor_list": [
    {
      "inventor_name_last": "Daniel",
      "inventor_name_first": "Adrien",
      "inventor_city": "Antibes",
      "inventor_state": "",
      "inventor_country": "FR"
    }
  ],
  "title": "Method and System for Facilitating the Detection of Time Series Patterns",
  "decision": "PENDING",
  "_processing_info": {
    "original_size": 34610,
    "optimized_size": 3346,
    "reduction_percent": 90.33
  }
}