{
  "patent_number": "None",
  "application_number": "15639705",
  "date_published": "20180412",
  "date_produced": "20180328",
  "filing_date": "20170630",
  "main_ipcr_label": "G06N308",
  "abstract": "Techniques for iterative query-based analysis of text are described. According to various implementations, a neural network architecture is implemented receives a query for information about text content, and iteratively analyzes the content using the query. During the analysis a state of the query evolves until it reaches a termination state, at which point the state of the query is output as an answer to the initial query.",
  "publication_number": "US20180101767A1-20180412",
  "summary": "<SOH> SUMMARY <EOH>This Summary is provided to introduce a selection of concepts in a simplified form that are further described below in the Detailed Description. This Summary is not intended to identify key features or essential features of the claimed subject matter, nor is it intended to be used as an aid in determining the scope of the claimed subject matter. Techniques for iterative query-based analysis of text are described. According to various implementations, a neural network architecture is implemented receives a query for information about text content, and iteratively analyzes the content using the query. During the analysis a state of the query evolves until it reaches a termination state, at which point the state of the query is output as an answer to the initial query.",
  "ipcr_labels": [
    "G06N308",
    "G06F1730"
  ],
  "inventor_list": [
    {
      "inventor_name_last": "Huang",
      "inventor_name_first": "Po-Sen",
      "inventor_city": "Bellevue",
      "inventor_state": "WA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Gao",
      "inventor_name_first": "Jianfeng",
      "inventor_city": "Woodinville",
      "inventor_state": "WA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Chen",
      "inventor_name_first": "Weizhu",
      "inventor_city": "Kirkland",
      "inventor_state": "WA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Shen",
      "inventor_name_first": "Yelong",
      "inventor_city": "Bothell",
      "inventor_state": "WA",
      "inventor_country": "US"
    }
  ],
  "title": "Iterative Query-based Analysis of Text",
  "decision": "PENDING",
  "_processing_info": {
    "original_size": 54103,
    "optimized_size": 2192,
    "reduction_percent": 95.95
  }
}