{
  "patent_number": "None",
  "application_number": "15633603",
  "date_published": "20171026",
  "date_produced": "20171011",
  "filing_date": "20170626",
  "main_ipcr_label": "G06N9900",
  "abstract": "Computer-implemented systems and methods are disclosed for data driven expertise mapping. The systems and methods provide for obtaining data sets from data sources, wherein the data sets include services related data, analyzing the data sets, wherein the analysis generates information representative of the services related data, and generating training sets related to the data sets, wherein the training sets are based on known values. The systems and methods further provide for generating models, wherein the models are based on determining services provided by service providers using a combination of the services related data, the analysis of the data sets and the training sets, and provide a mapping of at least one service to service providers. The systems and methods additionally include evaluating the models based on known values and storing an indication for providing to a graphical user interface based on more models.",
  "publication_number": "US20170308814A1-20171026",
  "summary": "<SOH> BRIEF DESCRIPTION OF THE DRAWINGS <EOH>Reference will now be made to the accompanying drawings showing example embodiments of this disclosure. In the drawings: FIG. 1 is a block diagram of an exemplary computing device, consistent with embodiments of the present disclosure. FIG. 2 is a block diagram of an exemplary system for data driven expertise mapping, consistent with embodiments of the present disclosure. FIG. 3 is an exemplary data structure consistent with embodiments of the present disclosure. FIG. 4 is an exemplary data structure consistent with embodiments of the present disclosure. FIG. 5 is an exemplary data structure consistent with embodiments of the present disclosure. FIG. 6 is a flowchart of an exemplary method for data driven expertise mapping, consistent with embodiments of the present disclosure. detailed-description description=\"Detailed Description\" end=\"lead\"?",
  "ipcr_labels": [
    "G06N9900",
    "G06N502"
  ],
  "inventor_list": [
    {
      "inventor_name_last": "Freese",
      "inventor_name_first": "Nathaniel Sayer",
      "inventor_city": "San Francisco",
      "inventor_state": "CA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Pinho",
      "inventor_name_first": "Ricardo Nuno Silva Moura",
      "inventor_city": "San Francisco",
      "inventor_state": "CA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Pancia",
      "inventor_name_first": "Matthew Steven",
      "inventor_city": "San Francisco",
      "inventor_state": "CA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Yamamoto",
      "inventor_name_first": "Seiji James",
      "inventor_city": "San Francisco",
      "inventor_state": "CA",
      "inventor_country": "US"
    }
  ],
  "title": "DATA DRIVEN FEATURIZATION AND MODELING",
  "decision": "PENDING",
  "_processing_info": {
    "original_size": 79377,
    "optimized_size": 2876,
    "reduction_percent": 96.38
  }
}