{
  "patent_number": "None",
  "application_number": "15649489",
  "date_published": "20180125",
  "date_produced": "20180109",
  "filing_date": "20170713",
  "main_ipcr_label": "G06N9900",
  "abstract": "A system disclosed herein includes a hardware processor and a predictive risk model training software code stored in a system memory. The hardware processor executes the software code to receive vital sign data of a population of subjects including positive and negative subjects with respect to a health state, to define data sets for use in training a predictive risk model, to transform the vital sign data to parameters characterizing the vital sign data, and to obtain differential parameters based on those parameters. The hardware processor executes the software code to further generate combinatorial parameters using the parameters and the differential parameters, to analyze the parameters, the differential parameters, and the combinatorial parameters to identify a reduced set of parameters correlated with the health state, to identify a predictive set of parameters enabling prediction of the health state for a living subject, and to compute predictive risk model coefficients.",
  "publication_number": "US20180025290A1-20180125",
  "summary": "<SOH> SUMMARY <EOH>There are provided systems and methods for predictive risk model optimization, substantially as shown in and/or described in connection with at least one of the figures, and as set forth more completely in the claims.",
  "ipcr_labels": [
    "G06N9900",
    "G06N504"
  ],
  "inventor_list": [
    {
      "inventor_name_last": "Al Hatib",
      "inventor_name_first": "Feras",
      "inventor_city": "Irvine",
      "inventor_state": "CA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Jian",
      "inventor_name_first": "Zhongping",
      "inventor_city": "Irvine",
      "inventor_state": "CA",
      "inventor_country": "US"
    }
  ],
  "title": "PREDICTIVE RISK MODEL OPTIMIZATION",
  "decision": "PENDING",
  "_processing_info": {
    "original_size": 57373,
    "optimized_size": 1904,
    "reduction_percent": 96.68
  }
}