{
  "patent_number": "None",
  "application_number": "15647279",
  "date_published": "20180503",
  "date_produced": "20180418",
  "filing_date": "20170712",
  "main_ipcr_label": "G06N300",
  "abstract": "A conversation control system includes a conversation device, an acquisition unit that acquires personality information of a user that is registered in advance, a detection unit that detects biological information of the user, an estimation unit that estimates a mental state of the user from the acquired personality information and the detected biological information, and a changing unit that changes a personality of the conversation device in accordance with the estimated mental state of the user.",
  "publication_number": "US20180121784A1-20180503",
  "summary": "<SOH> SUMMARY <EOH>According to an aspect of the invention, there is provided a conversation control system including a conversation device, an acquisition unit that acquires personality information of a user that is registered in advance, a detection unit that detects biological information of the user, an estimation unit that estimates a mental state of the user from the acquired personality information and the detected biological information, and a changing unit that changes a personality of the conversation device in accordance with the estimated mental state of the user.",
  "ipcr_labels": [
    "G06N300",
    "G09B706",
    "A61B5024",
    "A61B50295",
    "G06N504"
  ],
  "inventor_list": [
    {
      "inventor_name_last": "ICHIBOSHI",
      "inventor_name_first": "Akira",
      "inventor_city": "Kanagawa",
      "inventor_state": "",
      "inventor_country": "JP"
    },
    {
      "inventor_name_last": "THAPLIYA",
      "inventor_name_first": "Roshan",
      "inventor_city": "Kanagawa",
      "inventor_state": "",
      "inventor_country": "JP"
    }
  ],
  "title": "CONVERSATION CONTROL SYSTEM",
  "decision": "PENDING",
  "_processing_info": {
    "original_size": 40703,
    "optimized_size": 1790,
    "reduction_percent": 95.6
  }
}