{
  "patent_number": "None",
  "application_number": "15642871",
  "date_published": "20180503",
  "date_produced": "20180418",
  "filing_date": "20170706",
  "main_ipcr_label": "G06N502",
  "abstract": "The present disclosure provides a method and an apparatus for analyzing an intention based on artificial intelligence. The method includes: receiving a query; acquiring a keyword of an intention of the query according to a preset strategy; acquiring a qualifier of the intention of the query according to the keyword based on a syntax tree; and determining the intention of the query according to the keyword and the qualifier.",
  "publication_number": "US20180121810A1-20180503",
  "summary": "<SOH> SUMMARY <EOH>Embodiments of the present disclosure seek to solve at least one of the problems existing in the related art to at least some extent. For this, embodiments of a first aspect of the present disclosure provide a method for analyzing an intention based on artificial intelligence. The method includes: receiving a query; acquiring a keyword of an intention of the query according to a preset strategy; acquiring a qualifier of the intention of the query according to the keyword based on a syntax tree; and determining the intention of the query according to the keyword and the qualifier. Embodiments of a second aspect of the present disclosure provide an apparatus for analyzing an intention based on artificial intelligence. The apparatus includes: a receiving module, configured to receive a query; a first acquiring module, configured to acquire a keyword of an intention of the query according to a preset strategy; a second acquiring module, configured to acquire a qualifier of the intention of the query according to the keyword based on a syntax tree; and a determining module, configured to determine the intention of the query according to the keyword and the qualifier. Embodiments of a third aspect of the present disclosure provide a terminal, including: a processor; a memory for storing instructions executed by the processor, in which the processor is configured to: receive a query; acquire a keyword of an intention of the query according to a preset strategy; acquire a qualifier of the intention of the query according to the keyword based on a syntax tree; and determine the intention of the query according to the keyword and the qualifier. Embodiments of a fourth aspect of the present disclosure provide a non-transitory computer readable storage medium for storing one or more application programs, when executed by one or more processors in a mobile terminal, causing the mobile terminal to execute a method for analyzing the intention based on artificial...",
  "ipcr_labels": [
    "G06N502",
    "G06F1730",
    "G06N300"
  ],
  "inventor_list": [
    {
      "inventor_name_last": "GUO",
      "inventor_name_first": "Zhen",
      "inventor_city": "Beijing",
      "inventor_state": "",
      "inventor_country": "CN"
    },
    {
      "inventor_name_last": "WU",
      "inventor_name_first": "Wenquan",
      "inventor_city": "Beijing",
      "inventor_state": "",
      "inventor_country": "CN"
    },
    {
      "inventor_name_last": "LIU",
      "inventor_name_first": "Zhanyi",
      "inventor_city": "Beijing",
      "inventor_state": "",
      "inventor_country": "CN"
    }
  ],
  "title": "METHOD AND APPARATUS FOR ANALYZING INTENTION BASED ON ARTIFICIAL INTELLIGENCE",
  "decision": "PENDING",
  "_processing_info": {
    "original_size": 55355,
    "optimized_size": 3287,
    "reduction_percent": 94.06
  }
}