{
  "patent_number": "None",
  "application_number": "15641426",
  "date_published": "20180503",
  "date_produced": "20180418",
  "filing_date": "20170705",
  "main_ipcr_label": "G06N300",
  "abstract": "The present disclosure provides a semantic analysis method and apparatus based on artificial intelligence. The method includes: matching input information to be processed with a preset semantic template, in which the preset semantic template is generated according to semantic slot information and equipment information corresponding to an application scenario; when the input information to be processed is successfully matched with the preset semantic template, converting the input information to formative data according to a target semantic template successfully matched with the input information; normalizing the formative data and generating a semantic analysis result corresponding to the input information.",
  "publication_number": "US20180121783A1-20180503",
  "summary": "<SOH> SUMMARY <EOH>The present disclosure aims to solve at least one of the above technical problems to at least some extent. Embodiments according to a first aspect of the present disclosure provide a semantic analysis method based on artificial intelligence, and the method includes: matching input information to be processed with a preset semantic template, in which the preset semantic template is generated according to semantic slot information and equipment information corresponding to an application scenario; when the input information to be processed is successfully matched with the preset semantic template, converting the input information to formative data according to a target semantic template successfully matched with the input information; normalizing the formative data and generating a semantic analysis result corresponding to the input information. Embodiments according to a second aspect of the present disclosure provide a semantic analysis apparatus based on artificial intelligence, including: a matching module, configured to match input information to be processed with a preset semantic template, in which the preset semantic template is generated according to semantic slot information and equipment information corresponding to an application scenario; a converting module, configured to convert the input information to formative data according to a target semantic template successfully matched to the input information, when the input information to be processed is successfully matched with the semantic template; a generating module, configured to normalize the formative data and generate a semantic analysis result corresponding to the input information. Embodiments according to a third aspect of the present disclosure provide a semantic analysis apparatus based on artificial intelligence, including a processor and a memory configured to store instructions executable by the processor, in which the processor is configured to perform the semantic analys...",
  "ipcr_labels": [
    "G06N300"
  ],
  "inventor_list": [
    {
      "inventor_name_last": "HU",
      "inventor_name_first": "Zejin",
      "inventor_city": "Beijing",
      "inventor_state": "",
      "inventor_country": "CN"
    },
    {
      "inventor_name_last": "SHI",
      "inventor_name_first": "Peixuan",
      "inventor_city": "Beijing",
      "inventor_state": "",
      "inventor_country": "CN"
    }
  ],
  "title": "SEMANTIC ANALYSIS METHOD AND APPARATUS BASED ON ARTIFICIAL INTELLIGENCE",
  "decision": "PENDING",
  "_processing_info": {
    "original_size": 53728,
    "optimized_size": 3408,
    "reduction_percent": 93.66
  }
}