{
  "patent_number": "None",
  "application_number": "15646132",
  "date_published": "20180118",
  "date_produced": "20180103",
  "filing_date": "20170711",
  "main_ipcr_label": "G06N504",
  "abstract": "The present application provides a method, apparatus, device, and system for predicting future travel volumes of geographic regions based on historical transportation network data. In one embodiment, the disclosure describes a method comprising receiving first historical travel data associated with a plurality of users, the first historical travel data including a plurality of first historical travel bookings for a plurality of regions of a map; predicting user travel information in a selected region of the plurality of regions in a future time range based on the first historical travel data, the user travel information including, within the future time range for the selected region, a future travel booking quantity and a future travel booking response quantity; and transmitting the user travel information to one of a service device or a user device.",
  "publication_number": "US20180018572A1-20180118",
  "summary": "<SOH> BRIEF SUMMARY <EOH>To solve the aforementioned technical problems, the disclosure provides methods, apparatuses, devices, and systems for predicting future travel volumes of geographic regions based on historical transportation network data. In one embodiment, the disclosure describes a method comprising receiving first historical travel data associated with a plurality of users, the first historical travel data including a plurality of first historical travel bookings for a plurality of regions of a map; predicting user travel information in a selected region of the plurality of regions in a future time range based on the first historical travel data, the user travel information including, within the future time range for the selected region, a future travel booking quantity and a future travel booking response quantity; and transmitting the user travel information to one of a service device or a user device. In one embodiment, the disclosure describes an apparatus comprising a processor and a non-transitory memory storing computer-executable instructions therein that, when executed by the processor, cause the apparatus to perform the operations of: receiving first historical travel data associated with a plurality of users, the first historical travel data including a plurality of first historical travel bookings for a plurality of regions of a map; predicting user travel information in a selected region of the plurality of regions in a future time range based on the first historical travel data, the user travel information including, within the future time range for the selected region, a future travel booking quantity and a future travel booking response quantity; and transmitting the user travel information to one of a service device or a user device. The disclosed embodiments make it possible to predict user travel information in at least one region of a map in a future time range according to first historical travel data in a preset travel database. The...",
  "ipcr_labels": [
    "G06N504"
  ],
  "inventor_list": [
    {
      "inventor_name_last": "WANG",
      "inventor_name_first": "Yu",
      "inventor_city": "Hangzhou",
      "inventor_state": "",
      "inventor_country": "CN"
    },
    {
      "inventor_name_last": "WANG",
      "inventor_name_first": "Rui",
      "inventor_city": "Hangzhou",
      "inventor_state": "",
      "inventor_country": "CN"
    },
    {
      "inventor_name_last": "YE",
      "inventor_name_first": "Zhou",
      "inventor_city": "Hangzhou",
      "inventor_state": "",
      "inventor_country": "CN"
    },
    {
      "inventor_name_last": "WANG",
      "inventor_name_first": "Jinming",
      "inventor_city": "Hangzhou",
      "inventor_state": "",
      "inventor_country": "CN"
    }
  ],
  "title": "METHOD, APPARATUS, DEVICE, AND SYSTEM FOR PREDICTING FUTURE TRAVEL VOLUMES OF GEOGRAPHIC REGIONS BASED ON HISTORICAL TRANSPORTATION NETWORK DATA",
  "decision": "PENDING",
  "_processing_info": {
    "original_size": 166204,
    "optimized_size": 3906,
    "reduction_percent": 97.65
  }
}