{
  "patent_number": "9911080",
  "application_number": "15645872",
  "date_published": "20171102",
  "date_produced": "20171018",
  "filing_date": "20170710",
  "main_ipcr_label": "G06N3063",
  "abstract": "Self-organizing logic gates formed from a combination of memristor devices and dynamic correction modules configured to provide a stable operation upon application of a signal to any terminal. A SOLG of the invention can accept signals from any terminal and does not require an absence of signals at any other terminal. Terminal signals can superpose and the gate finds equilibrium, if an equilibrium exists.",
  "publication_number": "US20170316309A1-20171102",
  "summary": "<SOH> SUMMARY OF THE INVENTION <EOH>Embodiment of the invention includes a self-organizing logic gate, set of self-organizing logic gates and self-organizing circuits. Preferred embodiments are memcomputing architectures that provide forward logic (input to output) like a traditional logic chip, and also provide reverse logic (output to input). A preferred method solves complex problems using the forward and reverse logic at the same time. We call the simultaneous embodiment of forward and reverse logic self-organizing (SO) logic. The use of SO logic speeds up the solutions of the NP problems. NP problems that require exponentially growing resources (in space, time and energy) depending on the input length when solved with forward logic, can be solved with only polynomial resources when solved with SO logic. This is a direct consequence of the definition of NP problems through Boolean circuits. Preferred embodiments of the invention also provide a self-organizing logic gate and circuit emulator. The emulator can be in the form of code that causes a machine to emulate self-organizing logic gates and circuits. The emulator emulates memcomputing architectures that provide forward logic (input to output) like a traditional logic chip, and also provide reverse logic (output to input). The emulator can solve complex problems using SO logic. The use of SO logic speeds up the solutions of the NP problems. NP problems that require exponentially growing resources depending on the input length when solved with forward logic, can be solved with only polynomial resources when solved with SO logic.",
  "ipcr_labels": [
    "G06N3063",
    "G06N308"
  ],
  "inventor_list": [
    {
      "inventor_name_last": "Di Ventra",
      "inventor_name_first": "Massimiliano",
      "inventor_city": "Carlsbad",
      "inventor_state": "CA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Traversa",
      "inventor_name_first": "Fabio Lorenzo",
      "inventor_city": "San Diego",
      "inventor_state": "CA",
      "inventor_country": "US"
    }
  ],
  "title": "SELF-ORGANIZING LOGIC GATES AND CIRCUITS AND COMPLEX PROBLEM SOLVING WITH SELF-ORGANIZING CIRCUITS",
  "decision": "ACCEPTED",
  "_processing_info": {
    "original_size": 124158,
    "optimized_size": 2784,
    "reduction_percent": 97.76
  }
}