{
  "patent_number": "None",
  "application_number": "15643743",
  "date_published": "20180503",
  "date_produced": "20180418",
  "filing_date": "20170707",
  "main_ipcr_label": "G06N304",
  "abstract": "Embodiments of the invention provide a method and system for machine failure prediction. The method comprises: identifying a plurality of basic memory depth values based on a composite sequence of machine failure history; ascertaining weight values for at least one of the identified basic memory depth values according to a pre-stored table which includes a plurality of mappings wherein each mapping relates a basic memory depth value to one set of weight values; and predicting a future failure using a Back Propagation Through Time (BPTT) trained Recurrent Neural Network (RNN) based on the ascertained weight values, wherein weight values related to a first basic memory depth value in the pre-stored table is ascertained based on a second set of weight values related to a second basic memory depth value which is less than the first basic memory depth value by a predetermined value.",
  "publication_number": "US20180121794A1-20180503",
  "summary": "<SOH> SUMMARY OF INVENTION <EOH>Embodiments of the invention provide a machine failure prediction solution which can handle very long time gaps between two successive failures, e.g. more than 1000 time steps. According to one aspect of the invention, a method for machine failure prediction is provided. The method comprises: identifying, by a first processor in a first computer system, a plurality of basic memory depth values based on a composite sequence of a machine failure history; ascertaining, by the first processor, a set of weight values for at least one of the plurality of basic memory depth values according to a pre-stored table which is stored in a memory and includes a plurality of mappings wherein each mapping relates a basic memory depth value to one set of weight values; and predicting, by the first processor, a future failure using a Back Propagation Through Time (BPTT) trained Recurrent Neural Network (RNN) based on the ascertained weight values for the at least one of the plurality of basic memory depth values, wherein a first set of weight values related to a first basic memory depth value in the pre-stored table is ascertained based on a second set of weight values related to a second basic memory depth value, wherein the second basic memory depth value is less than the first basic memory depth value by a predetermined value. According to a second aspect of the invention, a system for machine failure prediction is provided. The system comprises: a first processor and a memory communicably coupled thereto, wherein the first memory is configured to store data to be executed by the first processor, wherein the first processor is configured to identify a plurality of basic memory depth values based on a machine failure history; ascertain a set of weight values for at least one of the plurality of basic memory depth values according to a pre-stored table which is stored in a memory and includes a plurality of mappings wherein each mapping relates a basi...",
  "ipcr_labels": [
    "G06N304",
    "G06N308"
  ],
  "inventor_list": [
    {
      "inventor_name_last": "BHANDARY",
      "inventor_name_first": "Chiranjib",
      "inventor_city": "Bangalore",
      "inventor_state": "",
      "inventor_country": "IN"
    }
  ],
  "title": "METHOD AND SYSTEM FOR MACHINE FAILURE PREDICTION",
  "decision": "PENDING",
  "_processing_info": {
    "original_size": 49417,
    "optimized_size": 3441,
    "reduction_percent": 93.04
  }
}