{
  "patent_number": "None",
  "application_number": "15659371",
  "date_published": "20180215",
  "date_produced": "20180131",
  "filing_date": "20170725",
  "main_ipcr_label": "G06N304",
  "abstract": "A method, computer program product, and system perform computations using a processor. A first instruction including a first index vector operand and a second index vector operand is received and the first index vector operand is decoded to produce first coordinate sets for a first array, each first coordinate set including at least a first coordinate and a second coordinate of a position of a non-zero element in the first array. The second index vector operand is decoded to produce second coordinate sets for a second array, each second coordinate set including at least a third coordinate and a fourth coordinate of a position of a non-zero element in the second array. The first coordinate sets are summed with the second coordinate sets to produce output coordinate sets and the output coordinate sets are converted into a set of linear indices.",
  "publication_number": "US20180046900A1-20180215",
  "summary": "<SOH> SUMMARY <EOH>A method, computer program product, and system perform computations using a processor. A first instruction including a first index vector operand and a second index vector operand is received and the first index vector operand is decoded to produce first coordinate sets for a first array, each first coordinate set including at least a first coordinate and a second coordinate of a position of a non-zero element in the first array. The second index vector operand is decoded to produce second coordinate sets for a second array, each second coordinate set including at least a third coordinate and a fourth coordinate of a position of a non-zero element in the second array. The first coordinate sets are summed with the second coordinate sets to produce output coordinate sets and the output coordinate sets are converted into a set of linear indices.",
  "ipcr_labels": [
    "G06N304",
    "G06F1711"
  ],
  "inventor_list": [
    {
      "inventor_name_last": "Dally",
      "inventor_name_first": "William J.",
      "inventor_city": "Los Altos Hills",
      "inventor_state": "CA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Parashar",
      "inventor_name_first": "Angshuman",
      "inventor_city": "Northborough",
      "inventor_state": "MA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Emer",
      "inventor_name_first": "Joel Springer",
      "inventor_city": "Acton",
      "inventor_state": "MA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Keckler",
      "inventor_name_first": "Stephen William",
      "inventor_city": "Austin",
      "inventor_state": "TX",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Dennison",
      "inventor_name_first": "Larry Robert",
      "inventor_city": "Mendon",
      "inventor_state": "MA",
      "inventor_country": "US"
    }
  ],
  "title": "SPARSE CONVOLUTIONAL NEURAL NETWORK ACCELERATOR",
  "decision": "PENDING",
  "_processing_info": {
    "original_size": 159507,
    "optimized_size": 2890,
    "reduction_percent": 98.19
  }
}