{
  "patent_number": "None",
  "application_number": "15650145",
  "date_published": "20180118",
  "date_produced": "20180103",
  "filing_date": "20170714",
  "main_ipcr_label": "G06N3063",
  "abstract": "An analog neuromorphic circuit is disclosed having resistive memories that provide a resistance to each corresponding input voltage signal. Input voltages are applied to the analog neuromorphic circuit. Each input voltage represents a vector value that is a non-binary value included in a vector that is incorporated into a dot-product operation with weighted matrix values included in a weighted matrix. A controller pairs each resistive memory with another resistive memory. The controller converts each pair of resistance values to a single non-binary value. Each single non-binary value is mapped to a weighted matrix value included in the weighted matrix that is incorporated into the dot-product operation with the vector values included in the vector. The controller generates dot-product operation values from the dot-product operation with the vector and the weighted matrix where each dot-product operation is a non-binary value.",
  "publication_number": "US20180018559A1-20180118",
  "summary": "<SOH> SUMMARY OF THE INVENTION <EOH>The present invention provides an analog neuromorphic circuit that implements a plurality of resistive memories, a plurality of input voltages and a controller. A plurality of input voltages is applied to the analog neuromorphic circuit. Each input voltage represents a vector value that is a non-binary value included in a vector that is incorporated into a dot-product operation with a plurality of matrix values included in a matrix. Each resistive memory is configured to provide a resistance value to each corresponding input voltage. Each resistance value is a positive resistance value selected from a finite range of resistance values. The controller is configured to pair each resistive memory with another resistive memory so that each pair of resistive memories includes a pair of resistance values. The controller is also configured to convert each pair of resistance values from a pair of resistance values selected from the finite range of resistance values to a single non-binary value. Each single non-binary value is mapped to a matrix value included in the matrix that is incorporated into the dot-product operation with the vector values included in the vector. The controller is also configured to generate a plurality of dot-product operation values from the dot-product operation with the vector and the matrix where each dot-product operation value is a non-binary value. The present invention also provides a method for adjusting resistances of a plurality of resistive memories positioned in an analog neuromorphic circuit. The method starts with applying input voltages to the analog neuromorphic circuit. Each input voltage represents a vector value that is a non-binary value included in a vector that is incorporated into a dot-product operation with a plurality of matrix values included in a matrix. The method further includes providing a resistance value to each corresponding input voltage from a corresponding resistance memory i...",
  "ipcr_labels": [
    "G06N3063",
    "G06F1710",
    "G11C1154",
    "G11C1300"
  ],
  "inventor_list": [
    {
      "inventor_name_last": "Yakopcic",
      "inventor_name_first": "Chris",
      "inventor_city": "Dayton",
      "inventor_state": "OH",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Taha",
      "inventor_name_first": "Tarek M.",
      "inventor_city": "Centerville",
      "inventor_state": "OH",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Hasan",
      "inventor_name_first": "Md Raqibul",
      "inventor_city": "Baltimore",
      "inventor_state": "MD",
      "inventor_country": "US"
    }
  ],
  "title": "ANALOG NEUROMORPHIC CIRCUITS FOR DOT-PRODUCT OPERATION IMPLEMENTING RESISTIVE MEMORIES",
  "decision": "PENDING",
  "_processing_info": {
    "original_size": 162434,
    "optimized_size": 3849,
    "reduction_percent": 97.63
  }
}