{
  "patent_number": "None",
  "application_number": "15658395",
  "date_published": "20171116",
  "date_produced": "20171103",
  "filing_date": "20170725",
  "main_ipcr_label": "G06N502",
  "abstract": "Mechanisms for clarifying an input question are provided. A question is received for generation of an answer. A set of candidate answers is generated based on an analysis of a corpus of information. Each candidate answer has an evidence passage supporting the candidate answer. Based on the set of candidate answers, a determination is made as to whether clarification of the question is required. In response to a determination that clarification of the question is required, a request is sent for user input to clarify the question. User input is received from the computing device in response to the request and at least one candidate answer in the set of candidate answers is selected as an answer for the question based on the user input.",
  "publication_number": "US20170330084A1-20171116",
  "summary": "<SOH> SUMMARY <EOH>In one illustrative embodiment, a method, in a data processing system comprising a processor and a memory, for clarifying an input question. The method comprises receiving, in the data processing system from a computing device, the input question for generation of an answer to the input question. The method further comprises generating, in the data processing system, a set of candidate answers for the input question based on an analysis of a corpus of information, wherein each candidate answer in the set of candidate answers has an evidence passage supporting the candidate answer as answering the input question. Moreover, the method comprises determining, in the data processing system, based on the set of candidate answers, whether clarification of the input question is required and sending, by the data processing system, in response to a determination that clarification of the input question is required, a request for user input to clarify the input question. In addition, the method comprises receiving, in the data processing system, user input from the computing device in response to the request and selecting, by the data processing system, at least one candidate answer in the set of candidate answers as an answer for the input question based on the user input. In other illustrative embodiments, a computer program product comprising a computer useable or readable medium having a computer readable program is provided. The computer readable program, when executed on a computing device, causes the computing device to perform various ones of, and combinations of, the operations outlined above with regard to the method illustrative embodiment. In yet another illustrative embodiment, a system/apparatus is provided. The system/apparatus may comprise one or more processors and a memory coupled to the one or more processors. The memory may comprise instructions which, when executed by the one or more processors, cause the one or more processors to perfor...",
  "ipcr_labels": [
    "G06N502",
    "G06F1730",
    "G06F1730",
    "G06F1730",
    "G06F30484"
  ],
  "inventor_list": [
    {
      "inventor_name_last": "Cook",
      "inventor_name_first": "Kelly L.",
      "inventor_city": "Raleigh",
      "inventor_state": "NC",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Rodriguez",
      "inventor_name_first": "Adrian X.",
      "inventor_city": "Durham",
      "inventor_state": "NC",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Skeen",
      "inventor_name_first": "Michael M.",
      "inventor_city": "Raleigh",
      "inventor_state": "NC",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Woods",
      "inventor_name_first": "Eric",
      "inventor_city": "Durham",
      "inventor_state": "NC",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Wuu",
      "inventor_name_first": "Menlo",
      "inventor_city": "Raleigh",
      "inventor_state": "NC",
      "inventor_country": "US"
    }
  ],
  "title": "Clarification of Submitted Questions in a Question and Answer System",
  "decision": "PENDING",
  "_processing_info": {
    "original_size": 86506,
    "optimized_size": 3927,
    "reduction_percent": 95.46
  }
}