{
  "patent_number": "None",
  "application_number": "15654750",
  "date_published": "20171102",
  "date_produced": "20171018",
  "filing_date": "20170720",
  "main_ipcr_label": "G06N9900",
  "abstract": "A computer generates labels for machine learning algorithms by retrieving, from a data storage circuit, multiple label sets that contain labels that each classify data points in a corpus of data. A graph is generated that includes a plurality of edges, each edge between two respective labels from different label sets of the multiple label sets. Weights are determined for the plurality of edges based upon a consistency between data points classified by two labels connected by the edges. An algorithm is applied that groups labels from the multiple label sets based upon the weights for the plurality of edges. Data points are identified from the corpus of data that represent conflicts within the grouped labels. An electronic message is transmitted in order to present the identified data points to entities for further classification. A new label set is generated using the further classification received from the entities.",
  "publication_number": "US20170316348A1-20171102",
  "summary": "<SOH> SUMMARY <EOH>Consistent with certain embodiments, a computer implemented method is used to generate labels for machine learning algorithms. The method includes retrieving, from a data storage circuit, multiple label sets that contain labels that each classify data points in a corpus of data; generating a graph that includes a plurality of edges, each edge between two respective labels from different label sets of the multiple label sets; determining weights for the plurality of edges based upon a consistency between data points classified by two labels connected by the edges; applying an algorithm that groups labels from the multiple label sets based upon the weights for the plurality of edges; identifying data points from the corpus of data that represent conflicts within the grouped labels; transmitting an electronic message for presenting the identified data points to entities for further classification; and generating a new label set based upon the grouped labels and further classification received from the entities. According to embodiments, a computer system can generate labels for machine learning algorithms. The computer system can include at least one processor circuit and computer readable storage device that are configured to include a label set comparison module configured to: retrieve, from a data storage circuit, multiple label sets that contain labels that each classify data points in a corpus of data; generate a graph that includes a plurality of edges, each edge between two respective labels from different label sets of the multiple label sets; determine weights for the plurality of edges based upon a consistency between data points classified by two labels connected by the edges. The system can also include a label set coordinator module configured to: apply an algorithm that groups labels from the multiple label sets based upon the weights for the plurality of edges; and identify data points from the corpus of data that represent conflicts w...",
  "ipcr_labels": [
    "G06N9900",
    "G06F1730",
    "G06F1730",
    "G06N502"
  ],
  "inventor_list": [
    {
      "inventor_name_last": "Ghosh",
      "inventor_name_first": "Prasanta",
      "inventor_city": "Bangalore",
      "inventor_state": "",
      "inventor_country": "IN"
    },
    {
      "inventor_name_last": "Godbole",
      "inventor_name_first": "Shantanu R.",
      "inventor_city": "Bangalore",
      "inventor_state": "",
      "inventor_country": "IN"
    },
    {
      "inventor_name_last": "Joshi",
      "inventor_name_first": "Sachindra",
      "inventor_city": "Gurgaon",
      "inventor_state": "",
      "inventor_country": "IN"
    },
    {
      "inventor_name_last": "Merugu",
      "inventor_name_first": "Srujana",
      "inventor_city": "Bangalore",
      "inventor_state": "",
      "inventor_country": "IN"
    },
    {
      "inventor_name_last": "Verma",
      "inventor_name_first": "Ashish",
      "inventor_city": "New Delhi",
      "inventor_state": "",
      "inventor_country": "IN"
    }
  ],
  "title": "LABELING OF DATA FOR MACHINE LEARNING",
  "decision": "PENDING",
  "_processing_info": {
    "original_size": 49907,
    "optimized_size": 4078,
    "reduction_percent": 91.83
  }
}