{
  "patent_number": "None",
  "application_number": "15659827",
  "date_published": "20180201",
  "date_produced": "20180117",
  "filing_date": "20170726",
  "main_ipcr_label": "G06N308",
  "abstract": "A computer-implemented method includes recording, with a three-dimensional camera, one or more demonstrations of a user performing one or more reaching tasks. Training data is computed to describe the one or more demonstrations. One or more weights of a neural network are learned based on the training data, where the neural network is configured to estimate a goal location of the one or more reaching tasks. A partial trajectory of a new reaching task is recorded. An estimated goal location is computed, by a computer processor, by applying the neural network to the partial trajectory of the new reaching task.",
  "publication_number": "US20180032868A1-20180201",
  "summary": "<SOH> SUMMARY <EOH>According to an embodiment of this disclosure, a computer-implemented method includes recording, with a three-dimensional camera, one or more demonstrations of a user performing one or more reaching tasks. Training data is computed to describe the one or more demonstrations. One or more weights of a neural network are learned based on the training data, where the neural network is configured to estimate a goal location of the one or more reaching tasks. A partial trajectory of a new reaching task is recorded. An estimated goal location is computed, by a computer processor, by applying the neural network to the partial trajectory of the new reaching task. In another embodiment, a system includes a memory having computer readable instructions and one or more processors for executing the computer readable instructions. The computer readable instructions include recording, with a three-dimensional camera, one or more demonstrations of a user performing one or more reaching tasks. Further according to the computer readable instructions, training data is computed to describe the one or more demonstrations. One or more weights of a neural network are learned based on the training data, where the neural network is configured to estimate a goal location of the one or more reaching tasks. A partial trajectory of a new reaching task is recorded. An estimated goal location is computed, by applying the neural network to the partial trajectory of the new reaching task. In yet another embodiment, a computer program product for inferring an intention includes a computer readable storage medium having program instructions embodied therewith. The program instructions are executable by a processor to cause the processor to perform a method. The method includes recording, with a three-dimensional camera, one or more demonstrations of a user performing one or more reaching tasks. Further according to the method, training data is computed to describe the one or more de...",
  "ipcr_labels": [
    "G06N308",
    "B25J900",
    "G06T7285",
    "G06K900"
  ],
  "inventor_list": [
    {
      "inventor_name_last": "Dani",
      "inventor_name_first": "Ashwin",
      "inventor_city": "Manchester",
      "inventor_state": "CT",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Ravichandar",
      "inventor_name_first": "Harish",
      "inventor_city": "Willimantic",
      "inventor_state": "CT",
      "inventor_country": "US"
    }
  ],
  "title": "EARLY PREDICTION OF AN INTENTION OF A USER'S ACTIONS",
  "decision": "PENDING",
  "_processing_info": {
    "original_size": 55941,
    "optimized_size": 3343,
    "reduction_percent": 94.02
  }
}