{
  "patent_number": "None",
  "application_number": "15657950",
  "date_published": "20180329",
  "date_produced": "20180315",
  "filing_date": "20170724",
  "main_ipcr_label": "G06N304",
  "abstract": "In a method of operating a neural network device, a plurality of consecutive input data is received by an input layer. A delta data is generated by the input layer based on a difference between a current input data and a previous input data. A first current feature is generated by a first linear layer based on a first delta feature generated by performing a first linear operation on the delta data and a first previous feature. A second delta feature is generated by a first nonlinear layer based on a second current feature generated by performing a first nonlinear operation on the first current feature and a second previous feature. A third current feature is generated by a second linear layer based on a third delta feature generated by performing a second linear operation on the second delta feature and a third previous feature.",
  "publication_number": "US20180089555A1-20180329",
  "summary": "<SOH> SUMMARY <EOH>Exemplary embodiments of the present inventive concept provide a method of operating a neural network device that may increase an operation speed, and a neural network device that may increase an operation speed. According to an exemplary embodiment of the present inventive concept, a method of operating a neural network device includes receiving, by an input layer, a plurality of consecutive input data. The neural network device includes a neural network including the input layer, a first linear layer, a first nonlinear layer, and a second nonlinear layer. The method further includes generating, by the input layer, a delta data based on a difference between a current input data and a previous input data from among the plurality of consecutive input data. The method further includes generating, by the first linear layer, a first current feature. The first current feature corresponds to a result of performing a first linear operation on the current input data based on a first delta feature and a first previous feature. The first delta feature is generated by performing the first linear operation on the delta data. The first previous feature is stored in a first register in the first linear layer. The method further includes generating, by the first nonlinear layer, a second delta feature based on a second current feature and a second previous feature. The second current feature is generated by performing a first nonlinear operation on the first current feature. The second previous feature is stored in a second register in the first nonlinear layer. The method further includes generating, by the second linear layer, a third current feature based on a third delta feature and a third previous feature. The third current feature corresponds to a result of performing a second linear operation on the second current feature. The third delta feature is generated by performing the second linear operation on the second delta feature. The third previous featur...",
  "ipcr_labels": [
    "G06N304"
  ],
  "inventor_list": [
    {
      "inventor_name_last": "PARK",
      "inventor_name_first": "JUN-SEOK",
      "inventor_city": "HWASEONG-SI",
      "inventor_state": "",
      "inventor_country": "KR"
    }
  ],
  "title": "NEURAL NETWORK DEVICE AND METHOD OF OPERATING NEURAL NETWORK DEVICE",
  "decision": "PENDING",
  "_processing_info": {
    "original_size": 69683,
    "optimized_size": 3396,
    "reduction_percent": 95.13
  }
}