{
  "patent_number": "None",
  "application_number": "15655666",
  "date_published": "20180125",
  "date_produced": "20180109",
  "filing_date": "20170720",
  "main_ipcr_label": "G06N9900",
  "abstract": "A data processing system for structuring data includes a repository storing data referencing sources, the data representing actions and states for each of the sources. A data structuring engine generates a data sequence, for each source. Each data sequence represents states and actions for the source. An aggregation engine aggregates data sequences for the sources into a data structure, each entry of the data structure representing a state. Each entry includes an identifier for the state, a probability value of at least one action occurring at the state, the probability value based on a proportion of the data sequences comprising the state that also comprises the at least one action, and frequency data indicating a proportion of the data sequences included in the entry. A classification engine traverses the data structure and classifies the data sequences into groups based on probability values and frequency data associated with each state of each respective data sequence.",
  "publication_number": "US20180025291A1-20180125",
  "summary": "<SOH> SUMMARY <EOH>This document describes a data processing system for structuring data. The data processing system includes a repository storing data referencing one or more sources, the data representing actions and states for each of the one or more sources. The data processing system includes a data structuring engine that generates a data sequence, for each source, from one or more portions of the stored data for that source, each data sequence representing one or more states and one or more actions for the source. The data processing system includes an aggregation engine that aggregates data sequences for the one or more sources into a data structure, each entry of the data structure representing a state, each entry including an identifier for the state; a probability value of at least one action occurring at the state, the probability value based on a proportion of the data sequences, including the state, that also comprise the at least one action; and frequency data indicating a proportion of the data sequences included in the entry. The data processing system includes a classification engine that traverses the data structure and classifies the data sequences into groups based on probability values and frequency data associated with each state of each respective data sequence. In some implementations, the classification engine identifies a first data sequence of a group of data sequences to be a particular sequence, and a second data sequence of the group to be a variation of the particular sequence, the variation including at least one particular action for a data sequence having a probability value above a predetermined threshold. In some implementations, the data processing system includes a simulation engine for generating, using the data structure, a simulation. In some implementations, the simulation includes an environment having one or more objects and one or more data sequences automatically generated by the simulation engine, each data sequence of...",
  "ipcr_labels": [
    "G06N9900",
    "G06N700"
  ],
  "inventor_list": [
    {
      "inventor_name_last": "Dey",
      "inventor_name_first": "Anind K.",
      "inventor_city": "Pittsburgh",
      "inventor_state": "PA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Banovic",
      "inventor_name_first": "Nikola",
      "inventor_city": "Pittsburgh",
      "inventor_state": "PA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Mankoff",
      "inventor_name_first": "Jennifer C.",
      "inventor_city": "Pittsburgh",
      "inventor_state": "PA",
      "inventor_country": "US"
    }
  ],
  "title": "Data Processing System for Generating Data Structures",
  "decision": "PENDING",
  "_processing_info": {
    "original_size": 155586,
    "optimized_size": 3845,
    "reduction_percent": 97.53
  }
}