{
  "patent_number": "None",
  "application_number": "15668030",
  "date_published": "20180222",
  "date_produced": "20180207",
  "filing_date": "20170803",
  "main_ipcr_label": "G06N700",
  "abstract": "Anomaly scores for respective message types in computer log data and confidence intervals for respective anomaly scores are calculated based on a number of appearances of respective message types in a plurality of models generated from a historical set of computer log data. Respective models of the plurality of models can have at least a portion of the historical set of computer log data excluded from the respective models. Respective anomaly scores and respective confidence intervals can be applied to a new set of log data to identify and troubleshoot unusual log data events.",
  "publication_number": "US20180053109A1-20180222",
  "summary": "<SOH> SUMMARY <EOH>Aspects of the present disclosure are directed to a method for generating anomaly scores and confidence intervals for message types in computer log data. The method can comprise receiving a plurality of periods of log data comprising various message types. Respective periods of log data can be made up of a plurality of subsets such that each subset comprises log data from a respective time interval of a respective period. The method can further comprise generating a plurality of models using the plurality of periods of log data, where respective models comprise the plurality of periods of log data having at least one respective period of log data excluded. The method can further comprise calculating, for respective models, respective anomaly scores for at least a first message type indicating a rarity of the first message type in respective models. The method can further comprise determining a first average anomaly score for the first message type by dividing a sum of the respective anomaly scores by the plurality of models. The method can further comprise calculating a confidence interval for the first average anomaly score of the first message type based on the first average anomaly score, a statistic based on respective anomaly scores of the first message type, the plurality of models, and a confidence parameter. The method can further comprise storing, for respective various message types, respective average anomaly scores and respective confidence intervals for respective average anomaly scores in a non-transitory computer readable storage medium. Further aspects of the present disclosure are directed to a system having a plurality of compute nodes communicatively coupled to one another via a network. The system can include a user interface configured to present output to a user, a memory configured to store log data comprising respective message types generated by the plurality of compute nodes, a database configured to store respective mess...",
  "ipcr_labels": [
    "G06N700",
    "G06N9900",
    "G06N504"
  ],
  "inventor_list": [
    {
      "inventor_name_last": "Caffrey",
      "inventor_name_first": "James M.",
      "inventor_city": "Woodstock",
      "inventor_state": "NY",
      "inventor_country": "US"
    }
  ],
  "title": "CONFIDENCE INTERVALS FOR ANOMALIES IN COMPUTER LOG DATA",
  "decision": "PENDING",
  "_processing_info": {
    "original_size": 61444,
    "optimized_size": 3153,
    "reduction_percent": 94.87
  }
}