{
  "patent_number": "None",
  "application_number": "15663048",
  "date_published": "20171207",
  "date_produced": "20171121",
  "filing_date": "20170728",
  "main_ipcr_label": "G06N502",
  "abstract": "Certain example embodiments described herein relate to techniques for managing “bad” or “imperfect” data being imported into a database system. That is, certain example embodiments provide a lifecycle technology solution that helps receive data from a variety of different data sources of a variety of known and/or unknown formats, standardize it, fit it to a known taxonomy through model-assisted classification, store it to a database in a manner that is consistent with the taxonomy, and allow it to be queried for a variety of different usages. Some or all of the disclosed technology concerning auto-classification, enrichment, clustering model and model stacks, and/or the like, may be used in these and/or other regards.",
  "publication_number": "US20170351956A1-20171207",
  "summary": "<SOH> BACKGROUND AND SUMMARY <EOH>A database may be thought of, at least in theory, as an organized collection of data, very often defined in connection with schemas, tables, queries, reports, views, and/or other objects, and very often organized in a logical, object-oriented, relational, and/or other manner. Databases have become fundamental components for many modern computer systems and, in this regard, database management systems (DBMSs) typical include computer software applications that interact with one or more users, other applications, and the database itself, e.g., to facilitate the definition, creation, querying, updating, administration, etc., of the databases and/or the data associated therewith. Databases, directly or indirectly, support a wide variety of applications. For instance, databases underlie computerized library catalog systems, flight reservation systems, computerized parts inventory systems, etc. Some databases support lead tracking and sales-related metrics. Other databases support organizations' human resources functions including, for example, maintaining employees' personal information, vacation time, performance, and/or the like. Other databases support accounting functions, are involved in economic data analysis, and/or the like. So-called business-to-business (B2B), business-to-consumer (B2C), and other patterns of purchasing also are typically enabled by databases. The advent of so-called Big Data has placed a number of challenges on modern computerized database technologies. Although there are a number of different definitions of Big Data, those skilled in the art understand that it generally refers to datasets so large and/or complex that traditional data processing applications are inadequate. Challenges also arise because Big Data oftentimes is not structured, which makes it difficult and sometimes even impossible to process using conventional database systems. Challenges arise in areas including data analysis, capturing, curati...",
  "ipcr_labels": [
    "G06N502",
    "G06F1730",
    "G06N9900",
    "G06F1727"
  ],
  "inventor_list": [
    {
      "inventor_name_last": "DUBEY",
      "inventor_name_first": "Dilip",
      "inventor_city": "Troy",
      "inventor_state": "MI",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "RATHI",
      "inventor_name_first": "Dineshchandra Harikisan",
      "inventor_city": "San Carlos",
      "inventor_state": "CA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "KUMARASWAMY",
      "inventor_name_first": "Koushik",
      "inventor_city": "Littleton",
      "inventor_state": "CO",
      "inventor_country": "US"
    }
  ],
  "title": "SYSTEM AND/OR METHOD FOR GENERATING  CLEAN RECORDS FROM IMPERFECT DATA USING MODEL STACK(S) INCLUDING CLASSIFICATION MODEL(S) AND CONFIDENCE MODEL(S)",
  "decision": "PENDING",
  "_processing_info": {
    "original_size": 109681,
    "optimized_size": 3731,
    "reduction_percent": 96.6
  }
}