{
  "patent_number": "None",
  "application_number": "15668646",
  "date_published": "20180208",
  "date_produced": "20180124",
  "filing_date": "20170803",
  "main_ipcr_label": "G06N502",
  "abstract": "Provided are an adaptive knowledge base construction system and method. The adaptive knowledge base construction system includes a machine learning engine analyzing a correlation between pieces of data included in a first data set in a process of learning the first data set input thereto, based on machine learning, a rule generator generating a rule based on the machine learning by using an analysis result obtained by analyzing the correlation, and a semantic rule generator generating a semantic rule from the rule based on the machine learning by using a language expressing ontology, and reflecting the generated semantic rule in a knowledge base to extend the knowledge base.",
  "publication_number": "US20180039890A1-20180208",
  "summary": "<SOH> SUMMARY <EOH>Accordingly, the present invention provides an adaptive knowledge base construction method and system. In detail, the present invention provides a method and a system, which construct an adaptive knowledge base based on a dynamically changed environment by using machine learning and semantic technology without intervention of a person. The object of the present invention is not limited to the aforesaid, but other objects not described herein will be clearly understood by those skilled in the art from descriptions below. In one general aspect, an adaptive knowledge base construction system includes: a machine learning engine analyzing a correlation between pieces of data included in a first data set in a process of learning the first data set input thereto, based on machine learning; a rule generator generating a rule based on the machine learning by using an analysis result obtained by analyzing the correlation; and a semantic rule generator generating a semantic rule from the rule based on the machine learning by using a language expressing ontology, and reflecting the generated semantic rule in a knowledge base to extend the knowledge base. In another general aspect, an adaptive knowledge base construction system includes: a memory storing a program for providing an adaptive knowledge base construction model; and a processor executing the program, wherein by executing the program, the processor generates a learning model corresponding to a first data set input thereto, outputs a correlation analysis result obtained by analyzing the first data set according to the generated learning model, generates a machine learning rule based on a correlation analysis result obtained by analyzing a correlation between a learned model and a learned algorithm, and generates a semantic rule by using the generated machine learning rule. In another general aspect, an adaptive knowledge base construction method includes: performing machine learning on an input first...",
  "ipcr_labels": [
    "G06N502",
    "G06F1730"
  ],
  "inventor_list": [
    {
      "inventor_name_last": "KIM",
      "inventor_name_first": "Mal Hee",
      "inventor_city": "Daejeon",
      "inventor_state": "",
      "inventor_country": "KR"
    },
    {
      "inventor_name_last": "KANG",
      "inventor_name_first": "Hyun Joong",
      "inventor_city": "Jinju",
      "inventor_state": "",
      "inventor_country": "KR"
    },
    {
      "inventor_name_last": "KWON",
      "inventor_name_first": "Soon Hyun",
      "inventor_city": "Incheon",
      "inventor_state": "",
      "inventor_country": "KR"
    }
  ],
  "title": "ADAPTIVE KNOWLEDGE BASE CONSTRUCTION METHOD AND SYSTEM",
  "decision": "PENDING",
  "_processing_info": {
    "original_size": 39761,
    "optimized_size": 3519,
    "reduction_percent": 91.15
  }
}