{
  "patent_number": "None",
  "application_number": "15662476",
  "date_published": "20180201",
  "date_produced": "20180117",
  "filing_date": "20170728",
  "main_ipcr_label": "G06N502",
  "abstract": "The present invention relates to methods and apparatus for entering data for a goal lattice, displaying the graph of goals and edges, and extracting sublattices of goals and edges for detailed data entry, display, and analysis. More particularly, the present invention relates to methods, systems, and apparatus for visualizing goals and their relationship in a multidimensional visualization. In preferred embodiments, goal lattices are displayed such that direct human interaction through a graphical user interface and data entry devices allow for the addition, modification, and extraction of goal lattices and their visualization.",
  "publication_number": "US20180032878A1-20180201",
  "summary": "<SOH> BRIEF DESCRIPTION OF THE SEVERAL VIEWS OF THE DRAWINGS <EOH>The present invention will become more fully understood from the detailed description given herein below and the accompanying drawings which are given by way of illustration only, and thus are not limitative of the present invention, and wherein: FIGS. 1A and 1B illustrate examples of uniformly and non-uniformly apportioned goal lattice structures in accordance with the present invention; FIG. 1C illustrates an example of a computer housing a computer readable medium storing a computer program that comprises code segments capable of performing processes in accordance with the concepts of the present invention as well as the linkage between the goal lattice apparatus and the control system and system under control; FIG. 2 illustrates an exemplary flowchart of steps performed by a method used to display and modify the elements of a goal lattice; FIG. 3 illustrates and example of a particular goal lattice structure used to describe one implementation of the present invention; FIG. 4 illustrates the relationship among the various goals of a goal lattice and the levels that comprise them; FIG. 5 . illustrates how two collaborating agents can have both their own local goals and contribute to shared goals for which they are both responsible; FIG. 6 . is an exemplary display showing the projection of a goal lattice onto two dimensions. The dynamic behavior in manipulating the goal lattice is not shown. detailed-description description=\"Detailed Description\" end=\"lead\"?",
  "ipcr_labels": [
    "G06N502",
    "G05B19042"
  ],
  "inventor_list": [
    {
      "inventor_name_last": "Hintz",
      "inventor_name_first": "Kenneth J.",
      "inventor_city": "Fairfax Station",
      "inventor_state": "VA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Hintz",
      "inventor_name_first": "Andrew S.",
      "inventor_city": "Avon",
      "inventor_state": "IN",
      "inventor_country": "US"
    }
  ],
  "title": "Dynamic Goal Lattice Creation and Display Apparatus",
  "decision": "PENDING",
  "_processing_info": {
    "original_size": 56988,
    "optimized_size": 2893,
    "reduction_percent": 94.92
  }
}