{
  "patent_number": "None",
  "application_number": "15662956",
  "date_published": "20180510",
  "date_produced": "20180425",
  "filing_date": "20170728",
  "main_ipcr_label": "G06N308",
  "abstract": "In a method of managing a plurality of computing paths in an artificial neural network (ANN) driven by a plurality of heterogeneous resources, resource information, preference level metrics, and a plurality of initial computing paths are obtained by performing an initialization. The resource information represents information associated with the heterogeneous resources. The preference level metrics represent a relationship between the heterogeneous resources and a plurality of operations. The initial computing paths represent computing paths predetermined for the operations. When a first event including at least one of the plurality of operations is to be performed, a first computing path for the first event is set based on the initial computing paths, the preference level metrics, resource environment, and operating environment. The resource environment represents whether the heterogeneous resources are available. The operating environment represents contexts of the ANN and at least o...",
  "publication_number": "US20180129939A1-20180510",
  "summary": "<SOH> SUMMARY <EOH>According to an exemplary embodiment of the inventive concept, in a method of managing a plurality of computing paths in an artificial neural network (ANN) configured to be driven by a plurality of heterogeneous resources, resource information, preference level metrics, and a plurality of initial computing paths are obtained by performing an initialization. The resource information represents information associated with the plurality of heterogeneous resources. The preference level metrics represent a relationship between the plurality of heterogeneous resources and a plurality of operations. The plurality of initial computing paths represent computing paths predetermined for the plurality of operations. When a first event including at least one of the plurality of operations is to be performed, a first computing path for the first event is set based on the plurality of initial computing paths, the preference level metrics, resource environment, and operating environment. The resource environment represents whether the plurality of heterogeneous resources is available. The operating environment represents contexts of the ANN and at least one electronic device including the plurality of heterogeneous resources. According to an exemplary embodiment of the inventive concept, a system of managing a plurality of computing paths in an artificial neural network (ANN) includes a plurality of heterogeneous resources and at least one adaptive path manager. The plurality of heterogeneous resources is configured to drive the ANN. The at least one adaptive path manager is configured to manage the plurality of computing paths in the ANN. The at least one adaptive path manager obtains resource information, preference level metrics, and a plurality of initial computing paths by performing an initialization. The resource information represents information associated with the plurality of heterogeneous resources. The preference level metrics represent a relationshi...",
  "ipcr_labels": [
    "G06N308",
    "G06N304"
  ],
  "inventor_list": [
    {
      "inventor_name_last": "Yang",
      "inventor_name_first": "Seung-Soo",
      "inventor_city": "Hwaseong-si",
      "inventor_state": "",
      "inventor_country": "KR"
    }
  ],
  "title": "METHOD AND SYSTEM OF MANAGING COMPUTING PATHS IN AN ARTIFICIAL NEURAL NETWORK",
  "decision": "PENDING",
  "_processing_info": {
    "original_size": 81366,
    "optimized_size": 3581,
    "reduction_percent": 95.6
  }
}