{
  "patent_number": "None",
  "application_number": "15661318",
  "date_published": "20180208",
  "date_produced": "20180124",
  "filing_date": "20170727",
  "main_ipcr_label": "G06N3067",
  "abstract": "An imaging device connected to a neural network is provided. An imaging device having a neuron in a neural network includes a plurality of first pixels, a first circuit, a second circuit, and a third circuit. Each of the plurality of first pixels includes a photoelectric conversion element. The plurality of first pixels is electrically connected to the first circuit. The first circuit is electrically connected to the second circuit. The second circuit is electrically connected to the third circuit. Each of the plurality of first pixels generates an input signal of the neuron. The first circuit, the second circuit, and the third circuit function as the neuron. The third circuit includes an interface connected to the neural network.",
  "publication_number": "US20180039882A1-20180208",
  "summary": "<SOH> BRIEF DESCRIPTION OF DRAWINGS <EOH>FIG. 1 is a block diagram illustrating an imaging element. FIGS. 2A and 2B are block diagrams illustrating an imaging element. FIGS. 3A to 3C are circuit diagrams illustrating an imaging element. FIG. 4A is a timing chart showing an operation of an imaging element, and FIG. 4B is a timing chart showing an operation of a pixel. FIG. 5 is a block diagram illustrating an imaging element. FIGS. 6A and 6B are block diagrams illustrating an imaging element. FIG. 7 is a circuit diagram illustrating an imaging element. FIG. 8A is a timing chart showing an operation of an imaging element, and FIG. 8B is a timing chart showing an operation of a pixel. FIG. 9 is a cross-sectional view illustrating a structure of an imaging device. FIG. 10 is a cross-sectional view illustrating a structure of an imaging device. FIGS. 11A to 11E are cross-sectional views each illustrating connection of a photoelectric conversion element. FIGS. 12A to 12D are cross-sectional views each illustrating connection of a photoelectric conversion element. FIG. 13 is a cross-sectional view illustrating a structure of an imaging device. FIGS. 14A to 14C are cross-sectional views each illustrating connection of a photoelectric conversion element. FIG. 15 is a cross-sectional view illustrating a structure of an imaging device. FIGS. 16A and 16B are cross-sectional views each illustrating a structure of an imaging device. FIG. 17 is a cross-sectional view illustrating a structure of an imaging device. FIGS. 18A to 18C are circuit diagrams each illustrating a pixel. FIGS. 19A and 19B are circuit diagrams each illustrating a pixel. FIG. 20A is a block diagram of an analog-to-digital converter circuit, and FIG. 20B illustrates connection between an imaging element and the analog-to-digital converter circuit. FIG. 21A is a top view of a transistor, and FIGS. 21B and 21C are cross-sectional views thereof. FIG. 22A is a top view of a transistor, and FIGS. 22B and 22C are cro...",
  "ipcr_labels": [
    "G06N3067",
    "H04N5378",
    "G06N304",
    "H01L27146"
  ],
  "inventor_list": [
    {
      "inventor_name_last": "IKEDA",
      "inventor_name_first": "Takayuki",
      "inventor_city": "Atsugi",
      "inventor_state": "",
      "inventor_country": "JP"
    },
    {
      "inventor_name_last": "FUKUTOME",
      "inventor_name_first": "Takahiro",
      "inventor_city": "Atsugi",
      "inventor_state": "",
      "inventor_country": "JP"
    }
  ],
  "title": "IMAGING DEVICE, IMAGING MODULE, ELECTRONIC DEVICE, AND IMAGING SYSTEM",
  "decision": "PENDING",
  "_processing_info": {
    "original_size": 166872,
    "optimized_size": 3478,
    "reduction_percent": 97.92
  }
}