{
  "patent_number": "None",
  "application_number": "15660825",
  "date_published": "20180201",
  "date_produced": "20180117",
  "filing_date": "20170726",
  "main_ipcr_label": "G06N9900",
  "abstract": "A computer-implemented method, computer program product and computing system for receiving a first piece of content that has a first structure and includes a first plurality of items. A second piece of content is received that has a second structure and includes a second plurality of items. Commonality between the first piece of content and the second piece of content is identified. The first piece of content and the second piece of content are combined to form combined content that is based, at least in part, upon the identified commonality.",
  "publication_number": "US20180032913A1-20180201",
  "summary": "<SOH> SUMMARY OF DISCLOSURE <EOH>User-Teachable Metadata-Free ETL System In one implementation, a computer-implemented method is executed on a computing device and includes receiving a first piece of content that has a first structure and includes a first plurality of items. A second piece of content is received that has a second structure and includes a second plurality of items. Commonality between the first piece of content and the second piece of content is identified. The first piece of content and the second piece of content are combined to form combined content that is based, at least in part, upon the identified commonality. One or more of the following features may be included. The first structure may include a first plurality of feature categories. The second structure may include a second plurality of feature categories. Identifying commonality between the first piece of content and the second piece of content may include identifying one or more common feature categories that are present in both the first plurality of feature categories and the second plurality of feature categories. Combining the first piece of content and the second piece of content to form combined content that is based, at least in part, upon the identified commonality may include combining the first piece of content and the second piece of content to form combined content that is based, at least in part, upon the one or more common feature categories. Combining the first piece of content and the second piece of content to form combined content that is based, at least in part, upon the identified commonality may include normalizing a feature defined within the first piece of content and/or the second piece of content to define a normalized feature within the combined content. Combining the first piece of content and the second piece of content to form combined content that is based, at least in part, upon the identified commonality may include splitting a feature defined within the fi...",
  "ipcr_labels": [
    "G06N9900",
    "G06N308",
    "G06F1730"
  ],
  "inventor_list": [
    {
      "inventor_name_last": "Vigoda",
      "inventor_name_first": "Benjamin W.",
      "inventor_city": "Winchester",
      "inventor_state": "MA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Freer",
      "inventor_name_first": "Cameron E.",
      "inventor_city": "Cambridge",
      "inventor_state": "MA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Peris",
      "inventor_name_first": "Charith Srian",
      "inventor_city": "Boston",
      "inventor_state": "MA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Ring",
      "inventor_name_first": "Daniel F.",
      "inventor_city": "San Francisco",
      "inventor_state": "CA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Neely",
      "inventor_name_first": "Jacob E.",
      "inventor_city": "Watertown",
      "inventor_state": "MA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Forsythe",
      "inventor_name_first": "Martin Blood Zwirner",
      "inventor_city": "Cambridge",
      "inventor_state": "MA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Barr",
      "inventor_name_first": "Matthew C.",
      "inventor_city": "Malden",
      "inventor_state": "MA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Zimoch",
      "inventor_name_first": "Pawel Jerzy",
      "inventor_city": "Cambridge",
      "inventor_state": "MA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Rollings",
      "inventor_name_first": "Ryan C.",
      "inventor_city": "Newton",
      "inventor_state": "MA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Markovich",
      "inventor_name_first": "Thomas",
      "inventor_city": "Cambridge",
      "inventor_state": "MA",
      "inventor_country": "US"
    }
  ],
  "title": "MACHINE LEARNING DATA ANALYSIS SYSTEM AND METHOD",
  "decision": "PENDING",
  "_processing_info": {
    "original_size": 74729,
    "optimized_size": 4474,
    "reduction_percent": 94.01
  }
}