{
  "patent_number": "None",
  "application_number": "15663535",
  "date_published": "20180201",
  "date_produced": "20180117",
  "filing_date": "20170728",
  "main_ipcr_label": "G06N9900",
  "abstract": "A quantum information processing system comprises a light source, a detector, at least one spatial light modulator and at least one optical lens. The light source is configured to provide a beam of entangled photons. The at least one optical lens is configured to project the resultant beam onto the spatial light modulator, either by direct imaging or by performing a full or partial optical Fourier transform. Said spatial light modulator includes a plurality of discrete pixels and is configured to select one or more of the plurality of discrete pixels to generate a resultant beam from said beam of entangled photons. The resultant beam from said spatial light modulator is projected onto the detector. For optical computation, such as search algorithms, the configuration and projections are repeated to find the optimal solution.",
  "publication_number": "US20180032896A1-20180201",
  "summary": "<SOH> SUMMARY OF INVENTION <EOH>The following presents a simplified summary of the invention in order to provide a basic understanding of some aspects of the invention. This summary is not an extensive overview of the invention. It is not intended to identify key/critical elements of the invention or to delineate the scope of the invention. Its sole purpose is to present some concepts of the invention in a simplified form as a prelude to the more detailed description that is presented later. An exemplary quantum information processing system comprises a light source, a detector, at least one spatial light modulator, and at least one optical lens. The light source is configured to provide a beam of two or more entangled photons. The spatial light modulator includes a plurality of discrete pixels and is configured to select one or more of the plurality of discrete pixels to generate a resultant beam from said beam of entangled photons. The at least one optical lens is configured to project the resultant beam onto the detector, either by direct imaging or by performing a full or partial optical Fourier transform.",
  "ipcr_labels": [
    "G06N9900",
    "G06F1717",
    "G06F1718",
    "G06E104",
    "G06F1714"
  ],
  "inventor_list": [
    {
      "inventor_name_last": "Fleischer",
      "inventor_name_first": "Jason W.",
      "inventor_city": "Princeton",
      "inventor_state": "NJ",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Lu",
      "inventor_name_first": "Chien-Hung",
      "inventor_city": "Newark",
      "inventor_state": "CA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Sun",
      "inventor_name_first": "Xiaohang",
      "inventor_city": "Princeton",
      "inventor_state": "NJ",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Reichert",
      "inventor_name_first": "Matthew",
      "inventor_city": "Kendall Park",
      "inventor_state": "NJ",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Defienne",
      "inventor_name_first": "Hugo",
      "inventor_city": "Étang Salé",
      "inventor_state": "",
      "inventor_country": "FR"
    }
  ],
  "title": "METHOD AND SYSTEM FOR QUANTUM INFORMATION PROCESSING AND COMPUTATION",
  "decision": "PENDING",
  "_processing_info": {
    "original_size": 59606,
    "optimized_size": 3170,
    "reduction_percent": 94.68
  }
}