{
  "patent_number": "None",
  "application_number": "15662225",
  "date_published": "20180201",
  "date_produced": "20180117",
  "filing_date": "20170727",
  "main_ipcr_label": "G06N3063",
  "abstract": "The present disclosure relates to a communication method and system for converging a 5th-Generation (5G) communication system for supporting higher data rates beyond a 4th-Generation (4G) system with a technology for Internet of Things (IoT). The present disclosure may be applied to intelligent services based on the 5G communication technology and the IoT-related technology, such as smart home, smart building, smart city, smart car, connected car, health care, digital education, smart retail, security and safety services. A Processing Element (PE) implemented in an accelerator in a convolutional neural network, which includes a first buffer configured to transfer input data to one other PE, and a second buffer configured to transmit to an outside output data that is processed on the basis of the input data; and an operation unit configured to generate output data.",
  "publication_number": "US20180032859A1-20180201",
  "summary": "<SOH> BRIEF DESCRIPTION OF THE DRAWINGS <EOH>For a more complete understanding of the present disclosure and its advantages, reference is now made to the following description taken in conjunction with the accompanying drawings, in which like reference numerals represent like parts: FIG. 1 illustrates a diagram explaining the operation of an accelerator by layers and memory input/output in a convolutional neural network; FIG. 2 illustrates a block diagram illustrating the configuration of an electronic device according to an embodiment of the present disclosure; FIG. 3 illustrates a diagram explaining the operation of an accelerator by layers and memory input/output in a convolutional neural network according to an embodiment of the present disclosure; FIG. 4 illustrates a block diagram illustrating the structure of an accelerator in a convolutional neural network according to an embodiment of the present disclosure; FIG. 5 illustrates a diagram explaining the operation of an accelerator in a convolutional neural network according to an embodiment of the present disclosure; FIG. 6 illustrates a diagram explaining a method in which a Processing Element (PE) performs a pooling operation according to an embodiment of the present disclosure; FIG. 7 illustrates a diagram explaining a method in which a Processing Element (PE) performs a pooling operation according to another embodiment of the present disclosure; FIG. 8 is a flowchart illustrating a method for operating an accelerator in a convolutional neural network according to an embodiment of the present disclosure; FIG. 9 is a flowchart illustrating a method in which a PE performs a pooling operation according to an embodiment of the present disclosure; FIGS. 10 a and 10 b illustrate a diagram explaining a method in which a PE performs a pooling operation if a pooling size and a stride are equal to each other according to an embodiment of the present disclosure; and FIGS. 11 a and 11 b illustrate a diagram explaining...",
  "ipcr_labels": [
    "G06N3063",
    "G06N304"
  ],
  "inventor_list": [
    {
      "inventor_name_last": "Park",
      "inventor_name_first": "Younghwan",
      "inventor_city": "Yongin-si",
      "inventor_state": "",
      "inventor_country": "KR"
    },
    {
      "inventor_name_last": "Kim",
      "inventor_name_first": "Kyounghoon",
      "inventor_city": "Suwon-si",
      "inventor_state": "",
      "inventor_country": "KR"
    },
    {
      "inventor_name_last": "Lee",
      "inventor_name_first": "Seungwon",
      "inventor_city": "Hwaseong-si",
      "inventor_state": "",
      "inventor_country": "KR"
    },
    {
      "inventor_name_last": "Cho",
      "inventor_name_first": "Hansu",
      "inventor_city": "Hwaseong-si",
      "inventor_state": "",
      "inventor_country": "KR"
    },
    {
      "inventor_name_last": "Kim",
      "inventor_name_first": "Sukjin",
      "inventor_city": "Seoul",
      "inventor_state": "",
      "inventor_country": "KR"
    }
  ],
  "title": "ACCELERATOR IN CONVOLUTIONAL NEURAL NETWORK AND METHOD FOR OPERATING THE SAME",
  "decision": "PENDING",
  "_processing_info": {
    "original_size": 62598,
    "optimized_size": 4026,
    "reduction_percent": 93.57
  }
}