{
  "patent_number": "None",
  "application_number": "15666379",
  "date_published": "20180208",
  "date_produced": "20180124",
  "filing_date": "20170801",
  "main_ipcr_label": "G06N9900",
  "abstract": "A method includes using a computational network to learn and predict time-series data. The computational network is configured to receive the time-series data and perform transformation-invariant encoding of the time-series data. The computational network includes one or more encoding layers. The method also includes feeding back future predictions of the time-series data through inertial adjustments of transformations. The inertial adjustments preserve the invariants in the computational network. The computational network could further include one or more pooling layers each configured to reduce dimensionality of data, where the one or more pooling layers provide the transformation invariance for the encoding.",
  "publication_number": "US20180039913A1-20180208",
  "summary": "<SOH> SUMMARY <EOH>This disclosure provides systems and methods for learning and predicting time-series data using inertial auto-encoders. In a first embodiment, a method includes using a computational network to learn and predict time-series data. The computational network is configured to receive the time-series data and perform transformation-invariant encoding of the time-series data. The computational network includes one or more encoding layers. The method also includes feeding back future predictions of the time-series data through inertial adjustments of transformations. The inertial adjustments preserve the invariants in the computational network. In a second embodiment, an apparatus includes at least one processing device and at least one memory storing instructions. The instructions, when executed by the at least one processing device, cause the at least one processing device to learn and predict time-series data using a computational network. The computational network is configured to receive the time-series data and perform transformation-invariant encoding of the time-series data. The computational network includes one or more encoding layers. The instructions, when executed by the at least one processing device, also cause the at least one processing device to feed back future predictions of the time-series data through inertial adjustments of transformations. The inertial adjustments preserve the invariants in the computational network. In a third embodiment, a non-transitory computer readable medium contains instructions that, when executed by at least one processing device, cause the at least one processing device to learn and predict time-series data using a computational network. The computational network is configured to receive the time-series data and perform transformation-invariant encoding of the time-series data. The computational network includes one or more encoding layers. The medium also contains instructions that, when executed by the...",
  "ipcr_labels": [
    "G06N9900",
    "G06N504"
  ],
  "inventor_list": [
    {
      "inventor_name_last": "Burchard",
      "inventor_name_first": "Paul",
      "inventor_city": "Jersey City",
      "inventor_state": "NJ",
      "inventor_country": "US"
    }
  ],
  "title": "SYSTEMS AND METHODS FOR LEARNING AND PREDICTING TIME-SERIES DATA USING INERTIAL AUTO-ENCODERS",
  "decision": "PENDING",
  "_processing_info": {
    "original_size": 45970,
    "optimized_size": 3317,
    "reduction_percent": 92.78
  }
}