{
  "patent_number": "None",
  "application_number": "15663773",
  "date_published": "20171214",
  "date_produced": "20171129",
  "filing_date": "20170730",
  "main_ipcr_label": "G06N300",
  "abstract": "This invention deals generally with DNA-based microprocessors. In an exemplary embodiment of the invention, a DNA lattice or grid with photoreceptors forms a microprocessor and is configured to perform the functions of a series of logic gates. An input signal is supplied to the DNA lattice by shining a light signal on the lattice. The lattice performs the functions of the series of logic gates that are placed on the lattice. The lattice, in turn, supplies an augmented light output signal, which is decoded to reflect the processing by the DNA-based microprocessor.",
  "publication_number": "US20170357888A1-20171214",
  "summary": "<SOH> SUMMARY OF THE INVENTION <EOH>An exemplary embodiment of the present invention includes a DNA-based microprocessor having a plurality of DNA-transistors arranged relative to one another or bonded to one another in a grid-like assembly. Each of the plurality of DNA-transistors are comprised of a plurality of DNA-molecules configured in specific amino-acid sequences thereby replicating logic gates. The grid-like assembly is configured to receive an input signal of a pulsed electromagnetic wave. The input signal includes a first modulated data signal. The grid-like assembly is configured to, following the absorption of the first modulated data signal, emit an output signal of an electromagnetic wave comprising a second modulated data signal. The second modulated data signal is an augmentation of the first modulated data signal based upon computing operations performed by the plurality of DNA-molecules. In other exemplary embodiments, the input signal of the first modulated data signal may be based upon a quaternary numeral system. Or, the input signal of the first modulated data signal may be based upon a binary numeral system. Alternatively, the input signal of the first modulated data signal may be converted from a binary signal to a quaternary numerical system prior to being input into the DNA-based microprocessor. The logic gates or DNA-transistors may include a combination of one or more following transistor types: AND, OR, NOT, NAND, NOR, XOR or XNOR. The input signal may include more than one electromagnetic wave. The output signal may include more than one electromagnetic wave. The more than one electromagnetic wave may include more than one different frequency. The one different frequency may then allow the DNA-based microprocessor to simultaneously process multiple sequences of data. Another exemplary embodiment of the present invention includes a DNA-based transistor having a plurality of DNA-molecules configured in specific amino-acid sequences thereb...",
  "ipcr_labels": [
    "G06N300",
    "G06F1580"
  ],
  "inventor_list": [
    {
      "inventor_name_last": "Zakariaie",
      "inventor_name_first": "David Bobbak",
      "inventor_city": "Los Angeles",
      "inventor_state": "CA",
      "inventor_country": "US"
    }
  ],
  "title": "DNA COMPUTING",
  "decision": "PENDING",
  "_processing_info": {
    "original_size": 35957,
    "optimized_size": 3094,
    "reduction_percent": 91.4
  }
}