{
  "patent_number": "None",
  "application_number": "15673606",
  "date_published": "20180322",
  "date_produced": "20180308",
  "filing_date": "20170810",
  "main_ipcr_label": "G06N9900",
  "abstract": "A control unit extracts a plurality of potential features each included in at least one of a plurality of teacher data elements, from the plurality of teacher data elements. The control unit calculates the degree of importance of each potential feature in machine learning on the basis of the frequency of occurrence of the potential feature in the teacher data elements. The control unit calculates the information amount of each teacher data element on the basis of the degrees of importance of the potential features included in the teacher data element. The control unit selects teacher data elements for use in the machine learning from the teacher data elements on the basis of the information amounts of the respective teacher data elements.",
  "publication_number": "US20180082215A1-20180322",
  "summary": "<SOH> SUMMARY <EOH>According to one aspect, there is provided an information processing apparatus including: a memory configured to store therein a plurality of teacher data elements; and a processor configured to perform a process including: extracting, from the plurality of teacher data elements, a plurality of potential features each included in at least one of the plurality of teacher data elements; calculating, based on a frequency of occurrence of each of the plurality of potential features in the plurality of teacher data elements, a degree of importance of said each potential feature in machine learning; calculating an information amount of each of the plurality of teacher data elements, using degrees of importance calculated respectively for a plurality of potential features included in said each teacher data element; and selecting a teacher data element for use in the machine learning from the plurality of teacher data elements, based on information amounts of respective ones of the plurality of teacher data elements. The object and advantages of the invention will be realized and attained by means of the elements and combinations particularly pointed out in the claims. It is to be understood that both the foregoing general description and the following detailed description are exemplary and explanatory and are not restrictive of the invention.",
  "ipcr_labels": [
    "G06N9900",
    "G06N308"
  ],
  "inventor_list": [
    {
      "inventor_name_last": "Mizobuchi",
      "inventor_name_first": "Yuji",
      "inventor_city": "Kawasaki",
      "inventor_state": "",
      "inventor_country": "JP"
    }
  ],
  "title": "INFORMATION PROCESSING APPARATUS AND INFORMATION PROCESSING METHOD",
  "decision": "PENDING",
  "_processing_info": {
    "original_size": 61544,
    "optimized_size": 2687,
    "reduction_percent": 95.63
  }
}