{
  "patent_number": "None",
  "application_number": "15672146",
  "date_published": "20171214",
  "date_produced": "20171129",
  "filing_date": "20170808",
  "main_ipcr_label": "G06N9900",
  "abstract": "An automated Web portal template generation method includes parsing, via a parser subsystem, a number of Webpages of a first Website from which a Web portal template to be customized is to be accessed. The method further includes producing an entity feature set for the first Website based on a result of the parsing and processing the entity feature set for the first Website via a classifier subsystem to produce a set of data that represents, for each of a plurality of entities, a respective probability of the entity belonging to a respective one of a plurality of classes. The method additionally includes performing, by a color matching subsystem, color matching on the set of data produced by the classifier subsystem to generate a number of proposed color combinations for a proposed customization of the Web portal template.",
  "publication_number": "US20170357913A1-20171214",
  "summary": "<SOH> BRIEF SUMMARY <EOH>Data and/or services may be provided using a Web portal. However, the aesthetic and organizational aspects or characteristics of a Web portal may not match or conform to that of a given Website. This is particularly a problem where the Web portal is sourced from a third party provider (i.e., an entity that is different from the entity which operates the Website or for which the Website is operated). Often times, Web designers responsible for a given Website ignore the inconsistencies between the Web portal and the “native” Webpages of the Website. Alternatively, the Web designers may painstakingly create or modify the aesthetic and organizational aspects or characteristics of the Web portal in an attempt to match that of the native Webpages of the Website. Such effort helps to provide a consistent Website provider identity and consumer interface, ensuring a smooth user experience, and creating a seamless integration experience for the Web user. Described herein are systems, devices, articles and methods which employ Web portal templates, and customize the Web portal templates according to target Websites which will employ the corresponding Web portals. These may advantageously automate the creation of customized Web portal templates that provide third party supplied content and/or services with aesthetic and/or organizational aspects or characteristics consistent with other native Webpages of a Website of an entity. Such an automated Web portal template generation process improves Web user experience by providing a consistent “look and feel” across a Website, regardless of the point of origin of the data provided via the Website. With the advent of various form factor electronic devices (e.g., desktop monitors, laptop computers, netbook computers, tablet computers, smartphones, and wearable computer and/or display devices such as Google Glass® or the Pebble® smartwatch) the problem of maintaining consistent Website appearance and functionali...",
  "ipcr_labels": [
    "G06N9900",
    "G06F1727",
    "G06F1724",
    "G06F1722",
    "G06F1730"
  ],
  "inventor_list": [
    {
      "inventor_name_last": "Garrison",
      "inventor_name_first": "Sara",
      "inventor_city": "Woodinville",
      "inventor_state": "WA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Sinyagin",
      "inventor_name_first": "Aleksey",
      "inventor_city": "Redmond",
      "inventor_state": "WA",
      "inventor_country": "US"
    }
  ],
  "title": "AUTOMATED CUSTOMIZED WEB PORTAL TEMPLATE GENERATION SYSTEMS AND METHODS",
  "decision": "PENDING",
  "_processing_info": {
    "original_size": 135658,
    "optimized_size": 3624,
    "reduction_percent": 97.33
  }
}