{
  "patent_number": "None",
  "application_number": "15670453",
  "date_published": "20180208",
  "date_produced": "20180124",
  "filing_date": "20170807",
  "main_ipcr_label": "G06N302",
  "abstract": "A method for assigning a personalized aesthetic score to an image is provided. The method includes providing a base neural network for generating learned features. The base neural network is trained on a first set of training images and the base neural network includes two or more layers comprising one or more initial layers and one or more final layers. The method further includes receiving a second set of training images and updating the base neural network to generate a personalized neural network based on the received second set of training images. Updating the base neural network comprises re-training the final layers of the base neural network with the second set of images and keeping the initial layers of the base neural network, such that the personalized neural network includes two or more layers comprising one or more initial layers and one or more final layers.",
  "publication_number": "US20180039879A1-20180208",
  "summary": "<SOH> SUMMARY OF THE INVENTION <EOH>Accordingly, systems, methods, and computer program products addressing the above-described problems are described herein.",
  "ipcr_labels": [
    "G06N302",
    "G06K962",
    "G06K946",
    "G06F1730"
  ],
  "inventor_list": [
    {
      "inventor_name_last": "SHAJI",
      "inventor_name_first": "Appu",
      "inventor_city": "Berlin",
      "inventor_state": "",
      "inventor_country": "DE"
    },
    {
      "inventor_name_last": "RIZK",
      "inventor_name_first": "Ramzi",
      "inventor_city": "Berlin",
      "inventor_state": "",
      "inventor_country": "DE"
    },
    {
      "inventor_name_last": "YILDIRIM",
      "inventor_name_first": "Gökhan",
      "inventor_city": "Berlin",
      "inventor_state": "",
      "inventor_country": "DE"
    }
  ],
  "title": "SYSTEMS, METHODS, AND COMPUTER PROGRAM PRODUCTS FOR SEARCHING AND SORTING IMAGES BY AESTHETIC QUALITY PERSONALIZED TO USERS OR SEGMENTS",
  "decision": "PENDING",
  "_processing_info": {
    "original_size": 55620,
    "optimized_size": 1977,
    "reduction_percent": 96.45
  }
}