{
  "patent_number": "None",
  "application_number": "15685854",
  "date_published": "20180301",
  "date_produced": "20180213",
  "filing_date": "20170824",
  "main_ipcr_label": "G06N9900",
  "abstract": "A data annotation apparatus for machine learning is provided, which includes a stimulus generation portion, a biometrics reading portion, and a data integration portion. The stimulus generation portion is configured to generate, and present to an agent, at least one stimulus based on a first data from a first machine learning dataset. The biometrics reading portion is configured to measure at least one response of the agent to the at least one stimulus, and to generate biometrics data based on the at least one response. The data integration portion is configured to integrate the biometrics data, data of the at least one stimulus, and data of the first machine learning dataset to thereby obtain a second machine learning dataset. The data annotation apparatus can result in an improved data labeling and an enhanced machine learning.",
  "publication_number": "US20180060757A1-20180301",
  "summary": "<SOH> SUMMARY OF THE INVENTION <EOH>The present disclosure provides a machine learning data annotation apparatus, an artificial intelligence machine learning assembly, and a method for enhanced machine learning. In a first aspect, the present disclosure provides a data annotation apparatus for machine learning. The data annotation apparatus includes a stimulus generation portion, a biometrics reading portion, and a data integration portion. The stimulus generation portion is configured to generate, and present to an agent, at least one stimulus based on a first data from a first machine learning dataset. The biometrics reading portion is configured to measure at least one response of the agent to the at least one stimulus, and to generate biometrics data based on the at least one response. The data integration portion is configured to integrate the biometrics data, data of the at least one stimulus, and data of the first machine learning dataset to thereby obtain a second machine learning dataset. Herein the stimulus generation portion can include a stimulus presenting sub-portion, which is configured to present to the agent the at least one stimulus based on the first data from the first machine learning dataset. In the data annotation apparatus as described above, the stimulus generation portion can further include a stimulus preparing sub-portion, which is configured to process the first data from the first machine learning dataset to thereby generate at least one stimulus data suitable for presentation by the stimulus presenting sub-portion. Accordingly, the stimulus presenting sub-portion is further configured, based on the at least one stimulus data, to present to the agent the at least one stimulus. Herein each of the at least one stimulus corresponds to one of the at least one stimulus data. In the data annotation apparatus, the stimulus presenting sub-portion can include at least one stimulus presenting device. Each of the at least one stimulus presenting d...",
  "ipcr_labels": [
    "G06N9900",
    "G06F301"
  ],
  "inventor_list": [
    {
      "inventor_name_last": "LI",
      "inventor_name_first": "Qiang",
      "inventor_city": "Santa Clara",
      "inventor_state": "CA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "SAVARESE",
      "inventor_name_first": "Silvio",
      "inventor_city": "Santa Clara",
      "inventor_state": "CA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "JANKOWSKI, JR.",
      "inventor_name_first": "Charles Robert",
      "inventor_city": "Santa Clara",
      "inventor_state": "CA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "HUANG",
      "inventor_name_first": "William Xiao-Qing",
      "inventor_city": "Santa Clara",
      "inventor_state": "CA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "ZHANG",
      "inventor_name_first": "Zhe",
      "inventor_city": "Santa Clara",
      "inventor_state": "CA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "FERN",
      "inventor_name_first": "Xiaoli",
      "inventor_city": "Santa Clara",
      "inventor_state": "CA",
      "inventor_country": "US"
    }
  ],
  "title": "DATA ANNOTATION METHOD AND APPARATUS FOR ENHANCED MACHINE LEARNING",
  "decision": "PENDING",
  "_processing_info": {
    "original_size": 82745,
    "optimized_size": 4173,
    "reduction_percent": 94.96
  }
}