{
  "patent_number": "None",
  "application_number": "15686687",
  "date_published": "20180503",
  "date_produced": "20180418",
  "filing_date": "20170825",
  "main_ipcr_label": "G06N700",
  "abstract": "A system for forecasting the drying of an agricultural crop includes an electronic processor configured to receive weather data associated with an agricultural field and receive an agricultural field parameter from a field sensor associated with the agricultural field. The electronic processor is also configured to determine a drying score for each of a plurality of harvest times based on the weather data and the agricultural field parameter. The electronic processor is also configured to determine a recommended harvest time for harvesting the agricultural crop based on the drying score, wherein the recommended harvest time is included in the plurality of harvest times. The electronic processor is also configured to output a forecast for the agricultural crop for display to a user, wherein the forecast includes the drying score and the recommended harvest time for harvesting the agricultural crop.",
  "publication_number": "US20180121821A1-20180503",
  "summary": "<SOH> SUMMARY <EOH>In most climates, providing a dry agricultural crop, such as hay, involves a lot of risk due to the limited and variable time periods between rains and the large variation in drying rates at any given time. Commonly available tools, such as local weather forecasts, may aid in estimating a time period between rains at a given time and location. However, there are no commonly available tools for forecasting how fast an agricultural crop will dry at a given time and location. Such a drying forecast tool may mitigate the risks involved in providing a dry agricultural crop and may improve the chances of successfully providing a dry agricultural crop. Accordingly, embodiments described herein relate to forecasting the drying of an agricultural crop. For example, one embodiment provides a system for forecasting the drying of an agricultural crop. The system includes an electronic processor configured to receive weather data associated with an agricultural field and receive an agricultural field parameter from a field sensor associated with the agricultural field. The electronic processor is also configured to determine a drying score for each of a plurality of harvest times based on the weather data and the agricultural field parameter. The electronic processor is also configured to determine a recommended harvest time for harvesting the agricultural crop based on the drying score, wherein the recommended harvest time is included in the plurality of harvest times. The electronic processor is also configured to output a forecast for the agricultural crop for display to a user, wherein the forecast includes the drying score and the recommended harvest time for harvesting the agricultural crop. Another embodiment provides a method for forecasting the drying of an agricultural crop. The method includes receiving, with an electronic processor, weather data associated with an agricultural field and receiving, with the electronic processor, an agricultural fiel...",
  "ipcr_labels": [
    "G06N700"
  ],
  "inventor_list": [
    {
      "inventor_name_last": "Parsons",
      "inventor_name_first": "Stephen K.",
      "inventor_city": "Moline",
      "inventor_state": "IL",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Graeve",
      "inventor_name_first": "Joshua D.",
      "inventor_city": "Moline",
      "inventor_state": "IL",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Rotole",
      "inventor_name_first": "David V.",
      "inventor_city": "Bloomfield",
      "inventor_state": "IA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Hill",
      "inventor_name_first": "Kellen B.",
      "inventor_city": "Moline",
      "inventor_state": "IL",
      "inventor_country": "US"
    }
  ],
  "title": "METHODS AND SYSTEMS OF FORECASTING THE DRYING OF AN AGRICULTURAL CROP",
  "decision": "PENDING",
  "_processing_info": {
    "original_size": 60060,
    "optimized_size": 3912,
    "reduction_percent": 93.49
  }
}