{
  "patent_number": "None",
  "application_number": "15686452",
  "date_published": "20180201",
  "date_produced": "20180117",
  "filing_date": "20170825",
  "main_ipcr_label": "G06N504",
  "abstract": "Methods, apparatus, and systems for analyzing data trends are described herein. The present disclosure includes the identification of trending terms in data through the use of an unsupervised algorithm. Trending terms are identified and counted during a first and second time period without reference to a library of pre-defined terms, along with at least one reason for using such trending terms. The set of trending terms and the at least one reason for use of the trending terms are displayed to a user.",
  "publication_number": "US20180032886A1-20180201",
  "summary": "<SOH> SUMMARY <EOH>The present disclosure describes methods and systems of analyzing trends in data relationships. In a first aspect, the present disclosure encompasses a system for analyzing data relating to trends, which includes a processor, an analysis module, wherein the analysis module is a non-transitory computer readable medium operably connected to the processor, wherein the non-transitory computer readable medium comprises a plurality of instructions stored in association therewith that are accessible to, and executable by, the processor, wherein the plurality of instructions when executed: analyze a first plurality of communications occurring over a first time period; determine a first plurality of terms based on the analyzed first plurality of communications; analyze a second plurality of communications occurring over a second time period; determine a second plurality of terms based on the analyzed second plurality of communications; identify trending terms based on the determined first plurality of terms and the determined second plurality of terms; review the identified trending terms to determine at least one reason for use of the identified trending terms in the first time period, the second time period, or both; and communicate the identified trending terms and the at least one reason for use of the identified trending terms to a user, a display device configured to display the identified trending terms and the at least one reason for use of the identified trending terms to the user, and a routing engine configured to send an automated message to an external source based on the at least one reason for use of the identified trending terms. In a second aspect, the present disclosure encompasses a method of analyzing data related to trends, which includes recording, by one or more processors, a first plurality of communications occurring over a first time period, determining a first plurality of terms based on the first plurality of communications, rec...",
  "ipcr_labels": [
    "G06N504",
    "G06N9900"
  ],
  "inventor_list": [
    {
      "inventor_name_last": "Danson",
      "inventor_name_first": "Christopher",
      "inventor_city": "Austin",
      "inventor_state": "TX",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Brown",
      "inventor_name_first": "Douglas",
      "inventor_city": "Austin",
      "inventor_state": "TX",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Warford",
      "inventor_name_first": "Roger",
      "inventor_city": "Hoschton",
      "inventor_state": "GA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Traba",
      "inventor_name_first": "Andrew",
      "inventor_city": "Chicago",
      "inventor_state": "IL",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Heller",
      "inventor_name_first": "Jordana",
      "inventor_city": "Chicago",
      "inventor_state": "IL",
      "inventor_country": "US"
    }
  ],
  "title": "TREND BASIS AND BEHAVIORAL ANALYTICS SYSTEM AND METHODS",
  "decision": "PENDING",
  "_processing_info": {
    "original_size": 106987,
    "optimized_size": 3644,
    "reduction_percent": 96.59
  }
}