{
  "patent_number": "None",
  "application_number": "15689744",
  "date_published": "20171221",
  "date_produced": "20171207",
  "filing_date": "20170829",
  "main_ipcr_label": "G06N504",
  "abstract": "A method to predict whether a particular fungus will be observed by a scout checking on a particular crop at a particular location on a particular date. The method using a set of previous scouting reports and weather information for the particular location, including weather information for a period of time before the particular date.",
  "publication_number": "US20170364816A1-20171221",
  "summary": "<SOH> SUMMARY OF THE DISCLOSURE <EOH>Aspects of the teachings contained within this disclosure are addressed in the claims submitted with this application upon filing. Rather than adding redundant restatements of the contents of the claims, these claims should be considered incorporated by reference into this summary. This summary is meant to provide an introduction to the concepts that are disclosed within the specification without being an exhaustive list of the many teachings and variations upon those teachings that are provided in the extended discussion within this disclosure. Thus, the contents of this summary should not be used to limit the scope of the claims that follow. Inventive concepts are illustrated in a series of examples, some examples showing more than one inventive concept. Individual inventive concepts can be implemented without implementing all details provided in a particular example. It is not necessary to provide examples of every possible combination of the inventive concepts provide below as one of skill in the art will recognize that inventive concepts illustrated in various examples can be combined together in order to address a specific application. Other systems, methods, features and advantages of the disclosed teachings will be immediately apparent or will become apparent to one with skill in the art upon examination of the following figures and detailed description. It is intended that all such additional systems, methods, features and advantages be included within the scope of and be protected by the accompanying claims. Aspects of the present disclosure may be summarized as an alternative to finding the parametric impact of any one variable as is traditionally done in regression. Instead of using statistical techniques to estimate the unique impacts of individual variables, the methodologies set forth in this disclosure is somewhat akin to the process of pattern recognition. Essentially the statistical question to be addressed is h...",
  "ipcr_labels": [
    "G06N504",
    "G06Q5002",
    "G06Q1006"
  ],
  "inventor_list": [
    {
      "inventor_name_last": "Marticorena",
      "inventor_name_first": "Drew Chandler William",
      "inventor_city": "Durham",
      "inventor_state": "NC",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Corbett",
      "inventor_name_first": "John Dorschel",
      "inventor_city": "Denver",
      "inventor_state": "CO",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Allen",
      "inventor_name_first": "Daniel Joel",
      "inventor_city": "Greensboro",
      "inventor_state": "NC",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Collis",
      "inventor_name_first": "Stewart Neville",
      "inventor_city": "Carrboro",
      "inventor_state": "NC",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Landon",
      "inventor_name_first": "Kristopher Thomas Michael",
      "inventor_city": "Wake Forest",
      "inventor_state": "NC",
      "inventor_country": "US"
    }
  ],
  "title": "Prediction of Discernible Fungus Establishment on a Crop",
  "decision": "PENDING",
  "_processing_info": {
    "original_size": 89703,
    "optimized_size": 3549,
    "reduction_percent": 96.04
  }
}