{
  "patent_number": "None",
  "application_number": "15684293",
  "date_published": "20180301",
  "date_produced": "20180213",
  "filing_date": "20170823",
  "main_ipcr_label": "G06N504",
  "abstract": "A heterogeneous log pattern editing recommendation system and computer-implemented method are provided. The system has a processor configured to identify, from heterogeneous logs, patterns including variable fields and constant fields. The processor is also configured to extract a category feature, a cardinality feature, and a before-after n-gram feature by tokenizing the variable fields in the identified patterns. The processor is additionally configured to generate target similarity scores between target fields to be potentially edited and other fields from among the variable fields in the heterogeneous logs using pattern editing operations based on the extracted category feature, the extracted cardinality feature, and the extracted before-after n-gram feature. The processor is further configured to recommend, to a user, log pattern edits for at least one of the target fields based on the target similarity scores between the target fields in the heterogeneous logs.",
  "publication_number": "US20180060748A1-20180301",
  "summary": "<SOH> SUMMARY <EOH>According to an aspect of the present principles, a computer-implemented heterogeneous log pattern editing recommendation method performed in a network having network devices that generate heterogeneous logs is provided. The method includes identifying, by a processor from the heterogeneous logs, patterns comprising variable fields and constant fields. The method also includes extracting, by the processor, a category feature, a cardinality feature, and a before-after n-gram feature by tokenizing the variable fields in the identified patterns. The method additionally includes generating, by the processor, target similarity scores between target fields to be potentially edited and other fields from among the variable fields in the heterogeneous logs using pattern editing operations based on the extracted category feature, the extracted cardinality feature, and the extracted before-after n-gram feature. The method further includes recommending, by the processor to a user, log pattern edits for at least one of the target fields based on the target similarity scores between the target fields in the heterogeneous logs. According to another aspect of the present principles, a heterogeneous log pattern editing recommendation system deployed in a network having network devices that generate heterogeneous logs is provided. The system includes a server having a processor. The processor is configured to identify, from the heterogeneous logs, patterns comprising variable fields and constant fields. The processor is also configured to extract a category feature, a cardinality feature, and a before-after n-gram feature by tokenizing the variable fields in the identified patterns. The processor is additionally configured to generate target similarity scores between target fields to be potentially edited and other fields from among the variable fields in the heterogeneous logs using pattern editing operations based on the extracted category feature, the extracted ...",
  "ipcr_labels": [
    "G06N504",
    "G06N700",
    "G06F1716"
  ],
  "inventor_list": [
    {
      "inventor_name_last": "Xu",
      "inventor_name_first": "Jianwu",
      "inventor_city": "Lawrenceville",
      "inventor_state": "NJ",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Debnath",
      "inventor_name_first": "Biplob",
      "inventor_city": "Princeton",
      "inventor_state": "NJ",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Zong",
      "inventor_name_first": "Bo",
      "inventor_city": "Plainsboro",
      "inventor_state": "NJ",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Zhang",
      "inventor_name_first": "Hui",
      "inventor_city": "Princeton Junction",
      "inventor_state": "NJ",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Jiang",
      "inventor_name_first": "Guofei",
      "inventor_city": "Princeton",
      "inventor_state": "NJ",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Ge",
      "inventor_name_first": "Hancheng",
      "inventor_city": "College Station",
      "inventor_state": "TX",
      "inventor_country": "US"
    }
  ],
  "title": "RECOMMENDER SYSTEM FOR HETEROGENEOUS LOG PATTERN EDITING OPERATION",
  "decision": "PENDING",
  "_processing_info": {
    "original_size": 53316,
    "optimized_size": 4298,
    "reduction_percent": 91.94
  }
}