{
  "patent_number": "None",
  "application_number": "15682946",
  "date_published": "20180222",
  "date_produced": "20180207",
  "filing_date": "20170822",
  "main_ipcr_label": "G06N308",
  "abstract": "An integrated and comprehensive method and system is disclosed for management and optimization of innovation and associated processes under uncertainty. A first embodiment of the invention consists of a data mining and clustering module to compare a new innovation submission with existing internal and external entries and databases, identify similarities and group similar entries together. A second embodiment of the invention is directed towards an intelligent machine learning module to learn from the available data of previous innovation projects and provide estimates of outputs or target values for new innovation submissions or entries. In a third embodiment of the invention, an uncertainty quantification method and system is introduced to handle uncertain inputs of innovation entries and provide probabilistic estimates of outputs by generating a plurality of solutions and scenarios. In a fourth embodiment of the invention, a multiobjective optimization module is used to simultaneous...",
  "publication_number": "US20180053092A1-20180222",
  "summary": "<SOH> SUMMARY OF THE INVENTION <EOH>Accordingly, this document discloses a system and method for automated categorization and classification of innovation entries. In order to accomplish this, an innovation gathering system is used where a user interacts with the system via an interface to input ideas and innovations. Example inputs can be of different media types including text, audio, images, videos, and alike. In one embodiment, data from previous ideas, technologies, innovations or projects may be captured and analyzed in order to identify similar metrics, objectives, targets, steps and workflows for each category of innovation submissions. Upon submission of a new entry, the system may query the database in order to find similar documents, media, and/or workflows using a data mining module. The models used for prediction of possible outcomes and the input parameters to those models both carry uncertainty associated with lack of knowledge. One or more embodiments of this invention obtain a set of representative values for the model parameter having uncertain values. The solution includes optimal value for the control variables. In any product or service development, uncertainties are expressed in the form of probability density functions of the decision variables and are systematically propagated through the workflow by generating probability density functions or cumulative distribution functions of the input parameters, and by using multiple runs of mathematical models and simulation tools to thus transform the first set of parameters into output variables with uncertainties. Various graphs, charts, plots, or other visual representation of uncertainty is used to make optimal decisions in identifying the best ideas for further steps (e.g. consideration, implementation, resource allocation and alike). A further object of the invention is a novel and efficient system and method for multiobjective optimization of innovation and technology management operations and ...",
  "ipcr_labels": [
    "G06N308",
    "G06N700",
    "G06N502",
    "G06F1730"
  ],
  "inventor_list": [
    {
      "inventor_name_last": "Hajizadeh",
      "inventor_name_first": "Yasin",
      "inventor_city": "Houston",
      "inventor_state": "TX",
      "inventor_country": "US"
    }
  ],
  "title": "Method and System for Innovation Management and Optimization Under Uncertainty",
  "decision": "PENDING",
  "_processing_info": {
    "original_size": 78909,
    "optimized_size": 3604,
    "reduction_percent": 95.43
  }
}