{
  "patent_number": "None",
  "application_number": "15687001",
  "date_published": "20180315",
  "date_produced": "20180228",
  "filing_date": "20170825",
  "main_ipcr_label": "G06N504",
  "abstract": "Conventional techniques for automatically evaluating and grading assignments are generally ill-suited to evaluation of coursework submitted in media-rich form. For courses whose subject includes programming, signal processing or other functionally expressed designs that operate on, or are used to produce media content, conventional techniques are also ill-suited. It has been discovered that media-rich, indeed even expressive, content can be accommodated as, or as derivatives of, coursework submissions using feature extraction and machine learning techniques. Accordingly, in on-line course offerings, even large numbers of students and student submissions may be accommodated in a scalable and uniform grading or scoring scheme. Instructors or curriculum designers may adaptively refine assignments or testing based on classifier feedback. Using developed techniques, it is possible to administer courses and automatically grade submitted work that takes the form of media encodings of artistic...",
  "publication_number": "US20180075358A1-20180315",
  "summary": "<SOH> SUMMARY <EOH>For courses that deal with media content, such as sound, music, photographic images, hand sketches, video (including videos of dance, acting, and other performances, computer animations, music videos, and artistic video productions), conventional techniques for automatically evaluating and grading assignments are generally ill-suited to direct evaluation of coursework submitted in media-rich form. Likewise, for courses whose subject includes programming, signal processing or other functionally-expressed designs that operate on, or are used to produce media content, conventional techniques are also ill-suited. Instead, it has been discovered that media-rich, indeed even expressive, content can be accommodated as, or as derivatives of, coursework submissions using feature extraction and machine learning techniques. In this way, e.g., in on-line course offerings, even large numbers of students and student submissions may be accommodated in a scalable and uniform grading or scoring scheme. Instructors or curriculum designers may adaptively refine their assignments or testing based on classifier feedback. Using the developed techniques, it is possible to administer courses and automatically grade submitted work that takes the form of media encodings of artistic expression, computer programming and even signal processing to be applied to media content. In some embodiments in accordance with the present invention(s), a method is provided for use in connection with automated evaluation of coursework submissions. The method includes receiving from an instructor or curriculum designer a selection of exemplary media content to be used in evaluating the coursework submissions. The exemplary media content includes a training set of examples each assigned at least one quality score by the instructor or curriculum designer. The method further includes accessing computer readable encodings of the exemplary media content that together constitute the training set a...",
  "ipcr_labels": [
    "G06N504",
    "G06N9900"
  ],
  "inventor_list": [
    {
      "inventor_name_last": "Kapur",
      "inventor_name_first": "Ajay",
      "inventor_city": "Valencia",
      "inventor_state": "CA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Cook",
      "inventor_name_first": "Perry Raymond",
      "inventor_city": "Jacksonville",
      "inventor_state": "OR",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Hochenbaum",
      "inventor_name_first": "Jordan",
      "inventor_city": "Valencia",
      "inventor_state": "CA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Honigman",
      "inventor_name_first": "Colin Bennett",
      "inventor_city": "Los Angeles",
      "inventor_state": "CA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Vallis",
      "inventor_name_first": "Owen Skipper",
      "inventor_city": "Valencia",
      "inventor_state": "CA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Wagner",
      "inventor_name_first": "Chad A.",
      "inventor_city": "Pasadena",
      "inventor_state": "CA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Heep",
      "inventor_name_first": "Eric Christopher",
      "inventor_city": "Val Verde",
      "inventor_state": "CA",
      "inventor_country": "US"
    }
  ],
  "title": "FEATURE EXTRACTION AND MACHINE LEARNING FOR EVALUATION OF MEDIA-RICH COURSEWORK",
  "decision": "PENDING",
  "_processing_info": {
    "original_size": 113756,
    "optimized_size": 4496,
    "reduction_percent": 96.05
  }
}