{
  "patent_number": "None",
  "application_number": "15688970",
  "date_published": "20171214",
  "date_produced": "20171129",
  "filing_date": "20170829",
  "main_ipcr_label": "G06N502",
  "abstract": "The one or more embodiments disclosed herein provide a method for automatically assembling multiple compounds into a single edible custom composition, in which each compound is individually customized to proportions formulated from a profile of an individual or group. The single custom mixture can contain a plurality of compounds including foods or flavors, nutritional additives, herbals, biologics, or pharmacologically active substances. Using the method and a related algorithm, the formulation of a custom mixture is suggested.",
  "publication_number": "US20170357899A1-20171214",
  "summary": "<SOH> SUMMARY <EOH>This Summary is provided to introduce a selection of concepts in a simplified form that are further described below in the Detailed Description of Illustrative Embodiments. This Summary is not intended to identify key features or essential features of the claimed subject matter, nor is it intended to be used to limit the scope of the claimed subject matter. The one or more embodiments disclosed herein provide a method for automatically assembling multiple components into a single edible custom composition, in which each component is individually customized to proportions formulated from a profile of an individual or group. The single custom mixture can contain a plurality of components including foods or flavors, nutritional additives, herbals, biologics, or pharmacologically active substances. Using the method and a related algorithm, the formulation of a custom mixture is suggested. According to one or more embodiments, the one or more embodiments encompass six subsystems. One of the subsystems may include a database of the physical parameters of an individual along with several or all vital health conditions, including family history, consumption of supplements and pharmaceuticals, and genetic profile of same individual. These may be generated via online questionnaire completed by the individual or advisor, deciphered from medical or family history records, or results of levels of various compounds as determined by laboratory tests or in-situ instrumentation or tests and known or suspected allergens. One of the subsystems includes a database of a multitude of commonly consumed nutritional, biologic, and pharmaceutical compounds with normative dose data, contraindications, depletions, and graded research indicating science evidence correlation score to health conditions. One of the subsystems may include a formulation algorithm implemented in software that automatically cross correlates the health conditions of the individual profile to the comp...",
  "ipcr_labels": [
    "G06N502",
    "A61J300",
    "A61J106",
    "G06F1900"
  ],
  "inventor_list": [
    {
      "inventor_name_last": "Hudson",
      "inventor_name_first": "Edison Thurman",
      "inventor_city": "Chapel Hill",
      "inventor_state": "NC",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Noel",
      "inventor_name_first": "Lloyd Staton",
      "inventor_city": "Durham",
      "inventor_state": "NC",
      "inventor_country": "US"
    }
  ],
  "title": "APPARATUS AND MACHINE FOR MAKING CUSTOMIZED FORMULATIONS HAVING A THIXOTROPIC HYDROCOLLOID FOR INDIVIDUALS",
  "decision": "PENDING",
  "_processing_info": {
    "original_size": 68943,
    "optimized_size": 3321,
    "reduction_percent": 95.18
  }
}