{
  "patent_number": "None",
  "application_number": "15686954",
  "date_published": "20180329",
  "date_produced": "20180315",
  "filing_date": "20170825",
  "main_ipcr_label": "G06N9900",
  "abstract": "A computing device may receive a communication sent from an external computing device. At least one processor of the computing device may determine, using an on-device machine-trained model and based at least in part on the communication, one or more candidate responses to the communication. The at least one processor may receive an indication of a user input that selects a candidate response from the one or more candidate responses. Responsive to receiving the indication of the user input that selects the candidate response, the at least one processor may send the candidate response to the external computing device.",
  "publication_number": "US20180089588A1-20180329",
  "summary": "<SOH> SUMMARY <EOH>Aspects of the present disclosure are directed to providing candidate responses to reply to a received communication based on an on-device machine-trained model. That is, according to techniques of the present disclosure, a computing device may receive a communication from a remote computing device. The computing device may determine one or more candidate responses that are relevant to a received communication based on inputting the received communication into an on-device machine-trained model, and to output the one or more candidate responses. In response to receiving an indication of user input that selects one of the one or more candidate responses, the computing device may send the selected candidate response to the remote computing device to respond to the received communication. In one aspect, the disclosure is directed to a method. The method includes receiving, by at least one processor of a computing device, a communication sent from an external computing device. The method further includes determining, by the at least one processor using an on-device machine-trained model and based at least in part on the communication, one or more candidate responses to the communication. The method further includes receiving, by the at least one processor, an indication of a user input that selects a candidate response from the one or more candidate responses. The method further includes responsive to receiving the indication of the user input that selects the candidate response, sending, by the at least one processor, the candidate response to the external computing device. In another aspect, the disclosure is directed to a computing device. The computing device includes a memory configured to store an on-device machine-trained model. The computing device further includes at least one processor operably coupled to the memory and configured to: receive a communication sent from an external computing device; determine, using the on-device machine-train...",
  "ipcr_labels": [
    "G06N9900",
    "G06N504",
    "G06F708"
  ],
  "inventor_list": [
    {
      "inventor_name_last": "Ravi",
      "inventor_name_first": "Sujith",
      "inventor_city": "Santa Clara",
      "inventor_state": "CA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Rudick",
      "inventor_name_first": "Thomas Matthew",
      "inventor_city": "Cambridge",
      "inventor_state": "MA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Beach",
      "inventor_name_first": "Nathan Dickerson",
      "inventor_city": "Somerville",
      "inventor_state": "MA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "McGregor, JR.",
      "inventor_name_first": "John Patrick",
      "inventor_city": "Menlo Park",
      "inventor_state": "CA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Ranieri",
      "inventor_name_first": "Mirko",
      "inventor_city": "Cambridge",
      "inventor_state": "MA",
      "inventor_country": "US"
    }
  ],
  "title": "SMART REPLIES USING AN ON-DEVICE MODEL",
  "decision": "PENDING",
  "_processing_info": {
    "original_size": 142800,
    "optimized_size": 3795,
    "reduction_percent": 97.34
  }
}