{
  "patent_number": "None",
  "application_number": "15683377",
  "date_published": "20171207",
  "date_produced": "20171121",
  "filing_date": "20170822",
  "main_ipcr_label": "G06N504",
  "abstract": "An embodiment for a computing device is described herein. The computing device may include a word database enhancer, a recommendation engine, a keyboard monitor, a ranking and display manager, and a keyboard. The keyboard may be a configurable physical keyboard device that includes an embedded display, where the embedded display is a runtime configurable display. The keyboard may display configurable images in the form of auto-text completion text or a decrypted password. The keyboard may also include a microcontroller, a touch sensor, and a keyboard filter driver.",
  "publication_number": "US20170351960A1-20171207",
  "summary": "<SOH> BRIEF DESCRIPTION OF THE DRAWINGS <EOH>FIG. 1 is a block diagram of a computing device that displays a runtime configurable display on a keyboard. FIG. 2 is a block diagram for an auto-complete recommendation service. FIG. 3 is a block diagram of the architecture for the display of an image on a keycap on a keyboard. FIGS. 4A and 4B each illustrate displaying a runtime created image on a space bar of a keyboard and selecting the runtime created image on the keyboard. FIGS. 5A and 5B each illustrate a visual layer of a keyboard and a scan code layer of the keyboard. FIGS. 6A and 6B each illustrate displaying a hidden password as asterisks on a space bar of a keyboard and an actual display of the runtime created and decrypted image of the password on the keyboard. FIG. 7 is a process flow diagram of a method for displaying a runtime configurable display. FIG. 8 is a block diagram showing a tangible, non-transitory, computer readable storage medium that stores code to display a runtime configurable display. detailed-description description=\"Detailed Description\" end=\"lead\"?",
  "ipcr_labels": [
    "G06N504",
    "G06F302",
    "G06F3023",
    "G06F2183",
    "G06F1727",
    "G06F2100",
    "G06F2184"
  ],
  "inventor_list": [
    {
      "inventor_name_last": "Mahajan",
      "inventor_name_first": "Ayeshwarya",
      "inventor_city": "Bangalore",
      "inventor_state": "",
      "inventor_country": "IN"
    },
    {
      "inventor_name_last": "Pendakur",
      "inventor_name_first": "Ramesh",
      "inventor_city": "Gaston",
      "inventor_state": "OR",
      "inventor_country": "US"
    }
  ],
  "title": "RUN-TIME IMAGE DISPLAY ON A DEVICE",
  "decision": "PENDING",
  "_processing_info": {
    "original_size": 37541,
    "optimized_size": 2408,
    "reduction_percent": 93.59
  }
}