{
  "patent_number": "None",
  "application_number": "15682454",
  "date_published": "20171228",
  "date_produced": "20171213",
  "filing_date": "20170821",
  "main_ipcr_label": "G06N9900",
  "abstract": "In embodiments of the present invention improved capabilities are described for developing, training, validating and deploying discovery avatars embodying mathematical models that may be used for document and data discovery and deployed within large data repositories. For example, an avatar may be constructed by machine learning processes, including by processing information related to what types of information analysts find useful in large data sets. Once constructed, an avatar may be deployed as an aid to human intuition in a wide range of analytical processes, such as related to national security, enterprise management (e.g., programs related to sales, marketing, product, promotions, placement, pricing and the like), dispute resolution (including litigation), forensic analysis, criminal, administrative, civil and private investigations, scientific investigations, research and development, and a wide range of others.",
  "publication_number": "US20170372233A1-20171228",
  "summary": "<SOH> SUMMARY <EOH>Provided herein are methods and systems for building, modifying, deploying, using and managing one or more computer-implemented avatars, referred to herein in some cases as “discovery avatars,” that can assist one or more human analysts in conducting analysis of problems or exploration of topics, where analysis or exploration may include review of one or more source data sets, such as presented to the analysts in one or more data streams. An avatar may be constructed by machine learning processes, including by processing information related to what types of information analysts find useful in large data sets, such that each avatar represents an automated, mathematical representation of an analyst's knowledge and intuition about the relevance of material that appears in such data sets. Once constructed, an avatar as described herein may be deployed as an aid to human intuition in a wide range of analytical processes, such as related to national security, enterprise management (e.g., programs related to sales, marketing, product, promotions, placement, pricing and the like), dispute resolution (including litigation), forensic analysis, criminal, administrative, civil and private investigations, scientific investigations, research and development, and a wide range of others. In embodiments of the present invention, source data may be tokenized, and from the tokenized data a plurality of data features may be extracted. The extracted data features may be stored as quantitative vectors. The extracted data features may be analyzed using a mathematical model to determine a data cluster, wherein the data cluster includes extracted data features that share an attribute and includes identifiers that are associated with a plurality of data elements from the source data. Continuing the example, a first source datum, from the plurality of data elements from the source data, may be presented for review based at least in part on the identifiers within the data cl...",
  "ipcr_labels": [
    "G06N9900"
  ],
  "inventor_list": [
    {
      "inventor_name_last": "Dolan",
      "inventor_name_first": "Brian",
      "inventor_city": "Los Angeles",
      "inventor_state": "CA",
      "inventor_country": "US"
    }
  ],
  "title": "Creation, Use And Training Of Computer-Based Discovery Avatars",
  "decision": "PENDING",
  "_processing_info": {
    "original_size": 122848,
    "optimized_size": 3495,
    "reduction_percent": 97.16
  }
}