{
  "patent_number": "None",
  "application_number": "15693677",
  "date_published": "20180531",
  "date_produced": "20180516",
  "filing_date": "20170901",
  "main_ipcr_label": "G06N700",
  "abstract": "A calculation device according to the present application includes an acquiring unit and a calculation unit. The acquiring unit that acquires a plurality of pieces of first triple information indicating a relationship related to three types of elements and a plurality of pieces of second triple information obtained based on a conceptual system in the plurality of pieces of the first triple information. The calculation unit that calculates statistical information related to the plurality of pieces of the first triple information based on the number of pieces of the first triple information associated with each of the plurality of pieces of the second triple information acquired by the acquiring unit.",
  "publication_number": "US20180150759A1-20180531",
  "summary": "<SOH> SUMMARY OF THE INVENTION <EOH>It is an object of the present invention to at least partially solve the problems in the conventional technology. According to one aspect of an embodiment, a calculation device includes an acquiring unit that acquires a plurality of pieces of first triple information indicating a relationship related to three types of elements and a plurality of pieces of second triple information obtained based on a conceptual system in the plurality of pieces of the first triple information; and a calculation unit that calculates statistical information related to the plurality of pieces of the first triple information based on the number of pieces of the first triple information associated with each of the plurality of pieces of the second triple information acquired by the acquiring unit. The above and other objects, features, advantages and technical and industrial significance of this invention will be better understood by reading the following detailed description of presently preferred embodiments of the invention, when considered in connection with the accompanying drawings.",
  "ipcr_labels": [
    "G06N700",
    "G06N504"
  ],
  "inventor_list": [
    {
      "inventor_name_last": "NITTA",
      "inventor_name_first": "Kiyoshi",
      "inventor_city": "Tokyo",
      "inventor_state": "",
      "inventor_country": "JP"
    },
    {
      "inventor_name_last": "SAVNIK",
      "inventor_name_first": "Iztok",
      "inventor_city": "Koper",
      "inventor_state": "",
      "inventor_country": "SI"
    }
  ],
  "title": "CALCULATION DEVICE, CALCULATION METHOD, AND NON-TRANSITORY COMPUTER-READABLE RECORDING MEDIUM",
  "decision": "PENDING",
  "_processing_info": {
    "original_size": 110184,
    "optimized_size": 2551,
    "reduction_percent": 97.68
  }
}