{
  "patent_number": "None",
  "application_number": "15691236",
  "date_published": "20180301",
  "date_produced": "20180213",
  "filing_date": "20170830",
  "main_ipcr_label": "G06N9900",
  "abstract": "Computer-based models can be developed, deployed, and managed in an automated manner. For example, a model building tool can be selected based on the model building tool being compatible with one or more parameters. A first machine-learning model can be generated using the model building tool and trained using a training dataset. The first machine-learning model can then be used to perform a task. Thereafter, a new model-building tool can be selected based on the new model-building tool being compatible with the one or more parameters. A second machine-learning model can be generated using the new model-building tool and trained using the training dataset. The accuracy of the first machine-learning model can be compared to the accuracy of the second machine-learning model. Based on the second machine-learning model being more accurate, the second machine-learning model can be used to perform the particular task rather than the first machine-learning model.",
  "publication_number": "US20180060759A1-20180301",
  "summary": "<SOH> SUMMARY <EOH>In some examples, a system of the present disclosure can include a processing device and a memory device on which instructions that are executable by the processing device are stored. The instructions can cause the processing device to select a model building tool from among a plurality of model building tools based on the model building tool being compatible with one or more parameters of (i) a machine learning model or (ii) training data usable to train the machine learning model. The plurality of model building tools can be available for use in generating machine learning models. The instructions can cause the processing device to generate a first machine-learning model using the model building tool by providing the one or more parameters to the model building tool. The instructions can cause the processing device to train the first machine-leaning model using a training dataset. The instructions can cause the processing device to use the first machine-learning model to perform a particular task. The instructions can cause the processing device to perform one or more other operations subsequent to using the first machine-learning model to perform the particular task. For example, the instructions can cause the processing device to receive a new model-building tool. The instructions can cause the processing device to incorporate the new model-building tool into the plurality of model building tools. The instructions can cause the processing device to select the new model-building tool from among the plurality of model building tools based on the new model-building tool being compatible with the one or more parameters. The instructions can cause the processing device to generate a second machine-learning model using the new model-building tool by providing the one or more parameters to the new model-building tool. The instructions can cause the processing device to train the second machine-learning model using the training dataset. The instructio...",
  "ipcr_labels": [
    "G06N9900"
  ],
  "inventor_list": [
    {
      "inventor_name_last": "Chu",
      "inventor_name_first": "Chengwen Robert",
      "inventor_city": "Cary",
      "inventor_state": "NC",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Bao",
      "inventor_name_first": "Wenjie",
      "inventor_city": "Cary",
      "inventor_state": "NC",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Clingroth",
      "inventor_name_first": "Glenn Joseph",
      "inventor_city": "Raleigh",
      "inventor_state": "NC",
      "inventor_country": "US"
    }
  ],
  "title": "AUTOMATED COMPUTER-BASED MODEL DEVELOPMENT, DEPLOYMENT, AND MANAGEMENT",
  "decision": "PENDING",
  "_processing_info": {
    "original_size": 177192,
    "optimized_size": 3825,
    "reduction_percent": 97.84
  }
}