{
  "patent_number": "9965720",
  "application_number": "15699298",
  "date_published": "20180125",
  "date_produced": "20180109",
  "filing_date": "20170908",
  "main_ipcr_label": "G06N308",
  "abstract": "Systems and methods are disclosed for applying neural networks in resource-constrained environments. A system may include a sensor located in a resource-constrained environment configured to generate sensor data of the resource-constrained environment. The system may also include a first computing device not located in the resource-constrained environment configured to produce a neural network structure based on the sensor data. The system may further include a second computing device located in the resource-constrained environment configured to provide the sensor data as input to the neural network structure. The second computing device may be further configured to determine a state of the resource-constrained environment based on the input of the sensor data to the neural network structure.",
  "publication_number": "US20180025272A1-20180125",
  "summary": "<SOH> SUMMARY <EOH>According to some embodiments of the present disclosure, a system is provided. The system includes a sensor located in a resource-constrained environment configured to generate sensor data of the resource-constrained environment. The system further includes a first computing device not located in the resource-constrained environment configured to produce a neural network structure based on the sensor data. The system further includes a second computing device located in the resource-constrained environment configured to provide the sensor data as input to the neural network structure. The second computing device is further configured to determine a state of the resource-constrained environment based on the input of the sensor data to the neural network structure. In some embodiments, the system further includes a controller located in the resource-constrained environment configured to control an element in the resource-constrained environment based on the state of the resource-constrained environment determined by the second computing device. In some embodiments, the system further includes a transceiver located in the resource-constrained environment configured to transmit the sensor data from the sensor to the first computing device. In some embodiments, the transceiver is configured to transmit the sensor data from the sensor to the first computing device using a wireless communications link. In some embodiments, the wireless communications link provides intermittent communications between the transceiver and the first computing device. In some embodiments, the sensor is located in or next to a rearview mirror of an automobile. In some embodiments, the sensor includes a camera and the sensor data includes visual images of the resource-constrained environment. In some embodiments, the first computing device is configured to produce the neural network structure based in part on labels associated with the sensor data. In some embodiments, the labe...",
  "ipcr_labels": [
    "G06N308",
    "G06N304"
  ],
  "inventor_list": [
    {
      "inventor_name_last": "Lin",
      "inventor_name_first": "Rocky Chau-Hsiung",
      "inventor_city": "Cupertino",
      "inventor_state": "CA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Yamasaki",
      "inventor_name_first": "Thomas",
      "inventor_city": "Anaheim Hills",
      "inventor_state": "CA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Kanda",
      "inventor_name_first": "Koichiro",
      "inventor_city": "San Jose",
      "inventor_state": "CA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Risco",
      "inventor_name_first": "Diego Rodriguez",
      "inventor_city": "Campbell",
      "inventor_state": "CA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Ryan",
      "inventor_name_first": "Alexander Joseph",
      "inventor_city": "Mountain View",
      "inventor_state": "CA",
      "inventor_country": "US"
    }
  ],
  "title": "NEURAL NETWORK APPLICATIONS IN RESOURCE CONSTRAINED ENVIRONMENTS",
  "decision": "ACCEPTED",
  "_processing_info": {
    "original_size": 251295,
    "optimized_size": 3992,
    "reduction_percent": 98.41
  }
}