{
  "patent_number": "None",
  "application_number": "15690176",
  "date_published": "20180301",
  "date_produced": "20180213",
  "filing_date": "20170829",
  "main_ipcr_label": "G06N9900",
  "abstract": "Machine-learning methods and apparatus are provided to solve blind source separation problems with an unknown number of sources and having a signal propagation model with features such as wave-like propagation, medium-dependent velocity, attenuation, diffusion, and/or advection, between sources and sensors. In exemplary embodiments, multiple trials of non-negative matrix factorization are performed for a fixed number of sources, with selection criteria applied to determine successful trials. A semi-supervised clustering procedure is applied to trial results, and the clustering results are evaluated for robustness using measures for reconstruction quality and cluster separation. The number of sources is determined by comparing these measures for different trial numbers of sources. Source locations and parameters of the signal propagation model can also be determined. Disclosed methods are applicable to a wide range of spatial problems including chemical dispersal, pressure transients, a...",
  "publication_number": "US20180060758A1-20180301",
  "summary": "<SOH> SUMMARY <EOH>Apparatus, computer-readable storage media, and methods are disclosed to identify an unknown number of sources from mixed signals observed at a plurality of sensors, in the presence of signal variations from sources to sensors, or between sensors. In certain examples of the disclosed technology, the sources and sensors have spatial locations, and identification of the sources includes determining the location of each source. In certain examples of the disclosed technology, the sources, the sensors, or both the sources and the sensors do not have spatial locations, or can have abstract locations. The spatial locations can be distributed in any number of dimensions, including in one dimension, in two dimensions, and in three dimensions, and in spaces that have curvature or no curvature. In certain examples of the disclosed technology, the sources can generate respective signals that evolve continuously over time, while in other examples the signals can evolve as a function of a discrete variable, such as cell division or mutation. In certain examples, the source signals can be unknown, and identification of sources can include determination of one or more signals as generated by respective sources. In certain examples of the disclosed technology, the signal variations can evolve according to a signal propagation model, which can be a wave-like propagation model associated with a medium-dependent propagation velocity, and/or an attenuation that is dependent on distance. In certain examples of the disclosed technology, the signal variations can evolve according to a diffusion and/or advection model, in which signal evolution can depend on signal gradients, or according to another model amenable to Green's function treatment. In certain examples of the disclosed technology, the signal variations can be isotropic, while in other examples the signal variations can be anisotropic. In some examples of the disclosed technology, multiple runs are performed. ...",
  "ipcr_labels": [
    "G06N9900"
  ],
  "inventor_list": [
    {
      "inventor_name_last": "Alexandrov",
      "inventor_name_first": "Boian S.",
      "inventor_city": "Santa Fe",
      "inventor_state": "NM",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Alexandrov",
      "inventor_name_first": "Ludmil B.",
      "inventor_city": "Santa Fe",
      "inventor_state": "NM",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Iliev",
      "inventor_name_first": "Filip L.",
      "inventor_city": "Oakland",
      "inventor_state": "CA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Stanev",
      "inventor_name_first": "Valentin G.",
      "inventor_city": "Crofton",
      "inventor_state": "MD",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Vesselinov",
      "inventor_name_first": "Velimir V.",
      "inventor_city": "Santa Fe",
      "inventor_state": "NM",
      "inventor_country": "US"
    }
  ],
  "title": "SOURCE IDENTIFICATION BY NON-NEGATIVE MATRIX FACTORIZATION COMBINED WITH SEMI-SUPERVISED CLUSTERING",
  "decision": "PENDING",
  "_processing_info": {
    "original_size": 252419,
    "optimized_size": 4201,
    "reduction_percent": 98.34
  }
}