{
  "patent_number": "None",
  "application_number": "15692089",
  "date_published": "20180104",
  "date_produced": "20171219",
  "filing_date": "20170831",
  "main_ipcr_label": "G06N502",
  "abstract": "A mechanism is provided in a data processing system for corpus quality analysis. The mechanism applies at least one filter to a candidate corpus to determine a degree to which the candidate corpus supplements existing corpora for performing a natural language processing (NLP) operation. Responsive to a determination to add the candidate corpus to the existing corpora based on a result of applying the at least one filter, the mechanism adds the candidate corpus to the existing corpora to form modified corpora. The mechanism performs the NLP operation using the modified corpora.",
  "publication_number": "US20180005117A1-20180104",
  "summary": "<SOH> BRIEF DESCRIPTION OF THE SEVERAL VIEWS OF THE DRAWINGS <EOH>The invention, as well as a preferred mode of use and further objectives and advantages thereof, will best be understood by reference to the following detailed description of illustrative embodiments when read in conjunction with the accompanying drawings, wherein: FIG. 1 depicts a schematic diagram of one illustrative embodiment of a question/answer creation (QA) system in a computer network; FIG. 2 is a block diagram of an example data processing system in which aspects of the illustrative embodiments may be implemented; FIG. 3 illustrates a QA system pipeline for processing an input question in accordance with one illustrative embodiment; FIG. 4 is a block diagram illustrating a mechanism for performing a general corpus metrics filter on a new corpus in accordance with an illustrative embodiment; FIGS. 5A-5E are block diagrams illustrating a mechanism for performing a summarization of corpus filter on a new corpus in accordance with an illustrative embodiment; FIG. 6 is a block diagram illustrating a mechanism for performing a domain specific corpus filter on a new corpus in accordance with an illustrative embodiment; FIG. 7 is a flowchart illustrating operation of a mechanism for corpus quality analysis in accordance with an illustrative embodiment; FIG. 8 is a flowchart illustrating operation of a mechanism for performing a general corpus metrics filter on a new corpus in accordance with an illustrative embodiment; FIG. 9 is a flowchart illustrating operation of a mechanism for performing a summarization of corpus filter on a new corpus in accordance with an illustrative embodiment; and FIG. 10 is a flowchart illustrating operation of a mechanism for performing a domain specific corpus filter on a new corpus in accordance with an illustrative embodiment. detailed-description description=\"Detailed Description\" end=\"lead\"?",
  "ipcr_labels": [
    "G06N502",
    "G06N9900",
    "G06F1727"
  ],
  "inventor_list": [
    {
      "inventor_name_last": "Allen",
      "inventor_name_first": "Corville O.",
      "inventor_city": "Morrisville",
      "inventor_state": "NC",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Freed",
      "inventor_name_first": "Andrew R.",
      "inventor_city": "Cary",
      "inventor_state": "NC",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Salmon",
      "inventor_name_first": "Richard A.",
      "inventor_city": "Apex",
      "inventor_state": "NC",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Strack",
      "inventor_name_first": "Beata J.",
      "inventor_city": "New York",
      "inventor_state": "NY",
      "inventor_country": "US"
    }
  ],
  "title": "Corpus Quality Analysis",
  "decision": "PENDING",
  "_processing_info": {
    "original_size": 82097,
    "optimized_size": 3487,
    "reduction_percent": 95.75
  }
}