{
  "patent_number": "None",
  "application_number": "15694719",
  "date_published": "20180419",
  "date_produced": "20180404",
  "filing_date": "20170901",
  "main_ipcr_label": "G06N308",
  "abstract": "Methods and systems for performing diagnostic functions for a deep learning model are provided. One system includes one or more components executed by one or more computer subsystems. The one or more components include a deep learning model configured for determining information from an image generated for a specimen by an imaging tool. The one or more components also include a diagnostic component configured for determining one or more causal portions of the image that resulted in the information being determined and for performing one or more functions based on the determined one or more causal portions of the image.",
  "publication_number": "US20180107928A1-20180419",
  "summary": "<SOH> SUMMARY OF THE INVENTION <EOH>The following description of various embodiments is not to be construed in any way as limiting the subject matter of the appended claims. One embodiment relates to a system configured to perform diagnostic functions for a deep learning model. The system includes one or more computer subsystems and one or more components executed by the one or more computer subsystems. The one or more components includes a deep learning model configured for determining information from an image generated for a specimen by an imaging tool. The one or more components also include a diagnostic component configured for determining one or more causal portions of the image that resulted in the information being determined and for performing one or more functions based on the determined one or more causal portions of the image. The system may be further configured as described herein. An additional embodiment relates to another system configured to perform diagnostic functions for a deep learning model. This system is configured as described above. This system also includes an imaging tool configured for generating images of a specimen. The computer subsystem(s) are, in this embodiment, configured for acquiring the images. This embodiment of the system may be further configured as described herein. Another embodiment relates to a computer-implemented method for performing diagnostic functions for a deep learning model. The method includes determining information from an image generated for a specimen by an imaging tool by inputting the image to a deep learning model. The method also includes determining one or more causal portions of the image that resulted in the information being determined by inputting the information to a diagnostic component. In addition, the method includes performing one or more functions based on the determined one or more causal portions of the image with the diagnostic component. The deep learning model and the diagnostic compon...",
  "ipcr_labels": [
    "G06N308",
    "G06T700",
    "G06K962",
    "G06K946"
  ],
  "inventor_list": [
    {
      "inventor_name_last": "Zhang",
      "inventor_name_first": "Jing",
      "inventor_city": "Santa Clara",
      "inventor_state": "CA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Donapati",
      "inventor_name_first": "Ravi Chandra",
      "inventor_city": "Ann Arbor",
      "inventor_state": "MI",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Roulo",
      "inventor_name_first": "Mark",
      "inventor_city": "Mountain View",
      "inventor_state": "CA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Bhaskar",
      "inventor_name_first": "Kris",
      "inventor_city": "San Jose",
      "inventor_state": "CA",
      "inventor_country": "US"
    }
  ],
  "title": "DIAGNOSTIC SYSTEMS AND METHODS FOR DEEP LEARNING MODELS CONFIGURED FOR SEMICONDUCTOR APPLICATIONS",
  "decision": "PENDING",
  "_processing_info": {
    "original_size": 113336,
    "optimized_size": 3692,
    "reduction_percent": 96.74
  }
}