{
  "patent_number": "None",
  "application_number": "15694411",
  "date_published": "20180322",
  "date_produced": "20180308",
  "filing_date": "20170901",
  "main_ipcr_label": "G06N502",
  "abstract": "According to one aspect of an embodiment an estimation device includes a collecting unit that collects pieces of operation information that indicate operational statuses of electric devices, provided in a predetermined facility, and terminal information that is acquired by a terminal device of a user in the predetermined facility. The estimation device includes an estimating unit that estimates an action of a user in the predetermined facility based on the pieces of operation information and the terminal information.",
  "publication_number": "US20180082186A1-20180322",
  "summary": "<SOH> SUMMARY OF THE INVENTION <EOH>It is an object of the present invention to at least partially solve the problems in the conventional technology. According to one aspect of an embodiment an estimation device includes a collecting unit that collects pieces of operation information that indicate operational statuses of electric devices, provided in a predetermined facility, and terminal information that is acquired by a terminal device of a user in the predetermined facility. The estimation device includes an estimating unit that estimates an action of a user in the predetermined facility based on the pieces of operation information and the terminal information. The above and other objects, features, advantages and technical and industrial significance of this invention will be better understood by reading the following detailed description of presently preferred embodiments of the invention, when considered in connection with the accompanying drawings.",
  "ipcr_labels": [
    "G06N502",
    "G06N700"
  ],
  "inventor_list": [
    {
      "inventor_name_last": "KITAGISHI",
      "inventor_name_first": "Ikuo",
      "inventor_city": "Tokyo",
      "inventor_state": "",
      "inventor_country": "JP"
    }
  ],
  "title": "ESTIMATION DEVICE, ESTIMATION METHOD, AND NON-TRANSITORY COMPUTER READABLE STORAGE MEDIUM",
  "decision": "PENDING",
  "_processing_info": {
    "original_size": 78755,
    "optimized_size": 2072,
    "reduction_percent": 97.37
  }
}