{
  "patent_number": "None",
  "application_number": "15692985",
  "date_published": "20180426",
  "date_produced": "20180411",
  "filing_date": "20170831",
  "main_ipcr_label": "G06N504",
  "abstract": "An apparatus includes a state machine engine. The state machine engine may also include an automaton, whereby the automaton is configured to analyze data from a beginning of an input data stream until a point when an end of data signal is seen. The automaton may further be configured to report an event representative of a satisfaction of a Boolean clause of a conjunctive normal form (CNF) Boolean expression representative of a Boolean Satisfiability problem (SAT) by a portion of the input data stream.",
  "publication_number": "US20180114131A1-20180426",
  "summary": "<SOH> BRIEF DESCRIPTION OF DRAWINGS <EOH>FIG. 1 illustrates an example of system having a state machine engine, according to various embodiments; FIG. 2 illustrates an example of an FSM lattice of the state machine engine of FIG. 1 , according to various embodiments; FIG. 3 illustrates an example of a block of the FSM lattice of FIG. 2 , according to various embodiments; FIG. 4 illustrates an example of a row of the block of FIG. 3 , according to various embodiments; FIG. 4A illustrates a block as in FIG. 3 having counters in rows of the block, according to various embodiments of the invention; FIG. 5 illustrates an example of a Group of Two of the row of FIG. 4 , according to embodiments; FIG. 6 illustrates an example of a finite state machine graph, according to various embodiments; FIG. 7 illustrates an example of two-level hierarchy implemented with FSM lattices, according to various embodiments; FIG. 7A illustrates a second example of two-level hierarchy implemented with FSM lattices, according to various embodiments; FIG. 8 illustrates an example of a method for a compiler to convert source code into a binary file for programming of the FSM lattice of FIG. 2 , according to various embodiments; FIG. 9 illustrates a state machine engine, according to various embodiments; FIG. 10 illustrates a first embodiment of a graphical automaton representation for reporting of one or more events generated in the automaton; FIG. 11 illustrates a second embodiment of a graphical automaton representation for reporting of one or more events generated in the automaton; FIG. 12 illustrates a third embodiment of a graphical automaton representation for reporting of an event generated in the automaton; and FIG. 13 illustrates a fourth embodiment of a graphical automaton representation for reporting of an event generated in the automaton. detailed-description description=\"Detailed Description\" end=\"lead\"?",
  "ipcr_labels": [
    "G06N504"
  ],
  "inventor_list": [
    {
      "inventor_name_last": "Grimm",
      "inventor_name_first": "Matthew T.",
      "inventor_city": "Boise",
      "inventor_state": "ID",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Tanner",
      "inventor_name_first": "Jeffery M.",
      "inventor_city": "Boise",
      "inventor_state": "ID",
      "inventor_country": "US"
    }
  ],
  "title": "BOOLEAN SATISFIABILITY",
  "decision": "PENDING",
  "_processing_info": {
    "original_size": 153244,
    "optimized_size": 3085,
    "reduction_percent": 97.99
  }
}