{
  "patent_number": "None",
  "application_number": "15692070",
  "date_published": "20180524",
  "date_produced": "20180509",
  "filing_date": "20170831",
  "main_ipcr_label": "G06N500",
  "abstract": "Provided are a data processing apparatus and method for merging and processing deterministic knowledge and non-deterministic knowledge. The data processing apparatus and method may efficiently process various real-time and large-scale data to convert the data into knowledge by merging and processing non-deterministic knowledge and also deterministic knowledge perceived by an expert. Thus, it is possible to adaptively operate in accordance with a dynamically changing application service environment by converting a conversion rule for converting collected data generated from an application service system into semantic data, a context awareness rule for perceiving context information from given information, and a user query for searching for knowledge information into knowledge and gradually augmenting the knowledge information in accordance with an application service environment.",
  "publication_number": "US20180144250A1-20180524",
  "summary": "<SOH> SUMMARY <EOH>The present invention is directed to providing a data processing apparatus and method for merging and processing deterministic knowledge and non-deterministic knowledge, the data processing apparatus and method being capable of efficiently processing various real-time and large-scale data to convert the data into knowledge by merging and processing deterministic knowledge perceived by an expert and also even non-deterministic knowledge. In particular, the present invention is directed to providing a data processing apparatus and method for merging and processing deterministic knowledge and non-deterministic knowledge, the data processing apparatus and method being capable of merging Semantic Web technology and a machine learning technique, adaptively processing large-scale and real-time data in a dynamically-changing environment such as the IoE environment, and achieving an intelligent object itself and an intelligent cooperation between objects through conversion of data into knowledge. According to an aspect of the present invention, there is provided a data processing apparatus interoperating with a specific application service system to process knowledge information of a corresponding application service environment including: a knowledge base unit configured to store the knowledge information, the knowledge information including a conversion rule for converting collected data generated by the application service system into a predetermined type of knowledge; a machine learning unit configured to perform machine learning on the converted knowledge stored in the knowledge base unit on a data type basis and extract extensive conversion rule information according to the type of collected data; and a data conversion unit configured to input data type information regarding collected data generated in the specific application service environment and the conversion rule of the knowledge base unit to the machine learning unit, augment the conversion r...",
  "ipcr_labels": [
    "G06N500",
    "G06F1730",
    "G06F944"
  ],
  "inventor_list": [
    {
      "inventor_name_last": "KWON",
      "inventor_name_first": "Soon Hyun",
      "inventor_city": "Incheon",
      "inventor_state": "",
      "inventor_country": "KR"
    },
    {
      "inventor_name_last": "KIM",
      "inventor_name_first": "Eun Joo",
      "inventor_city": "Daejeon",
      "inventor_state": "",
      "inventor_country": "KR"
    },
    {
      "inventor_name_last": "PARK",
      "inventor_name_first": "Hong Kyu",
      "inventor_city": "Daejeon",
      "inventor_state": "",
      "inventor_country": "KR"
    },
    {
      "inventor_name_last": "KANG",
      "inventor_name_first": "Hyun Joong",
      "inventor_city": "Jinju-si",
      "inventor_state": "",
      "inventor_country": "KR"
    },
    {
      "inventor_name_last": "KIM",
      "inventor_name_first": "Kwi Hoon",
      "inventor_city": "Daejeon",
      "inventor_state": "",
      "inventor_country": "KR"
    },
    {
      "inventor_name_last": "KIM",
      "inventor_name_first": "Young Min",
      "inventor_city": "Daejeon",
      "inventor_state": "",
      "inventor_country": "KR"
    },
    {
      "inventor_name_last": "KIM",
      "inventor_name_first": "Hyun Jae",
      "inventor_city": "Incheon",
      "inventor_state": "",
      "inventor_country": "KR"
    },
    {
      "inventor_name_last": "BAE",
      "inventor_name_first": "Ji Hoon",
      "inventor_city": "Daejeon",
      "inventor_state": "",
      "inventor_country": "KR"
    },
    {
      "inventor_name_last": "OH",
      "inventor_name_first": "Se Won",
      "inventor_city": "Daejeon",
      "inventor_state": "",
      "inventor_country": "KR"
    },
    {
      "inventor_name_last": "YU",
      "inventor_name_first": "Jae Hak",
      "inventor_city": "Daejeon",
      "inventor_state": "",
      "inventor_country": "KR"
    },
    {
      "inventor_name_last": "LEE",
      "inventor_name_first": "Yeon Hee",
      "inventor_city": "Daejeon",
      "inventor_state": "",
      "inventor_country": "KR"
    },
    {
      "inventor_name_last": "LEE",
      "inventor_name_first": "Ho Sung",
      "inventor_city": "Daejeon",
      "inventor_state": "",
      "inventor_country": "KR"
    },
    {
      "inventor_name_last": "KIM",
      "inventor_name_first": "Nae Soo",
      "inventor_city": "Daejeon",
      "inventor_state": "",
      "inventor_country": "KR"
    },
    {
      "inventor_name_last": "KIM",
      "inventor_name_first": "Sun Jin",
      "inventor_city": "Daejeon",
      "inventor_state": "",
      "inventor_country": "KR"
    },
    {
      "inventor_name_last": "PYO",
      "inventor_name_first": "Cheol Sig",
      "inventor_city": "Daejeon",
      "inventor_state": "",
      "inventor_country": "KR"
    }
  ],
  "title": "DATA PROCESSING APPARATUS AND METHOD FOR MERGING AND PROCESSING DETERMINISTIC KNOWLEDGE AND NON-DETERMINISTIC KNOWLEDGE",
  "decision": "PENDING",
  "_processing_info": {
    "original_size": 74238,
    "optimized_size": 5504,
    "reduction_percent": 92.59
  }
}