{
  "patent_number": "None",
  "application_number": "15706679",
  "date_published": "20180201",
  "date_produced": "20180117",
  "filing_date": "20170916",
  "main_ipcr_label": "G06N502",
  "abstract": "A personal illness management system includes an extended semantic model of a health care knowledge domain, a semantic knowledge database for personal illness management, and an inference engine. The extended semantic model of a health care knowledge domain includes existing concepts related to personal illness management, existing relationships among the existing concepts, and inference logic embedded within each existing concept. The semantic knowledge database for personal illness management is distinct from the extended semantic model and includes existing nodes and existing links. The existing nodes represent instances of the existing concepts, and the existing links represent instances of the existing relationships among the existing concepts. The inference engine is knowledge domain independent and populates the semantic knowledge database with the instances of the existing concepts and the instances of the existing relationships by following the inference logic embedded within ...",
  "publication_number": "US20180032879A1-20180201",
  "summary": "<SOH> SUMMARY OF THE INVENTION <EOH>The present invention provides a computer system and a computer-based method for automatically deriving insights from facts. The system and the method are used to automate processes, increase situational understanding and activate people to undertake right actions at the right time. In particular, this invention addresses the challenge of homebound patients with complex chronic conditions managing their health in their home environment. Multiple compounding conditions contribute to the challenge: lack of or diminishing cognitive ability sufficient to understand the rigor necessary to maintain health; the care team's lack of knowledge of the situation in the home; and the clinicians' lack of knowledge of how well the prescribed therapy is working. The present invention provides a personal illness management system that incorporates semantic reasoning for automatically deriving insights from facts. The computer system and the computer-based method are used to automate processes, increase situational understanding and activate people to undertake right actions at the right time. In general, in one aspect the invention provides a personal illness management system that includes an extended semantic model of a health care knowledge domain, a semantic knowledge database for personal illness management, and an inference engine. The extended semantic model of a health care knowledge domain includes existing concepts related to personal illness management, existing relationships among the existing concepts, and inference logic embedded within each existing concept. Each existing concept comprises associated properties and the embedded inference logic is used for inferring values of the associated properties and comprises conditions and processes for drawings inferences about an existing downstream concept that is connected to an existing concept via an existing relationship. The semantic knowledge database for personal illness management i...",
  "ipcr_labels": [
    "G06N502",
    "G06N504",
    "G06Q2000",
    "G06F1900"
  ],
  "inventor_list": [
    {
      "inventor_name_last": "DE",
      "inventor_name_first": "PIALI",
      "inventor_city": "HARVARD",
      "inventor_state": "MA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "STODDART",
      "inventor_name_first": "HUGH A.",
      "inventor_city": "HARVARD",
      "inventor_state": "MA",
      "inventor_country": "US"
    }
  ],
  "title": "SYSTEMS AND METHODS FOR SEMANTIC REASONING IN PERSONAL ILLNESS MANAGEMENT",
  "decision": "PENDING",
  "_processing_info": {
    "original_size": 126446,
    "optimized_size": 3741,
    "reduction_percent": 97.04
  }
}