{
  "patent_number": "None",
  "application_number": "15707773",
  "date_published": "20180322",
  "date_produced": "20180308",
  "filing_date": "20170918",
  "main_ipcr_label": "G06N700",
  "abstract": "The present design is directed to a cognitive system including a receiver configured to receive a set of actors and associated actor information and receive assets and their associated asset information, a creation apparatus configured to create data dictionary entries for a taxonomy based on the set of actors and the assets and create a cognitive model using the data dictionary entries for a time period, and a computing apparatus configured to compute trust of the cognitive model as a fuzzy number and activate the cognitive model if trust of the cognitive model is above a cognitive model trust threshold. When the cognitive model is activated, the cognitive modeling system is configured to schedule a collection of tasks to run that perform regular extraction of actions from an original data source and perform at least one anomaly analysis associated with the cognitive model.",
  "publication_number": "US20180082207A1-20180322",
  "summary": "<SOH> SUMMARY OF THE INVENTION <EOH>Thus according to one aspect of the present design, there is provided a cognitive system comprising a receiver configured to receive a set of actors and associated actor information and receive assets and their associated asset information, a creation apparatus configured to create data dictionary entries for a taxonomy based on the set of actors and the assets and create a cognitive model using the data dictionary entries for a time period, and a computing apparatus configured to compute trust of the cognitive model as a fuzzy number and activate the cognitive model if trust of the cognitive model is above a cognitive model trust threshold. When the cognitive model is activated, the cognitive modeling system is configured to schedule a collection of tasks to run that perform regular extraction of actions from an original data source and perform at least one anomaly analysis associated with the cognitive model. For selected data dictionary entries, the cognitive modeling system is configured to normalize associated actor actions by converting at least one event to data dictionary format, insert at least one normalized terrain entry into the cognitive model, and update the cognitive model. According to a further aspect of the present design, there is provided a cognitive modeling system comprising a receiver configured to receive a set of actors, associated actor information, assets, and associated asset information, a creation apparatus configured to create data dictionary entries for a taxonomy based on the set of actors and the assets and create a cognitive model using the data dictionary entries applicable to a time period, and a computing apparatus configured to compute trust of the cognitive model as a fuzzy number and activate the cognitive model if trust of the cognitive model is above a cognitive model trust threshold. According to a further aspect of the present design, there is provided a cognitive modeling method compri...",
  "ipcr_labels": [
    "G06N700",
    "G06N502",
    "G06N702"
  ],
  "inventor_list": [
    {
      "inventor_name_last": "Cormier",
      "inventor_name_first": "Michael E.",
      "inventor_city": "Delray Beach",
      "inventor_state": "FL",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Cox",
      "inventor_name_first": "Earl D.",
      "inventor_city": "Delray Beach",
      "inventor_state": "FL",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Thackrey",
      "inventor_name_first": "William E.",
      "inventor_city": "Delray Beach",
      "inventor_state": "FL",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "McGlynn",
      "inventor_name_first": "Joseph",
      "inventor_city": "Delray Beach",
      "inventor_state": "FL",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Gardner",
      "inventor_name_first": "Harry",
      "inventor_city": "Delray Beach",
      "inventor_state": "FL",
      "inventor_country": "US"
    }
  ],
  "title": "COGNITIVE MODELING SYSTEM",
  "decision": "PENDING",
  "_processing_info": {
    "original_size": 170735,
    "optimized_size": 4036,
    "reduction_percent": 97.64
  }
}