{
  "patent_number": "None",
  "application_number": "15707892",
  "date_published": "20180322",
  "date_produced": "20180308",
  "filing_date": "20170918",
  "main_ipcr_label": "G06N502",
  "abstract": "The present design is directed to a system for defuzzification of multiple qualitative signals into human-centric threat notifications using cognitive computing techniques, including a series of periodic execution components configured to operate over full or partial sets of received data, and a plurality of event reception components configured to operate on each event in a stream relevant to a terrain and selectively provide information to the series of periodic execution components. The system detects and signals anomalies upon detecting behavior inconsistent with normal behavior.",
  "publication_number": "US20180082193A1-20180322",
  "summary": "<SOH> SUMMARY OF THE INVENTION <EOH>Thus according to one aspect of the present design, there is provided According to a further aspect of the present design, there is provided a system for defuzzification of multiple qualitative signals into human-centric threat notifications using cognitive computing techniques, comprising a series of periodic execution components configured to operate over full or partial sets of received data, and a plurality of event reception components configured to operate on each event in a stream relevant to a terrain and selectively provide information to the series of periodic execution components. The system detects and signals anomalies upon detecting behavior inconsistent with normal behavior. According to a further aspect of the present design, there is provided a system comprising a series of periodic execution components configured to operate over full or partial sets of received data, a plurality of event reception components configured to operate on each event in a stream relevant to a terrain and selectively provide information to the series of periodic execution components, and a signal manager configured to manage signals for one of the series of periodic execution components and the plurality of event reception components. The system performs defuzzification of multiple qualitative signals into human-centric threat notifications using cognitive computing techniques by detecting and signaling anomalies upon detecting behavior inconsistent with normal behavior. According to a further aspect of the present design, there is provided a system, comprising a series of periodic execution components configured to operate over full or partial sets of received data, a plurality of event reception components configured to operate on each event in a stream relevant to a terrain and selectively provide information to the series of periodic execution components, and a threat detector configured to detect threats based on information provide...",
  "ipcr_labels": [
    "G06N502",
    "G06N704",
    "G06F1730",
    "G06F1518"
  ],
  "inventor_list": [
    {
      "inventor_name_last": "Cormier",
      "inventor_name_first": "Michael E.",
      "inventor_city": "Delray Beach",
      "inventor_state": "FL",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Cox",
      "inventor_name_first": "Earl D.",
      "inventor_city": "Delray Beach",
      "inventor_state": "FL",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Thackrey",
      "inventor_name_first": "William E.",
      "inventor_city": "Delray Beach",
      "inventor_state": "FL",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "McGlynn",
      "inventor_name_first": "Joseph",
      "inventor_city": "Delray Beach",
      "inventor_state": "FL",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Gardner",
      "inventor_name_first": "Harry",
      "inventor_city": "Delray Beach",
      "inventor_state": "FL",
      "inventor_country": "US"
    }
  ],
  "title": "COGNITIVE MODELING APPARATUS FOR DEFUZZIFICATION OF MULTIPLE QUALITATIVE SIGNALS INTO HUMAN-CENTRIC THREAT NOTIFICATIONS",
  "decision": "PENDING",
  "_processing_info": {
    "original_size": 169454,
    "optimized_size": 3847,
    "reduction_percent": 97.73
  }
}