{
  "patent_number": "None",
  "application_number": "15704899",
  "date_published": "20180322",
  "date_produced": "20180308",
  "filing_date": "20170914",
  "main_ipcr_label": "G06N700",
  "abstract": "Examples of the present disclosure describe systems and methods for passive visit detection. In aspects, a mobile device comprising a set of sensors may collect and store sensor data from the set of sensors in response to detecting a movement event or user interaction data. The collected sensor data may be processed and provided as input to one or more predictive or statistical models. The model(s) may evaluate the sensor data to detect mobile device location, movement events and visit events. The model(s) may also be used to determine correlations between features of the sensor data and movement- or location-based events, optimize the types of data collected by the set of sensors, extend localized predictions to large-scale ecosystems, and generate battery-efficient state predictions. In aspects, the model(s) may be trained using labeled and/or unlabeled data sets of sensor data.",
  "publication_number": "US20180082206A1-20180322",
  "summary": "<SOH> SUMMARY <EOH>Examples of the present disclosure describe systems and methods for passive visit detection. In aspects, a mobile device comprising a set of sensors may collect and store sensor data from the set of sensors in response to detecting a movement event or user interaction data. The collected sensor data may be processed and provided as input to one or more predictive or statistical models. The model(s) may evaluate the sensor data to detect mobile device location, movement events and visit events. The model(s) may also be used to determine correlations between features of the sensor data and movement-/location-based events, optimize the types of data collected by the set of sensors, extend localized predictions to large-scale ecosystems, and generate battery-efficient state predictions, among others. In some aspects, the model(s) may be trained using labeled and/or unlabeled data sets of sensor data. This Summary is provided to introduce a selection of concepts in a simplified form that are further described below in the Detailed Description. This Summary is not intended to identify key features or essential features of the claimed subject matter, nor is it intended to be used to limit the scope of the claimed subject matter. Additional aspects, features, and/or advantages of examples will be set forth in part in the description which follows and, in part, will be apparent from the description, or may be learned by practice of the disclosure.",
  "ipcr_labels": [
    "G06N700",
    "G06N9900"
  ],
  "inventor_list": [
    {
      "inventor_name_last": "Yang",
      "inventor_name_first": "Stephanie",
      "inventor_city": "New York",
      "inventor_state": "NY",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Hannah",
      "inventor_name_first": "Lauren",
      "inventor_city": "Millbum",
      "inventor_state": "NJ",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Kronovet",
      "inventor_name_first": "Daniel",
      "inventor_city": "New York",
      "inventor_state": "",
      "inventor_country": "NY"
    },
    {
      "inventor_name_last": "Kapicioglu",
      "inventor_name_first": "Catgatay Berk",
      "inventor_city": "New York",
      "inventor_state": "NY",
      "inventor_country": "US"
    }
  ],
  "title": "Passive Visit Detection",
  "decision": "PENDING",
  "_processing_info": {
    "original_size": 57288,
    "optimized_size": 3343,
    "reduction_percent": 94.16
  }
}