{
  "patent_number": "None",
  "application_number": "15706564",
  "date_published": "20180322",
  "date_produced": "20180308",
  "filing_date": "20170915",
  "main_ipcr_label": "G06N304",
  "abstract": "Described herein are systems and methods for modeling the structure and function of the nervous system including the central nervous system and the peripheral nervous system. The system and methods provide novel tools for systematizing the construction of connectomes.",
  "publication_number": "US20180082169A1-20180322",
  "summary": "<SOH> SUMMARY OF THE DISCLOSURE <EOH>This disclosure provides a system and method for modeling connections, structure, and/or function of biological systems, such as the nervous system including the CNS and/or PNS. In one aspect, the method comprises generating, with a processor, a plurality of connections corresponding to nervous system data, e.g., the CNS and/or PNS data, wherein each of the plurality of connections comprises an origin, a termination, and a degree of connection. The method also includes storing the plurality of connections in a first memory location, receiving a nervous system atlas, and storing the nervous system atlas in a second memory location. The method also includes matching, with a processor on a connection-by-connection basis, each origin and each termination of the plurality of connections to a corresponding position of the nervous system atlas to produce an annotated connection matrix. The method further includes converting the annotated connection matrix to one or more modules, wherein the one or modules comprise an aggregated ranking of connections exceeding a threshold. In one aspect, the method further comprises deriving the data from CNS and/or PNS connection information. In another aspect, the method further comprises deriving the data from nervous system gene expression data, proteomic data, or markers of neural activity. In yet another aspect, the nervous system gene expression data comprises expressions of a neurotransmitter, a neurotransmitter receptor, or a nervous system cellular marker. In still yet another aspect, the method further comprises presenting the one or more modules as two-dimensional models. In yet another aspect, the method further comprises projecting the one or more modules onto an atlas of the nervous system (e.g. an atlas of the rat brain). In another aspect, the ranking of connections comprises one or more of a node degree, node strength, node betweenness and node closeness. In a yet further embodiment, a...",
  "ipcr_labels": [
    "G06N304",
    "G06F1912",
    "G06F1730"
  ],
  "inventor_list": [
    {
      "inventor_name_last": "Hahn",
      "inventor_name_first": "Joel",
      "inventor_city": "Los Angeles",
      "inventor_state": "CA",
      "inventor_country": "US"
    }
  ],
  "title": "SYSTEM AND METHOD FOR MODELING THE STRUCTURE AND FUNCTION OF BIOLOGICAL SYSTEMS",
  "decision": "PENDING",
  "_processing_info": {
    "original_size": 147069,
    "optimized_size": 2858,
    "reduction_percent": 98.06
  }
}