{
  "patent_number": "None",
  "application_number": "15705400",
  "date_published": "20180104",
  "date_produced": "20171219",
  "filing_date": "20170915",
  "main_ipcr_label": "G06N504",
  "abstract": "Various systems and method related to home automation systems are presented. A service robot system may be present that includes a service robot that autonomously moves within a structure to perform a household task. The service robot system may include a wireless communication interface, wherein the service robot system is configured to transmit, via the wireless communication interface, an indication of robot activity indicative of the service robot moving within the structure. Such a home automation system may also include a home security system that includes one or more motion sensors that detect motion within a structure. The home security system may be configured to distinguish intrusion activity (e.g., a burglar) from robot activity based at least in part on the indication of robot activity.",
  "publication_number": "US20180005125A1-20180104",
  "summary": "<SOH> BRIEF SUMMARY <EOH>Various techniques for providing home security objectives are disclosed herein. Embodiments described herein are representative examples of devices, methods, systems, services, and/or computer program products that can be used in conjunction with an extensible devices and services platform that, while being particularly applicable and advantageous for providing security objectives in the smart home context, is generally applicable to any type of enclosure or group of enclosures (e.g., offices, factories, retail stores), vessels (e.g., automobiles, aircraft), or other resource-consuming physical systems that will be occupied by humans or with which humans will physically or logically interact. Thus, although particular examples are set forth in the context of a smart home, it is to be appreciated that the scope of applicability of the described extensible devices and services platform is not so limited. According to an embodiment, a method is provided for calculating and reporting a security score for a home. The method comprises: obtaining, by a server, one or more security criterions for assessing security of the home; obtaining, by the server, security data from the home, the security data comprises a plurality of conditions that were sensed by one or more home devices in the home; comparing, by the server, the security data obtained from the home devices to the security criterions to determine which of the security criterions are satisfied; calculating, by the server, the security score for the home based in part on which of the security criterions are satisfied; generating, by the server, a security log that lists the security criterions and corresponding indications of whether the respective criterions are satisfied; and outputting, by the server, the security score and the security log. According to another embodiment, a method is provided for creating and using a neighborhood security network to detect security-related conditions and ...",
  "ipcr_labels": [
    "G06N504",
    "G05B1502",
    "G05B19042",
    "G08B1900",
    "H04W400",
    "H05B3702",
    "G08B2700",
    "H04L1228",
    "C08L100",
    "G08B1500",
    "G08B2500"
  ],
  "inventor_list": [
    {
      "inventor_name_last": "Fadell",
      "inventor_name_first": "Anthony M.",
      "inventor_city": "Portola Valley",
      "inventor_state": "CA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Rogers",
      "inventor_name_first": "Matthew Lee",
      "inventor_city": "Los Gatos",
      "inventor_state": "CA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Matsuoka",
      "inventor_name_first": "Yoky",
      "inventor_city": "Los Altos Hills",
      "inventor_state": "CA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Sloo",
      "inventor_name_first": "David",
      "inventor_city": "Menlo Park",
      "inventor_state": "CA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Veron",
      "inventor_name_first": "Maxime",
      "inventor_city": "San Jose",
      "inventor_state": "CA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Honjo",
      "inventor_name_first": "Shigefumi",
      "inventor_city": "Santa Cruz",
      "inventor_state": "CA",
      "inventor_country": "US"
    }
  ],
  "title": "DEVICES, METHODS, AND ASSOCIATED INFORMATION PROCESSING FOR SECURITY IN A SMART-SENSORED HOME",
  "decision": "PENDING",
  "_processing_info": {
    "original_size": 274690,
    "optimized_size": 4264,
    "reduction_percent": 98.45
  }
}