{
  "patent_number": "None",
  "application_number": "15707859",
  "date_published": "20180322",
  "date_produced": "20180308",
  "filing_date": "20170918",
  "main_ipcr_label": "G06N502",
  "abstract": "The present design is directed to a system for measuring values qualitatively across a terrain including multiple dimensions using cognitive computing techniques, comprising a plurality of event reception components configured to operate on each event in a stream relevant to the terrain, the plurality of event reception components including a threshold application component configured to apply a threshold to each element in the stream, a terrain updater configured to update the terrain based on at least one event, an outlier analysis module configured to determine any outlier in the stream of events, a threshold violation predictor configured to predict threshold violations based on the stream of events, a time-ordered behavior evaluator configured to evaluate behavior based on the stream of events, and a graph updater to update a graph based on the stream of events.",
  "publication_number": "US20180082189A1-20180322",
  "summary": "<SOH> SUMMARY OF THE INVENTION <EOH>Thus according to one aspect of the present design, there is provided a system for measuring values qualitatively across a terrain comprising multiple dimensions using cognitive computing techniques, comprising a plurality of event reception components configured to operate on each event in a stream relevant to the terrain, the plurality of event reception components comprising a threshold application component configured to apply a threshold to each element in the stream, a terrain updater configured to update the terrain based on at least one event, an outlier analysis module configured to determine any outlier in the stream of events, a threshold violation predictor configured to predict threshold violations based on the stream of events, a time-ordered behavior evaluator configured to evaluate behavior based on the stream of events, and a graph updater to update a graph based on the stream of events. According to a further aspect of the present design, there is provided a system for measuring values qualitatively across a terrain comprising multiple dimensions using cognitive computing techniques, comprising a plurality of event reception components configured to operate on each event in a stream relevant to the terrain, a periodic set of components configured to operate periodically on demand to analyze and predict based on information received from the plurality of event reception components, and a plurality of signal managers interfacing with the plurality of event reception components and the periodic set of components, wherein the plurality of signal managers is configured to exclude signals based on content properties of data transmitted. According to a further aspect of the present design, there is provided a method for measuring values qualitatively across a terrain comprising multiple dimensions using cognitive computing techniques, comprising operating on each event in a stream relevant to the terrain using a plurali...",
  "ipcr_labels": [
    "G06N502",
    "G06N9900"
  ],
  "inventor_list": [
    {
      "inventor_name_last": "Cormier",
      "inventor_name_first": "Michael E.",
      "inventor_city": "Delray Beach",
      "inventor_state": "FL",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Cox",
      "inventor_name_first": "Earl D.",
      "inventor_city": "Delray Beach",
      "inventor_state": "FL",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Thackrey",
      "inventor_name_first": "William E.",
      "inventor_city": "Delray Beach",
      "inventor_state": "FL",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "McGlynn",
      "inventor_name_first": "Joseph",
      "inventor_city": "Delray Beach",
      "inventor_state": "FL",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Gardner",
      "inventor_name_first": "Harry",
      "inventor_city": "Delray Beach",
      "inventor_state": "FL",
      "inventor_country": "US"
    }
  ],
  "title": "COGNITIVE MODELING APPARATUS FOR ASSESSING VALUES QUALITATIVELY ACROSS A MULTIPLE DIMENSION TERRAIN",
  "decision": "PENDING",
  "_processing_info": {
    "original_size": 168753,
    "optimized_size": 4092,
    "reduction_percent": 97.58
  }
}