{
  "patent_number": "None",
  "application_number": "15705820",
  "date_published": "20180510",
  "date_produced": "20180425",
  "filing_date": "20170915",
  "main_ipcr_label": "G06N700",
  "abstract": "A system includes a processor and a memory device communicatively coupled to the processor. The system also includes a database communicatively coupled to the processor. The database is configured to store a first plurality of prediction sets. Each prediction set is associated with a respective individual within a first population. Each prediction set comprises a plurality of prediction results, and each prediction result corresponds to a selected one of a plurality of features. The processor is configured to receive a request for a distribution value associated with a selected feature and one or more parameters. The distribution value indicate how often the selected feature appears in a second population of individuals, the second population being defined by the one or more parameters.",
  "publication_number": "US20180129962A1-20180510",
  "summary": "<SOH> SUMMARY <EOH>In general, one aspect of the subject matter described in this specification may be embodied in methods that include the actions of filtering social media data for content resources that match one or more search terms; providing the content resources to a user interface; receiving a selection of one or more of the content resources; receiving a selection to create a new visual based on data received; creating a visualization instance; and providing the visualization instance to be displayed on the user interface. Other embodiments of these aspects include corresponding systems, apparatus, and computer-readable medium storing software comprising instructions executable by one or more computers, which cause the computers to perform the actions of the methods. Another aspect of the subject matter described in this specification may be embodied in methods that include the actions of receiving visualization settings at a server visualization loader; identifying visualization data sources; creating a visualization controller from the visualization data sources, visualization structure and visualization settings; providing to a visualization instance manager the visualization controller and generated visualization style; and creating with the visualization instance manager a visualization instance based on the visualization controller and generated visualization style. Other embodiments of these aspects include corresponding systems, apparatus, and computer-readable medium storing software comprising instructions executable by one or more computers, which cause the computers to perform the actions of the methods. Another aspect of the subject matter described in this specification may be embodied in methods that include the actions of selecting all elements on a webpage, by a client loader that have a first attribute and make a request to a server loader for a visualization manager, including the value of all of the attributes. For each of the visual ide...",
  "ipcr_labels": [
    "G06N700",
    "G06N502"
  ],
  "inventor_list": [
    {
      "inventor_name_last": "Mathew",
      "inventor_name_first": "Thomas",
      "inventor_city": "Vienna",
      "inventor_state": "VA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Seaman",
      "inventor_name_first": "John William",
      "inventor_city": "Reston",
      "inventor_state": "VA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Vasquez",
      "inventor_name_first": "Jorge Luis",
      "inventor_city": "Fairfax",
      "inventor_state": "VA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Manouchehri",
      "inventor_name_first": "Reza Ali",
      "inventor_city": "Reston",
      "inventor_state": "VA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Kohn",
      "inventor_name_first": "Lee Evan",
      "inventor_city": "Arlington",
      "inventor_state": "VA",
      "inventor_country": "US"
    }
  ],
  "title": "DATABASE QUERY AND DATA MINING IN INTELLIGENT DISTRIBUTED COMMUNICATION NETWORKS",
  "decision": "PENDING",
  "_processing_info": {
    "original_size": 201709,
    "optimized_size": 3972,
    "reduction_percent": 98.03
  }
}