{
  "patent_number": "None",
  "application_number": "15704947",
  "date_published": "20180315",
  "date_produced": "20180228",
  "filing_date": "20170914",
  "main_ipcr_label": "G06N700",
  "abstract": "A device may receive a first sample. The device may identify a plurality of second samples that are similar to the first sample. The plurality of second samples may correspond to service tickets that have previously been processed. The device may obtain or determine log information identifying a plurality of events associated with the first sample. The device may determine respective probabilities of occurrence corresponding to the plurality of second samples. A probability of occurrence, for a particular second sample, may identify a likelihood of receiving a corresponding service ticket within a particular time period of occurrence of the plurality of events. The device may assign ranks to the plurality of second samples based on the respective probabilities of occurrence. The device may provide information identifying the ranks and the plurality of second samples.",
  "publication_number": "US20180075363A1-20180315",
  "summary": "<SOH> SUMMARY <EOH>A device may include one or more processors. The device may receive a first sample. The device may identify a plurality of second samples that are similar to the first sample. The plurality of second samples may correspond to service tickets that have previously been processed. The device may obtain or determine log information identifying a plurality of events associated with the first sample. The device may determine respective probabilities of occurrence corresponding to the plurality of second samples. A probability of occurrence, for a particular second sample, may identify a likelihood of receiving a corresponding service ticket within a particular time period of occurrence of the plurality of events. The device may assign ranks to the plurality of second samples based on the respective probabilities of occurrence. The device may provide information identifying the ranks and the plurality of second samples. A method may include receiving, by a device, an input sample corresponding to an input service ticket. The method may include identifying, by the device, a plurality of output samples that are similar to the input sample. The plurality of output samples may be selected from historical service tickets that have previously been processed. The method may include obtaining or determining, by the device, log information identifying a plurality of events associated with the input sample. The method may include determining, by the device, respective probabilities of occurrence corresponding to the plurality of output samples. A probability of occurrence, for a particular output sample of the plurality of output samples, may identify a likelihood of receiving a corresponding service ticket within a particular time period of occurrence of the plurality of events. The method may include assigning, by the device, ranks to the plurality of output samples based on the respective probabilities of occurrence. The method may include providing, by the dev...",
  "ipcr_labels": [
    "G06N700",
    "G06F1107",
    "G06F1727"
  ],
  "inventor_list": [
    {
      "inventor_name_last": "DURAISAMY SOUNDRAPANDIAN",
      "inventor_name_first": "Pradeepkumar",
      "inventor_city": "Sivakasi",
      "inventor_state": "",
      "inventor_country": "IN"
    },
    {
      "inventor_name_last": "NARAYANASWAMY CHANDRASEKARAN",
      "inventor_name_first": "Shrikanth",
      "inventor_city": "Bangalore",
      "inventor_state": "",
      "inventor_country": "IN"
    },
    {
      "inventor_name_last": "BHOLA",
      "inventor_name_first": "Aditya",
      "inventor_city": "Jabalpur",
      "inventor_state": "",
      "inventor_country": "IN"
    },
    {
      "inventor_name_last": "SUBRAMANIA",
      "inventor_name_first": "Venkatesh",
      "inventor_city": "Bangalore",
      "inventor_state": "",
      "inventor_country": "IN"
    },
    {
      "inventor_name_last": "KAULGUD",
      "inventor_name_first": "Vikrant",
      "inventor_city": "Pune",
      "inventor_state": "",
      "inventor_country": "IN"
    },
    {
      "inventor_name_last": "PODDER",
      "inventor_name_first": "Sanjay",
      "inventor_city": "Thane",
      "inventor_state": "",
      "inventor_country": "IN"
    }
  ],
  "title": "AUTOMATED INFERENCE OF EVIDENCE FROM LOG INFORMATION",
  "decision": "PENDING",
  "_processing_info": {
    "original_size": 105064,
    "optimized_size": 4213,
    "reduction_percent": 95.99
  }
}