{
  "patent_number": "None",
  "application_number": "15715747",
  "date_published": "20180201",
  "date_produced": "20180117",
  "filing_date": "20170926",
  "main_ipcr_label": "G06N504",
  "abstract": "A system that incorporates teachings of the present disclosure may include, for example, a synthesis engine having a controller, and a storage medium for storing instructions to be executed by the controller. The instructions, when executed by the controller, can cause the controller to retrieve collected information associated with a behavior of an individual, synthesize from the information a measure of a mood of the individual to interact with others, and transmit the measure to a system associated with the individual to manage requests between the individual and the entity. The measure of the mood of the individual can indicate an availability of the individual and a receptiveness of the individual to accept a request to interact with an entity. The measure can be described by a plurality of dimensions. Other embodiments are disclosed.",
  "publication_number": "US20180032889A1-20180201",
  "summary": "<SOH> BRIEF DESCRIPTION OF THE DRAWINGS <EOH>FIGS. 1-2 depict illustrative embodiments of communication systems that provide media services; FIG. 3 depicts an illustrative embodiment of a portal interacting with the communication systems of FIGS. 1-2 ; FIG. 4 depicts an illustrative embodiment of a communication device utilized in the communication systems of FIGS. 1-2 ; FIG. 5 depicts an illustrative embodiment of a method according to the present disclosure; FIG. 6 depicts an illustrative embodiment of a system for managing access to individuals according to the method of FIG. 6 ; FIG. 7 depicts an illustrative embodiment of a multidimensional representation of an individual's mood according to the method of FIG. 6 ; FIGS. 8-9 depict illustrative embodiments of metaphors for describing the individual's mood according to the method of FIG. 6 ; FIG. 10 depicts an illustrative embodiment of an intermediary for negotiating a degree of communication access to the individual according to the method of FIG. 6 ; and FIG. 11 is a diagrammatic representation of a machine in the form of a computer system within which a set of instructions, when executed, may cause the machine to perform any one or more of the methodologies discussed herein. detailed-description description=\"Detailed Description\" end=\"lead\"?",
  "ipcr_labels": [
    "G06N504",
    "G06N300",
    "H04L2908",
    "H04L1258"
  ],
  "inventor_list": [
    {
      "inventor_name_last": "Donovan",
      "inventor_name_first": "John",
      "inventor_city": "Dallas",
      "inventor_state": "TX",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Bedingfield, SR.",
      "inventor_name_first": "James Carlton",
      "inventor_city": "Gainesville",
      "inventor_state": "GA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Roden",
      "inventor_name_first": "Barbara",
      "inventor_city": "Atlanta",
      "inventor_state": "GA",
      "inventor_country": "US"
    }
  ],
  "title": "Systems and Methods for Managing Interactions Between an Individual and an Entity",
  "decision": "PENDING",
  "_processing_info": {
    "original_size": 68083,
    "optimized_size": 3083,
    "reduction_percent": 95.47
  }
}