{
  "patent_number": "None",
  "application_number": "15715460",
  "date_published": "20180329",
  "date_produced": "20180315",
  "filing_date": "20170926",
  "main_ipcr_label": "G06N9900",
  "abstract": "In some embodiments, user-selectable/connectable model representations may be provided via a user interface to facilitate artificial intelligence development. The model representations may comprises first and second machine learning model (ML) representations corresponding to first and second ML models, and non-ML model representations corresponding to non-ML models. Based on user input indicating selection of the first and second ML model representations and a non-ML model representation corresponding to a non-ML model, at least a portion of a software application may be generated such that the software application comprises (i) an instance of the first ML model, an instance of the second ML model, and an instance of the non-ML model and (ii) an input/output data path between the instance of the first ML model and at least one other instance, the at least one other instance comprising the instance of the second ML model or the instance of the non-ML model.",
  "publication_number": "US20180089592A1-20180329",
  "summary": "<SOH> SUMMARY OF THE INVENTION <EOH>Aspects of the invention relate to methods, apparatuses, and/or systems for generating a prediction-model-incorporated software application via user-selectable/connectable model representations of an interactive user interface. In some embodiments, user-selectable/connectable model representations, input/output representations, or other representations may be provided via a user interface. Based on user input indicating selection of one or more model or input/output representations, the model representations, input/output representations, or other representations may be presented via the user interface. Additionally, or alternatively, at least a portion of a software application may be generated based on the user input or subsequent user-initiated changes related to the representations. As an example, responsive to the generation, the resulting software application may include one or more instances of machine learning models or non-machine-learning models that correspond to the presented model representations, one or more input/output paths between respective ones of the models or from/to other sources/destinations, or other components. In some embodiments, a service platform may provide one or more application program interface (API) services, which provide developers and their applications with access to features of such services' APIs that may be incorporated at least part of such applications. As an example, a graph of arbitrary data workflow methods that incorporate artificial intelligence blocks with other processing operations may be built via the service platform's user interface to meet an entire application or enterprise need. Such workflows may be configured via a user interface and a corresponding API to enable developers to embed features of prediction models in their applications (e.g., as API calls to the prediction models to provide input to and obtain outputs from the prediction models or workflow incorporating th...",
  "ipcr_labels": [
    "G06N9900",
    "G06F1730"
  ],
  "inventor_list": [
    {
      "inventor_name_last": "ZEILER",
      "inventor_name_first": "Matthew",
      "inventor_city": "New York",
      "inventor_state": "NY",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "KANTOR",
      "inventor_name_first": "Daniel",
      "inventor_city": "New York",
      "inventor_state": "NY",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "JONES",
      "inventor_name_first": "Marshall",
      "inventor_city": "New York",
      "inventor_state": "NY",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "FOX",
      "inventor_name_first": "Christopher",
      "inventor_city": "New York",
      "inventor_state": "NY",
      "inventor_country": "US"
    }
  ],
  "title": "ARTIFICIAL INTELLIGENCE DEVELOPMENT VIA USER-SELECTABLE/CONNECTABLE MODEL REPRESENTATIONS",
  "decision": "PENDING",
  "_processing_info": {
    "original_size": 133723,
    "optimized_size": 4004,
    "reduction_percent": 97.01
  }
}