{
  "patent_number": "None",
  "application_number": "15717597",
  "date_published": "20180329",
  "date_produced": "20180315",
  "filing_date": "20170927",
  "main_ipcr_label": "G06N9900",
  "abstract": "The present application discloses systems and method for filtering digital source content for the processing and indexing of large volume of digital content by leveraging a multiple variable value-based system built upon selective intelligent processing of input data generated by multiple users or sources, each analyzed by using Natural Language Processing algorithm. More particularly, the present invention is related to a computer or machine implemented system for carrying out a system and a method of use thereof for the improvement of processing and indexing of large volume of digital content based on multiple variables. The system uses various interconnected modules to achieve the processing, filtering, indexing and ranking of large volumes of data, including, digital content created in the world wide web",
  "publication_number": "US20180089595A1-20180329",
  "summary": "<SOH> SUMMARY <EOH>In an embodiment of the present invention, digital content is processed, filtered, indexed and ranked based on NLP algorithm in conjunction with context or other related information generated by a values-based system. By filtering users or a digital content source using values-based metrics and associating content of interest with the values and the users, the system creates an optimized algorithm to be used alone or as part of a group of indexing masks at a different source to help rank and associate content with the users. In addition, users can also be ranked and masked using the same values-based tools as above.",
  "ipcr_labels": [
    "G06N9900",
    "G06Q5000",
    "G06Q3002",
    "G06F1727",
    "H04L2908"
  ],
  "inventor_list": [
    {
      "inventor_name_last": "Martin",
      "inventor_name_first": "John",
      "inventor_city": "Venice",
      "inventor_state": "CA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Kenny",
      "inventor_name_first": "Joseph",
      "inventor_city": "Alexandria",
      "inventor_state": "VA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Iyer",
      "inventor_name_first": "Ravi",
      "inventor_city": "Los Angeles",
      "inventor_state": "CA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Maloney",
      "inventor_name_first": "Joseph",
      "inventor_city": "Venice",
      "inventor_state": "CA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Anderson",
      "inventor_name_first": "Benton",
      "inventor_city": "Marina Del Rey",
      "inventor_state": "CA",
      "inventor_country": "US"
    }
  ],
  "title": "SYSTEM FOR MULTI-VARIABLE DIGITAL CONTENT INDEXING TOOL AND METHOD OF USE THEREOF",
  "decision": "PENDING",
  "_processing_info": {
    "original_size": 42957,
    "optimized_size": 2664,
    "reduction_percent": 93.8
  }
}