{
  "patent_number": "None",
  "application_number": "15715433",
  "date_published": "20180329",
  "date_produced": "20180315",
  "filing_date": "20170926",
  "main_ipcr_label": "G06N9900",
  "abstract": "In some embodiments, a service platform that facilitates artificial intelligence model and data collection and collection may be provided. Input/output information derived from machine learning models may be obtained via the service platform. The input/output information may indicate (i) first items provided as input to at least one model of the machine learning models, (ii) first prediction outputs derived from the at least one model's processing of the first items, (iii) second items provided as input to at least another model of the machine learning models, (iv) second prediction outputs derived from the at least one other model's processing of the second items, and (v) other inputs and outputs. The input/output information may be provided via the service platform to update a first machine learning model. The first machine learning model may be updated based on the input/output information being provided as input to the first machine learning model.",
  "publication_number": "US20180089591A1-20180329",
  "summary": "<SOH> SUMMARY OF THE INVENTION <EOH>Aspects of the invention relate to methods, apparatuses, and/or systems for facilitating development of a prediction model via a service platform. In some embodiments, collection/development of one or more prediction models, prediction-model-incorporated software applications, or related data may be facilitated. Such prediction models may include neural networks, other machine learning models, or other prediction models. As an example, a service platform may facilitate collection/development of (i) training data for machine learning models, (ii) domains of the machine learning models, (iii) things learned by the machine learning models (e.g., concepts learned by the machine learning models), (iv) the architectures of the machine learning models, (v) the accuracy/speed of operation or cost of various machine learning models, (vi) different available/stored versions of the machine learning models, or (vii) other items or information. The training data may include (i) inputs to be provided to a machine learning model (e.g., inputs provided to and processed by other machine learning models or other inputs), (ii) reference outputs that are to be derived from a machine learning model's processing of such inputs (e.g., user-confirmed or user-provided outputs, outputs confirmed through one or more machine learning models' processing of such inputs, outputs confirmed multiple times by processing of such inputs by respective sets of machine learning models, or other reference outputs), (iii) reference indications of outputs that are not to be derived from a machine learning model's processing of such inputs (e.g., user indications that such outputs are inaccurate or other reference indications), or (iv) other training data. Various other aspects, features, and advantages of the invention will be apparent through the detailed description of the invention and the drawings attached hereto. It is also to be understood that both the foregoing ge...",
  "ipcr_labels": [
    "G06N9900",
    "G06N504"
  ],
  "inventor_list": [
    {
      "inventor_name_last": "ZEILER",
      "inventor_name_first": "Matthew",
      "inventor_city": "New York",
      "inventor_state": "NY",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "KANTOR",
      "inventor_name_first": "Daniel",
      "inventor_city": "New York",
      "inventor_state": "NY",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "FOX",
      "inventor_name_first": "Christopher",
      "inventor_city": "New York",
      "inventor_state": "NY",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "WILLIAMS",
      "inventor_name_first": "Cassidy",
      "inventor_city": "New York",
      "inventor_state": "NY",
      "inventor_country": "US"
    }
  ],
  "title": "ARTIFICIAL INTELLIGENCE MODEL AND DATA COLLECTION/DEVELOPMENT PLATFORM",
  "decision": "PENDING",
  "_processing_info": {
    "original_size": 133342,
    "optimized_size": 3981,
    "reduction_percent": 97.01
  }
}