{
  "patent_number": "None",
  "application_number": "15716558",
  "date_published": "20180412",
  "date_produced": "20180328",
  "filing_date": "20170927",
  "main_ipcr_label": "G06N308",
  "abstract": "A generative model learning method includes learning a first generative model by unsupervised learning based on train data prepared beforehand, generating generated data by the first generative model, and learning a second generative model by supervised learning based on the train data and the generated data determined as undesirable by a user.",
  "publication_number": "US20180101770A1-20180412",
  "summary": "<SOH> SUMMARY <EOH>Example embodiments of the present invention include a generative model learning method including learning a first generative model by unsupervised learning based on train data prepared beforehand, generating generated data by the first generative model, and learning a second generative model by supervised learning based on the train data and the generated data determined as undesirable by a user. Example embodiments of the present invention include a generative model learning system, which causes one or more processors to learn a first generative model by unsupervised learning based on train data prepared beforehand, generates generated data by the first generative model, and learns a second generative model by supervised learning based on the train data and the generated data determined as undesirable by a user. Example embodiments of the present invention include a computer program product such as a non-transitory recording medium causing a computer to perform the above-described generative model learning method.",
  "ipcr_labels": [
    "G06N308",
    "G06N304"
  ],
  "inventor_list": [
    {
      "inventor_name_last": "TANAKA",
      "inventor_name_first": "Takuya",
      "inventor_city": "Kanagawa",
      "inventor_state": "",
      "inventor_country": "JP"
    },
    {
      "inventor_name_last": "KANEBAKO",
      "inventor_name_first": "Yusuke",
      "inventor_city": "Miyagi",
      "inventor_state": "",
      "inventor_country": "JP"
    }
  ],
  "title": "METHOD AND SYSTEM OF GENERATIVE MODEL LEARNING, AND PROGRAM PRODUCT",
  "decision": "PENDING",
  "_processing_info": {
    "original_size": 67355,
    "optimized_size": 2101,
    "reduction_percent": 96.88
  }
}