{
  "patent_number": "None",
  "application_number": "15719445",
  "date_published": "20180329",
  "date_produced": "20180315",
  "filing_date": "20170928",
  "main_ipcr_label": "G06N504",
  "abstract": "Embodiments of the invention disclosed herein provide techniques for generating an alternative design recommendation. The techniques include determining, via a processor, a first function associated with one or more first components included in a first design. The techniques further include analyzing, via the processor, a plurality of components included in a database to select one or more second components associated with a second function that corresponds to the first function. The techniques further include causing an alternative design recommendation that includes the one or more second components to be output for display.",
  "publication_number": "US20180089575A1-20180329",
  "summary": "<SOH> SUMMARY OF THE INVENTION <EOH>Embodiments of the present application set forth a method for generating an alternative design recommendation. The method includes determining, via a processor, a first function associated with one or more first components included in a first design. The method further includes analyzing, via the processor, a plurality of components included in a database to select one or more second components associated with a second function that corresponds to the first function. The method further includes causing an alternative design recommendation that includes the one or more second components to be output for display Other embodiments of the present invention include, without limitation, a computer-readable medium including instructions for performing one or more aspects of the disclosed techniques, as well as a computing device for performing one or more aspects of the disclosed techniques. One advantage of the disclosed techniques is that a user is able to generate portions of a design without having to manually select each and every component in the design and/or without having to manually specify relationships between one or more components in the design. Additionally, a user who is not familiar with all of the preexisting components stored in a data store can be presented with recommendations that include one or more components that are most relevant to the particular design being generated by the user. Accordingly, users can more quickly and efficiently generate designs that include optimal components and/or component relationships relative to prior art techniques.",
  "ipcr_labels": [
    "G06N504",
    "G06F1750"
  ],
  "inventor_list": [
    {
      "inventor_name_last": "CHEONG",
      "inventor_name_first": "Hyunmin",
      "inventor_city": "Toronto",
      "inventor_state": "",
      "inventor_country": "CA"
    },
    {
      "inventor_name_last": "LI",
      "inventor_name_first": "Wei",
      "inventor_city": "Toronto",
      "inventor_state": "",
      "inventor_country": "CA"
    },
    {
      "inventor_name_last": "IORIO",
      "inventor_name_first": "Francesco",
      "inventor_city": "Toronto",
      "inventor_state": "",
      "inventor_country": "CA"
    }
  ],
  "title": "KNOWLEDGE-BASED ALTERNATIVE DESIGN RECOMMENDATIONS",
  "decision": "PENDING",
  "_processing_info": {
    "original_size": 55095,
    "optimized_size": 3086,
    "reduction_percent": 94.4
  }
}