{
  "patent_number": "None",
  "application_number": "15717495",
  "date_published": "20180118",
  "date_produced": "20180103",
  "filing_date": "20170927",
  "main_ipcr_label": "G06N700",
  "abstract": "A method, system, and computer program product for social collaboration in probabilistic prediction are provided in the illustrative embodiments. A set of predictions is sent to a user device. A prediction in the set of predictions is a probability of an outcome of an event. The probability is computed using a prediction model trained with training data corresponding to the event. An input is received from the user device. The input comprises a new prediction made at the user device using a new prediction model executing on the user device. A difference is determined between the prediction and the new prediction. The prediction model is revised to produce a revised prediction. A revised difference between the revised prediction and the new prediction is smaller than the difference.",
  "publication_number": "US20180018575A1-20180118",
  "summary": "<SOH> SUMMARY <EOH>The illustrative embodiments provide a method, system, and computer program product for normalizing amorphous query result sets. An embodiment includes a method for social collaboration in probabilistic prediction. The embodiment sends, from an application executing in a data processing system using a processor and a memory, a set of predictions to a user device, wherein a prediction in the set of predictions is a probability of an outcome of an event, wherein the probability is computed using a prediction model trained with training data corresponding to the event. The embodiment receives an input from the user device, wherein the input comprises a new prediction made at the user device using a new prediction model executing on the user device. The embodiment determines a difference between the prediction and the new prediction. The embodiment revises the prediction model to produce a revised prediction, wherein a revised difference between the revised prediction and the new prediction is smaller than the difference. Another embodiment includes a computer program product for social collaboration in probabilistic prediction. The embodiment further includes one or more computer-readable tangible storage devices. The embodiment further includes program instructions, stored on at least one of the one or more storage devices, to send, from an application executing in a data processing system using a processor and a memory, a set of predictions to a user device, wherein a prediction in the set of predictions is a probability of an outcome of an event, wherein the probability is computed using a prediction model trained with training data corresponding to the event. The embodiment further includes program instructions, stored on at least one of the one or more storage devices, to receive an input from the user device, wherein the input comprises a new prediction made at the user device using a new prediction model executing on the user device. The embod...",
  "ipcr_labels": [
    "G06N700"
  ],
  "inventor_list": [
    {
      "inventor_name_last": "Baughman",
      "inventor_name_first": "Aaron Keith",
      "inventor_city": "Silver Spring",
      "inventor_state": "MD",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "O'Connell",
      "inventor_name_first": "Brian Marshall",
      "inventor_city": "Cary",
      "inventor_state": "NC",
      "inventor_country": "US"
    }
  ],
  "title": "SOCIAL COLLABORATION IN PROBABILISTIC PREDICTION",
  "decision": "PENDING",
  "_processing_info": {
    "original_size": 67785,
    "optimized_size": 3493,
    "reduction_percent": 94.85
  }
}