{
  "patent_number": "None",
  "application_number": "15727007",
  "date_published": "20180208",
  "date_produced": "20180124",
  "filing_date": "20171006",
  "main_ipcr_label": "G06N504",
  "abstract": "Provided is an information processing apparatus, including a calculation section which calculates a proficiency level of a user for operations performed by the user for achieving a prescribed objective based on history information related to the operations and attribute information related to physical features of the user, and a generation section which generates advice for achieving the objective based on the proficiency level calculated by the calculation section.",
  "publication_number": "US20180039896A1-20180208",
  "summary": "<SOH> SUMMARY <EOH>In the field of sports, suitable advice will differ according to features of a user, such as physical features such as physique or muscular strength, or a technique level, even if learning the same technique. However, JP H11-9752A, JP 2003-241634A, JP 2006-209148A, JP 2011-24067A and JP 2012-189624A do not consider presenting advice in accordance with such features of a user, even if being able to present general advice. Accordingly, the present disclosure proposes a new and improved information processing apparatus and storage medium capable of presenting suitable advice in accordance with features of a user. According to an embodiment of the present disclosure, there is provided an information processing apparatus, including a calculation section which calculates a proficiency level of a user for operations performed by the user for achieving a prescribed objective based on history information related to the operations and attribute information related to physical features of the user, and a generation section which generates advice for achieving the objective based on the proficiency level calculated by the calculation section. According to an embodiment of the present disclosure, there is provided a non-transitory computer-readable storage medium having a program stored therein, the program causing a computer to perform calculating a proficiency level of a user for operations performed by the user for achieving a prescribed objective based on history information related to the operations and attribute information related to physical features of the user, and generating advice for achieving the objective based on the calculated proficiency level. According to the present disclosure such as described above, it is possible to present suitable advice in accordance with features of a user.",
  "ipcr_labels": [
    "G06N504"
  ],
  "inventor_list": [
    {
      "inventor_name_last": "KON",
      "inventor_name_first": "Takayasu",
      "inventor_city": "Tokyo",
      "inventor_state": "",
      "inventor_country": "JP"
    },
    {
      "inventor_name_last": "SAKO",
      "inventor_name_first": "Yoichiro",
      "inventor_city": "Tokyo",
      "inventor_state": "",
      "inventor_country": "JP"
    },
    {
      "inventor_name_last": "HAYASHI",
      "inventor_name_first": "Kazunori",
      "inventor_city": "Tokyo",
      "inventor_state": "",
      "inventor_country": "JP"
    },
    {
      "inventor_name_last": "KAMADA",
      "inventor_name_first": "Yasunori",
      "inventor_city": "Kanagawa",
      "inventor_state": "",
      "inventor_country": "JP"
    },
    {
      "inventor_name_last": "NAKAMURA",
      "inventor_name_first": "Takatoshi",
      "inventor_city": "Tokyo",
      "inventor_state": "",
      "inventor_country": "JP"
    },
    {
      "inventor_name_last": "HANAYA",
      "inventor_name_first": "Hiroyuki",
      "inventor_city": "Kanagawa",
      "inventor_state": "",
      "inventor_country": "JP"
    },
    {
      "inventor_name_last": "ONUMA",
      "inventor_name_first": "Tomoya",
      "inventor_city": "Shizuoka",
      "inventor_state": "",
      "inventor_country": "JP"
    },
    {
      "inventor_name_last": "TANGE",
      "inventor_name_first": "Akira",
      "inventor_city": "Tokyo",
      "inventor_state": "",
      "inventor_country": "JP"
    }
  ],
  "title": "INFORMATION PROCESSING APPARATUS AND STORAGE MEDIUM",
  "decision": "PENDING",
  "_processing_info": {
    "original_size": 95289,
    "optimized_size": 3843,
    "reduction_percent": 95.97
  }
}