{
  "patent_number": "None",
  "application_number": "15729362",
  "date_published": "20180201",
  "date_produced": "20180117",
  "filing_date": "20171010",
  "main_ipcr_label": "G06N9900",
  "abstract": "Examples relate to providing hierarchical classifiers. In some examples, a superclass classifier of a hierarchy of classifiers is trained with a first type of prediction threshold, where the superclass classifier classifies data into one of a number of subclasses. At this stage, a subclass classifier is trained with a second type of prediction threshold, where the subclass classifier classifies the data into one of a number of classes. The first type of prediction threshold of the superclass classifier and the second type of prediction threshold of the subclass classifier are alternatively applied to classify data segments.",
  "publication_number": "US20180032917A1-20180201",
  "summary": "<SOH> BRIEF DESCRIPTION OF THE DRAWINGS <EOH>The following detailed description references the drawings, wherein: FIG. 1 is a block diagram of an example computing device for providing hierarchical classifiers; FIG. 2 is a block diagram of an example computing device for providing hierarchical classifiers; FIG. 3 is a flowchart of an example method for execution by a computing device for providing hierarchical classifiers; and FIG. 4 is an example hierarchy of classifiers that can be trained and applied to observed data. detailed-description description=\"Detailed Description\" end=\"lead\"?",
  "ipcr_labels": [
    "G06N9900",
    "G06N504"
  ],
  "inventor_list": [
    {
      "inventor_name_last": "HAGEN",
      "inventor_name_first": "Josiah Dede",
      "inventor_city": "Austin",
      "inventor_state": "TX",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "NIEMCZYK",
      "inventor_name_first": "Brandon",
      "inventor_city": "Austin",
      "inventor_state": "TX",
      "inventor_country": "US"
    }
  ],
  "title": "HIERARCHICAL CLASSIFIERS",
  "decision": "PENDING",
  "_processing_info": {
    "original_size": 31248,
    "optimized_size": 1900,
    "reduction_percent": 93.92
  }
}