{
  "patent_number": "None",
  "application_number": "15725335",
  "date_published": "20180412",
  "date_produced": "20180328",
  "filing_date": "20171005",
  "main_ipcr_label": "G06N700",
  "abstract": "A method executable via operation of configured processing circuitry may include constructing a mutual information graph for categorical data with respect to observed attributes of a plurality of entities described in terms of respective ones of the observed attributes by the categorical data, determining a clique tree correlating attributes having at least a threshold level of mutual dependence among the observed attributes, and determining a normality rating for an entity relative to the plurality of entities based on the clique tree.",
  "publication_number": "US20180101783A1-20180412",
  "summary": "<SOH> BRIEF SUMMARY OF SOME EXAMPLES <EOH>Some example embodiments may enable the provision of a probabilistic approach to data representation that addresses the challenges described above. In one example embodiment, an apparatus including processing circuitry configured to execute instructions that, when executed, cause the apparatus to perform various operations may be provided. The operations may include constructing a mutual information graph for categorical data with respect to observed attributes of a plurality of entities described in terms of respective ones of the observed attributes by the categorical data, determining a clique tree correlating attributes having at least a threshold level of mutual dependence among the observed attributes, and determining a normality rating for an entity relative to the plurality of entities based on the clique tree. In another example embodiment, a method may be provided. The method may include constructing a mutual information graph for categorical data with respect to observed attributes of a plurality of entities described in terms of respective ones of the observed attributes by the categorical data, determining a clique tree correlating attributes having at least a threshold level of mutual dependence among the observed attributes, and determining a normality rating for an entity relative to the plurality of entities based on the clique tree. In still other examples, another method may be provided. The method may include utilizing a correlation metric with respect to observed attributes of a plurality of entities described in terms of respective ones of the observed attributes in categorical data, determining a clique tree defining entity groupings with correlated attributes based on the correlation metric, and determining a normality rating for an entity relative to the plurality of entities based on the clique tree.",
  "ipcr_labels": [
    "G06N700",
    "G06F1730",
    "G06F1715"
  ],
  "inventor_list": [
    {
      "inventor_name_last": "Savkli",
      "inventor_name_first": "Cetin",
      "inventor_city": "Annapolis",
      "inventor_state": "MD",
      "inventor_country": "US"
    }
  ],
  "title": "Method and Apparatus for Analysis and Classification of High Dimensional Data Sets",
  "decision": "PENDING",
  "_processing_info": {
    "original_size": 75507,
    "optimized_size": 3032,
    "reduction_percent": 95.98
  }
}