{
  "patent_number": "None",
  "application_number": "15724828",
  "date_published": "20180125",
  "date_produced": "20180109",
  "filing_date": "20171004",
  "main_ipcr_label": "G06N308",
  "abstract": "Certain embodiments involve generating or optimizing a neural network for generating analytical or predictive outputs. The neural network can be generated using a relationship between various predictor variables and an outcome (e.g., a condition's presence or absence). The neural network can be used to determine a relationship between each of the predictor variables and a response variable. The neural network can be optimized by iteratively adjusting the neural network such that a monotonic relationship exists between each of the predictor variables and the response variable. The optimized neural network can be used both for accurately determining response variables using predictor variables and determining adverse action codes for the predictor variables, which indicate an effect or an amount of impact that a given predictor variable has on the response variable. The neural network can be used to generate adverse action codes upon which consumer behavior can be modified to improve the...",
  "publication_number": "US20180025273A1-20180125",
  "summary": "<SOH> SUMMARY <EOH>Various embodiments of the present disclosure provide systems and methods for optimizing a neural network for generating a predictive or analytical output (e.g., a risk assessment). The neural network can model relationships between various predictor variables and various outcomes modeled using one or more response variables. Examples of outcomes include, but are not limited to, a positive outcome indicating the satisfaction of a condition and a negative outcome indicating a failure to satisfy a condition. The neural network can be optimized by iteratively adjusting the neural network such that a monotonic relationship exists between each of the predictor variables and the response variable. In some aspects, the optimized neural network can be used both for accurately determining response variables using predictor variables and determining explanatory data for the predictor variables, which indicates an effect or an amount of impact that a given predictor variable has on the response variable. An example of explanatory data is an adverse action code. This summary is not intended to identify key or essential features of the claimed subject matter, nor is it intended to be used in isolation to determine the scope of the claimed subject matter. The subject matter should be understood by reference to appropriate portions of the entire specification, any or all drawings, and each claim. The foregoing, together with other features and examples, will become more apparent upon referring to the following specification, claims, and accompanying drawings.",
  "ipcr_labels": [
    "G06N308",
    "G06N700",
    "G06N304"
  ],
  "inventor_list": [
    {
      "inventor_name_last": "Jordan",
      "inventor_name_first": "Lewis",
      "inventor_city": "Atlanta",
      "inventor_state": "GA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Turner",
      "inventor_name_first": "Matthew",
      "inventor_city": "Cumming",
      "inventor_state": "GA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "McBurnett",
      "inventor_name_first": "Michael",
      "inventor_city": "Cumming",
      "inventor_state": "GA",
      "inventor_country": "US"
    }
  ],
  "title": "OPTIMIZING NEURAL NETWORKS FOR GENERATING ANALYTICAL OR PREDICTIVE OUTPUTS",
  "decision": "PENDING",
  "_processing_info": {
    "original_size": 91003,
    "optimized_size": 3466,
    "reduction_percent": 96.19
  }
}