{
  "patent_number": "None",
  "application_number": "15725696",
  "date_published": "20180412",
  "date_produced": "20180328",
  "filing_date": "20171005",
  "main_ipcr_label": "G06N9900",
  "abstract": "A technique relates to a microwave detection device. A quantum non-demolition microwave photon detector is connected to a quadrature microwave hybrid coupler connected. A dispersive nonlinear element is coupled to the quadrature microwave hybrid coupler.",
  "publication_number": "US20180101785A1-20180412",
  "summary": "<SOH> SUMMARY <EOH>According to one or more embodiments, a microwave detection device is provided. The microwave detection device includes a quantum non-demolition microwave photon detector, a quadrature microwave hybrid coupler connected to the quantum non-demolition microwave photon detector, and a dispersive nonlinear element coupled to the quadrature microwave hybrid coupler. According to one or more embodiments, a method of forming a microwave detection device is provided. The method includes providing a quantum non-demolition microwave photon detector, providing a quadrature microwave hybrid coupler connected to the quantum non-demolition microwave photon detector, and providing a dispersive nonlinear element coupled to the quadrature microwave hybrid coupler. According to one or more embodiments, a method of detecting a microwave photon is provided. The method includes receiving, by a quadrature microwave hybrid coupler, a reflected microwave signal from a quantum non-demolition microwave device. Also, the method includes determining a presence of the microwave photon based on a dispersive nonlinear element being in a voltage state. The dispersive nonlinear element is coupled to the quadrature microwave hybrid coupler. According to one or more embodiments, a method of detecting an absence of a microwave photon is provided. The method includes receiving, by a quadrature microwave hybrid coupler, a reflected microwave signal from a quantum non-demolition microwave device. Also, the method includes determining the absence of the microwave photon based on a dispersive nonlinear element being in a zero-voltage state. The dispersive nonlinear element is coupled to the quadrature microwave hybrid coupler.",
  "ipcr_labels": [
    "G06N9900",
    "G01R2908"
  ],
  "inventor_list": [
    {
      "inventor_name_last": "Abdo",
      "inventor_name_first": "Baleegh",
      "inventor_city": "Carmel",
      "inventor_state": "NY",
      "inventor_country": "US"
    }
  ],
  "title": "HIGH FIDELITY THRESHOLD DETECTION OF SINGLE MICROWAVE PHOTONS USING A QUANTUM NON-DEMOLITION PHOTON DETECTOR",
  "decision": "PENDING",
  "_processing_info": {
    "original_size": 73621,
    "optimized_size": 2592,
    "reduction_percent": 96.48
  }
}