{
  "patent_number": "None",
  "application_number": "15727693",
  "date_published": "20180201",
  "date_produced": "20180117",
  "filing_date": "20171009",
  "main_ipcr_label": "G06N504",
  "abstract": "Certain relationships representing material insights are identified from among a set of discovered relationships. Cognitive discovery of relationships in a knowledge base, or corpus, are ranked according to one or more metrics indicative of material insights, including recentness and degree of alignment.",
  "publication_number": "US20180032887A1-20180201",
  "summary": "<SOH> SUMMARY <EOH>A method, computer program product, and computer system includes: identifying a focus within a natural language question; mining a first body of information for disclosure of entities within the first body of information; determining relationships among the entities based on the focus; generating a targeting document containing a first relationship and a second relationship, the first and second relationships being relationships among the entities determined from the first body of information; recording mining data for relationships in the targeting document in support of an importance criteria; ranking the first relationship with respect to the second relationship based on the recorded mining data and according to the importance criteria as a set of ranking data; and storing the targeting document including the set of ranking data and mining data in the first body of information for on-demand access during a question-answer session corresponding to the domain of knowledge. The importance criteria is a first degree to which first relationship is known and a second degree to which the second relationship is known according to a dictionary of commonly known relationships for the domain of knowledge. The first relationship being ranked as more important than the second relationship because the first degree is smaller than the second degree.",
  "ipcr_labels": [
    "G06N504",
    "G06N302",
    "G06N9900",
    "G06F1728",
    "G06N502",
    "G09B704",
    "G06F944"
  ],
  "inventor_list": [
    {
      "inventor_name_last": "Gordon",
      "inventor_name_first": "John B.",
      "inventor_city": "Austin",
      "inventor_state": "TX",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Hogan",
      "inventor_name_first": "John P.",
      "inventor_city": "Hurley",
      "inventor_state": "NY",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Kottaram",
      "inventor_name_first": "Sanjay F.",
      "inventor_city": "Cedar Park",
      "inventor_state": "TX",
      "inventor_country": "US"
    }
  ],
  "title": "SIGNIFICANCE OF RELATIONSHIPS DISCOVERED IN A CORPUS",
  "decision": "PENDING",
  "_processing_info": {
    "original_size": 62101,
    "optimized_size": 2584,
    "reduction_percent": 95.84
  }
}