{
  "patent_number": "None",
  "application_number": "15722270",
  "date_published": "20180531",
  "date_produced": "20180516",
  "filing_date": "20171002",
  "main_ipcr_label": "G06N308",
  "abstract": "An information processing device includes: a processor that executes a process, the process including: controlling a recognition process that performs, with respect to input neuron data, a hierarchical neural network operation including a weighting operation using a parameter and that holds the neuron data and the parameter of each layer of the neural network in each of memory areas; and performing, in a learning process of learning the parameter of each layer of the neural network from an error that is obtained from a recognition result, regarding the layer in which the neuron data and the parameter are held in the memory areas, control of calculating an error of the neuron data after calculating an error of the parameter.",
  "publication_number": "US20180150745A1-20180531",
  "summary": "<SOH> SUMMARY <EOH>According to an aspect of an embodiment, an information processing device includes: a processor that executes a process, the process including: controlling a recognition process that performs, with respect to input neuron data, a hierarchical neural network operation including a weighting operation using a parameter and that holds the neuron data and the parameter of each layer of the neural network in each of memory areas; and performing, in a learning process of learning the parameter of each layer of the neural network from an error that is obtained from a recognition result, regarding the layer in which the neuron data and the parameter are held in the memory areas, control of calculating an error of the neuron data after calculating an error of the parameter. The object and advantages of the invention will be realized and attained by means of the elements and combinations particularly pointed out in the claims. It is to be understood that both the foregoing general description and the following detailed description are exemplary and explanatory and are not restrictive of the invention, as claimed.",
  "ipcr_labels": [
    "G06N308",
    "G06N304",
    "G06K962"
  ],
  "inventor_list": [
    {
      "inventor_name_last": "SHIRAHATA",
      "inventor_name_first": "Koichi",
      "inventor_city": "Yokohama",
      "inventor_state": "",
      "inventor_country": "JP"
    }
  ],
  "title": "INFORMATION PROCESSING DEVICE AND INFORMATION PROCESSING SYSTEM",
  "decision": "PENDING",
  "_processing_info": {
    "original_size": 112368,
    "optimized_size": 2442,
    "reduction_percent": 97.83
  }
}