{
  "patent_number": "None",
  "application_number": "15723457",
  "date_published": "20180607",
  "date_produced": "20180523",
  "filing_date": "20171003",
  "main_ipcr_label": "G06N308",
  "abstract": "Provided are device and method for determining a Convolutional Neural Network (CNN) model. The device for determining the CNN model includes: a first determination unit configured to determine complexity of a database including multiple samples; a second determination unit configured to determine a classification capability of a CNN model applicable to the database based on the complexity of the database; a third determination unit configured to acquire classification capability of each candidate CNN model; and a matching unit configured to determine the CNN model applicable to the database based on the classification capability of each candidate CNN model. With the device and method for determining the CNN module, a design process of CNN model can be simplified.",
  "publication_number": "US20180157976A1-20180607",
  "summary": "<SOH> SUMMARY <EOH>In this section, it is provided a general summary of the present disclosure, instead of fully disclosing a full scope or all features of the present disclosure. An object of the present disclosure is to provide device and method for determining a Convolutional Neural Network (CNN) model. With the device and method, a design process of the CNN model can be simplified to make an ordinary person, as a user, able easily design and adjust the CNN model, and a CNN model more matching with a database can be designed. A device for determining a CNN model is provided according to an aspect of the present disclosure. The device includes: a first determination unit, configured to determine complexity of a database comprising multiple samples; a second determination unit, configured to determine a classification capability of a CNN model applicable to the database based on the complexity of the database; a third determination unit, configured to acquire classification capability of each of the multiple candidate CNN models; and a matching unit, configured to determine the CNN model applicable to the database based on the classification capability of each candidate CNN model and the classification capability of the CNN model applicable to the database. A method for determining a CNN model is provided according to another aspect of the present disclosure. The method includes: determining complexity of a database comprising multiple samples; determining a classification capability of a CNN model applicable to the database based on the complexity of the database; acquiring classification capability of each of the multiple candidate CNN models; and determining the CNN model applicable to the database based on the classification capability of each candidate CNN model and the classification capability of the CNN model applicable to the database. A program product is provided according to another aspect of the present disclosure. The program product includes machine ...",
  "ipcr_labels": [
    "G06N308",
    "G06N310"
  ],
  "inventor_list": [
    {
      "inventor_name_last": "SUN",
      "inventor_name_first": "Li",
      "inventor_city": "Beijing",
      "inventor_state": "",
      "inventor_country": "CN"
    },
    {
      "inventor_name_last": "WANG",
      "inventor_name_first": "Song",
      "inventor_city": "Beijing",
      "inventor_state": "",
      "inventor_country": "CN"
    },
    {
      "inventor_name_last": "FAN",
      "inventor_name_first": "Wei",
      "inventor_city": "Beijing",
      "inventor_state": "",
      "inventor_country": "CN"
    },
    {
      "inventor_name_last": "SUN",
      "inventor_name_first": "Jun",
      "inventor_city": "Beijing",
      "inventor_state": "",
      "inventor_country": "CN"
    }
  ],
  "title": "DEVICE AND METHOD FOR DETERMINING CONVOLUTIONAL NEURAL NETWORK MODEL",
  "decision": "PENDING",
  "_processing_info": {
    "original_size": 76725,
    "optimized_size": 3743,
    "reduction_percent": 95.12
  }
}