{
  "patent_number": "None",
  "application_number": "15724796",
  "date_published": "20180531",
  "date_produced": "20180516",
  "filing_date": "20171004",
  "main_ipcr_label": "G06N9900",
  "abstract": "A method and apparatus used for general purpose problem solving using entanglement properties of holography. Intelligent point-based entities having spatial and other electromagnetic properties called DROPLETS [Data-Representative-Object-Particle(s)-Liking-EnTanglement] are generated as avatars, or delegate objects, connected to concrete or abstract data sources representing a situation, event or other problem. Each DROPLET's properties are controlled by changes in the input sources, feedback, changes in itself, and/or changes of other DROPLETS. Coherent rays are introduced and interact with said DROPLETS, generating an INTELLIGENCE WAVEFRONT. Interference patterns are recorded and converted to binary machine codes used as instruction keys to store and lock human readable and/or machine readable content components into a plurality of associative memories. Said content includes waveforms, harmonics, codes, data, and other holograms. Upon recognition of future like-patterns of situations...",
  "publication_number": "US20180150763A1-20180531",
  "summary": "<SOH> BRIEF SUMMARY OF INVENTION <EOH>The Holographic Computer System (HCS, or “the system”) is a method and apparatus used for recognizing and solving problems. The first goal of the invention is to acquire a wide latitude of datasets in a plurality of knowledge domains having to do with situations, events and other problems. Another goal of the invention is to convert all or part of the data which is input into objects which have spatial properties that permit them to be entangled wholistically in a manner that approximates or emulates quantum theories of interconnectedness of all things, known as entanglement. This wholistic entanglement is regarded in the invention as Stimulus A. It is here noted that Stimulus A may be wholly or in part, derived from Stimulus B, explained below. Another goal of the invention is to also acquire a wide latitude of datasets in a plurality of knowledge domains having to do with possible solutions to said situations, events and other problems. These solutions, in the form of human readable and/or machine readable waveforms, codes and other data, are regarded in the invention as Stimulus B. It is here noted that Stimulus B may be wholly or in part, derived from Stimulus A. A main goal of the invention is to store data and information by reason of associating pluralities of Stimulus A with pluralities of Stimulus B so that a large knowledge base of situations, events and other problems along with potential solutions to the same is created over time. The primary goal of the invention is to subsequently be able to recognize similar future situations, events and other problems as they occur so that the system may recall any plurality of Stimulus B from the broad knowledge base, be it filtered or unfiltered, processed or unprocessed, as useful solutions and/or partial solutions in the form of human readable and/or machine readable content. A further goal of the invention is that it acquire enough machine intelligence making it suitable to ...",
  "ipcr_labels": [
    "G06N9900",
    "G06E300",
    "B82Y1000"
  ],
  "inventor_list": [
    {
      "inventor_name_last": "Dluhos",
      "inventor_name_first": "Eric John",
      "inventor_city": "Mifflinburg",
      "inventor_state": "PA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Wilk",
      "inventor_name_first": "Bradley Lloyd",
      "inventor_city": "Pacific Grove",
      "inventor_state": "CA",
      "inventor_country": "US"
    }
  ],
  "title": "Holographic Computer System",
  "decision": "PENDING",
  "_processing_info": {
    "original_size": 131607,
    "optimized_size": 3715,
    "reduction_percent": 97.18
  }
}