{
  "patent_number": "None",
  "application_number": "15730112",
  "date_published": "20180201",
  "date_produced": "20180117",
  "filing_date": "20171011",
  "main_ipcr_label": "G06N700",
  "abstract": "A system and method for predicting, proposing and/or evaluating suitable medication dosing regimens for a specific individual as a function of individual-specific characteristics and observed responses of the specific individual. Mathematical models of observed patient responses are used in determining an initial dose. The system and method use the patient's observed response to the initial dose to refine the model for use to forecast expected responses to proposed dosing regimens more accurately for a specific patient. More specifically, the system and method uses Bayesian averaging, Bayesian updating and Bayesian forecasting techniques to develop patient-specific dosing regimens as a function of not only generic mathematical models and patient-specific characteristics accounted for in the models as covariate patient factors, but also observed patient-specific responses that are not accounted for within the models themselves, and that reflect variability that distinguishes the specifi...",
  "publication_number": "US20180032892A1-20180201",
  "summary": "<SOH> SUMMARY <EOH>The present invention provides a system and method for providing patient-specific medication dosing as a function of mathematical models updated to account for an observed patient response. More specifically, the present invention provides a system and method for predicting, proposing and/or evaluating suitable medication dosing regimens for a specific individual as a function of individual-specific characteristics and observed responses of the specific individual to the medication. Conceptually, the present invention provides access, in a direct way, to mathematical models of observed patient responses to a medication. In prescribing an initial dose, the present invention allows for use of published mathematical model(s) to predict a specific patient's response as a function of patient-specific characteristics that are account for in the model(s) as patient factor covariates. Accordingly, the prescribing physician is able to leverage the model(s) in developing a reasonably tailored initial dose for a specific patient, as a function of the specific patient's characteristics, with much greater precision than a PI can provide. To account for this uniqueness of any particular patient (BSV), the present invention allows for further use of the specific patient's observed response to the initial dosing regimen to adjust the dosing regimen. Specifically, the inventive system and method uses the patient's observed response in conjunction with the published mathematical model(s) and patient-specific characteristics to account for BSV that cannot be accounted for by the mathematical models alone. Accordingly, the present invention allows observed responses of the specific patient to be used refine the models and related forecasts, to effectively personalize the models so that they may be used to forecast expected responses to proposed dosing regimens more accurately for a specific patient. By using the observed response data to personalize the models, the m...",
  "ipcr_labels": [
    "G06N700",
    "G06F1900"
  ],
  "inventor_list": [
    {
      "inventor_name_last": "Mould",
      "inventor_name_first": "Diane R.",
      "inventor_city": "Fort Myers",
      "inventor_state": "FL",
      "inventor_country": "US"
    }
  ],
  "title": "SYSTEM AND METHOD FOR PROVIDING PATIENT-SPECIFIC DOSING AS A FUNCTION OF MATHEMATICAL MODELS UPDATED TO ACCOUNT FOR AN OBSERVED PATIENT RESPONSE",
  "decision": "PENDING",
  "_processing_info": {
    "original_size": 107249,
    "optimized_size": 3650,
    "reduction_percent": 96.6
  }
}