{
  "filing_date": "20180115",
  "publication_number": "US20180165570A1-20180614",
  "decision": "PENDING",
  "summary": "<SOH> SUMMARY <EOH>According to a first aspect of the present invention, provided is an emotion control system comprising an information acquiring section that acquires network content acquired from a public network; a storage section that stores effect information indicating an effect exerted on an emotion of a control target by the network content; an updating section that updates the effect information stored in the storage section, based on sensor information detected by a sensor of the control target; and an emotion control section that controls the emotion of the control target based on the network content acquired by the information acquiring section and the effect information stored in the storage section. The emotion control system may further comprise an extracting section that analyzes characters included in the network content acquired by the information acquiring section and extracts meaning content from the network content, the effect information may indicate whether the meaning content of the network content is preferable for the control target, and the emotion control section may control the emotion of the control target based on the meaning content of the network content extracted by the extracting section and the effect information stored in the storage section. The emotion control system may further comprise a judging section that judges whether the meaning content of the network content extracted by the information acquiring section corresponds to a predetermined restricted topic, and if the judging section judges that the meaning content of the network content extracted by the extracting section corresponds to the predetermined restricted topic, the emotion control section may lower a degree by which the network content acquired by the information acquiring section affects the emotion of the control target. The emotion control section may determine a parameter indicating the emotion of the control target using a neural network, based on the netw...",
  "title": "EMOTION CONTROL SYSTEM, SYSTEM, AND PROGRAM",
  "ipcr_labels": [
    "G06N300",
    "G06N308",
    "G06N304",
    "G06N3063"
  ],
  "abstract": "It is impossible to change tastes and preferences with a robot or artificial intelligence. Provided is an emotion control system comprising an information acquiring section that acquires network content acquired from a public network; a storage section that stores effect information indicating an effect exerted on an emotion of a control target by the network content; an updating section that updates the effect information stored in the storage section, based on sensor information detected by a sensor of the control target; and an emotion control section that controls the emotion of the control target based on the network content acquired by the information acquiring section and the effect information stored in the storage section.",
  "patent_number": "nan",
  "application_number": "15744856",
  "date_published": "20180614",
  "main_ipcr_label": "G06N300",
  "date_produced": "20180530",
  "inventor_list": [
    {
      "inventor_name_last": "SON",
      "inventor_name_first": "Masayoshi",
      "inventor_city": "Tokyo",
      "inventor_state": "",
      "inventor_country": "JP"
    },
    {
      "inventor_name_last": "TOMONAGA",
      "inventor_name_first": "Kosuke",
      "inventor_city": "Tokyo",
      "inventor_state": "",
      "inventor_country": "JP"
    }
  ],
  "_processing_info": {
    "original_size": 59960,
    "optimized_size": 3443,
    "reduction_percent": 94.26
  }
}