{
  "patent_number": "nan",
  "application_number": "15740791",
  "date_published": "20180712",
  "date_produced": "20180627",
  "filing_date": "20171229",
  "main_ipcr_label": "G06N3063",
  "abstract": "Disclosed herein is a neuromorphic percolating network (100). The network comprises a substrate (102) having at least two electrical contacts (104A, 104B); a plurality of nanoparticles (106, 108, 100) distributed on the substrate (102), at least some of the nanoparticles positioned between at least two of the at least two electrical contacts, the surface coverage of the nanoparticles within a tolerance of a percolation threshold; and at least one memristive element (116) located at least partially in a gap between nanoparticles, or groups of nanoparticles, that are not otherwise directly connected to each other, the memristive element(s) at least partially providing at least one persistent pathway (118,120) of increased activity. Disclosed herein are methods for fabricating a neuromorphic percolating network or component thereof, and neuromorphic percolating networks formed by such methods.",
  "publication_number": "US20180197077A1-20180712",
  "summary": "<SOH> SUMMARY OF THE INVENTION <EOH>In one aspect the invention comprises a neuromorphic percolating network comprising a substrate having at least two electrical contacts; a plurality of nanoparticles distributed on the substrate, at least some of the nanoparticles positioned between at least two of the at least two electrical contacts, the surface coverage of the nanoparticles within a tolerance of a percolation threshold; and at least one memristive element located at least partially in a gap between nanoparticles, or groups of nanoparticles, that are not otherwise directly connected to each other, the memristive element(s) at least partially providing at least one persistent pathway of increased activity. The term ‘comprising’ as used in this specification means ‘consisting at least in part of’. When interpreting each statement in this specification that includes the term ‘comprising’, features other than that or those prefaced by the term may also be present. Related terms such as ‘comprise’ and ‘comprises’ are to be interpreted in the same manner. Preferably the network further comprises a plurality of memristive elements located at least partially in respective gaps between nanoparticles, or groups of nanoparticles, that are not otherwise directly connected to each other. Preferably the at least one persistent pathway of increased activity comprises at least one persistent pathway of increased conductivity. Preferably the at least one persistent pathway of increased activity comprises at least one persistent pathway that includes a plurality of memristive elements whose switching rate or likelihood of switching is increased. Preferably the at least one persistent pathway of increased activity is between two of the at least two electrical contacts. Preferably at least some of the nanoparticles are at least partially oxidised so as to limit the extent of coalescence of the nanoparticles. Preferably at least some of the nanoparticles are conducting. Preferably a...",
  "ipcr_labels": [
    "G06N3063"
  ],
  "inventor_list": [
    {
      "inventor_name_last": "Brown",
      "inventor_name_first": "Simon Anthony",
      "inventor_city": "Christchurch",
      "inventor_state": "",
      "inventor_country": "NZ"
    },
    {
      "inventor_name_last": "Fostner",
      "inventor_name_first": "Shawn",
      "inventor_city": "Grenoble",
      "inventor_state": "",
      "inventor_country": "FR"
    },
    {
      "inventor_name_last": "Bose",
      "inventor_name_first": "Saurabh Kumar",
      "inventor_city": "Christchurch",
      "inventor_state": "",
      "inventor_country": "NZ"
    }
  ],
  "title": "NEUROMORPHIC NETWORK",
  "decision": "PENDING",
  "_processing_info": {
    "original_size": 118694,
    "optimized_size": 3767,
    "reduction_percent": 96.83
  }
}