{
  "filing_date": "20180314",
  "publication_number": "US20180240030A1-20180823",
  "decision": "PENDING",
  "summary": "<SOH> SUMMARY <EOH>In one aspect, in general, the present disclosure describes a content recommendation method and device, which are capable of recommending content based on a user's feedback so that it is possible to perform reasonable and effective content recommendation for random users who have less click behaviors. According to one aspect of the present disclosure, there is described a content recommendation method, comprising: recommending a content in a content set to a user based on an average recommendation probability; collecting feedback information on the recommended content from the user's client; and determining a sequence of preferred contents from the contents in the content set according to the feedback information, so as to recommend a content to the user based on the sequence of preferred contents. According to another aspect of the present disclosure, there is described a content recommendation method, comprising: creating a content pool which comprises a plurality of content sets each containing contents of corresponding type, respectively; and executing the method in the above aspect on the respective content sets in the content pool, to generate sequences of preferred contents for the respective content sets. According to another aspect of the present disclosure, there is described a content recommendation device comprising: a first recommendation unit configured to recommend a content in a content set to a user based on an average recommendation probability; a collection unit configured to collect feedback information on the recommended content from the user's client; and a determination unit configured to determine a sequence of preferred contents from the contents in the content set according to the feedback information, so as to recommend a content to the user based on the sequence of preferred content. According to another aspect of the present disclosure, there is described a content recommendation device comprising: a creation unit conf...",
  "title": "CONTENT RECOMMENDATION METHOD, APPARATUS AND SYSTEM",
  "ipcr_labels": [
    "G06N700"
  ],
  "abstract": "The present disclosure relates to a content recommendation method, device and system. The method includes: recommending a content in a content set to a user based on an average recommendation probability; collecting feedback information on the recommended content from the user's client, wherein the feedback information includes display information and click information, the display information including displaying times and displaying timing of the recommended content on the client, and the click information including clicking times and clicking timing of the recommended content on the client; and determining a sequence of preferred contents from the contents in the content set according to the feedback information, so as to recommend a content to the user based on the sequence of preferred contents. Respective aspects of the present disclosure recommend contents based on a user's feedback so that it is possible to perform reasonable and effective content recommendation for random user...",
  "patent_number": "nan",
  "application_number": "15759902",
  "date_published": "20180823",
  "main_ipcr_label": "G06N700",
  "date_produced": "20180808",
  "inventor_list": [
    {
      "inventor_name_last": "SHEN",
      "inventor_name_first": "Shixing",
      "inventor_city": "Beijing",
      "inventor_state": "",
      "inventor_country": "CN"
    },
    {
      "inventor_name_last": "WANG",
      "inventor_name_first": "Biyao",
      "inventor_city": "Beijing",
      "inventor_state": "",
      "inventor_country": "CN"
    },
    {
      "inventor_name_last": "YIN",
      "inventor_name_first": "Yuzong",
      "inventor_city": "Beijing",
      "inventor_state": "",
      "inventor_country": "CN"
    },
    {
      "inventor_name_last": "YAO",
      "inventor_name_first": "Jian",
      "inventor_city": "Beijing",
      "inventor_state": "",
      "inventor_country": "CN"
    },
    {
      "inventor_name_last": "PAN",
      "inventor_name_first": "Baiyu",
      "inventor_city": "Beijing",
      "inventor_state": "",
      "inventor_country": "CN"
    },
    {
      "inventor_name_last": "WANG",
      "inventor_name_first": "Ji",
      "inventor_city": "Beijing",
      "inventor_state": "",
      "inventor_country": "CN"
    }
  ],
  "_processing_info": {
    "original_size": 57855,
    "optimized_size": 4231,
    "reduction_percent": 92.69
  }
}