{
  "filing_date": "20180328",
  "publication_number": "US20180285724A1-20181004",
  "decision": "PENDING",
  "summary": "<SOH> BRIEF DESCRIPTION OF THE DRAWINGS <EOH>FIGS. 1A and 1B are diagrams for explaining a configuration of a neuro-semiconductor device according to an aspect of the present invention. FIG. 2 is an internal transparent perspective view of a semiconductor chip constituting the neuro-semiconductor device of FIGS. 1A and 1B . FIG. 3 is a schematic cross-sectional view for explaining non-contact communication in the neuro-semiconductor device of FIGS. 1A and 1B . FIG. 4 is a diagram showing superiority of synapse imitation by magnetic coupling used for non-contact communication, in the neuro-semiconductor device shown in FIGS. 1A and 1B to FIG. 3 to which μTCI is applied. FIGS. 5A and 5B are diagrams showing a trial calculation of power consumption of the neuro-semiconductor device shown in FIGS. 1A and 1B to FIG. 3 to which μTCI is applied. FIG. 6 is a diagram for explaining benefits when magnetic coupling and semiconductor wafer thinning are combined for the neuro-semiconductor device shown in FIGS. 1A and 1B to FIG. 3 to which μTCI is applied. detailed-description description=\"Detailed Description\" end=\"lead\"?",
  "title": "SEMICONDUCTOR DEVICE",
  "ipcr_labels": [
    "G06N3063",
    "G06N304"
  ],
  "abstract": "In order to provide a 1H-magnitude neuro-semiconductor device, a semiconductor device that constitutes a neural network in which a plurality of sets each including a plurality of synapse bonds and a neuron section are connected with each other. The semiconductor device includes the synapse bonds that perform non-contact communications using magnetic coupling, and the neuron sections including a wired connection and a logical circuit. The semiconductor device has a connection array in which the synapse bonds and the neuron sections are arranged three-dimensionally. The semiconductor device has a function for enabling reconfiguration of at least some of groupings of the connection array or wired short-distance, intermediate-distance, or long-distance connections.",
  "patent_number": "nan",
  "application_number": "15764005",
  "date_published": "20181004",
  "main_ipcr_label": "G06N3063",
  "date_produced": "20180919",
  "inventor_list": [
    {
      "inventor_name_last": "SAITO",
      "inventor_name_first": "Motoaki",
      "inventor_city": "Tokyo",
      "inventor_state": "",
      "inventor_country": "JP"
    }
  ],
  "_processing_info": {
    "original_size": 33328,
    "optimized_size": 2429,
    "reduction_percent": 92.71
  }
}