{
  "filing_date": "20180425",
  "publication_number": "US20180253656A1-20180906",
  "decision": "PENDING",
  "summary": "<SOH> BRIEF DESCRIPTION OF DRAWINGS <EOH>The following detailed description refers to the appended drawings in which: FIG. 1 schematically illustrates a system comprising a first device and a second device exchanging requests via interfaces; FIG. 2 is a flow diagram illustrating an example of reordering not (successfully) processed requests in the system of FIG. 1 ; FIG. 3 is a flow diagram illustrating another example of reordering not (successfully) processed requests in the system of FIG. 1 ; and FIG. 4 is a flow diagram illustrating an example of a fuzzy logic engine that may be used in the reordering process. detailed-description description=\"Detailed Description\" end=\"lead\"?",
  "title": "FUZZY LOGIC BASED RESENDING ORDER OF NOT SUCCESSFULLY PROCESSED REQUESTS",
  "ipcr_labels": [
    "G06N504"
  ],
  "abstract": "Provided is a process in which a plurality of requests is sent from an interface of a first device to an interface of a second device. If it is determined that at least some of the plurality of requests have not successfully been processed by the second device, an order of at least some of the not successfully processed requests is determined for resending, wherein the order is based on a fuzzy logic implementation.",
  "patent_number": "nan",
  "application_number": "15771016",
  "date_published": "20180906",
  "main_ipcr_label": "G06N504",
  "date_produced": "20180822",
  "inventor_list": [
    {
      "inventor_name_last": "Ivanov",
      "inventor_name_first": "Plamen Valentinov",
      "inventor_city": "Sofia",
      "inventor_state": "",
      "inventor_country": "BG"
    },
    {
      "inventor_name_last": "Lozanov",
      "inventor_name_first": "Lozen",
      "inventor_city": "Sofia",
      "inventor_state": "",
      "inventor_country": "BG"
    }
  ],
  "_processing_info": {
    "original_size": 27979,
    "optimized_size": 1815,
    "reduction_percent": 93.51
  }
}