{
  "patent_number": "None",
  "application_number": "15787691",
  "date_published": "20180301",
  "date_produced": "20180213",
  "filing_date": "20171018",
  "main_ipcr_label": "G06N502",
  "abstract": "Methods and systems are provided for cloud processing data streamed from a vehicle and a home (e.g., any location) associated with a user account. One method includes receiving a data stream from the vehicle entity, where the data stream from the vehicle entity includes metadata from one or more data producing objects of the vehicle entity. And, receiving a data stream from the home entity, where the data stream from the home entity includes metadata from one or more data producing objects of the home entity. The method includes accessing action conditions associated with a user account. The action conditions identify a position where at least one or more states of the metadata from each of the home entity and the vehicle entity intersect. And, each action condition identifies a type or types of control information to be processed. The method includes processing the received metadata from the vehicle entity and the home entity. The processing identifies metadata of the home entity and ...",
  "publication_number": "US20180060742A1-20180301",
  "summary": "<SOH> SUMMARY <EOH>Embodiments are disclosed which enable processing of data captured from a multitude of data producing objects. In one embodiment, data producing objects are associated with objects that relate to information, places, vehicles, homes, and environments associated with a user. For example, a vehicle can have a multitude of objects that capture information from sensors, receive input from users, and change location overtime. Similarly, users may associate specific location as home locations, wherein they may spend more time than other places. Home locations can include a person's home or work location or school location. At these home locations, users can have access to various types of data producing objects, such as lighting systems, alarm systems, camera systems, motion sensors, image sensors, entertainment systems, personal electronics, personal monitors, garden watering systems, solar systems, the energy grid, and the like. A common thread between these data producing objects is their relationship to specific users and/or associated user accounts. In some embodiments, intersections of relevance between disparate data produced by these data producing objects will yield new data that can provide useful assistance to a user. In specific examples, users that operate vehicles must rely on data produced by the vehicle. Some of this data is more relevant at particular times than others, such as speed information is more important when the vehicle is actively moving than when the vehicle is stopped. Other information, such as entertainment options in a vehicle may be more important when the operation of the vehicle appears to be occurring during a time of normal driving, as opposed to a time when abrupt driving maneuvers are taking place. Additionally, the status of one or more features of a home, such as lighting, heating and cooling, water gardening, entertainment functions, energy consumption, etc. will be more relevant or important when a user is at ...",
  "ipcr_labels": [
    "G06N502",
    "H04L2908",
    "B60L1118",
    "G05B1502",
    "G06F30481",
    "G09G514",
    "G07C500",
    "G06Q3002",
    "G06F944",
    "G06F316",
    "G06F314",
    "G06F30488",
    "G06F30484",
    "G06F30482",
    "H01M1048",
    "H01M1042"
  ],
  "inventor_list": [
    {
      "inventor_name_last": "Penilla",
      "inventor_name_first": "Angel A.",
      "inventor_city": "Sacramento",
      "inventor_state": "CA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Penilla",
      "inventor_name_first": "Albert S.",
      "inventor_city": "Sunnyvale",
      "inventor_state": "CA",
      "inventor_country": "US"
    }
  ],
  "title": "Methods and Cloud Processing Systems for Processing Data Streams From Data Producing Objects of Vehicles, Location Entities and Personal Devices",
  "decision": "PENDING",
  "_processing_info": {
    "original_size": 275266,
    "optimized_size": 3970,
    "reduction_percent": 98.56
  }
}