{
  "patent_number": "None",
  "application_number": "15782413",
  "date_published": "20180201",
  "date_produced": "20180117",
  "filing_date": "20171012",
  "main_ipcr_label": "G06N500",
  "abstract": "Constraint programming is used to solve problems that have many variables and that have many possible solutions. An interactive constraint solver application provides additional information to a user if a conflict arises between two choice-constraints so that the additional information can be used to resolve the conflict according to a model-constraint set up by an application developer. The additional information identifies a priority group, or queue, to which the constraint was added. Depending on the particulars included in the additional information, and the model-constraints, the conflict is resolved by the interactive constraint solver application.",
  "publication_number": "US20180032872A1-20180201",
  "summary": "<SOH> BRIEF DESCRIPTION OF THE DRAWINGS <EOH>FIG. 1 is an illustration of an environment in which various embodiments can be implemented. FIG. 2 is a block diagram of an example interactive constraint solver application, according to various embodiments. FIG. 3A is a flowchart of an example method of ordering constraints within priority groups, according to various embodiments. FIG. 3B is a chart depicting example ways a conflict can be resolved, according to various embodiments. FIGS. 4 depicts a general format of queues or groups that are used to order choice-constraints. FIG. 5 depicts examples of constraints being ordered within priority groups according to business rules during a first session, according to various embodiments. FIG. 6 depicts examples of constraints being ordered within priority groups according to business rules during a second session, according to various embodiments. FIG. 7 depicts examples of constraints being ordered within priority groups according to business rules during a third session, according to various embodiments. FIG. 8 is a block diagram of a computer system upon which various embodiments may be implemented. detailed-description description=\"Detailed Description\" end=\"lead\"?",
  "ipcr_labels": [
    "G06N500"
  ],
  "inventor_list": [
    {
      "inventor_name_last": "LEE",
      "inventor_name_first": "DAVID J.",
      "inventor_city": "Merrimack",
      "inventor_state": "NH",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "HUBERMAN",
      "inventor_name_first": "STEVEN",
      "inventor_city": "Carlisle",
      "inventor_state": "MA",
      "inventor_country": "US"
    }
  ],
  "title": "INTERACTIVE CONSTRAINT SOLVER",
  "decision": "PENDING",
  "_processing_info": {
    "original_size": 56086,
    "optimized_size": 2561,
    "reduction_percent": 95.43
  }
}