{
  "patent_number": "None",
  "application_number": "15786087",
  "date_published": "20180426",
  "date_produced": "20180411",
  "filing_date": "20171017",
  "main_ipcr_label": "G06N700",
  "abstract": "A device may receive, from a set of data sources, information associated with a topic. The device may determine a set of directional scores associated with the topic based on the information associated with the topic. The device may determine a set of sentiment scores associated with the topic based on the information associated with the topic. The device may determine, using a model, a trend score based on the set of directional scores and the set of sentiment scores. The device may provide information that identifies the trend score to permit an action to be performed.",
  "publication_number": "US20180114136A1-20180426",
  "summary": "<SOH> SUMMARY <EOH>According to some possible implementations, a device may include one or more processors to receive, from a set of data sources, information associated with a topic; determine a set of directional scores associated with the topic based on the information associated with the topic, the set of directional scores corresponding to the set of data sources, and the set of directional scores being indicative of a variation in a number of data points associated with the topic across a set of time frames; determine a set of sentiment scores associated with the topic based on the information associated with the topic, the set of sentiment scores corresponding to the set of data sources, and the set of sentiment scores being indicative of a sentiment associated with the topic; determine, using a model, a trend score based on the set of directional scores and the set of sentiment scores, the trend score being indicative of the variation in the number of data points and the sentiment associated with the topic; and provide information that identifies the trend score to permit an action to be performed. According to some possible implementations, a method may include receiving, by a device and from a set of data sources, information associated with a topic; determining, by the device, a set of directional scores associated with the topic based on the information associated with the topic, the set of directional scores corresponding to the set of data sources, and the set of directional scores being indicative of a variation in a number of data points associated with the topic across a set of time frames; determining, by the device, a set of sentiment scores associated with the topic based on the information associated with the topic, the set of sentiment scores corresponding to the set of data sources, and the set of sentiment scores being indicative of a sentiment associated with the topic; determining, by the device, a trend score based on the set of directiona...",
  "ipcr_labels": [
    "G06N700",
    "G06F1518",
    "G06Q3002"
  ],
  "inventor_list": [
    {
      "inventor_name_last": "KUMAR",
      "inventor_name_first": "Sheethal",
      "inventor_city": "Edina",
      "inventor_state": "MN",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Merl",
      "inventor_name_first": "Milton Jay",
      "inventor_city": "New York",
      "inventor_state": "NY",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Holla",
      "inventor_name_first": "Sudhir",
      "inventor_city": "Frisco",
      "inventor_state": "TX",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Rao B",
      "inventor_name_first": "Raghavendra",
      "inventor_city": "Bangalore",
      "inventor_state": "",
      "inventor_country": "IN"
    },
    {
      "inventor_name_last": "Olson",
      "inventor_name_first": "Wade J.",
      "inventor_city": "Minnetonka",
      "inventor_state": "MN",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "KUNCHALA",
      "inventor_name_first": "Sridhar",
      "inventor_city": "Hyderabad",
      "inventor_state": "",
      "inventor_country": "IN"
    },
    {
      "inventor_name_last": "SHARMA",
      "inventor_name_first": "Pragya C.",
      "inventor_city": "Mumbai",
      "inventor_state": "",
      "inventor_country": "IN"
    },
    {
      "inventor_name_last": "KUSHWAHA",
      "inventor_name_first": "Surendra",
      "inventor_city": "Bangalore",
      "inventor_state": "",
      "inventor_country": "IN"
    }
  ],
  "title": "TREND IDENTIFICATION USING MULTIPLE DATA SOURCES AND MACHINE LEARNING TECHNIQUES",
  "decision": "PENDING",
  "_processing_info": {
    "original_size": 90796,
    "optimized_size": 4197,
    "reduction_percent": 95.38
  }
}