{
  "patent_number": "None",
  "application_number": "15788232",
  "date_published": "20180426",
  "date_produced": "20180411",
  "filing_date": "20171019",
  "main_ipcr_label": "G06N502",
  "abstract": "The present disclosure relates to system(s) and method(s) for continuous business optimization of an organization based on a cognitive decision making process. In one embodiment, the method comprises generating an opportunity instance package associated with a business opportunity from a set of business opportunities associated with an organization based on analysis of a stream of raw data. Further, the method comprises generating a strategy using the opportunity instance package and one or more of a predictive technique, prescriptive technique and optimization technique. Furthermore, the method comprises generating a set of instruction associated with one or more actors associated with the organization based on the strategy, thereby enabling continuous business optimization of the organization based on a cognitive decision-making process.",
  "publication_number": "US20180114121A1-20180426",
  "summary": "<SOH> SUMMARY <EOH>Before the present an opportunity driven system and a method for continuous business optimization of an organization based on a cognitive decision-making process, are described, it is to be understood that this application is not limited to the particular systems, and methodologies described, as there can be multiple possible embodiments, which are not expressly illustrated in the present disclosures. It is also to be understood that the terminology used in the description is for the purpose of describing the particular implementations, versions, or embodiments only, and is not intended to limit the scope of the present application. This summary is provided to introduce aspects related to a system and a method for continuous business optimization of an organization based on a cognitive decision-making process. This summary is not intended to identify essential features of the claimed subject matter nor is it intended for use in determining or limiting the scope of the claimed subject matter. In one embodiment, a method for continuous business optimization of an organization based on a cognitive decision-making process is disclosed. In the embodiment, the method comprises the step of generating an opportunity instance package associated with a business opportunity from a set of business opportunities associated with an organization based on analysis of a stream of raw data. In one example, the generating may comprise the steps of receiving the stream of raw data from one or more sources internal or external to the organization and generating an opportunity input data package based on analysis of the stream of raw data using one or more predefined instructions. In the example, the one or more predefined instructions may comprise one or more data structures, and one or more pattern recognition algorithm associated with a business opportunity. In one other example, the generating may comprise the steps of filtering a noise data from the stream of raw ...",
  "ipcr_labels": [
    "G06N502",
    "G06N9900"
  ],
  "inventor_list": [
    {
      "inventor_name_last": "RANA",
      "inventor_name_first": "Satyendra Pal",
      "inventor_city": "Northville",
      "inventor_state": "MI",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "KEERTHY",
      "inventor_name_first": "Chandra Puttanna",
      "inventor_city": "Northville",
      "inventor_state": "MI",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "KALLAKURI",
      "inventor_name_first": "Krishna Prakash",
      "inventor_city": "Northville",
      "inventor_state": "MI",
      "inventor_country": "US"
    }
  ],
  "title": "OPPORTUNITY DRIVEN SYSTEM AND METHOD BASED ON COGNITIVE DECISION-MAKING PROCESS",
  "decision": "PENDING",
  "_processing_info": {
    "original_size": 86659,
    "optimized_size": 3756,
    "reduction_percent": 95.67
  }
}