{
  "patent_number": "None",
  "application_number": "15788322",
  "date_published": "20180426",
  "date_produced": "20180411",
  "filing_date": "20171019",
  "main_ipcr_label": "G06N504",
  "abstract": "The present disclosure relates to system(s) and method(s) to synthesis a business opportunity identified from a set of business opportunities corresponding to an organization for a cognitive decision-making process. In one embodiment, the method comprises receiving an opportunity instance knowledge object associated with a business opportunity identified from a set of business opportunities corresponding to an organization and generation an opportunity instance knowledge specification. The method further comprise generating a first specification based on the opportunity instance knowledge object and generating a second specification based on the opportunity instance knowledge object. The method furthermore comprises appending the first specification and the second specification to the opportunity instance knowledge specification, thereby synthesis a business opportunity identified from a set of business opportunities corresponding to an organization for a cognitive decision-making proc...",
  "publication_number": "US20180114129A1-20180426",
  "summary": "<SOH> SUMMARY <EOH>Before the present a system and a method to synthesis a business opportunity identified from a set of business opportunities corresponding to an organization for a cognitive decision-making process, are described, it is to be understood that this application is not limited to the particular systems, and methodologies described, as there can be multiple possible embodiments, which are not expressly illustrated in the present disclosures. It is also to be understood that the terminology used in the description is for the purpose of describing the particular implementations, versions, or embodiments only, and is not intended to limit the scope of the present application. This summary is provided to introduce aspects related to a system and a method to synthesis a business opportunity identified from a set of business opportunities corresponding to an organization for a cognitive decision-making process. This summary is not intended to identify essential features of the claimed subject matter nor is it intended for use in determining or limiting the scope of the claimed subject matter. In one embodiment, a method to synthesis a business opportunity identified from a set of business opportunities corresponding to an organization for a cognitive decision-making process is disclosed. In the embodiment, the method comprises the step of receiving an opportunity instance knowledge object associated with a business opportunity identified from a set of business opportunities corresponding to an organization. In one example, the opportunity instance knowledge object may comprise one or more symptoms indicative of the business opportunity, a financial amount associated with the business opportunity, a type of the business opportunity, a root cause of the one or more symptoms. Upon receiving, the method may comprise the step of generation of an opportunity instance knowledge specification and generating a first specification based on the opportunity instance kno...",
  "ipcr_labels": [
    "G06N504",
    "G06Q3002"
  ],
  "inventor_list": [
    {
      "inventor_name_last": "RANA",
      "inventor_name_first": "Satyendra Pal",
      "inventor_city": "Northville",
      "inventor_state": "MI",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "KEERTHY",
      "inventor_name_first": "Chandra Puttanna",
      "inventor_city": "Northville",
      "inventor_state": "MI",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "KALLAKURI",
      "inventor_name_first": "Krishna Prakash",
      "inventor_city": "Northville",
      "inventor_state": "MI",
      "inventor_country": "US"
    }
  ],
  "title": "METHOD AND SYSTEM FOR SYNTHESIS OF AN OPPORTUNITY FOR A COGNITIVE DECISION-MAKING PROCESS",
  "decision": "PENDING",
  "_processing_info": {
    "original_size": 70584,
    "optimized_size": 3918,
    "reduction_percent": 94.45
  }
}