{
  "patent_number": "None",
  "application_number": "15799352",
  "date_published": "20180607",
  "date_produced": "20180523",
  "filing_date": "20171031",
  "main_ipcr_label": "G06N9900",
  "abstract": "An apparatus and a method for evaluating complexity of a classification task are provided. The apparatus includes: one or more processing circuits, configured to calculate, with respect to each sample of at least a part of training samples for the classification task, similarities between the sample and respective classes, respectively; and calculate, based on the similarities, a task complexity score for the classification task.",
  "publication_number": "US20180157991A1-20180607",
  "summary": "<SOH> SUMMARY <EOH>In the following, an overview of the embodiments is given simply to provide basic understanding to some aspects of the present embodiments. It should be understood that this overview is not an exhaustive overview of the present embodiments. It is not intended to determine a critical part or an important part of the present embodiments, nor to limit the scope of the present embodiments. An object of the overview is only to give some concepts in a simplified manner, which serves as a preface of a more detailed description described later. According to an aspect of the present disclosure, an apparatus for evaluating complexity of a classification task is provided, which includes: a similarity calculating unit, configured to calculate, with respect to each sample of at least a part of training samples for the classification task, similarities between the sample and respective classes, respectively; and a score calculating unit, configured to calculate, based on the similarities, a complexity score for the classification task. According to another aspect of the present disclosure, a method for evaluating complexity of a classification task is provided, which includes: calculating, with respect to each sample of at least a part of training samples for the classification task, similarities between the sample and respective classes, respectively; and calculating, based on the similarities, a complexity score for the classification task. According to another aspect of the present disclosure, an apparatus for evaluating complexity of a classification task is further provided, which includes one or more processing circuits configured to: calculate, with respect to each sample of at least a part of training samples for the classification task, similarities between the sample and respective classes, respectively; and calculate, based on the similarities, a complexity score for the classification task. According to other aspects of the present disclosure, corre...",
  "ipcr_labels": [
    "G06N9900",
    "G06N700"
  ],
  "inventor_list": [
    {
      "inventor_name_last": "WANG",
      "inventor_name_first": "Song",
      "inventor_city": "Beijing",
      "inventor_state": "",
      "inventor_country": "CN"
    },
    {
      "inventor_name_last": "SUN",
      "inventor_name_first": "Li",
      "inventor_city": "Beijing",
      "inventor_state": "",
      "inventor_country": "CN"
    },
    {
      "inventor_name_last": "FAN",
      "inventor_name_first": "Wei",
      "inventor_city": "Beijing",
      "inventor_state": "",
      "inventor_country": "CN"
    },
    {
      "inventor_name_last": "SUN",
      "inventor_name_first": "Jun",
      "inventor_city": "Beijing",
      "inventor_state": "",
      "inventor_country": "CN"
    }
  ],
  "title": "APPARATUS AND METHOD FOR EVALUATING COMPLEXITY OF CLASSIFICATION TASK",
  "decision": "PENDING",
  "_processing_info": {
    "original_size": 38485,
    "optimized_size": 3406,
    "reduction_percent": 91.15
  }
}