{
  "patent_number": "9996794",
  "application_number": "15792852",
  "date_published": "20180215",
  "date_produced": "20180131",
  "filing_date": "20171025",
  "main_ipcr_label": "G06N3067",
  "abstract": "Various Reservoir Computing systems and a method performed by a Reservoir Computing system are provided. A Reservoir Computing system includes a laser for emitting light. The Reservoir Computing system further includes a mirror for reflecting external feedback light back to the laser. The Reservoir Computing system also includes a modulator for modulating the external feedback light reflected back to the laser. The Reservoir Computing system additionally includes a photo-detector for converting a laser output signal to an electrical signal.",
  "publication_number": "US20180046909A1-20180215",
  "summary": "<SOH> SUMMARY <EOH>According to an aspect of the present principles, a Reservoir Computing system is provided. The Reservoir Computing system includes a laser for emitting light. The Reservoir Computing system further includes a mirror for reflecting external feedback light back to the laser. The Reservoir Computing system also includes a modulator for modulating the external feedback light reflected back to the laser. The Reservoir Computing system additionally includes a photo-detector for converting a laser output signal to an electrical signal. According to another aspect of the present principles, a method performed by a Reservoir Computing system is provided. The method includes emitting, by a laser, light. The method further includes reflecting, by a mirror, external feedback light back to the laser. The method also includes modulating, by a modulator, the external feedback light reflected back to the laser. The method additionally includes converting, by a photo-detector, a laser output signal to an electrical signal. These and other features and advantages will become apparent from the following detailed description of illustrative embodiments thereof, which is to be read in connection with the accompanying drawings.",
  "ipcr_labels": [
    "G06N3067",
    "G06N9900",
    "H04Q1100",
    "G02F1017",
    "G02B6122",
    "G02F1015",
    "G02F1313",
    "H01S5026"
  ],
  "inventor_list": [
    {
      "inventor_name_last": "NAKANO",
      "inventor_name_first": "DAIJU",
      "inventor_city": "KAWASAKI",
      "inventor_state": "",
      "inventor_country": "JP"
    },
    {
      "inventor_name_last": "TAKEDA",
      "inventor_name_first": "SEIJI",
      "inventor_city": "KAWASAKI",
      "inventor_state": "",
      "inventor_country": "JP"
    },
    {
      "inventor_name_last": "YAMANE",
      "inventor_name_first": "TOSHIYUKI",
      "inventor_city": "KAWASAKI",
      "inventor_state": "",
      "inventor_country": "JP"
    }
  ],
  "title": "RESERVOIR COMPUTING DEVICE USING EXTERNAL-FEEDBACK LASER SYSTEM",
  "decision": "ACCEPTED",
  "_processing_info": {
    "original_size": 33804,
    "optimized_size": 2716,
    "reduction_percent": 91.97
  }
}