{
  "patent_number": "None",
  "application_number": "15794913",
  "date_published": "20180426",
  "date_produced": "20180411",
  "filing_date": "20171026",
  "main_ipcr_label": "G06N308",
  "abstract": "The technology disclosed relates to evolving a deep neural network based solution to a provided problem. In particular, it relates to providing an improved cooperative evolution technique for deep neural network structures. It includes creating blueprint structures that include a plurality of supermodule structures. The supermodule structures include a plurality of modules. The modules are neural networks. A first loop of evolution executes at the blueprint level. A second loop of evolution executes at the supermodule level. Further, multiple mini-loops of evolution execute at each of the subpopulations of the supermodules. The first loop, the second loop, and the mini-loops execute in parallel.",
  "publication_number": "US20180114116A1-20180426",
  "summary": "<SOH> BRIEF DESCRIPTION OF THE DRAWINGS <EOH>In the drawings, like reference characters generally refer to like parts throughout the different views. Also, the drawings are not necessarily to scale, with an emphasis instead generally being placed upon illustrating the principles of the technology disclosed. In the following description, various implementations of the technology disclosed are described with reference to the following drawings, in which: FIG. 1 illustrates one implementation of a supermodule identifying a plurality of supermodule hyperparameters that further identify a plurality of modules in the supermodule and interconnections among the modules in the supermodule. FIG. 2 depicts one implementation of an example supermodule identifying respective values for a plurality of supermodule hyperparameters that further identify a plurality of modules in the supermodule and interconnections among the modules in the supermodule. FIG. 3 depicts one implementation of an example deep neural network structure generated in dependence upon the example supermodule depicted in FIG. 2 . FIG. 4 depicts another implementation of an example deep neural network structure generated in dependence upon an example supermodule generated by the technology disclosed. FIG. 5 illustrates one implementation of a blueprint identifying a plurality of blueprint hyperparameters that further identify a plurality of supermodules in the blueprint and interconnections among the supermodules in the blueprint. FIG. 6 depicts one implementation of an example blueprint that identifies respective values for a plurality of blueprint hyperparameters which further identify a plurality of supermodules in the blueprint and interconnections among the supermodules in the blueprint. FIG. 7 illustrates one implementation of instantiation of a candidate blueprint as multiple blueprint instantiations, and identifying, from submodule subpopulations, respective values for each of the supermodules identified...",
  "ipcr_labels": [
    "G06N308",
    "G06N304"
  ],
  "inventor_list": [
    {
      "inventor_name_last": "LIANG",
      "inventor_name_first": "Jason Zhi",
      "inventor_city": "Fremont",
      "inventor_state": "CA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "MIIKKULAINEN",
      "inventor_name_first": "Risto",
      "inventor_city": "Stanford",
      "inventor_state": "CA",
      "inventor_country": "US"
    }
  ],
  "title": "COOPERATIVE EVOLUTION OF DEEP NEURAL NETWORK STRUCTURES",
  "decision": "PENDING",
  "_processing_info": {
    "original_size": 130208,
    "optimized_size": 3410,
    "reduction_percent": 97.38
  }
}