{
  "patent_number": "nan",
  "application_number": "15790756",
  "date_published": "20180301",
  "date_produced": "20180213",
  "filing_date": "20171023",
  "main_ipcr_label": "G06N504",
  "abstract": "A predictive modeling method may include obtaining a fitted, first-order predictive model configured to predict values of output variables based on values of first input variables; and performing a second-order modeling procedure on the fitted, first-order model, which may include: generating input data including observations including observed values of second input variables and predicted values of the output variables; generating training data and testing data from the input data; generating a fitted second-order model of the fitted first-order model by fitting a second-order model to the training data; and testing the fitted, second-order model of the first-order model on the testing data. Each observation of the input data may be generated by (1) obtaining observed values of the second input variables, and (2) applying the first-order predictive model to corresponding observed values of the first input variables to generate the predicted values of the output variables.",
  "publication_number": "US20180060744A1-20180301",
  "summary": "<SOH> SUMMARY <EOH>Motivation for Some Embodiments Data analysts can use analytic techniques and computational infrastructures to build predictive models from electronic data, including operations and evaluation data. Data analysts generally use one of two approaches to build predictive models. With the first approach, an organization dealing with a prediction problem simply uses a packaged predictive modeling solution already developed for the same prediction problem or a similar prediction problem. This “cookie cutter” approach, though inexpensive, is generally viable only for a small number of prediction problems (e.g., fraud detection, churn management, marketing response, etc.) that are common to a relatively large number of organizations. With the second approach, a team of data analysts builds a customized predictive modeling solution for a prediction problem. This “artisanal” approach is generally expensive and time-consuming, and therefore tends to be used for a small number of high-value prediction problems. The space of potential predictive modeling solutions for a prediction problem is generally large and complex. Statistical learning techniques are influenced by many academic traditions (e.g., mathematics, statistics, physics, engineering, economics, sociology, biology, medicine, artificial intelligence, data mining, etc.) and by applications in many areas of commerce (e.g., finance, insurance, retail, manufacturing, healthcare, etc.). Consequently, there are many different predictive modeling algorithms, which may have many variants and/or tuning parameters, as well as different pre-processing and post-processing steps with their own variants and/or parameters. The volume of potential predictive modeling solutions (e.g., combinations of pre-processing steps, modeling algorithms, and post-processing steps) is already quite large and is increasing rapidly as researchers develop new techniques. Given this vast space of predictive modeling techniques, the ...",
  "ipcr_labels": [
    "G06N504",
    "G06N9900",
    "G06Q1006",
    "G06N502",
    "G06F950",
    "G06Q1004"
  ],
  "inventor_list": [
    {
      "inventor_name_last": "Achin",
      "inventor_name_first": "Jeremy",
      "inventor_city": "Boston",
      "inventor_state": "MA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "DeGodoy",
      "inventor_name_first": "Thomas",
      "inventor_city": "Melrose",
      "inventor_state": "MA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Owen",
      "inventor_name_first": "Timothy",
      "inventor_city": "Watertown",
      "inventor_state": "MA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Conort",
      "inventor_name_first": "Xavier",
      "inventor_city": "Singapore",
      "inventor_state": "",
      "inventor_country": "SG"
    }
  ],
  "title": "SYSTEMS FOR SECOND-ORDER PREDICTIVE DATA ANALYTICS, AND RELATED METHODS AND APPARATUS",
  "decision": "PENDING",
  "_processing_info": {
    "original_size": 443610,
    "optimized_size": 4072,
    "reduction_percent": 99.08
  }
}