{
  "patent_number": "None",
  "application_number": "15794905",
  "date_published": "20180426",
  "date_produced": "20180411",
  "filing_date": "20171026",
  "main_ipcr_label": "G06N308",
  "abstract": "The technology disclosed relates to evolving deep neural network structures. A deep neural network structure includes a plurality of modules with submodules and interconnections among the modules and the submodules. In particular, the technology disclosed relates to storing candidate genomes that identify respective values for a plurality of hyperparameters of a candidate genome. The hyperparameters include global topology hyperparameters, global operational hyperparameters, local topology hyperparameters, and local operational hyperparameters. It further includes evolving the hyperparameters by training, evaluating, and procreating the candidate genomes and corresponding modules and submodules.",
  "publication_number": "US20180114115A1-20180426",
  "summary": "<SOH> BRIEF DESCRIPTION OF THE DRAWINGS <EOH>In the drawings, like reference characters generally refer to like parts throughout the different views. Also, the drawings are not necessarily to scale, with an emphasis instead generally being placed upon illustrating the principles of the technology disclosed. In the following description, various implementations of the technology disclosed are described with reference to the following drawings, in which: FIG. 1 illustrates one implementation of a genome identifying a plurality of hyperparameters that further identify a plurality of modules in the genome and interconnections among the modules in the genome. FIG. 2 depicts one implementation of an example genome identifying respective values for a plurality of hyperparameters that further identify a plurality of modules in the example genome and interconnections among the modules in the example genome. FIG. 3 depicts one implementation of a deep neural network structure generated in dependence upon the example genome depicted in FIG. 2 . FIG. 4 depicts another implementation of a deep neural network structure generated in dependence upon an example genome generated by the technology disclosed. FIG. 5 shows one implementation of a training system of the technology disclosed that can be used to evolve deep neural network structures. FIG. 6 illustrates various modules that can be used to implement the functionality of the training system depicted in FIG. 5 . FIG. 7 depicts a representative method of operation of the training system depicted in FIG. 5 . FIGS. 8A, 8B, and 8C illustrate examples of evolved deep neural network structures in accordance with implementations of the technology disclosed. FIG. 9 shows a chart that graphically illustrates performance results of one implementation of the technology disclosed. FIG. 10A is another chart that graphically illustrates performance results of another implementation of the technology disclosed. FIG. 10B is yet another chart ...",
  "ipcr_labels": [
    "G06N308",
    "G06N304"
  ],
  "inventor_list": [
    {
      "inventor_name_last": "LIANG",
      "inventor_name_first": "Jason Zhi",
      "inventor_city": "Fremont",
      "inventor_state": "CA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "MIIKKULAINEN",
      "inventor_name_first": "Risto",
      "inventor_city": "Stanford",
      "inventor_state": "CA",
      "inventor_country": "US"
    }
  ],
  "title": "EVOLUTION OF DEEP NEURAL NETWORK STRUCTURES",
  "decision": "PENDING",
  "_processing_info": {
    "original_size": 101963,
    "optimized_size": 3398,
    "reduction_percent": 96.67
  }
}