{
  "patent_number": "None",
  "application_number": "15796222",
  "date_published": "20180503",
  "date_produced": "20180418",
  "filing_date": "20171027",
  "main_ipcr_label": "G06N504",
  "abstract": "The subject disclosure relates to devices, systems, and methods for algorithmic transparency into algorithmic decision-making systems. In non-limiting aspects, the disclosed subject matter facilitates generating a set of intervention inputs for an algorithmic decision-making system, observing the outcomes of the algorithmic decision-making system, and determining Quantitative Input Influence (QII) measures for the algorithmic decision-making system, wherein the at least one QII measure describes degree of influence of inputs on outcomes of the algorithmic decision-making system. In further non-limiting aspects, the disclosed subject matter facilitates generating transparency reports related to the QII measures, including transparency reports, regarding inputs, regarding individuals, and regarding groups of individuals, while maintaining privacy. Further non-limiting embodiments are provided that illustrate the advantages and flexibility of the disclosed subject matter.",
  "publication_number": "US20180121817A1-20180503",
  "summary": "<SOH> SUMMARY <EOH>The following presents a simplified summary of the specification to provide a basic understanding of some aspects of the specification. This summary is not an extensive overview of the specification. It is intended to neither identify key or critical elements of the specification nor delineate any scope particular to any embodiments of the specification, or any scope of the claims. Its sole purpose is to present some concepts of the specification in a simplified form as a prelude to the more detailed description that is presented later. Thus, in non-limiting embodiments, the disclosed subject matter relates to software and services and, more specifically, relates to software and services facilitating algorithmic transparency into algorithmic decision-making systems and so on. In non-limiting embodiments, the disclosed subject matter facilitates generating a set of inputs (e.g., intervention inputs) for an algorithmic decision-making system, wherein the set of inputs (e.g., intervention inputs) can comprise an input intervention distribution based on a distribution of inputs of a population analyzed by the algorithmic decision-making system, in a non-limiting aspect. In a further non-limiting aspect, exemplary embodiments can facilitate determining one or more Quantitative Input Influence (QII) measures for the algorithmic decision-making system, wherein the one or more QII measures describe degree of influence of a subset of the set of inputs (e.g., intervention inputs) on an outcome that represents a property of a behavior of the algorithmic decision-making system for the input intervention distribution. Exemplary embodiment can further facilitate generate one or more transparency reports (e.g., influences/explanations) related to the one or more QII measures, wherein the one or more transparency reports (e.g., influences/explanations) can be based on one or more transparency queries (e.g., via an associated transparency query component) associat...",
  "ipcr_labels": [
    "G06N504"
  ],
  "inventor_list": [
    {
      "inventor_name_last": "Datta",
      "inventor_name_first": "Anupam",
      "inventor_city": "Redwood City",
      "inventor_state": "CA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Sen",
      "inventor_name_first": "Shayak",
      "inventor_city": "Pittsburgh",
      "inventor_state": "PA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Zick",
      "inventor_name_first": "Yair",
      "inventor_city": "Singapore",
      "inventor_state": "",
      "inventor_country": "SG"
    }
  ],
  "title": "SYSTEM AND METHOD FOR ASSISTING IN THE PROVISION OF ALGORITHMIC TRANSPARENCY",
  "decision": "PENDING",
  "_processing_info": {
    "original_size": 186711,
    "optimized_size": 3836,
    "reduction_percent": 97.95
  }
}