{
  "patent_number": "None",
  "application_number": "15792308",
  "date_published": "20180322",
  "date_produced": "20180308",
  "filing_date": "20171024",
  "main_ipcr_label": "G06N504",
  "abstract": "Techniques disclosed herein describe inferring user interests based on metadata of a plurality of multimedia objects captured by a plurality of users. An analysis tool receives, for each user, metadata describing each multimedia object in the plurality of objects associated with that user. Each multimedia object includes one or more attributes imputed to that object based on the metadata. The analysis tool identifies one or more concepts from the one or more attributes. The analysis tool determines from the one or more concepts, a hierarchical relationship between a first concept and at least a second concept. The analysis tool associates a first one of the plurality of users with at least one of the concepts based on the attributes imputed to multimedia objects associated with the first one of the plurality of users",
  "publication_number": "US20180082200A1-20180322",
  "summary": "<SOH> SUMMARY <EOH>One embodiment presented herein describes a method for inferring user interests based on metadata of a plurality of multimedia objects captured by a plurality of users. The method generally includes receiving, for each user, metadata describing each multimedia object in the plurality of objects associated with that user. Each multimedia object includes one or more attributes imputed to that object based on the metadata. The method also includes identifying one or more concepts from the one or more attributes. The method also includes determining, from the one or more concepts, a hierarchical relationship between a first concept and at least a second concept. The method also includes associating a first one of the plurality of users with at least one of the concepts based on the attributes imputed to multimedia objects associated with the first one of the plurality of users. Other embodiments include, without limitation, a computer-readable medium that includes instructions that enable a processing unit to implement one or more aspects of the disclosed methods as well as a system having a processor, memory, and application programs configured to implement one or more aspects of the disclosed methods.",
  "ipcr_labels": [
    "G06N504",
    "G06N502",
    "G06F1730",
    "G06Q3002"
  ],
  "inventor_list": [
    {
      "inventor_name_last": "SABAH",
      "inventor_name_first": "Mohammad",
      "inventor_city": "San Jose",
      "inventor_state": "CA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "SADREDDIN",
      "inventor_name_first": "Mohammad Iman",
      "inventor_city": "Santa Clara",
      "inventor_state": "CA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "ABDULLAH",
      "inventor_name_first": "Shafaq",
      "inventor_city": "Belmont",
      "inventor_state": "CA",
      "inventor_country": "US"
    }
  ],
  "title": "METHOD FOR INFERRING LATENT USER INTERESTS BASED ON IMAGE METADATA",
  "decision": "PENDING",
  "_processing_info": {
    "original_size": 49064,
    "optimized_size": 2958,
    "reduction_percent": 93.97
  }
}