{
  "patent_number": "None",
  "application_number": "15791223",
  "date_published": "20180503",
  "date_produced": "20180418",
  "filing_date": "20171023",
  "main_ipcr_label": "G06N304",
  "abstract": "A data processing apparatus includes a storage unit configured to store reference data of a filter operation and coefficient data of filters, a plurality of operators configured to parallelly perform the filter operation on the reference data and the coefficient data of the filters, a first supply unit configured to supply reference data transferred from the storage unit to the plurality of operators, a second supply unit configured to supply coefficient data of a first and second filters transferred from the storage unit to the plurality of operators, and a control unit configured to control the second supply unit to supply the coefficient data of the first filter to a first operator, and supply the coefficient data of the second filter to a second operator.",
  "publication_number": "US20180121795A1-20180503",
  "summary": "<SOH> SUMMARY <EOH>The present disclosure is directed to avoiding degradation of processing efficiency of product-sum operations by parallelly performing filter operations for partial reference data stored in a holding unit and a plurality of different filters. According to an aspect of the present disclosure, a data processing apparatus includes a storage unit configured to store reference data of a filter operation and coefficient data of filters to be used for the filter operation, a plurality of operators configured to parallelly perform the filter operation on the reference data and the coefficient data of the filters, a first supply unit configured to hold a predetermined number of pieces of reference data transferred from the storage unit, and supply the transferred reference data to the plurality of operators, a second supply unit configured to hold coefficient data of a first filter and coefficient data of a second filter transferred from the storage unit, and supply the coefficient data of the first and second filters to the plurality of operators, and a control unit configured to control the second supply unit to supply the coefficient data of the first filter to a first operator of the plurality of operators, and supply the coefficient data of the second filter to a second operator of the plurality of operators. Further features of the present disclosure will become apparent from the following description of exemplary embodiments with reference to the attached drawings.",
  "ipcr_labels": [
    "G06N304",
    "G06N310",
    "G06K968",
    "G06F1578"
  ],
  "inventor_list": [
    {
      "inventor_name_last": "Kato",
      "inventor_name_first": "Masami",
      "inventor_city": "Sagamihara-shi",
      "inventor_state": "",
      "inventor_country": "JP"
    },
    {
      "inventor_name_last": "Yamamoto",
      "inventor_name_first": "Takahisa",
      "inventor_city": "Kawasaki-shi",
      "inventor_state": "",
      "inventor_country": "JP"
    },
    {
      "inventor_name_last": "Nomura",
      "inventor_name_first": "Osamu",
      "inventor_city": "Yokohama-shi",
      "inventor_state": "",
      "inventor_country": "JP"
    },
    {
      "inventor_name_last": "Ito",
      "inventor_name_first": "Yoshinori",
      "inventor_city": "Tokyo",
      "inventor_state": "",
      "inventor_country": "JP"
    },
    {
      "inventor_name_last": "Mori",
      "inventor_name_first": "Katsuhiko",
      "inventor_city": "Kawasaki-shi",
      "inventor_state": "",
      "inventor_country": "JP"
    }
  ],
  "title": "DATA PROCESSING APPARATUS, METHOD FOR CONTROLLING THE SAME, AND STORAGE MEDIUM STORING PROGRAM",
  "decision": "PENDING",
  "_processing_info": {
    "original_size": 94506,
    "optimized_size": 3479,
    "reduction_percent": 96.32
  }
}