{
  "patent_number": "None",
  "application_number": "15801842",
  "date_published": "20180524",
  "date_produced": "20180509",
  "filing_date": "20171102",
  "main_ipcr_label": "G06N312",
  "abstract": "In a program generation apparatus, a processing unit selects a first program from among a plurality of image processing programs each generated by combining a plurality of partial programs; generates a second program by changing a part of the partial programs included in the first program; performs image processing on an input image, using the second program; determines whether to pass the second program to the next generation, based on a comparison between one or more intermediate output images that are output halfway through the image processing and a first target image; and replaces one of the image processing programs with the second program when the second program is determined to be passed to the next generation.",
  "publication_number": "US20180144249A1-20180524",
  "summary": "<SOH> SUMMARY <EOH>According to one aspect, there is provided a program generation apparatus that generates a program by using genetic programming, the program generation apparatus including: a memory configured to store learning data including an input image and a first target image, the first target image indicating an image that is output halfway through a process of converting the input image into a second target image; and a processor configured to perform a procedure including: selecting a first program from among a plurality of image processing programs each generated by combining a plurality of partial programs, generating a second program by changing a part of the partial programs included in the first program, performing image processing on the input image using the second program, determining whether to pass the second program to a next generation, based on a comparison between one or more intermediate output images and the first target image, the one or more intermediate output images being output halfway through the image processing, and replacing one of the plurality of image processing programs with the second program when the second program is determined to be passed to the next generation. The object and advantages of the invention will be realized and attained by means of the elements and combinations particularly pointed out in the claims. It is to be understood that both the foregoing general description and the following detailed description are exemplary and explanatory and are not restrictive of the invention.",
  "ipcr_labels": [
    "G06N312",
    "G06F836",
    "G06K900",
    "G06K962"
  ],
  "inventor_list": [
    {
      "inventor_name_last": "NAGATO",
      "inventor_name_first": "Tsuyoshi",
      "inventor_city": "Isehara",
      "inventor_state": "",
      "inventor_country": "JP"
    },
    {
      "inventor_name_last": "KOEZUKA",
      "inventor_name_first": "Tetsuo",
      "inventor_city": "Hachioji",
      "inventor_state": "",
      "inventor_country": "JP"
    }
  ],
  "title": "PROGRAM GENERATION APPARATUS AND PROGRAM GENERATION METHOD",
  "decision": "PENDING",
  "_processing_info": {
    "original_size": 81813,
    "optimized_size": 3006,
    "reduction_percent": 96.33
  }
}