{
  "patent_number": "None",
  "application_number": "15806874",
  "date_published": "20180510",
  "date_produced": "20180425",
  "filing_date": "20171108",
  "main_ipcr_label": "G06N9900",
  "abstract": "A computer-implemented method, computer program product and computing system for defining a first feature group having a first plurality of options. At least one additional feature group having at least one additional plurality of options is defined. A first level-one sample assembly is defined that includes an option chosen from the first plurality of options and an option chosen from the at least one additional plurality of options. A level-one probabilistic model is defined based, at least in part, upon the first level-one sample assembly.",
  "publication_number": "US20180129977A1-20180510",
  "summary": "<SOH> SUMMARY OF DISCLOSURE <EOH>User Teachable AI Digital Assistant In one implementation, a computer-implemented method is executed on a computing device and includes defining a first feature group having a first plurality of options. At least one additional feature group having at least one additional plurality of options is defined. A first level-one sample assembly is defined that includes an option chosen from the first plurality of options and an option chosen from the at least one additional plurality of options. A level-one probabilistic model is defined based, at least in part, upon the first level-one sample assembly. One or more of the following features may be included. Additional level-one sample assemblies may be detected using the level-one probabilistic model. At least one additional level-one sample assembly may be defined that includes an option chosen from the first plurality of options and an option chosen from the at least one additional plurality of options. A modified level-one probabilistic model may be defined by modifying the level-one probabilistic model based, at least in part, upon the at least-one additional level-one sample assembly. Additional level-one sample assemblies may be detected using the modified level-one probabilistic model. A first level-two sample assembly may be defined that includes the first level-one sample assembly and the at least one additional level-one sample assembly. A level-two probabilistic model may be defined based, at least in part, upon the first level-two sample assembly. Additional level-two sample assemblies may be detected using the level-two probabilistic model. The first plurality of options and/or the at least one additional plurality of options may define one or more of text-based options and object-based options. In another implementation, a computer program product resides on a computer readable medium and has a plurality of instructions stored on it. When executed by a processor, the instructi...",
  "ipcr_labels": [
    "G06N9900",
    "G06N300",
    "G06N700"
  ],
  "inventor_list": [
    {
      "inventor_name_last": "VIGODA",
      "inventor_name_first": "BENJAMIN W.",
      "inventor_city": "Winchester",
      "inventor_state": "MA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Barr",
      "inventor_name_first": "Matthew C.",
      "inventor_city": "Malden",
      "inventor_state": "MA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Neely",
      "inventor_name_first": "Jacob E.",
      "inventor_city": "Watertown",
      "inventor_state": "MA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Ring",
      "inventor_name_first": "Daniel F.",
      "inventor_city": "San Francisco",
      "inventor_state": "CA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Blood Zwirner Forsythe",
      "inventor_name_first": "Martin",
      "inventor_city": "Cambridge",
      "inventor_state": "MA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Rollings",
      "inventor_name_first": "Ryan C.",
      "inventor_city": "Newton",
      "inventor_state": "MA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Markovich",
      "inventor_name_first": "Thomas",
      "inventor_city": "Cambridge",
      "inventor_state": "MA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Zimoch",
      "inventor_name_first": "Pawel Jerzy",
      "inventor_city": "Cambridge",
      "inventor_state": "MA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Finkelstein",
      "inventor_name_first": "Jeffrey",
      "inventor_city": "Cambridge",
      "inventor_state": "MA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Makhoul",
      "inventor_name_first": "Khaldoun",
      "inventor_city": "Cambridge",
      "inventor_state": "MA",
      "inventor_country": "US"
    }
  ],
  "title": "MACHINE LEARNING DATA ANALYSIS SYSTEM AND METHOD",
  "decision": "PENDING",
  "_processing_info": {
    "original_size": 115217,
    "optimized_size": 4476,
    "reduction_percent": 96.12
  }
}