{
  "patent_number": "None",
  "application_number": "15808924",
  "date_published": "20180628",
  "date_produced": "20180613",
  "filing_date": "20171110",
  "main_ipcr_label": "G06N700",
  "abstract": "An information processing apparatus is disclosed. A processor acquires an upper limit and a lower limit of a probability of a false positive for each of multiple tests based on data-after-aggregation pertinent to a presence or absence of a specific event occurrence acquired by multiple testing, and sets a value from multiple upper limits being acquired. The processor calculates the probability of the false positive with respect to each of tests having lower limits less than the value, and acquires a set of probabilities of the false positive.",
  "publication_number": "US20180181874A1-20180628",
  "summary": "<SOH> SUMMARY <EOH>According to one aspect of the embodiments, there is provided an information processing apparatus including a memory; and a processor coupled to the memory and the processor configured to acquire an upper limit and a lower limit of a probability of a false positive for each of multiple tests based on data-after-aggregation pertinent to a presence or absence of a specific event occurrence acquired by a multiple testing; set a value from multiple upper limits being acquired; calculate the probability of the false positive with respect to each of tests having lower limits less than the value; and acquire a set of probabilities of the false positive. According to other aspects of the embodiments, a computer-readable recording medium storing an information processing program, and an information processing method are provided. The object and advantages of the invention will be realized and attained by means of the elements and combinations particularly pointed out in the claims. It is to be understood that both the foregoing general description and the following detailed description are exemplary and explanatory and are not restrictive of the invention, as claimed.",
  "ipcr_labels": [
    "G06N700",
    "G06F1718"
  ],
  "inventor_list": [
    {
      "inventor_name_last": "NISHIKAWA",
      "inventor_name_first": "RYUSUKE",
      "inventor_city": "Kawasaki",
      "inventor_state": "",
      "inventor_country": "JP"
    },
    {
      "inventor_name_last": "Ujibashi",
      "inventor_name_first": "Yoshifumi",
      "inventor_city": "Kawasaki",
      "inventor_state": "",
      "inventor_country": "JP"
    }
  ],
  "title": "INFORMATION PROCESSING APPARATUS AND METHOD",
  "decision": "PENDING",
  "_processing_info": {
    "original_size": 64319,
    "optimized_size": 2435,
    "reduction_percent": 96.21
  }
}