{
  "patent_number": "None",
  "application_number": "15805548",
  "date_published": "20180517",
  "date_produced": "20180503",
  "filing_date": "20171107",
  "main_ipcr_label": "G06N308",
  "abstract": "Apparatus and associated methods relate to developing a predictive analytic model based on data records partitioned as a function of at least one relationship between parts and folds, assigning more than one part to test each fold, and assigning at least one part to test more than one fold; and evaluating the predictive analytic model based on more than one prediction determined for each observation in each test data record as a function of a predictive analytic model not trained on the test data record. In an illustrative example, the relationship between parts and folds may exclude some of the training data in common, with the same degree of overlap in the data between each pair of folds. Various examples may advantageously produce models built on each pair of folds having nearly equal pairwise-correlation of their predictions with models built on any other pair of folds.",
  "publication_number": "US20180137415A1-20180517",
  "summary": "<SOH> SUMMARY <EOH>Apparatus and associated methods relate to developing a predictive analytic model based on data records partitioned as a function of at least one relationship between parts and folds, assigning more than one part to test each fold, and assigning at least one part to test more than one fold; and evaluating the predictive analytic model based on more than one prediction determined for each observation in each test data record as a function of a predictive analytic model not trained on the test data record. In an illustrative example, the relationship between parts and folds may exclude some of the training data in common, with the same degree of overlap in the data between each pair of folds. Various examples may advantageously produce models built on each pair of folds having nearly equal pairwise-correlation of their predictions with models built on any other pair of folds. Apparatus and associated methods relate to developing a predictive analytic model based on data records partitioned as a function of at least one relationship between parts and folds, assigning more than one part to test each fold, and assigning at least one part to test more than one fold; and evaluating the predictive analytic model based on more than one prediction determined for each observation in each test data record as a function of a predictive analytic model not trained on the test data record. In an illustrative example, the relationship between parts and folds may be symmetric, defining parts assigned to test each fold and test more than one fold. The symmetric relationship may be, for example, based on Galois Field mathematics. Various examples may advantageously partition data to assign parts to train and test to construct an optimal model using a minimum number of folds. Apparatus and associated methods relate to developing a predictive analytic model based on data records partitioned as a function of at least one relationship between parts and folds, assigning m...",
  "ipcr_labels": [
    "G06N308",
    "G06F1518",
    "G06N700",
    "G06F1718"
  ],
  "inventor_list": [
    {
      "inventor_name_last": "Steinberg",
      "inventor_name_first": "Dan",
      "inventor_city": "San Diego",
      "inventor_state": "CA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Cardell",
      "inventor_name_first": "Nicholas Scott",
      "inventor_city": "Pullman",
      "inventor_state": "WA",
      "inventor_country": "US"
    }
  ],
  "title": "PREDICTIVE ANALYTIC METHODS AND SYSTEMS",
  "decision": "PENDING",
  "_processing_info": {
    "original_size": 241656,
    "optimized_size": 3603,
    "reduction_percent": 98.51
  }
}