{
  "patent_number": "None",
  "application_number": "15807621",
  "date_published": "20180308",
  "date_produced": "20180222",
  "filing_date": "20171109",
  "main_ipcr_label": "G06N9900",
  "abstract": "Software that uses personalized information pertaining to a user to determine how familiar (or “novel” or “surprising”) a new artifact will be to the user, by performing the following steps: (i) receiving a first dataset pertaining to a first user; (ii) building, utilizing the first dataset, an ontology of artifacts known to the first user, where the ontology includes a domain of food and a plurality of artifacts that include food recipes, and where the artifacts have corresponding characteristics that include food ingredients; (iii) calculating a prior probability distribution for each artifact of the ontology using a probabilistic familiarity algorithm; and (iv) calculating a probabilistic familiarity value for the first artifact with respect to the first user by adding the first artifact to the set of artifacts and calculating the first artifact's prior probability distribution using the probabilistic familiarity algorithm.",
  "publication_number": "US20180068230A1-20180308",
  "summary": "<SOH> SUMMARY <EOH>According to an aspect of the present invention, there is a method, computer program product, and/or system that performs the following steps (not necessarily in the following order): (i) receiving a first dataset pertaining to a first user; (ii) building, utilizing the first dataset, an ontology of artifacts known to the first user, where the ontology includes a domain of food and a plurality of artifacts that include food recipes, and where the artifacts have corresponding characteristics that include food ingredients; (iii) calculating a prior probability distribution for each artifact of the ontology using a probabilistic familiarity algorithm; and (iv) calculating a probabilistic familiarity value for the first artifact with respect to the first user by adding the first artifact to the set of artifacts and calculating the first artifact's prior probability distribution using the probabilistic familiarity algorithm.",
  "ipcr_labels": [
    "G06N9900",
    "G06K900",
    "G06Q1006"
  ],
  "inventor_list": [
    {
      "inventor_name_last": "Pinel",
      "inventor_name_first": "Florian",
      "inventor_city": "New York",
      "inventor_state": "NY",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Shao",
      "inventor_name_first": "Nan",
      "inventor_city": "Ridgefield",
      "inventor_state": "CT",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Varshney",
      "inventor_name_first": "Kush R.",
      "inventor_city": "Ossining",
      "inventor_state": "NY",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Varshney",
      "inventor_name_first": "Lav R.",
      "inventor_city": "Champaign",
      "inventor_state": "IL",
      "inventor_country": "US"
    }
  ],
  "title": "COMPUTING PERSONALIZED PROBABILISTIC FAMILIARITY BASED ON KNOWN ARTIFACT DATA",
  "decision": "PENDING",
  "_processing_info": {
    "original_size": 63598,
    "optimized_size": 2940,
    "reduction_percent": 95.38
  }
}