{
  "patent_number": "None",
  "application_number": "15806855",
  "date_published": "20180510",
  "date_produced": "20180425",
  "filing_date": "20171108",
  "main_ipcr_label": "G06N9900",
  "abstract": "A computer-implemented method, computer program product and computing system for receiving non-structured content concerning a plurality of items. The non-structured content is processed to identify one or more proposed features for the plurality of items. The one or more proposed features are provided to a user for review. Feature feedback concerning the one or more proposed features is received. The one or more proposed features are modified based, at least in part, upon the feature feedback received from the user, thus generating one or more approved features.",
  "publication_number": "US20180129976A1-20180510",
  "summary": "<SOH> SUMMARY OF DISCLOSURE <EOH>User-Teachable, AI Enhanced Data Structuring System In one implementation, a computer-implemented method is executed on a computing device and includes receiving non-structured content concerning a plurality of items. The non-structured content is processed to identify one or more proposed features for the plurality of items. The one or more proposed features are provided to a user for review. Feature feedback concerning the one or more proposed features is received. The one or more proposed features are modified based, at least in part, upon the feature feedback received from the user, thus generating one or more approved features. One or more of the following features may be included. Modifying the one or more proposed features may include deleting one or more proposed features based, at least in part, upon the feature feedback received from the user. Modifying the one or more proposed features may include merging two or more proposed features based, at least in part, upon the feature feedback received from the user. Modifying the one or more proposed features may include augmenting one or more proposed features based, at least in part, upon the feature feedback received from the user. Modifying the one or more proposed features may include splitting one or more proposed features into two or more features based, at least in part, upon the feature feedback received from the user. Structured content may be formed from the non-structured content based, at least in part, upon the one or more approved features. Forming structured content from the non-structured content may include associating at least one of the approved features with each of the plurality of items. The non-structured content may include one or more of: unstructured content; and semi-structured content. The one or more proposed features may be grouped into two or more proposed feature categories. In another implementation, a computer program product resides on a compute...",
  "ipcr_labels": [
    "G06N9900",
    "G06N700"
  ],
  "inventor_list": [
    {
      "inventor_name_last": "Vigoda",
      "inventor_name_first": "Benjamin W.",
      "inventor_city": "Winchester",
      "inventor_state": "MA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Barr",
      "inventor_name_first": "Matthew C.",
      "inventor_city": "Malden",
      "inventor_state": "MA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Neely",
      "inventor_name_first": "Jacob E.",
      "inventor_city": "Watertown",
      "inventor_state": "MA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Ring",
      "inventor_name_first": "Daniel F.",
      "inventor_city": "San Francisco",
      "inventor_state": "CA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Blood Zwirner Forsythe",
      "inventor_name_first": "Martin",
      "inventor_city": "Cambridge",
      "inventor_state": "MA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Rollings",
      "inventor_name_first": "Ryan C.",
      "inventor_city": "Newton",
      "inventor_state": "MA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Markovich",
      "inventor_name_first": "Thomas",
      "inventor_city": "Cambridge",
      "inventor_state": "MA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Zimoch",
      "inventor_name_first": "Pawel Jerzy",
      "inventor_city": "Cambridge",
      "inventor_state": "MA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Finkelstein",
      "inventor_name_first": "Jeffrey",
      "inventor_city": "Cambridge",
      "inventor_state": "MA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Makhoul",
      "inventor_name_first": "Khaldoun",
      "inventor_city": "Cambridge",
      "inventor_state": "MA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Kearney",
      "inventor_name_first": "Glynnis",
      "inventor_city": "Somerville",
      "inventor_state": "MA",
      "inventor_country": "US"
    }
  ],
  "title": "MACHINE LEARNING DATA ANALYSIS SYSTEM AND METHOD",
  "decision": "PENDING",
  "_processing_info": {
    "original_size": 115786,
    "optimized_size": 4636,
    "reduction_percent": 96.0
  }
}