{
  "patent_number": "None",
  "application_number": "15803595",
  "date_published": "20180503",
  "date_produced": "20180418",
  "filing_date": "20171103",
  "main_ipcr_label": "G06N308",
  "abstract": "A system for teaching compositionality to convolutional neural networks includes an unmasked convolutional neural network comprising a first set of convolutional neural network layers; a first masked convolutional neural network comprising a second set of convolutional neural network layers; the unmasked convolutional neural network and the first masked convolutional network sharing convolutional neural network weights; the system training the unmasked and first masked convolutional neural networks simultaneously based on an objective function that seeks to reduce both discriminative loss and compositional loss.",
  "publication_number": "US20180121805A1-20180503",
  "summary": "<SOH> BRIEF DESCRIPTION OF THE FIGURES <EOH>FIG. 1A is an example diagram view of a convolutional neural network; FIG. 1B is an example diagram view of weights of a convolutional neural network; FIG. 2A is a diagram view of a system of an invention embodiment; FIG. 2B is a diagram view of a system of an invention embodiment; FIG. 3A is an example view of a first penalty mask generation scheme; FIG. 3B is an example view of a second penalty mask generation scheme; and FIG. 4 is a chart view of a method of an invention embodiment. detailed-description description=\"Detailed Description\" end=\"lead\"?",
  "ipcr_labels": [
    "G06N308",
    "G06N304",
    "G06K962",
    "G10L1516"
  ],
  "inventor_list": [
    {
      "inventor_name_last": "Stone",
      "inventor_name_first": "Austin Charles",
      "inventor_city": "Union City",
      "inventor_state": "CA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Wang",
      "inventor_name_first": "Huayan",
      "inventor_city": "Union City",
      "inventor_state": "CA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Phoenix",
      "inventor_name_first": "D. Scott",
      "inventor_city": "Union City",
      "inventor_state": "CA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "George",
      "inventor_name_first": "Dileep",
      "inventor_city": "Union City",
      "inventor_state": "CA",
      "inventor_country": "US"
    }
  ],
  "title": "SYSTEM AND METHOD FOR TEACHING COMPOSITIONALITY TO CONVOLUTIONAL NEURAL NETWORKS",
  "decision": "PENDING",
  "_processing_info": {
    "original_size": 32084,
    "optimized_size": 2278,
    "reduction_percent": 92.9
  }
}