{
  "patent_number": "None",
  "application_number": "15817443",
  "date_published": "20180621",
  "date_produced": "20180608",
  "filing_date": "20171120",
  "main_ipcr_label": "G06N3063",
  "abstract": "A sensor system comprises: an energy storage device electrically coupled to an intermittent energy release device that causes the energy storage device to release stored energy intermittently; a sensor electrically coupled to the energy storage device, where the sensor detects physical events occurring at a physical device and is intermittently powered by electrical energy received from the energy storage device; a synaptic neural network core electrically coupled to the sensor, where the synaptic neural network core converts sensor readings into an object that describes the physical events occurring at the physical device; a transponder electrically coupled to the synaptic neural network core; and a storage buffer within the transponder, where the storage buffer stores the object for transmission from the transponder to a monitoring system, where the intermittent energy release device provides power to the sensor in response to the transponder transmitting the object to the monitoring...",
  "publication_number": "US20180174029A1-20180621",
  "summary": "<SOH> SUMMARY <EOH>In an embodiment of the present invention, a sensor system comprises: an energy storage device; an intermittent energy release device electrically coupled to the energy storage device, where the intermittent energy release device causes the energy storage device to release stored energy intermittently; a sensor electrically coupled to the energy storage device, where the sensor detects physical events occurring at a physical device, and where the sensor is intermittently powered by electrical energy received from the energy storage device via the intermittent energy release device; a synaptic neural network core electrically coupled to the sensor, where the synaptic neural network core converts sensor readings from the sensor into an object that is derived from the sensor readings, and where the object describes the physical events occurring at the physical device; a transponder electrically coupled to the synaptic neural network core; and a storage buffer within the transponder, where the storage buffer stores the object for transmission from the transponder to a monitoring system which directs the intermittent energy release device to provide power to the sensor in response to the transponder transmitting the object to the monitoring system. In an embodiment of the present invention, a method optimizes sensor operations by storing electrical energy on an energy storage device; intermittently releasing stored electrical energy from the energy storage device to a sensor, where intermittently released stored electrical energy from the energy storage device activates one or more sensing units in the sensor, where the sensor detects physical events occurring at a physical device, and where the sensor is intermittently powered by electrical energy received from the energy storage device via the intermittent energy release device. Sensor readings are captured by the one or more sensing units in the sensor, transmitted to a register for storage, and loa...",
  "ipcr_labels": [
    "G06N3063",
    "G06N304",
    "G06F126"
  ],
  "inventor_list": [
    {
      "inventor_name_last": "Adams",
      "inventor_name_first": "Samuel S.",
      "inventor_city": "Rutherfordton",
      "inventor_state": "NC",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Belluomini",
      "inventor_name_first": "Wendy A.",
      "inventor_city": "San Jose",
      "inventor_state": "CA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Friedlander",
      "inventor_name_first": "Robert R.",
      "inventor_city": "Southbury",
      "inventor_state": "CT",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Kraemer",
      "inventor_name_first": "James R.",
      "inventor_city": "Santa Fe",
      "inventor_state": "NM",
      "inventor_country": "US"
    }
  ],
  "title": "Synaptic Neural Network Core Based Sensor System",
  "decision": "PENDING",
  "_processing_info": {
    "original_size": 70245,
    "optimized_size": 4026,
    "reduction_percent": 94.27
  }
}