{
  "patent_number": "None",
  "application_number": "15813097",
  "date_published": "20180614",
  "date_produced": "20180530",
  "filing_date": "20171114",
  "main_ipcr_label": "G06N504",
  "abstract": "A system and methods for operating an outcome modeling engine that incorporates a wide range of input data from various sources including (but not limited to) scientific advances in data analytics, agent-based modeling, discrete event simulation, and the mathematics of entropy to aid in making better decisions about real-world socio-technical systems.",
  "publication_number": "US20180165587A1-20180614",
  "summary": "<SOH> SUMMARY <EOH>The inventor has developed a system and method for epistemic uncertainty reduction using simulations, models and data exchange to model compare simulated outcomes to real-world outcomes and refine simulated scenario initial conditions to reduce uncertainty in outcomes and approach a causal limit, where causal drivers that influence system outcomes can be pinpointed. The aspects described herein provide a system and methods for operating an outcome modeling engine that incorporates a wide range of input data from various sources including (but not limited to) scientific advances in data analytics, agent-based modeling, discrete event simulation, and the mathematics of entropy to aid in making better decisions about real-world socio-technical systems. This is facilitated by utilizing a range of descriptive statistics, inferential statistics, heuristics, and generative modeling (both agent-based and using dynamical systems representations). The outcome modeling engine thereby provides a reduction of epistemic uncertainty. The ability to ultimately identify causal linkages via blended simulation/modeling, empirical observations with analytics, and dynamical systems modeling offers profound promise for diverse applications ranging from finance, infrastructure operations, to social sciences. According to one aspect, a system for epistemic uncertainty reduction using simulations, models and data exchange, comprising: a parametric evaluator comprising a processor, a memory, and a plurality of programming instructions stored in the memory and operating on the processor, wherein the programming instructions, when operating on the processor, cause the processor to: receive a plurality of input data values from external data sources; compile at least a portion of the plurality of input data values into a list of initial conditions; provide at least a portion of the initial conditions to a rules management engine; a rules management engine comprising a process...",
  "ipcr_labels": [
    "G06N504",
    "G06N9900"
  ],
  "inventor_list": [
    {
      "inventor_name_last": "Crabtree",
      "inventor_name_first": "Jason",
      "inventor_city": "Vienna",
      "inventor_state": "VA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Sellers",
      "inventor_name_first": "Andrew",
      "inventor_city": "Colorado Springs",
      "inventor_state": "CO",
      "inventor_country": "US"
    }
  ],
  "title": "EPISTEMIC UNCERTAINTY REDUCTION USING SIMULATIONS, MODELS AND DATA EXCHANGE",
  "decision": "PENDING",
  "_processing_info": {
    "original_size": 115721,
    "optimized_size": 3082,
    "reduction_percent": 97.34
  }
}