{
  "patent_number": "None",
  "application_number": "15819292",
  "date_published": "20180614",
  "date_produced": "20180530",
  "filing_date": "20171121",
  "main_ipcr_label": "G06N304",
  "abstract": "An information processing device includes, a memory, and a processor coupled to the memory and the processor configured to, acquire a neural network, divide the neural network into divided neural networks, identify, based on input-output characteristics of the divided neural networks, parameters of each of polynomial neural networks corresponding to each of the divided neural networks, and output another neural network generated by linking the identified polynomial neural networks.",
  "publication_number": "US20180165571A1-20180614",
  "summary": "<SOH> SUMMARY <EOH>According to an aspect of the invention, An information processing device includes, a memory, and a processor coupled to the memory and the processor configured to, acquire a neural network, divide the neural network into divided neural networks, identify, based on input-output characteristics of the divided neural networks, parameters of each of polynomial neural networks corresponding to each of the divided neural networks, and output another neural network generated by linking the identified polynomial neural networks. The object and advantages of the invention will be realized and attained by means of the elements and combinations particularly pointed out in the claims. It is to be understood that both the foregoing general description and the following detailed description are exemplary and explanatory and are not restrictive of the invention, as claimed.",
  "ipcr_labels": [
    "G06N304",
    "G06F1711"
  ],
  "inventor_list": [
    {
      "inventor_name_last": "TANABE",
      "inventor_name_first": "Satoshi",
      "inventor_city": "Meguro",
      "inventor_state": "",
      "inventor_country": "JP"
    }
  ],
  "title": "INFORMATION PROCESSING DEVICE AND INFORMATION PROCESSING METHOD",
  "decision": "PENDING",
  "_processing_info": {
    "original_size": 42433,
    "optimized_size": 1934,
    "reduction_percent": 95.44
  }
}