{
  "patent_number": "None",
  "application_number": "15810105",
  "date_published": "20180517",
  "date_produced": "20180503",
  "filing_date": "20171112",
  "main_ipcr_label": "G06N304",
  "abstract": "A method for constructing an artificial intelligence super depth learning model includes inputting by an objective function to input into each node of an input layer by interposing a no-teacher machine learning, connecting the no-teacher machine learning mutually between each node of the input layer and a nerve layer, calculating output reference values based on a learning value obtained by the no-teacher machine learning, a trigger threshold of a cranial nerve, or a sampling learning value, and determining an excitation level according to output reference values of all the nerve layers.",
  "publication_number": "US20180137409A1-20180517",
  "summary": "<SOH> SUMMARY <EOH>An aspect of the present disclosure includes a neural network model that can reproduce the function of the brain with emphasis on the function of the human brain trigger, and with unchanged calculation complexity. When human cranial nerves are triggered by nerves, a method to accurately construct a new neural network model capable of matching the role of the neural threshold is desired. In addition, the ability of machine learning can go infinitely deep. Another aspect of the present disclosure includes an artificial intelligence model, which is fundamentally more advanced than the conventional deep learning model, with low calculation complexity and high efficiency for application to actual industrialization.",
  "ipcr_labels": [
    "G06N304",
    "G06N308",
    "G06N504"
  ],
  "inventor_list": [
    {
      "inventor_name_last": "GU",
      "inventor_name_first": "ZECANG",
      "inventor_city": "Yokohama",
      "inventor_state": "",
      "inventor_country": "JP"
    }
  ],
  "title": "METHOD OF CONSTRUCTING AN ARTIFICAL INTELLIGENCE SUPER DEEP LAYER LEARNING MODEL, DEVICE, MOBILE TERMINAL, AND SOFTWARE PROGRAM OF THE SAME",
  "decision": "PENDING",
  "_processing_info": {
    "original_size": 48861,
    "optimized_size": 1972,
    "reduction_percent": 95.96
  }
}