{
  "patent_number": "None",
  "application_number": "15812253",
  "date_published": "20180308",
  "date_produced": "20180222",
  "filing_date": "20171114",
  "main_ipcr_label": "G06N504",
  "abstract": "In an approach to topic-based team analytics, a computing device extracts a list of topics based on a thread. The computing device identifies one or more participants with a relationship to one or more topics of the list of topics. The computing device generates a graph of the list of topics, the one or more participants, and relationships of the one or more participants to the one or more topics, wherein the one or more participants are represented as participant nodes of the graph and the one or more topics are represented as topic nodes of the graph, and wherein the relationships of the one or more participants to the one or more topics are represented as one or more edges connecting participant nodes with topic nodes.",
  "publication_number": "US20180068227A1-20180308",
  "summary": "<SOH> SUMMARY <EOH>According to one embodiment of the present invention, a computer-implemented method for topic-based team analytics, the method comprising: extracting, by one or more computer processors, a list of topics based on a thread; identifying, by one or more computer processors, one or more participants with a relationship to one or more topics of the list of topics; and generating, by one or more computer processors, a graph of the list of topics, the one or more participants, and relationships of the one or more participants to the one or more topics, wherein the one or more participants are represented as participant nodes of the graph and the one or more topics are represented as topic nodes of the graph, and wherein the relationships of the one or more participants to the one or more topics are represented as one or more edges connecting participant nodes with topic nodes.",
  "ipcr_labels": [
    "G06N504",
    "H04L1258",
    "G06F1730"
  ],
  "inventor_list": [
    {
      "inventor_name_last": "Bastide",
      "inventor_name_first": "Paul R.",
      "inventor_city": "Boxford",
      "inventor_state": "MA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Li",
      "inventor_name_first": "Shu Qiang",
      "inventor_city": "Beijing",
      "inventor_state": "",
      "inventor_country": "CN"
    },
    {
      "inventor_name_last": "Pei",
      "inventor_name_first": "Na",
      "inventor_city": "Beijing",
      "inventor_state": "",
      "inventor_country": "CN"
    },
    {
      "inventor_name_last": "Sun",
      "inventor_name_first": "Pei",
      "inventor_city": "Beijing",
      "inventor_state": "",
      "inventor_country": "CN"
    },
    {
      "inventor_name_last": "Wang",
      "inventor_name_first": "Lei",
      "inventor_city": "Beijing",
      "inventor_state": "",
      "inventor_country": "CN"
    }
  ],
  "title": "TOPIC-BASED TEAM ANALYTICS ENHANCEMENT",
  "decision": "PENDING",
  "_processing_info": {
    "original_size": 36580,
    "optimized_size": 2733,
    "reduction_percent": 92.53
  }
}