{
  "patent_number": "None",
  "application_number": "15828411",
  "date_published": "20180531",
  "date_produced": "20180516",
  "filing_date": "20171130",
  "main_ipcr_label": "G06N9900",
  "abstract": "Embodiments of the present invention are directed to computer-implemented methods and systems for automatically generating a description of a task or expectation. The method comprises receiving, in the form of an electronic communication, a natural language sentence that expresses a call or commitment to action; generating, using a machine learning model, a description of a task or expectation for a user based on the natural language sentence; and storing the description of the task or expectation in a non-transitory computer-readable memory.",
  "publication_number": "US20180150768A1-20180531",
  "summary": "<SOH> SUMMARY OF THE INVENTION <EOH>Embodiments of the present invention are directed to a computer-implemented method for automatically generating a description of a task or expectation. The method comprises receiving, in the form of an electronic communication, a natural language sentence that expresses a call or commitment to action; generating, using a machine learning model, a description of a task or expectation for a user based on the natural language sentence; and storing the description of the task or expectation in a non-transitory computer-readable memory. Other embodiments of the present invention are directed to a computer system comprising a processor, a network adapter coupled to the processor for receiving signals from a third-party system and sending signals to the third-party system, and a computer-readable memory coupled to the processor. The computer-readable memory is programmed with computer-executable instructions that, when executed by the processor, cause the computer system to perform the steps of: receiving, in the form of an electronic communication, a natural language sentence that expresses a call or commitment to action; generating, using a machine learning model, a description of a task or expectation for a user based on the natural language sentence; and storing the description of the task or expectation in a non-transitory computer-readable memory. The foregoing has outlined rather broadly the features and technical advantages of the present invention in order that the detailed description of the invention that follows may be better understood. Additional features and advantages of the invention will be described hereinafter. It should be appreciated by those skilled in the art that the conception and specific embodiments disclosed may be readily utilized as a basis for modifying or designing other structures for carrying out the same purposes of the present invention. It should also be realized by those skilled in the art that such...",
  "ipcr_labels": [
    "G06N9900",
    "G06F1727",
    "G06F1724"
  ],
  "inventor_list": [
    {
      "inventor_name_last": "Togia",
      "inventor_name_first": "Theodosia",
      "inventor_city": "Cambridge",
      "inventor_state": "",
      "inventor_country": "GB"
    },
    {
      "inventor_name_last": "Sama",
      "inventor_name_first": "Michele",
      "inventor_city": "London",
      "inventor_state": "",
      "inventor_country": "GB"
    },
    {
      "inventor_name_last": "Porter",
      "inventor_name_first": "Tim",
      "inventor_city": "London",
      "inventor_state": "",
      "inventor_country": "GB"
    }
  ],
  "title": "AUTOMATED GENERATION OF NATURAL LANGUAGE TASK/EXPECTATION DESCRIPTIONS",
  "decision": "PENDING",
  "_processing_info": {
    "original_size": 46708,
    "optimized_size": 3413,
    "reduction_percent": 92.69
  }
}