{
  "patent_number": "None",
  "application_number": "15823883",
  "date_published": "20180628",
  "date_produced": "20180613",
  "filing_date": "20171128",
  "main_ipcr_label": "G06N308",
  "abstract": "A method for autofilling an electronic form is provided. Elements of the electronic form are identified. A value for each identified elements of the electronic form is determined. The electronic form is automatically filled with the determined values. During the automatically filling of the electronic form, the determined value is provided in a field corresponding to each of the elements. A user input is received on the provided value. The received user input includes a correction to a first value provided in a first field of the electronic form. An autofill application is trained using the received user input.",
  "publication_number": "US20180181866A1-20180628",
  "summary": "<SOH> BRIEF DESCRIPTION OF THE DRAWINGS <EOH>Non-limiting and non-exhaustive examples are described with reference to the following figures. As a note, the same number represents the same element or same type of element in all drawings. FIG. 1 illustrates an exemplary computing environment in which autofill methods and systems described herein may be implemented. FIG. 2 illustrates an example of an autofill system as described herein. FIG. 3 illustrates an exemplary flow diagram illustrating steps of a method for collecting passive crowdsourcing data as described herein. FIG. 4 illustrates an exemplary flow diagram illustrating steps of a method for collecting active crowdsourcing data as described herein. FIG. 5 illustrates an exemplary flow diagram illustrating steps of a method for training an autofill engine as described herein. FIG. 6 illustrates an exemplary flow diagram illustrating steps of a method for resolving an ambiguity as described herein. FIG. 7 illustrates one example of a suitable operating environment in which one or more of the present examples may be implemented. detailed-description description=\"Detailed Description\" end=\"lead\"?",
  "ipcr_labels": [
    "G06N308",
    "G06F1724",
    "G06F1518"
  ],
  "inventor_list": [
    {
      "inventor_name_last": "Dalle",
      "inventor_name_first": "Manuel",
      "inventor_city": "Ivry-Sur-Seine",
      "inventor_state": "",
      "inventor_country": "FR"
    },
    {
      "inventor_name_last": "Maron",
      "inventor_name_first": "Guillaume",
      "inventor_city": "Paris",
      "inventor_state": "",
      "inventor_country": "FR"
    },
    {
      "inventor_name_last": "Rivain",
      "inventor_name_first": "Frédéric",
      "inventor_city": "Paris",
      "inventor_state": "",
      "inventor_country": "FR"
    },
    {
      "inventor_name_last": "Hugo",
      "inventor_name_first": "Laure",
      "inventor_city": "Versailles",
      "inventor_state": "",
      "inventor_country": "FR"
    },
    {
      "inventor_name_last": "Miguet",
      "inventor_name_first": "Kévin",
      "inventor_city": "Paris",
      "inventor_state": "",
      "inventor_country": "FR"
    },
    {
      "inventor_name_last": "Guychard",
      "inventor_name_first": "Loïc",
      "inventor_city": "Paris",
      "inventor_state": "",
      "inventor_country": "FR"
    },
    {
      "inventor_name_last": "Rajon",
      "inventor_name_first": "Damien",
      "inventor_city": "Paris",
      "inventor_state": "",
      "inventor_country": "FR"
    }
  ],
  "title": "CROWDSOURCED LEARNING ENGINE FOR SEMANTIC ANALYSIS OF WEBPAGES",
  "decision": "PENDING",
  "_processing_info": {
    "original_size": 64605,
    "optimized_size": 3234,
    "reduction_percent": 94.99
  }
}