{
  "patent_number": "None",
  "application_number": "15821679",
  "date_published": "20180607",
  "date_produced": "20180523",
  "filing_date": "20171122",
  "main_ipcr_label": "G06N304",
  "abstract": "A high-density neural network array. In an exemplary embodiment, an apparatus includes a three-dimensional (3D) structure having a plurality of layers forming a neural network. Each layer comprises one or more conductors forming neurons with each neuron having neuron inputs and neuron outputs. The apparatus also includes synapse elements coupled between the neurons outputs and the neuron inputs of neurons in adjacent layers. Each synapse element comprises a material that applies a selected weight to signals passing between neurons connected to that synapse element.",
  "publication_number": "US20180157964A1-20180607",
  "summary": "<SOH> SUMMARY <EOH>A novel high-density three-dimensional (3D) neutral network array structure is disclosed. In various exemplary embodiment, the 3D neural network array provides much higher density and speed over conventional neural networks. In an exemplary embodiment, an apparatus is provided that includes a three-dimensional (3D) structure having a plurality of layers forming a neural network. Each layer comprises one or more conductors forming neurons with each neuron having neuron inputs and neuron outputs. The apparatus also includes synapse elements coupled between the neurons outputs and the neuron inputs of neurons in adjacent layers. Each synapse element comprises a material that applies a selected weight to signals passing between neurons connected to that synapse element. In an exemplary embodiment, a three-dimensional (3D) neural network structure is provided that includes an input layer having at least one input conductor forming an input neuron, one or more hidden layers, each hidden layer having at least one hidden conductor forming hidden neurons, and an output layer having at least one output conductor forming an output neuron. The apparatus also includes threshold material coupled to each of the input, hidden, and output conductors, and synapse elements coupled between the threshold material associated with a selected layer and the conductors of an adjacent layer. Each synapse element comprises a material that applies a selected weight to signals passing through that synapse element. In an exemplary embodiment, a method is provided for programming a three-dimensional (3D) structure having a plurality of layers forming a neural network. Each layer comprises one or more conductors forming neurons, and synapse elements are coupled between neurons of adjacent layers. The method includes applying input voltages to an input layer of the neural network, measuring output voltages at an output layer of the neural network, determining an error value as a f...",
  "ipcr_labels": [
    "G06N304",
    "G06N3063"
  ],
  "inventor_list": [
    {
      "inventor_name_last": "Hsu",
      "inventor_name_first": "Fu-Chang",
      "inventor_city": "San Jose",
      "inventor_state": "CA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Hsu",
      "inventor_name_first": "Kevin",
      "inventor_city": "San Jose",
      "inventor_state": "CA",
      "inventor_country": "US"
    }
  ],
  "title": "HIGH-DENSITY NEURAL NETWORK ARRAY",
  "decision": "PENDING",
  "_processing_info": {
    "original_size": 46158,
    "optimized_size": 3245,
    "reduction_percent": 92.97
  }
}