{
  "patent_number": "None",
  "application_number": "15836804",
  "date_published": "20180614",
  "date_produced": "20180530",
  "filing_date": "20171208",
  "main_ipcr_label": "G06N9900",
  "abstract": "Systems and methods for automating data science machine learning using analytical workflows are disclosed that provide for user interaction and iterative analysis including automated suggestions based on at least one analysis of a dataset.",
  "publication_number": "US20180165604A1-20180614",
  "summary": "<SOH> SUMMARY <EOH>The present subject matter is directed to automatically generating and executing the necessary workflow steps to perform a given analytical task. These solutions can be accomplished using a combination of expert system (knowledge based) and machine learning (data driven) techniques driven by one or more decisions associated with given steps in an analytical workflow as executed on an underlying platform. Both techniques will operate in terms of a feature space derived from observing quantitative and qualitative data from data science workflows that abstracts data science workflows for metalearning, a subfield of machine learning where automatic learning algorithms are applied on meta-data about machine learning experiments. This metalearning feature set, or metaspace, can support transfer learning, using knowledge gained while solving one problem and applying it to a different but related problem. The system can implement an intelligent agent framework to accomplish this. Each of one or more specialized agents in the framework can be operable to make complex analytical decisions associated with given steps in an analytical workflow and execute them on the underlying platform on very high volume and high dimensional datasets. Application of the principles described herein can be considered and variously applied in the fields of scientific discovery, forecasting, and modeling highly complex functions, for instance in predictive analysis. In some embodiments, they can be broken down or separated by methodology including symbolic reasoning (rules/production systems), reinforcement learning (RL), recommenders, and others. Techniques such as rule conflict resolution and the merging of knowledge-based and data-driven methodologies can be performed in novel ways while reactive distributed agents and messaging to achieve workflow inferencing can be implemented. Also described are novel techniques including the use of block-based approaches for encapsulatin...",
  "ipcr_labels": [
    "G06N9900",
    "G06N502"
  ],
  "inventor_list": [
    {
      "inventor_name_last": "Minkin",
      "inventor_name_first": "Andrew M.",
      "inventor_city": "McKinney",
      "inventor_state": "TX",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "McNally",
      "inventor_name_first": "Mark",
      "inventor_city": "San Juan Capistrano",
      "inventor_state": "CA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Knight",
      "inventor_name_first": "William",
      "inventor_city": "Bainbridge Island",
      "inventor_state": "WA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Major",
      "inventor_name_first": "Stephane",
      "inventor_city": "Poway",
      "inventor_state": "CA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Lamoreaux",
      "inventor_name_first": "Richard",
      "inventor_city": "Redmond",
      "inventor_state": "WA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Hernandez",
      "inventor_name_first": "Leandro",
      "inventor_city": "Ladera Ranch",
      "inventor_state": "CA",
      "inventor_country": "US"
    }
  ],
  "title": "SYSTEMS AND METHODS FOR AUTOMATING DATA SCIENCE MACHINE LEARNING ANALYTICAL WORKFLOWS",
  "decision": "PENDING",
  "_processing_info": {
    "original_size": 183619,
    "optimized_size": 3587,
    "reduction_percent": 98.05
  }
}