{
  "patent_number": "None",
  "application_number": "15830710",
  "date_published": "20180607",
  "date_produced": "20180523",
  "filing_date": "20171204",
  "main_ipcr_label": "G06N308",
  "abstract": "One embodiment provides a method, comprising: training, using deep imitation learning, a neural network associated with a predetermined ghosting model to predict player movements for at least one player during at least one sequence in a game; receiving, at an information handling device, tracking data associated with a player movement path for at least one player during the at least one sequence; analyzing, using a processor, the tracking data to determine at least one feature associated with the at least one player at a plurality of predetermined time points during the at least one sequence; and determining, using the predetermined ghosting model and the at least one feature, a ghosted movement path for the at least one player beginning from one of the plurality of predetermined time points. Other aspects are described and claimed.",
  "publication_number": "US20180157974A1-20180607",
  "summary": "<SOH> BRIEF SUMMARY <EOH>In summary, one aspect provides a method, comprising: training, using deep imitation learning, a neural network associated with a predetermined ghosting model to predict player movements for at least one player during at least one sequence in a game; receiving, at an information handling device, tracking data associated with a player movement path for at least one player during the at least one sequence; analyzing, using a processor, the tracking data to determine at least one feature associated with the at least one player at a plurality of predetermined time points during the at least one sequence; and determining, using the predetermined ghosting model and the at least one feature, a ghosted movement path for the at least one player beginning from one of the plurality of predetermined time points. Another aspect provides an information handling device, comprising: a processor; a memory device that stores instructions executable by the processor to: train, using deep imitation learning, a neural network associated with a predetermined ghosting model to predict player movements for at least one player during at least one sequence in a game; receive tracking data associated with a player movement path for at least one player during the at least one sequence; analyze the tracking data to determine at least one feature associated with the at least one player at a plurality of predetermined time points during the at least one sequence; and determine, using the predetermined ghosting model and the at least one feature, a ghosted movement path for the at least one player beginning from one of the plurality of predetermined time points. A further aspect provides a product, comprising: a storage device that stores code, the code being executable by a processor and comprising: code that trains a neural network associated with a predetermined ghosting model to predict player movements for at least one player during at least one sequence in a game; co...",
  "ipcr_labels": [
    "G06N308",
    "G06K900",
    "A63B2400"
  ],
  "inventor_list": [
    {
      "inventor_name_last": "Carr",
      "inventor_name_first": "George Peter Kenneth",
      "inventor_city": "Allison Park",
      "inventor_state": "PA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Le",
      "inventor_name_first": "Hoang M.",
      "inventor_city": "Pasadena",
      "inventor_state": "CA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Yue",
      "inventor_name_first": "Yisong",
      "inventor_city": "Glendale",
      "inventor_state": "CA",
      "inventor_country": "US"
    }
  ],
  "title": "DATA-DRIVEN GHOSTING USING DEEP IMITATION LEARNING",
  "decision": "PENDING",
  "_processing_info": {
    "original_size": 50416,
    "optimized_size": 3708,
    "reduction_percent": 92.65
  }
}