{
  "patent_number": "None",
  "application_number": "15832285",
  "date_published": "20180607",
  "date_produced": "20180523",
  "filing_date": "20171205",
  "main_ipcr_label": "G06N9900",
  "abstract": "Embodiments of feedback-based quantum circuits are described. Embodiments of such quantum circuits may be externally controlled using only basis or eigenstate (classically-observable) signals without triggering de-coherence. Additionally, embodiments of such quantum circuits allow the internal (superpositioned) quantum state information to be preserved over long periods of time and present options for quantum error-correction due to the basis-state controls. Moreover, a coupling of two such feedback-based quantum circuits allows for quantum-channel-based information exchange to a variety of ends.",
  "publication_number": "US20180157986A1-20180607",
  "summary": "<SOH> SUMMARY <EOH>To address this need, among others, attention is directed to embodiments of systems and methods for preserving quantum coherence as depicted herein. A bit of additional context may be useful to an understanding of such embodiments. In a famous paper authored by Einstein, Podolsky and Rosen published in 1935 argued that there must be “missing information” in the new theory of quantum mechanics. In particular, they argued that if quantum theory were to hold, then one particle which happened to be entangled with another would somehow be able to communicate information about its state with the other in an instantaneous fashion, even when the two were separated by an arbitrary distance, thus violating the principle of locality. This hypothetical (at the time) pair of entangled particles has come to be known as an “EPR pair”; so-named in honor of this famous paper. A few decades later, Irish physicist John Stewart Bell derived the now-famous “Bell inequality” by which he showed that quantum theory (as interpreted by the EPR paper) is in conflict with the concept of “missing information” (see e.g., [Bell:64][Bell:66]). Bell proposed a set of test conditions (now known as a “Bell test”) that can be used in order to prove or disprove the missing information paradox. The first of experimental proof of a Bell inequality was demonstrated by Freedman, Clauser and Aspect (see e.g., [FC:72][Asp:81][Asp:82]) in 1982. Today, it is an accepted fact that EPR pairs exist, can be created, and do exhibit the behavior coined by Einstein, Podolsky and Rosen as “spooky action at a distance”. Today, this mechanism is referred to as a “quantum channel”. Many engineered artifacts depend upon synchronization of events. There have been numerous protocols, methods, and systems developed solely for the purpose of synchronizing two or more events. In conventional electronic systems, such synchronization can be accomplished in many means; typically involving the transmission of a ...",
  "ipcr_labels": [
    "G06N9900",
    "H01L3922"
  ],
  "inventor_list": [
    {
      "inventor_name_last": "Oxford",
      "inventor_name_first": "William V.",
      "inventor_city": "Austin",
      "inventor_state": "TX",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Thornton",
      "inventor_name_first": "Mitchell A.",
      "inventor_city": "Dallas",
      "inventor_state": "TX",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "MacFarlane",
      "inventor_name_first": "Duncan L.",
      "inventor_city": "Dallas",
      "inventor_state": "TX",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "LaFave, JR.",
      "inventor_name_first": "Timothy P.",
      "inventor_city": "Dallas",
      "inventor_state": "TX",
      "inventor_country": "US"
    }
  ],
  "title": "Systems and Methods for Quantum Coherence Preservation of Qubits",
  "decision": "PENDING",
  "_processing_info": {
    "original_size": 132552,
    "optimized_size": 3696,
    "reduction_percent": 97.21
  }
}