{
  "patent_number": "None",
  "application_number": "15837427",
  "date_published": "20180412",
  "date_produced": "20180328",
  "filing_date": "20171211",
  "main_ipcr_label": "G06N300",
  "abstract": "The present invention is an Intelligent Automated Assistant that can be implemented using any of a number of graphical interface operated platforms such as a smartphone to facilitate user interaction with the device by a unique adaptive graphical interface, to manage functionalities of: mathematical calculations; telephony, Smart Dial; Speed Dial of phone numbers, Apps and actions; input of text; definition, Calculation and Management of Time values and their utilization in the creation or edition of Calendar Events, Schedule Reminders/Tasks, Timers and Alarms.",
  "publication_number": "US20180101762A1-20180412",
  "summary": "<SOH> SUMMARY <EOH>According to various embodiments of the present invention, a Graphical Interface based Intelligent Automated Assistant is implemented on an electronic device, to facilitate user interaction with a device, and to help the user more effectively engage with local and/or remote services. In various embodiments, the present invention engages with the user by an adaptive graphical Interface, and invokes external services when appropriate to obtain information or perform various actions. According to various embodiments, the present invention integrates and coordinates a variety of capabilities provided by different software components to offer intelligent interfaces and useful functionality to users. According to various embodiments of The Present Invention, intelligent automated assistant Software components are designed to provide different types of operations, functionalities, and/or features, and/or to combine a plurality of features, operations, and applications of an electronic device on which it is installed. In some embodiments, The Present Invention can perform any or all of: actively eliciting input from a user, interpreting user intent, disambiguating among competing interpretations, requesting and receiving clarifying information as needed, and performing (or initiating) actions based on the discerned intent. Actions can be performed, for example, by activating and/or interfacing with other Software Applications or services that may be available on the electronic device. In various embodiments, such activation of external services can be performed via APIs or by any other suitable mechanism. In this manner, The Present Invention systems of various embodiments of the present invention can unify, simplify, and improve the user's experience with respect to different applications and functions of an electronic device of the like of: mathematical calculations, telephony, Smart dial, Speed dial (not only of phone numbers but also actions), text in...",
  "ipcr_labels": [
    "G06N300",
    "G06F30488",
    "G06F30485",
    "G06F944",
    "G06F30484"
  ],
  "inventor_list": [
    {
      "inventor_name_last": "Gutierrez",
      "inventor_name_first": "Pablo",
      "inventor_city": "San Rafael Mendoza",
      "inventor_state": "",
      "inventor_country": "AR"
    }
  ],
  "title": "Graphical interfaced based intelligent automated assistant",
  "decision": "PENDING",
  "_processing_info": {
    "original_size": 170665,
    "optimized_size": 3173,
    "reduction_percent": 98.14
  }
}