{
  "patent_number": "None",
  "application_number": "15836980",
  "date_published": "20180621",
  "date_produced": "20180608",
  "filing_date": "20171211",
  "main_ipcr_label": "G06N9900",
  "abstract": "Disclosed aspects relate to cognitive adaptations for well-being management in a living environment. A set of sensor-derived data for the living environment may be ingested. The ingestion of a set of sensor-derived data may occur using a set of micro-cognitive modules. The set of sensor-derived data may be analyzed using a machine learning technique. The set of sensor-derived data may be analyzed to detect an anomalous event related to the living environment. The anomalous event may be detected based on the set of sensor-derived data. An anomalous event response action may be performed in response to detecting the anomalous event.",
  "publication_number": "US20180174671A1-20180621",
  "summary": "<SOH> SUMMARY <EOH>Aspects of the disclosure relate to cognitive adaptations for well-being management in a living environment. Disclosed aspects may utilize analytics and measurements from micro-cognitive systems to determine an anomalous state, and thereafter perform an action once the anomalous state is detected. Inputs from a plurality of micro cognitive systems may be received. The micro-cognitive systems may be configured to self-learn, identify a set of behavior patterns of an individual, and to trigger an alarm parameter in response to a pattern mismatch. The inputs received from the plurality of micro cognitive systems may be integrated to form integrated data by a central processing system. The integrated data may be analyzed to identify behavioral data and alarm parameters. Behavioral norms for a subject may be established using the behavioral data and the identified alarm parameters. Predetermined criteria may be used to determine whether an anomalous event has been detected, and a response action may be performed in response to determining the anomalous event. Disclosed aspects relate to cognitive adaptations for well-being management in a living environment. A set of sensor-derived data for the living environment may be ingested. The ingestion of a set of sensor-derived data may occur using a set of micro-cognitive modules. The set of sensor-derived data may be analyzed using a machine learning technique. The set of sensor-derived data may be analyzed to detect an anomalous event related to the living environment. The anomalous event may be detected based on the set of sensor-derived data. An anomalous event response action may be performed in response to detecting the anomalous event. The above summary is not intended to describe each illustrated embodiment or every implementation of the present disclosure.",
  "ipcr_labels": [
    "G06N9900"
  ],
  "inventor_list": [
    {
      "inventor_name_last": "Cruz Huertas",
      "inventor_name_first": "Luis Carlos",
      "inventor_city": "San Pedro",
      "inventor_state": "",
      "inventor_country": "CR"
    },
    {
      "inventor_name_last": "Hamilton, II",
      "inventor_name_first": "Rick A.",
      "inventor_city": "Charlottesville",
      "inventor_state": "VA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Narasimhamurthy",
      "inventor_name_first": "Hari K.",
      "inventor_city": "Chantilly",
      "inventor_state": "VA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Zamora Duran",
      "inventor_name_first": "Edgar Adolfo",
      "inventor_city": "Santo Domingo",
      "inventor_state": "",
      "inventor_country": "CR"
    }
  ],
  "title": "COGNITIVE ADAPTATIONS FOR WELL-BEING MANAGEMENT",
  "decision": "PENDING",
  "_processing_info": {
    "original_size": 104650,
    "optimized_size": 3513,
    "reduction_percent": 96.64
  }
}