{
  "patent_number": "None",
  "application_number": "15834311",
  "date_published": "20180607",
  "date_produced": "20180523",
  "filing_date": "20171207",
  "main_ipcr_label": "G06N9900",
  "abstract": "A computer-implemented method is disclosed for a first (P(TM)) to gain knowledge. The method includes: performing a first P(TM(i)) to interact with a P(TM(thing)) to set a first Thing that is representative of content, performing a second P(TM(i)) to interact with the P(TM(thing)) to parse the content of the first Thing as a second Thing that is representative of a statement, performing a third P(TM(i)) to interact with the P(TM(thing)) to evaluate the statement of the second Thing to compute a third Thing that is representative of a performable statement, and performing a fourth P(TM(i)) to interact with the P(TM(thing)) to perform the performable statement of the third Thing, The fourth P(TM(i)), in performing the performable statement, interacts with P(TM(thing)) to set one or more Things that are representative of posterior knowledge.",
  "publication_number": "US20180157993A1-20180607",
  "summary": "<SOH> SUMMARY OF THE INVENTION <EOH>Embodiments of the present invention provide a Thing Machine that represents actions the Thing Machine can perform, and the Things that the actions act upon, as instances of Things administered in non-transitory memory using a multi-dimensional graph model. According to one aspect, a computer-implemented method for a first (P(TM)) to gain knowledge includes: performing a first P(TM(i)) to interact with a P(TM(thing)) to set a first Thing that is representative of content, performing a second P(TM(i)) to interact with the P(TM(thing)) to parse the content of the first Thing as a second Thing that is representative of a statement, performing a third P(TM(i)) to interact with the P(TM(thing)) to evaluate the statement of the second Thing to compute a third Thing that is representative of a performable statement, and performing a fourth P(TM(i)) to interact with the P(TM(thing)) to perform the performable statement of the third Thing, The fourth P(TM(i)), in performing the performable statement, interacts with P(TM(thing)) to set one or more Things that are representative of posterior knowledge. According to another aspect, a computer-based system includes: one or more computer-based processors, and computer-based memory coupled to the one or computer-based processors. The computer-based memory stores computer-readable instructions that, when executed by the one or more computer-based processors, cause the one or more computer-based processors to perform a method. The method includes performing a first P(TM(i)), by executing a first section of the computer-readable instructions that corresponds to the first P(TM(i)), to interact with another section of the computer-readable instructions that corresponds to a P(TM(thing)), to set a first Thing that is representative of content, performing a second P(TM(i)), by executing a second section of the computer-readable instructions that corresponds to the first P(TM(i)), to interact with the o...",
  "ipcr_labels": [
    "G06N9900",
    "G06N502"
  ],
  "inventor_list": [
    {
      "inventor_name_last": "Northrup",
      "inventor_name_first": "Charles",
      "inventor_city": "Bedford",
      "inventor_state": "NH",
      "inventor_country": "US"
    }
  ],
  "title": "THING MACHINE SYSTEMS AND METHODS",
  "decision": "PENDING",
  "_processing_info": {
    "original_size": 322459,
    "optimized_size": 3386,
    "reduction_percent": 98.95
  }
}