{
  "patent_number": "None",
  "application_number": "15832671",
  "date_published": "20180607",
  "date_produced": "20180523",
  "filing_date": "20171205",
  "main_ipcr_label": "G06N9900",
  "abstract": "Systems and processes for metric learning distillation are disclosed herein. In accordance with one example, a method includes, at an electronic device, at an electronic device having one or more processors and memory, receiving a first plurality of vectors from a first model, receiving a second plurality of vectors from a second model, determining a first plurality of vector distances based on the first plurality of vectors, generating a first matrix based on the first plurality of vector distances, determining a second plurality of vector distances based on the second plurality of vectors, generating a second matrix based on the second plurality of vector distances, comparing the first matrix with the second matrix, and adjusting the second model based on the comparison of the first matrix and the second matrix.",
  "publication_number": "US20180157992A1-20180607",
  "summary": "<SOH> BRIEF SUMMARY <EOH>Example methods are disclosed herein. An example method includes, at an electronic device, receiving a first plurality of vectors from a first model; receiving a second plurality of vectors from a second model; determining a first plurality of vector distances based on the first plurality of vectors; generating a first matrix based on the first plurality of vector distances; determining a second plurality of vector distances based on the second plurality of vectors; generating a second matrix based on the second plurality of vector distances; comparing the first matrix with the second matrix; and adjusting the second model based on the comparison of the first matrix and the second matrix. Example non-transitory computer-readable media are disclosed herein. An example non-transitory computer-readable storage medium stores one or more programs. The one or more programs comprise instructions, which when executed by one or more processors of an electronic device, cause the electronic device to receive a first plurality of vectors from a first model; receive a second plurality of vectors from a second model; determine a first plurality of vector distances based on the first plurality of vectors; generate a first matrix based on the first plurality of vector distances; determine a second plurality of vector distances based on the second plurality of vectors; generate a second matrix based on the second plurality of vector distances; compare the first matrix with the second matrix; and adjust the second model based on the comparison of the first matrix and the second matrix. Example electronic devices are disclosed herein. An example electronic device comprises one or more processors; a memory; and one or more programs, where the one or more programs are stored in the memory and configured to be executed by the one or more processors, the one or more programs including instructions for receiving a first plurality of vectors from a first model; rece...",
  "ipcr_labels": [
    "G06N9900",
    "G06N502"
  ],
  "inventor_list": [
    {
      "inventor_name_last": "Susskind",
      "inventor_name_first": "Joshua M.",
      "inventor_city": "San Jose",
      "inventor_state": "CA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Tang",
      "inventor_name_first": "Feng",
      "inventor_city": "Cupertino",
      "inventor_state": "CA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Huang",
      "inventor_name_first": "Chen",
      "inventor_city": "Columbia",
      "inventor_state": "MO",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Sun",
      "inventor_name_first": "Shih-Yu",
      "inventor_city": "Cupertino",
      "inventor_state": "CA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Talbot",
      "inventor_name_first": "Walter A.",
      "inventor_city": "Cupertino",
      "inventor_state": "CA",
      "inventor_country": "US"
    }
  ],
  "title": "MODEL AND ENSEMBLE COMPRESSION FOR METRIC LEARNING",
  "decision": "PENDING",
  "_processing_info": {
    "original_size": 120125,
    "optimized_size": 3962,
    "reduction_percent": 96.7
  }
}