{
  "patent_number": "None",
  "application_number": "15834661",
  "date_published": "20180607",
  "date_produced": "20180523",
  "filing_date": "20171207",
  "main_ipcr_label": "G06N308",
  "abstract": "A system for forecasting a future signal pattern of a light signal system includes the following: A first communications interface for receiving traffic data for a light signal system, on the basis of which the light signal system can establish a future signal pattern, in order to display the signal pattern established; a second communications interface for receiving the signal pattern data of the light signal system corresponding to the signal pattern established by means of the light signal system; and a computing unit with artificial intelligence for forecasting a future signal pattern on the basis of the traffic data. The artificial intelligence is trainable on the basis of the traffic data and the signal pattern data of the light signal system. There is also provided a corresponding method, a computer program and a computer program product.",
  "publication_number": "US20180157975A1-20180607",
  "summary": "<SOH> SUMMARY OF THE INVENTION <EOH>It is an object of the invention to provide a forecasting process which overcomes the above-mentioned and other disadvantages of the heretofore-known devices and methods of this general type and which provides for an efficient concept for efficient forecasting of a future signal pattern of a light signal system. With the foregoing and other objects in view there is provided, in accordance with the invention, a system for forecasting a future signal pattern of a light signal system, the system comprising: a first communications interface for receiving traffic data for a light signal system, wherein the light signal system is enabled to establish a future signal pattern based on the traffic data, in order to display the signal pattern thus established; a second communications interface for receiving corresponding signal pattern data of the light signal system from the signal pattern established by the light signal system; and a computing unit containing a trainable artificial intelligence to be trained on a basis of the traffic data and the signal pattern data of the light signal system and for forecasting a future signal pattern based on the traffic data. In other words, according to one aspect of the invention, there is a system for forecasting a future signal pattern of a light signal system which includes: a first communications interface for receipt of traffic data for a light signal system, on the basis of which the light signal system can establish a future signal pattern, in order to display the signal pattern established, a second communications interface for receipt of the signal pattern data of the light signal system corresponding to the signal pattern established by means of the light signal system, and a computing unit comprising an artificial intelligence trainable on the basis of the traffic data and the signal pattern data of the light signal system for forecasting a future signal pattern on the basis of the traffic...",
  "ipcr_labels": [
    "G06N308",
    "G08G101"
  ],
  "inventor_list": [
    {
      "inventor_name_last": "HAHN",
      "inventor_name_first": "DENIS PHILIPP",
      "inventor_city": "MUENCHEN",
      "inventor_state": "",
      "inventor_country": "DE"
    },
    {
      "inventor_name_last": "HOBOHM",
      "inventor_name_first": "DANIEL",
      "inventor_city": "MUENCHEN",
      "inventor_state": "",
      "inventor_country": "DE"
    }
  ],
  "title": "METHOD, SYSTEM AND COMPUTER PROGRAM FOR FORECASTING SIGNALING IN A LIGHT SIGNAL SYSTEM",
  "decision": "PENDING",
  "_processing_info": {
    "original_size": 60217,
    "optimized_size": 3589,
    "reduction_percent": 94.04
  }
}