{
  "patent_number": "None",
  "application_number": "15835375",
  "date_published": "20180614",
  "date_produced": "20180530",
  "filing_date": "20171207",
  "main_ipcr_label": "G06N3063",
  "abstract": "Three-dimensional neural network array. In an exemplary embodiment, a three-dimensional (3D) neural network includes a plurality of input conductors forming a plurality of stacked input layers having a first orientation, and at least one output conductor forming an output layer having the first orientation. The three-dimensional (3D) neural network also includes a plurality of hidden conductors having a second orientation. Each hidden conductor includes an in-line threshold element. The three-dimensional (3D) neural network also includes synapse elements coupled between the hidden conductors and the input conductors and between the hidden conductors and the output conductor. Each synapse element includes a programmable resistive element.",
  "publication_number": "US20180165573A1-20180614",
  "summary": "<SOH> SUMMARY <EOH>A novel high-density three-dimensional (3D) neutral network array structure is disclosed. In various exemplary embodiment, the 3D neural network array provides much higher density and speed over conventional neural networks. In an exemplary embodiment, a three-dimensional (3D) neural network is disclosed that includes a plurality of input conductors forming a plurality of stacked input layers having a first orientation, and at least one output conductor forming an output layer having the first orientation. The three-dimensional (3D) neural network also includes a plurality of hidden conductors having a second orientation. Each hidden conductor includes an in-line threshold element. The three-dimensional (3D) neural network also includes synapse elements coupled between the hidden conductors and the input conductors and between the hidden conductors and the output conductor. Each synapse element includes a programmable resistive element. In an exemplary embodiment, a synapse element is disclosed for use in a three-dimensional (3D) neural network. The synapse element comprises a threshold layer having an outside surface connected to a first conductor and also includes an inside surface. The synapse element also includes a programmable resistive layer having an outside surface connected to the inside surface of the threshold layer and an inside surface connected to a second conductor. The programmable resistive layer is programmable to provide a plurality of resistance values. In an exemplary embodiment, a three-dimensional (3D) neural network is disclosed that comprises a first plurality of input conductors forming a first plurality of input layers, a second plurality of input conductors forming a second plurality of input layers, a plurality of output conductors forming a plurality of output layers, and a plurality of hidden conductors. The three-dimensional (3D) neural network also comprises a plurality of synapse elements that connect the input a...",
  "ipcr_labels": [
    "G06N3063",
    "G06N304"
  ],
  "inventor_list": [
    {
      "inventor_name_last": "Hsu",
      "inventor_name_first": "Fu-Chang",
      "inventor_city": "San Jose",
      "inventor_state": "CA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Hsu",
      "inventor_name_first": "Kevin",
      "inventor_city": "San Jose",
      "inventor_state": "CA",
      "inventor_country": "US"
    }
  ],
  "title": "THREE-DIMENSIONAL NEURAL NETWORK ARRAY",
  "decision": "PENDING",
  "_processing_info": {
    "original_size": 75582,
    "optimized_size": 3427,
    "reduction_percent": 95.47
  }
}