{
  "patent_number": "None",
  "application_number": "15833457",
  "date_published": "20180405",
  "date_produced": "20180322",
  "filing_date": "20171206",
  "main_ipcr_label": "G06N700",
  "abstract": "An electronic device described herein includes a sensing unit having at least one sensor to acquire sensing data. An associated computing device extracts sensor specific features from the sensing data, and generates a motion activity vector, a voice activity vector, and a spatial environment vector as a function of the sensor specific features. The motion activity vector, voice activity vector, and spatial environment vector are processed to determine a base level context of the electronic device relative to its surroundings, with the base level context having aspects each based on the motion activity vector, voice activity vector, and spatial environment vector. Meta level context of the electronic device relative to its surroundings is determined as a function of the base level context, with the meta level context being at least one inference made from at least two aspects of the plurality of aspects of the base level context.",
  "publication_number": "US20180096256A1-20180405",
  "summary": "<SOH> SUMMARY <EOH>This summary is provided to introduce a selection of concepts that are further described below in the detailed description. This summary is not intended to identify key or essential features of the claimed subject matter, nor is it intended to be used as an aid in limiting the scope of the claimed subject matter. An electronic device described herein includes a sensing unit having at least one sensor to acquire sensing data. An associated computing device extracts sensor specific features from the sensing data, and generates a motion activity vector, a voice activity vector, and a spatial environment vector as a function of the sensor specific features. The motion activity vector, voice activity vector, and spatial environment vector are processed to determine a base level context of the electronic device relative to its surroundings, with the base level context having aspects each based on the motion activity vector, voice activity vector, and spatial environment vector. Meta level context of the electronic device relative to its surroundings is determined as a function of the base level context, with the meta level context being at least one inference made from at least two aspects of the plurality of aspects of the base level context. Another aspect is directed to an electronic device including a printed circuit board (PCB) having at least one conductive trace thereon, and a system on chip (SoC) mounted on the PCB and electrically coupled to the at least one conductive trace. A sensor chip is mounted on the PCB in a spaced apart relation with the SoC and is electrically coupled to the at least one conductive trace such that the sensor chip and SoC are electrically coupled. The sensor chip is configured to acquire sensing data. The sensor chip may include a micro-electromechanical system (MEMS) sensing unit and an embedded processing node. The embedded processing node may be configured to preprocess the sensing data, extract sensor specific feat...",
  "ipcr_labels": [
    "G06N700",
    "G06F1730"
  ],
  "inventor_list": [
    {
      "inventor_name_last": "Chowdhary",
      "inventor_name_first": "Mahesh",
      "inventor_city": "San Jose",
      "inventor_state": "CA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Kumar",
      "inventor_name_first": "Arun",
      "inventor_city": "New Delhi",
      "inventor_state": "",
      "inventor_country": "IN"
    },
    {
      "inventor_name_last": "Singh",
      "inventor_name_first": "Ghanapriya",
      "inventor_city": "New Delhi",
      "inventor_state": "",
      "inventor_country": "IN"
    },
    {
      "inventor_name_last": "Meer",
      "inventor_name_first": "Kashif R. J.",
      "inventor_city": "New Delhi",
      "inventor_state": "",
      "inventor_country": "IN"
    },
    {
      "inventor_name_last": "Kar",
      "inventor_name_first": "Indra Narayan",
      "inventor_city": "New Delhi",
      "inventor_state": "",
      "inventor_country": "IN"
    },
    {
      "inventor_name_last": "Bahl",
      "inventor_name_first": "Rajendar",
      "inventor_city": "New Delhi",
      "inventor_state": "",
      "inventor_country": "IN"
    }
  ],
  "title": "METHOD AND APPARATUS FOR DETERMINING PROBABILISTIC CONTEXT AWARENESS OF A MOBILE DEVICE USER USING A SINGLE SENSOR AND/OR MULTI-SENSOR DATA FUSION",
  "decision": "PENDING",
  "_processing_info": {
    "original_size": 56618,
    "optimized_size": 4324,
    "reduction_percent": 92.36
  }
}