{
  "patent_number": "None",
  "application_number": "15844449",
  "date_published": "20180621",
  "date_produced": "20180608",
  "filing_date": "20171215",
  "main_ipcr_label": "G06N308",
  "abstract": "The compression system trains a machine-learned encoder and decoder through an autoencoder architecture. The encoder can be deployed by a sender system to encode content for transmission to a receiver system, and the decoder can be deployed by the receiver system to decode the encoded content and reconstruct the original content. The encoder is coupled to receive content and output a tensor as a compact representation of the content. The content may be, for example, images, videos, or text. The decoder is coupled to receive a tensor representing content and output a reconstructed version of the content. The compression system trains the autoencoder with a discriminator to reduce compression artifacts in the reconstructed content. The discriminator is coupled to receive one or more input content, and output a discrimination prediction that discriminates whether the input content is the original or reconstructed version of the content.",
  "publication_number": "US20180174052A1-20180621",
  "summary": "<SOH> SUMMARY <EOH>The compression system trains a machine-learned encoder and decoder through an autoencoder architecture. The encoder can be deployed by a sender system to encode content for transmission to a receiver system, and the decoder can be deployed by the receiver system to decode the encoded content and reconstruct the original content. The encoder is coupled to receive content and output a tensor as a compact representation of the content. The content may be, for example, images, videos, or text. The decoder is coupled to receive a tensor representing content and output a reconstructed version of the content. In one embodiment, the compression system trains the autoencoder with a discriminator to reduce compression artifacts in the reconstructed content. The discriminator is coupled to receive one or more input content, and output a discrimination prediction that discriminates whether the input content is the original or reconstructed version of the content. Specifically, the original version and the reconstructed version may be distinguishable from one another in that the reconstructed content may include characteristics, such as compression artifacts, that arise during the encoding process. Since the original content does not include such characteristics, the discriminator can learn to discriminate between the original and reconstructed version by identifying such differences between the two. The compression system trains the discriminator to output predictions that correctly discriminate between original and reconstructed content generated by the autoencoder. The compression system trains the autoencoder to generate reconstructed content that causes the discriminator to output incorrect predictions. By repeatedly training the autoencoder to compete with the discriminator, the compression system can train an encoder and decoder to continuously tune the reconstructed content to “fool” the discriminator by, for example, reducing the differences between ...",
  "ipcr_labels": [
    "G06N308",
    "G06N304"
  ],
  "inventor_list": [
    {
      "inventor_name_last": "Rippel",
      "inventor_name_first": "Oren",
      "inventor_city": "Mountain View",
      "inventor_state": "CA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Bourdev",
      "inventor_name_first": "Lubomir",
      "inventor_city": "Mountain View",
      "inventor_state": "CA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Lew",
      "inventor_name_first": "Carissa",
      "inventor_city": "San Jose",
      "inventor_state": "CA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Nair",
      "inventor_name_first": "Sanjay",
      "inventor_city": "Fremont",
      "inventor_state": "CA",
      "inventor_country": "US"
    }
  ],
  "title": "USING GENERATIVE ADVERSARIAL NETWORKS IN COMPRESSION",
  "decision": "PENDING",
  "_processing_info": {
    "original_size": 83101,
    "optimized_size": 3951,
    "reduction_percent": 95.25
  }
}