{
  "patent_number": "None",
  "application_number": "15844357",
  "date_published": "20180426",
  "date_produced": "20180411",
  "filing_date": "20171215",
  "main_ipcr_label": "G06N9900",
  "abstract": "A modular quantum computer architecture is developed with a hierarchy of interactions that can scale to very large numbers of qubits. Local entangling quantum gates between qubit memories within a single modular register are accomplished using natural interactions between the qubits, and entanglement between separate modular registers is completed via a probabilistic photonic interface between qubits in different registers, even over large distances. This architecture is suitable for the implementation of complex quantum circuits utilizing the flexible connectivity provided by a reconfigurable photonic interconnect network. The subject architecture is made fault-tolerant which is a prerequisite for scalability. An optimal quantum control of multimode couplings between qubits is accomplished via individual addressing the qubits with segmented optical pulses to suppress crosstalk in each register, thus enabling high-fidelity gates that can be scaled to larger qubit registers for quantum ...",
  "publication_number": "US20180114138A1-20180426",
  "summary": "<SOH> SUMMARY OF THE INVENTION <EOH>It is therefore an object of the present invention to provide a fault-tolerant modular universal scalable quantum computer (MUSIQC) architecture that may enable construction of quantum processors with a large number of stationary matter qubits, such as, for example, trapped ions, quantum dots, neutral atoms, NV color centers, etc., utilizing component technologies that have already been demonstrated as reliable and effective. It is an additional object of the present invention to provide a large scale modular quantum computer architecture with atomic memories and photonic interconnects enhanced by a quantum control of multimode couplings between trapped ion qubits for reliable scalable entanglement through optimally shaping optical fields that couple to multiple collective modes of motion. This approach enables high-fidelity gates that can be scaled to large qubit registers for quantum computations and simulation. It is another object of the present invention to provide a large scale modular quantum computer architecture featuring modular multi-qubit registers that may be combined with ion shuttling, and scalable photonic interconnects that can dynamically link the modular multi-qubit registers in reconfigurable flexible configurations, such as, for example, multi-dimensional hypercells of the modular multi-qubit registers supporting the controllable mapping to 3D cluster states of multiple qubits independent of distances between the modular registers, and capable of implementation of complex quantum computational circuits prescribed by quantum algorithms via the reconfigurable photonic interconnect network. It is a still further object of the present invention to provide a large scale modular quantum computer architecture that attains significant processing speed and effective resource (qubits required for computations) reduction in quantum circuit execution over other hardware architectures enabled by the ability to realize quan...",
  "ipcr_labels": [
    "G06N9900",
    "G06F1576"
  ],
  "inventor_list": [
    {
      "inventor_name_last": "MONROE",
      "inventor_name_first": "Christopher",
      "inventor_city": "Ellicott City",
      "inventor_state": "MD",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "KIM",
      "inventor_name_first": "Jungsang",
      "inventor_city": "Chapel Hill",
      "inventor_state": "NC",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "RAUSSENDORF",
      "inventor_name_first": "Robert",
      "inventor_city": "Vancouver",
      "inventor_state": "",
      "inventor_country": "CA"
    }
  ],
  "title": "FAULT-TOLERANT SCALABLE MODULAR QUANTUM COMPUTER ARCHITECTURE WITH AN ENHANCED CONTROL OF MULTI-MODE COUPLINGS BETWEEN TRAPPED ION QUBITS",
  "decision": "PENDING",
  "_processing_info": {
    "original_size": 197536,
    "optimized_size": 3950,
    "reduction_percent": 98.0
  }
}