{
  "patent_number": "None",
  "application_number": "15844457",
  "date_published": "20180621",
  "date_produced": "20180608",
  "filing_date": "20171215",
  "main_ipcr_label": "G06N3063",
  "abstract": "Self-learning for neural network arrays. In an exemplary embodiment, a method includes determining input voltages to be applied to one or more input neurons of a neural network, and determining target output voltages to be obtained at one or more output neurons of the neural network in response to the input voltages. The neural network also includes a plurality of hidden neurons and synapses connecting the neurons, and each of a plurality of synapses includes a resistive element. The method also includes applying the input voltages to the input neurons, and applying the target output voltages or complements of the target output voltages to the output neurons to simultaneously program the resistive elements of the plurality of synapses.",
  "publication_number": "US20180174030A1-20180621",
  "summary": "<SOH> SUMMARY <EOH>Self-learning for neutral network arrays is disclosed. In various exemplary embodiments, a self-learning neural network array includes neurons connected by weighted synapses. In an exemplary embodiment, programming the weights of the synapses is accomplished using a novel direct programming process whereby the weights of the synapses are directly programmed from selected input values and output values. This direct process eliminates the need for alternating forward-propagation and back-propagation steps as used with conventional neural networks. Therefore, a self-learning neural network chip can be realized. During the learning process, the weights may be updated quickly and efficiently one or more times until all the weight values are programmed (e.g., learned). Additional training can be used to achieve more accurate learning results. In an exemplary embodiment, a method is disclosed that comprises determining input voltages to be applied to one or more input neurons of a neural network, and determining target output voltages to be obtained at one or more output neurons of the neural network in response to the input voltages. The neural network also includes a plurality of hidden neurons and synapses connecting the neurons, and each of a plurality of synapses includes a resistive element. The method also includes applying the input voltages to the input neurons, and applying the target output voltages or complements of the target output voltages to the output neurons to simultaneously program the resistive elements of the plurality of synapses. In an exemplary embodiment, a method is disclosed for programming resistive elements of synapses of a neural network. The method comprises initializing the resistive elements to low resistive states, determining input voltages to be applied to one or more input neurons of the neural network, and determining target output voltages to be obtained at one or more output neurons of the neural network in respon...",
  "ipcr_labels": [
    "G06N3063",
    "G06N304"
  ],
  "inventor_list": [
    {
      "inventor_name_last": "Hsu",
      "inventor_name_first": "Fu-Chang",
      "inventor_city": "San Jose",
      "inventor_state": "CA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Hsu",
      "inventor_name_first": "Kevin",
      "inventor_city": "San Jose",
      "inventor_state": "CA",
      "inventor_country": "US"
    }
  ],
  "title": "SELF-LEARNING FOR NEURAL NETWORK ARRAYS",
  "decision": "PENDING",
  "_processing_info": {
    "original_size": 54838,
    "optimized_size": 3426,
    "reduction_percent": 93.75
  }
}