{
  "patent_number": "nan",
  "application_number": "15848381",
  "date_published": "20180412",
  "date_produced": "20180328",
  "filing_date": "20171220",
  "main_ipcr_label": "G06N9900",
  "abstract": "A technique relates to a microwave device. A pump resonator, at a first pump resonator end, is connected to both a dispersive nonlinear element and a first stub. The pump resonator, at a second pump resonator end, is capacitively coupled to a pump port, where the first stub is terminated in an open circuit. A quantum signal resonator, at a first quantum signal resonator end, is connected to both the dispersive nonlinear element and a second stub. The quantum signal resonator, at a second signal resonator end, is capacitively coupled to a signal port, where the second stub is connected to ground.",
  "publication_number": "US20180101787A1-20180412",
  "summary": "<SOH> SUMMARY <EOH>According to one embodiment, a microwave device is provided. The microwave device includes a dispersive nonlinear element, and a pump resonator, at a first pump resonator end, connected to both the dispersive nonlinear element and a first stub. The pump resonator, at a second pump resonator end, is capacitively coupled to a pump port, where the first stub is terminated in an open circuit. Also, the microwave device includes a quantum signal resonator, at a first quantum signal resonator end, connected to both the dispersive nonlinear element and a second stub. The quantum signal resonator, at a second signal resonator end, is capacitively coupled to a signal port, wherein the second stub is connected to ground. According to one embodiment, a method for nondemolition counting of photons is provided. The method includes coupling a pump resonance mode of a pump resonator and a signal resonance mode of a quantum signal resonator to a dispersive nonlinear element, responsive to a pump signal at a pump resonance frequency and a quantum signal at a signal resonance frequency. The pump resonance mode of the pump resonator has the pump resonance frequency, where the signal resonance mode of the quantum signal resonator has the signal resonance frequency. Also, the method includes creating a nonlinear interaction between the pump signal and the quantum signal, by driving the pump resonance mode with the pump signal at the pump resonance frequency, and detecting a presence or absence of photons in the quantum signal according to the pump resonance frequency which affects an output pump signal being measured. According to one embodiment, a method of operating a microwave device is device. The method includes receiving, by the microwave device, a pump signal at a pump resonance frequency, where the pump resonance frequency corresponds to a pump resonance mode of a pump resonator. The method includes receiving, by the microwave device, a quantum signal at a sig...",
  "ipcr_labels": [
    "G06N9900",
    "H01P708",
    "G01R2302",
    "G01V800",
    "H01P1203"
  ],
  "inventor_list": [
    {
      "inventor_name_last": "ABDO",
      "inventor_name_first": "Baleegh",
      "inventor_city": "Fishkill",
      "inventor_state": "NY",
      "inventor_country": "US"
    }
  ],
  "title": "QUANTUM NONDEMOLITION MICROWAVE PHOTON COUNTER BASED ON THE CROSS-KERR NONLINEARITY OF A JOSEPHSON JUNCTION EMBEDDED IN A SUPERCONDUCTING CIRCUIT",
  "decision": "PENDING",
  "_processing_info": {
    "original_size": 61389,
    "optimized_size": 3281,
    "reduction_percent": 94.66
  }
}