{
  "patent_number": "None",
  "application_number": "15843267",
  "date_published": "20180419",
  "date_produced": "20180404",
  "filing_date": "20171215",
  "main_ipcr_label": "G06N504",
  "abstract": "A search intention identifying method. The method includes: at a device having one or more processor and memory, obtaining a to-be-identified query character string, and obtaining a history web page set corresponding to the query character string, the history web page set comprising web pages clicked by using the query character string historically; obtaining a predetermined web page categorization model; obtaining a category of each web page in the history web page set according to the web page categorization model; collecting statistics on the number of web pages in each category in the history web page set, and performing calculation according to the number of the web pages in each category and a total number of web pages in the history web page set to obtain intention distribution of the query character string; and obtaining an intention identification result of the query character string according to the intention distribution.",
  "publication_number": "US20180107933A1-20180419",
  "summary": "<SOH> SUMMARY <EOH>Accordingly, for the foregoing technical problems, a web page training method and device, and a search intention identifying method and device are provided, so as to improve the search intention identification accuracy rate. A search intention identifying method is provided. The method includes: at a device having one or more processor and memory, obtaining a to-be-identified query character string, and obtaining a history web page set corresponding to the query character string, the history web page set comprising web pages clicked by using the query character string historically; obtaining a predetermined web page categorization model; obtaining a category of each web page in the history web page set according to the web page categorization model; collecting statistics on the number of web pages in each category in the history web page set, and performing calculation according to the number of the web pages in each category and a total number of web pages in the history web page set to obtain intention distribution of the query character string; and obtaining an intention identification result of the query character string according to the intention distribution. A non-transitory computer-readable storage medium is also provided and containing computer-executable instructions for, when executed by one or more processors, performing a search intention identifying method. The method includes: obtaining a to-be-identified query character string, and obtaining a history web page set corresponding to the query character string, the history web page set comprising web pages clicked by using the query character string historically; obtaining a predetermined web page categorization model; obtaining a category of each web page in the history web page set according to the web page categorization model; collecting statistics on the number of web pages in each category in the history web page set, and performing calculation according to the number of the we...",
  "ipcr_labels": [
    "G06N504",
    "G06F1730",
    "G06N9900"
  ],
  "inventor_list": [
    {
      "inventor_name_last": "WANG",
      "inventor_name_first": "Zhongcun",
      "inventor_city": "Shenzhen",
      "inventor_state": "",
      "inventor_country": "CN"
    }
  ],
  "title": "WEB PAGE TRAINING METHOD AND DEVICE, AND SEARCH INTENTION IDENTIFYING METHOD AND DEVICE",
  "decision": "PENDING",
  "_processing_info": {
    "original_size": 63702,
    "optimized_size": 3543,
    "reduction_percent": 94.44
  }
}