{
  "patent_number": "nan",
  "application_number": "15853421",
  "date_published": "20180503",
  "date_produced": "20180418",
  "filing_date": "20171222",
  "main_ipcr_label": "G06N504",
  "abstract": "A method and apparatus for certification of facts introduces a certifier and a fact certificate into the fact-exchange cycle that enables parties to exchange trustworthy facts. Certification is provided to a fact presenter during the first part of the fact-exchange cycle, and verification is provided to the fact receiver during the last part of the cycle. To request a certification, a fact presenter presents the Certifier with a fact. In return, the certifier issues a fact certificate, after which the fact presenter presents the fact certificate to the fact receiver instead of presenting the fact itself. The receiver inspects the received certificate in order to evaluate the fact's validity and trustworthiness. For some facts and notions of verification, the certificate is sufficient and its inspection does not require any communication. For others, the receiver requests a verification service from the Certifier in order to complete the verification.",
  "publication_number": "US20180121816A1-20180503",
  "summary": "<SOH> SUMMARY <EOH>A method and apparatus for certification of facts introduces a certifier and a fact certificate into the fact-exchange cycle that enables parties to exchange trustworthy facts. Certification is provided to a fact presenter during the first part of the fact-exchange cycle, and verification is provided to the fact receiver during the last part of the cycle. To request a certification, a fact presenter presents the fact certifier with a fact. In return, the fact certifier issues a fact certificate, after which the fact presenter presents the fact certificate to the fact receiver instead of presenting the fact itself. The fact receiver inspects the received fact certificate in order to evaluate the fact's validity and trustworthiness. For some facts and notions of verification, the fact certificate is sufficient and its inspection does not require any communication. For others, the fact receiver requests a verification service from the fact certifier in order to complete the verification.",
  "ipcr_labels": [
    "G06N504",
    "G06Q4002",
    "G06Q5018",
    "G06Q4008",
    "G06Q5026",
    "G06Q1010",
    "G06N502"
  ],
  "inventor_list": [
    {
      "inventor_name_last": "DONOHO",
      "inventor_name_first": "David Leigh",
      "inventor_city": "Stanford",
      "inventor_state": "CA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "GAVISH",
      "inventor_name_first": "Matan",
      "inventor_city": "Stanford",
      "inventor_state": "CA",
      "inventor_country": "US"
    }
  ],
  "title": "METHOD AND APPARATUS FOR CERTIFICATION OF FACTS",
  "decision": "PENDING",
  "_processing_info": {
    "original_size": 155175,
    "optimized_size": 2734,
    "reduction_percent": 98.24
  }
}