{
  "patent_number": "nan",
  "application_number": "15856819",
  "date_published": "20180503",
  "date_produced": "20180418",
  "filing_date": "20171228",
  "main_ipcr_label": "G06N9900",
  "abstract": "Technologies are generally described for systems, devices and methods relating to a machine learning environment. In some examples, a processor may identify a training distribution of a training data. The processor may identify information about a test distribution of a test data. The processor may identify a coordinate of the training data and the test data. The processor may determine, for the coordinate, differences between the test distribution and the training distribution. The processor may determine weights based on the differences. The weights may be adapted to cause the training distribution to conform to the test distribution when the weights are applied to the training distribution.",
  "publication_number": "US20180121832A1-20180503",
  "summary": "<SOH> SUMMARY <EOH>In some examples, methods in a machine learning environments are generally described. In various examples, the methods may include identifying, by a processor, a training distribution of a training data. In still other examples, the methods may also include identifying, by the processor, information about a test distribution of a test data. In other examples, the methods may also include identifying, by the processor, a coordinate of the training data and the test data. In yet other examples, the methods may also include determining, by the processor, for the coordinate, differences between the test distribution and the training distribution. In other examples, the methods may also include determining, by the processor, weights based on the differences. In some examples, the weights may be adapted to cause the training distribution to conform to the test distribution when the weights are applied to the training distribution. In some examples, methods to determine a weight for training data are generally described. The methods may include, by a processor, identifying first points of the training data. In various other examples, the methods may also include, by the processor, identifying information about a test data. The test data may include second points. In other examples, the methods may also include, by the processor, identifying a coordinate of the first and second points. In some examples, the coordinate may include a range of values in a coordinate space. In various other examples, the methods may also include, by the processor, dividing the range of values in the coordinate space into bins. In some examples, respective bins may define subsets of the range of values. In other examples, the methods may also include, by the processor, determining a first frequency. In examples, the first frequency may relate to a first percentage of the first points being located within a particular bin. In various examples, the methods may also include, by t...",
  "ipcr_labels": [
    "G06N9900",
    "G06K962"
  ],
  "inventor_list": [
    {
      "inventor_name_last": "Abu-Mostafa",
      "inventor_name_first": "Yaser Said",
      "inventor_city": "Pasadena",
      "inventor_state": "CA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Gonzalez",
      "inventor_name_first": "Carlos Roberto",
      "inventor_city": "Rancho Cucamonga",
      "inventor_state": "CA",
      "inventor_country": "US"
    }
  ],
  "title": "WEIGHT GENERATION IN MACHINE LEARNING",
  "decision": "PENDING",
  "_processing_info": {
    "original_size": 56378,
    "optimized_size": 3412,
    "reduction_percent": 93.95
  }
}