{
  "patent_number": "nan",
  "application_number": "15851645",
  "date_published": "20180503",
  "date_produced": "20180418",
  "filing_date": "20171221",
  "main_ipcr_label": "G06N9900",
  "abstract": "Systems and methods for analyzing documents are provided herein. A plurality of documents and user input are received via a computing device. The user input includes hard coding of a subset of the plurality of documents, based on an identified subject or category. Instructions stored in memory are executed by a processor to generate an initial control set, analyze the initial control set to determine at least one seed set parameter, automatically code a first portion of the plurality of documents based on the initial control set and the seed set parameter associated with the identified subject or category, analyze the first portion of the plurality of documents by applying an adaptive identification cycle, and retrieve a second portion of the plurality of documents based on a result of the application of the adaptive identification cycle test on the first portion of the plurality of documents.",
  "publication_number": "US20180121831A1-20180503",
  "summary": "<SOH> SUMMARY OF THE INVENTION <EOH>Systems, methods and media for analyzing documents are provided herein. One object of the present technology is to provide a higher quality and accuracy of document review. Such a higher quality of review of documents may be measurable. Another object of the present technology is to reduce the time required to review documents, particularly in the case of a voluminous amount of documents. According to various embodiments, the present technology limits the manual “human-only review” to a subset of documents, and this subset of manually reviewed documents are reviewed more quickly. In other words, the “human-only review” documents are reduced to a small number of documents, while the majority of the documents are analyzed through automated predictive coding of documents through computer processing and machine learning. A further object of the present technology is to reduce the costs associated with document review, as the present technology requires fewer human reviewers to participate in the document review. Yet a further object is to identify and prioritize documents in early stages of document review, such that early issue resolution may be within reach. These and other objects of the present technology are achieved in an exemplary method of analyzing documents. A plurality of documents is received via a computing device. User input is received from the computing device. The user input includes hard coding of a subset of the plurality of documents. The hard coding is based on an identified subject or category. Instructions stored in memory are executed by a processor to generate a coded seed set (called the “initial control set”) based on the subset of the plurality of documents and the received user input on the subset, analyze the initial control set to determine at least one seed set parameter associated with the identified subject or category. Further instructions stored in memory are executed by the processor to automatical...",
  "ipcr_labels": [
    "G06N9900",
    "G06N700"
  ],
  "inventor_list": [
    {
      "inventor_name_last": "Puzicha",
      "inventor_name_first": "Jan",
      "inventor_city": "Bonn",
      "inventor_state": "",
      "inventor_country": "DE"
    },
    {
      "inventor_name_last": "Vranas",
      "inventor_name_first": "Steve",
      "inventor_city": "Ashburn",
      "inventor_state": "VA",
      "inventor_country": "US"
    }
  ],
  "title": "SYSTEMS AND METHODS FOR PREDICTIVE CODING",
  "decision": "PENDING",
  "_processing_info": {
    "original_size": 77215,
    "optimized_size": 3613,
    "reduction_percent": 95.32
  }
}