{
  "patent_number": "nan",
  "application_number": "15851294",
  "date_published": "20180426",
  "date_produced": "20180411",
  "filing_date": "20171221",
  "main_ipcr_label": "G06N312",
  "abstract": "Roughly described, a problem solving platform distributes the solving of the problem over a evolvable individuals, each of which also evolves its own pool of actors. The actors have the ability to contribute collaboratively to a solution at the level of the individual, instead of each actor being a candidate for the full solution. Populations evolve both at the level of the individual and at the level of actors within an individual. In an embodiment, an individual defines parameters according to which its population of actors can evolve. The individual is fixed prior to deployment to a production environment, but its actors can continue to evolve and adapt while operating in the production environment. Thus a goal of the evolutionary process at the level of individuals is to find populations of actors that can sustain themselves and survive, solving a dynamic problem for a given domain as a consequence.",
  "publication_number": "US20180114118A1-20180426",
  "summary": "<SOH> SUMMARY <EOH>Roughly described, aspects of the invention address the above problem and others by providing a problem solving platform that distributes the solving of the problem over a plurality of evolvable individuals, each of which has its own plurality of evolvable actors. The population of evolving actors have the ability to contribute collaboratively to the emergence of a solution at the level of the individual, as opposed to each actor being a candidate for the full solution. Populations evolve both at the level of the individual and at the level of actors within an individual. An evolved individual having its evolved population of actors is likely to solve similar problems effectively and consistently. In an embodiment, an individual defines a set of parameters according to which its population of actors can evolve. The individual is fixed prior to deployment to a production environment, but its actors can continue to evolve and adapt while operating in the production environment. Thus a goal of the evolutionary process at the level of individuals is to find populations of actors that can sustain themselves and survive, solving a dynamic problem for a given domain as a consequence. Ultimately, embodiments of the system can be used to generate machine learning systems that are tolerant to noise or changes in the problem domain. The above summary of the invention is provided in order to provide a basic understanding of some aspects of the invention. This summary is not intended to identify key or critical elements of the invention or to delineate the scope of the invention. Its sole purpose is to present some concepts of the invention in a simplified form as a prelude to the more detailed description that is presented later. Particular aspects of the invention are described in the claims, specification and drawings.",
  "ipcr_labels": [
    "G06N312",
    "G06F1730",
    "G06F1518"
  ],
  "inventor_list": [
    {
      "inventor_name_last": "Hodjat",
      "inventor_name_first": "Babak",
      "inventor_city": "Dublin",
      "inventor_state": "CA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Shahrzad",
      "inventor_name_first": "Hormoz",
      "inventor_city": "Dublin",
      "inventor_state": "CA",
      "inventor_country": "US"
    }
  ],
  "title": "Alife Machine Learning System and Method",
  "decision": "PENDING",
  "_processing_info": {
    "original_size": 124223,
    "optimized_size": 3466,
    "reduction_percent": 97.21
  }
}