{
  "patent_number": "nan",
  "application_number": "15850674",
  "date_published": "20180503",
  "date_produced": "20180418",
  "filing_date": "20171221",
  "main_ipcr_label": "G06N502",
  "abstract": "A method for ingesting a plurality of content according to a statistical similarity of at least one portion of the ingested plurality of content into an information handling system capable of answering questions, whereby the ingested plurality of content is based on a received topic and ingesting the plurality of content comprises ingesting a plurality of documents associated with the received topic is provided. The method may include determining at least one similarity between each document based on a similarity criteria. The method may also include applying a statistical model to characterize the determined at least one similarity between each document. The method may further include creating at least one pair-wise link for each document. The method may additionally include mapping the created at least one pair-wise link. The method may include generating a plurality of rules for ingesting a plurality of additional content.",
  "publication_number": "US20180121812A1-20180503",
  "summary": "<SOH> SUMMARY <EOH>According to one embodiment, a method for ingesting a plurality of content according to a statistical similarity of at least one portion of the ingested plurality of content into an information handling system capable of answering questions, whereby the ingested plurality of content is based on a received topic and ingesting the plurality of content comprises ingesting a plurality of documents associated with the received topic is provided. The method may include determining at least one similarity between each document within the ingested plurality of documents based on a similarity criteria. The method may additionally include applying a statistical model to characterize the determined at least one similarity between each document within the ingested plurality of documents. The method may include creating at least one pair-wise link between a word, an image, or a plurality of other media for each document within the ingested plurality of documents based on the applied statistical model. The method may also include mapping the created at least one pair-wise link for a first document within the ingested plurality of documents to at least one other document within the ingested plurality of documents based on a context of the word, the image, or the plurality of other media. The method may include generating a plurality of rules for ingesting a plurality of additional content based on the mapping of the created at least one pair-wise link. According to another embodiment, a computer system for ingesting a plurality of content according to a statistical similarity of at least one portion of the ingested plurality of content into an information handling system capable of answering questions, whereby the ingested plurality of content is based on a received topic and ingesting the plurality of content comprises ingesting a plurality of documents associated with the received topic is provided. The computer system may include one or more processors, one o...",
  "ipcr_labels": [
    "G06N502",
    "G06F1721"
  ],
  "inventor_list": [
    {
      "inventor_name_last": "Bastide",
      "inventor_name_first": "Paul R.",
      "inventor_city": "Boxford",
      "inventor_state": "MA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Broomhall",
      "inventor_name_first": "Matthew E.",
      "inventor_city": "Goffstown",
      "inventor_state": "NH",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Loredo",
      "inventor_name_first": "Robert E.",
      "inventor_city": "North Miami Beach",
      "inventor_state": "FL",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Schultz",
      "inventor_name_first": "Dale M.",
      "inventor_city": "Limerick",
      "inventor_state": "ME",
      "inventor_country": "US"
    }
  ],
  "title": "ENHANCEMENT OF MASSIVE DATA INGESTION BY SIMILARITY LINKAGE OF DOCUMENTS",
  "decision": "PENDING",
  "_processing_info": {
    "original_size": 67043,
    "optimized_size": 3971,
    "reduction_percent": 94.08
  }
}