{
  "patent_number": "nan",
  "application_number": "15851769",
  "date_published": "20180510",
  "date_produced": "20180425",
  "filing_date": "20171222",
  "main_ipcr_label": "G06N300",
  "abstract": "A computer program product and method provides a question and answer service that accepts an initial first question from a user and analyzes the question by a first generation subsystem to generate a first answer. A second generation subsystem of the question and answer service is configured to generate a second question based at least in-part on keywords from the first question and the first answer.",
  "publication_number": "US20180129928A1-20180510",
  "summary": "<SOH> SUMMARY <EOH>In accordance with an embodiment, a computer implemented method of operating a question-answering system includes inputting a first question into a user interface by a user. The first question may then be analyzed by a computer device utilizing a corpus of data and outputting a computer generated candidate second question or questions based at least in-part on the first question. By providing a semantically similar question, the present disclosure may assist users to explore an unfamiliar domain and/or ask question with less time and effort than that required for more traditional systems. A computer program product according to another embodiment provides a question-answering service. The service is facilitated by a first generation subsystem of the computer program product that is configured to receive a first question from a user and computer and to generate at least one first answer to the question. A second generation subsystem is configured to generate a second candidate question based at least in-part on keywords from the first question and the content of the first answer or answers.",
  "ipcr_labels": [
    "G06N300",
    "G06N9900",
    "G06F1730"
  ],
  "inventor_list": [
    {
      "inventor_name_last": "Alupului",
      "inventor_name_first": "Mariana",
      "inventor_city": "Durham",
      "inventor_state": "NC",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Ames",
      "inventor_name_first": "Andrea L.",
      "inventor_city": "Redwood City",
      "inventor_state": "CA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Collopy",
      "inventor_name_first": "Beth Anne M.",
      "inventor_city": "Amesbury",
      "inventor_state": "MA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Pesot",
      "inventor_name_first": "Joseph F.",
      "inventor_city": "Cary",
      "inventor_state": "NC",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Pierce",
      "inventor_name_first": "Robert",
      "inventor_city": "Alfred",
      "inventor_state": "ME",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Steinmetz",
      "inventor_name_first": "David C.",
      "inventor_city": "Bothell",
      "inventor_state": "WA",
      "inventor_country": "US"
    }
  ],
  "title": "QUESTION-ANSWERING SYSTEM",
  "decision": "PENDING",
  "_processing_info": {
    "original_size": 40488,
    "optimized_size": 2804,
    "reduction_percent": 93.07
  }
}