{
  "filing_date": "20180112",
  "publication_number": "US20180137423A1-20180517",
  "decision": "PENDING",
  "summary": "<SOH> SUMMARY <EOH>According to one embodiment of the present invention, a method for optimizing predictive model analysis is provided, the method comprising creating, by a model decomposer, one or more model templates; decomposing, by the model decomposer, a predictive model, wherein model information is extracted from the predictive model; storing, by the model decomposer, the model information in the one or more model templates; creating, by the model decomposer, a plurality of sub-models, associated with the predictive model, using the stored model information; sending, by the model decomposer, the plurality of sub-models to a scoring engine; receiving, by the model decomposer, results based on the plurality of sub-models from the scoring engine; and generating predictions based on combining the results received from the scoring engine.",
  "title": "PREDICTIVE ANALYSIS WITH LARGE PREDICTIVE MODELS",
  "ipcr_labels": [
    "G06N502"
  ],
  "abstract": "An approach to optimizing predictive model analysis, comprising creating one or more model templates, decomposing a predictive model, wherein model information is extracted from the predictive model, storing the model information in the one or more model templates, creating a plurality of sub-models, associated with the predictive model, using the stored model information, sending the plurality of sub-models to a scoring engine, receiving results based on the plurality of sub-models from the scoring engine and generating predictions based on combining the results received from the scoring engine. The generated predictions can be sent to one or more analytic applications for further processing.",
  "patent_number": "nan",
  "application_number": "15869546",
  "date_published": "20180517",
  "main_ipcr_label": "G06N502",
  "date_produced": "20180503",
  "inventor_list": [
    {
      "inventor_name_last": "Shao",
      "inventor_name_first": "Yi",
      "inventor_city": "Xi'an",
      "inventor_state": "",
      "inventor_country": "CN"
    },
    {
      "inventor_name_last": "Tian",
      "inventor_name_first": "Lei",
      "inventor_city": "Xi'an",
      "inventor_state": "",
      "inventor_country": "CN"
    },
    {
      "inventor_name_last": "Xu",
      "inventor_name_first": "Jing",
      "inventor_city": "Xian",
      "inventor_state": "",
      "inventor_country": "CN"
    },
    {
      "inventor_name_last": "Xue",
      "inventor_name_first": "Peng",
      "inventor_city": "Xi'an",
      "inventor_state": "",
      "inventor_country": "CN"
    }
  ],
  "_processing_info": {
    "original_size": 39016,
    "optimized_size": 2481,
    "reduction_percent": 93.64
  }
}