{
  "filing_date": "20180105",
  "publication_number": "US20180144237A1-20180524",
  "decision": "PENDING",
  "summary": "<SOH> SUMMARY OF THE INVENTION <EOH>In order to solve the problems and shortcomings of the prior art, an apparatus is disclosed for 3D virtual try-on of apparel on an avatar. According to one preferred embodiment, the system for 3D virtual try-on of apparel on an avatar is disclosed. According to one preferred embodiment, a method of fitting a garment on a person's body online comprises receiving specifications of a garment, receiving body specifications of one or more fit models, receiving one or more grade rules, receiving one or more fabric specifications, and receiving specifications of a consumer's body. The value of one or more fabric constants are determined according to the received one or more fabric specifications. One or more virtual garments in graded sizes are created and stored in a database based on the received garment specifications and fabric constants. Moreover, one or more graded virtual fit models are created and stored in a database based on the received specifications of the fit model. Each virtual garment is draped on the related virtual fit model to create a fit-model drape. An avatar is received or created to represent a consumer's body shape. A selected one of the virtual garments is determined that represents a closest size for fitting on the avatar. The selected virtual garment is then re-draped on the consumer avatar. The consumer drape can then be viewed in 3D on the web or in a software application on any computing device. Data regarding the result of the virtual try-on process can then be utilized by the retailer, the consumer, and/or a third party. This virtual try-on data can be in the form of visual data or quantitative data that can be interpreted to determine the goodness of a garment's fit. Specifically, consumers can be presented with such data to assess the appropriate size and the goodness of a garment's fit, retailers can utilize such data for assessing how their garments are performing on their customer's bodies, and final...",
  "title": "SYSTEM AND METHOD FOR BODY SCANNING AND AVATAR CREATION",
  "ipcr_labels": [
    "G06N300",
    "G06T1900",
    "G06K900"
  ],
  "abstract": "A method and apparatus is disclosed for scanning a body. The system comprises a processor and a range camera capable of capturing at least a first set of depth images of the body rotated to 0 degrees and at least a second set of depth images of the body rotated to x degrees, wherein x is >0 degrees, and x<360 degrees. A first set of computer instructions executable on the processor is capable of calculating a first set of three dimensional points from the first set of depth images and a second set of three dimensional points from the second set of depth images. A second set of computer instructions executable on the processor is capable of rotating and translating the first and second set of three dimensional points into a final set of three dimensional points. A third set of computer instructions executable on the processor is capable of creating a three dimensional mesh from the final set of three dimensional points.",
  "patent_number": "nan",
  "application_number": "15863848",
  "date_published": "20180524",
  "main_ipcr_label": "G06N300",
  "date_produced": "20180509",
  "inventor_list": [
    {
      "inventor_name_last": "Sareen",
      "inventor_name_first": "Raj",
      "inventor_city": "Rolling Hills",
      "inventor_state": "CA",
      "inventor_country": "US"
    }
  ],
  "_processing_info": {
    "original_size": 130289,
    "optimized_size": 3499,
    "reduction_percent": 97.31
  }
}