{
  "filing_date": "20180109",
  "publication_number": "US20180129943A1-20180510",
  "decision": "PENDING",
  "summary": "<SOH> SUMMARY OF THE INVENTION <EOH>Accordingly, the inventor has conceived and reduced to practice, in a preferred embodiment of the invention, a method for proactive data gathering and user profile generation using deep analysis for a rapid onboarding process that adapts to a user in an intuitive, personal, and natural manner. The invention comprises a virtual assistant AI system that may be connected to a wide variety of user accounts such as financial accounts, social media, news, shopping, utilities and service providers, travel accounts, and other account types. The AI then continually monitors connected accounts for changes, analyzes changes when they occur and identifies any relationships or interactions between accounts and potential or actual implications of changes, such as if a news article mentions events affecting a company in a user's investment portfolio. The AI then generates proactive notifications and provides them to the user, such as notification alerts, reminders, suggestions, or prompts for action such as notifying a user of the news event that may impact their investment, and asking if they wish to take action on that company's stock. According to a preferred embodiment of the invention, a system for proactive data gathering and user profile generation using deep analysis for a rapid onboarding process, comprising: a virtual assistant platform comprising a memory, a processor, a network interface, and a plurality of programming instructions operating in the memory and on the processor, the programming instructions configured to: receive a first data message via the network interface; create a persistent user profile that is uniquely identifiable to a particular user, the persistent user profile being based at least in part on the first data message; produce a plurality of prompts for user interaction, the prompts being based at least in part on the persistent user profile; transmit at least a portion of the plurality of prompts via the networ...",
  "title": "PROACTIVE DATA GATHERING AND USER PROFILE GENERATION USING DEEP ANALYSIS FOR A RAPID ONBOARDING PROCESS",
  "ipcr_labels": [
    "G06N502"
  ],
  "abstract": "A virtual assistant platform for providing real-time financial advice based on a user's financial status online footprint, behavioral proclivities with regard to finances and investing as well as market conditions, comprising a virtual assistant application that creates and updates a user profile using interactive prompts to gather information during an onboarding process, and produces a final, highly individualized, user profile for use by the virtual assistant platform for providing real-time financial advice based on a user's profile, online footprint as well as market conditions.",
  "patent_number": "nan",
  "application_number": "15865551",
  "date_published": "20180510",
  "main_ipcr_label": "G06N502",
  "date_produced": "20180425",
  "inventor_list": [
    {
      "inventor_name_last": "La Placa",
      "inventor_name_first": "David J.",
      "inventor_city": "San Francisco",
      "inventor_state": "CA",
      "inventor_country": "US"
    }
  ],
  "_processing_info": {
    "original_size": 86630,
    "optimized_size": 3189,
    "reduction_percent": 96.32
  }
}