{
  "filing_date": "20180115",
  "publication_number": "US20180137416A1-20180517",
  "decision": "PENDING",
  "summary": "<SOH> BRIEF DESCRIPTION OF DRAWINGS <EOH>FIG. 1 illustrates an example of system having a state machine engine, according to various embodiments of the invention. FIG. 2 illustrates an example of an FSM lattice of the state machine engine of FIG. 1 , according to various embodiments of the invention. FIG. 3 illustrates an example of a block of the FSM lattice of FIG. 2 , according to various embodiments of the invention. FIG. 4 illustrates an example of a row of the block of FIG. 3 , according to various embodiments of the invention. FIG. 5 illustrates an example of a Group of Two of the row of FIG. 4 , according to various embodiments of the invention. FIG. 6 illustrates an example of a finite state machine graph, according to various embodiments of the invention. FIG. 7 illustrates an example of two-level hierarchy implemented with FSM lattices, according to various embodiments of the invention. FIG. 8 illustrates an example of a method for a compiler to convert source code into a binary file for programming of the FSM lattice of FIG. 2 , according to various embodiments of the invention. FIG. 9 illustrates a state machine engine, according to various embodiments of the invention. FIG. 10 illustrates an illustrates a second example of a row of the block of FIG. 3 , according to various embodiments of the invention. FIG. 11 illustrates an example of the match element of FIG. 10 , according to various embodiments of the invention. FIG. 12 illustrates a truth table corresponding to a multiplexer of FIG. 11 , according to various embodiments of the invention. detailed-description description=\"Detailed Description\" end=\"lead\"?",
  "title": "METHODS AND SYSTEMS FOR DATA ANALYSIS IN A STATE MACHINE",
  "ipcr_labels": [
    "G06N308",
    "G06N3063",
    "G06K900"
  ],
  "abstract": "A device includes a match element that includes a first data input configured to receive a first result, wherein the first result is of an analysis performed on at least a portion of a data stream by an element of a state machine. The match element also includes a second data input configured to receive a second result, wherein the second result is of an analysis performed on at least a portion of the data stream by another element of the state machine. The match element further includes an output configured to selectively provide the first result or the second result.",
  "patent_number": "nan",
  "application_number": "15871660",
  "date_published": "20180517",
  "main_ipcr_label": "G06N308",
  "date_produced": "20180503",
  "inventor_list": [
    {
      "inventor_name_last": "Brown",
      "inventor_name_first": "David R.",
      "inventor_city": "Lucas",
      "inventor_state": "TX",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Noyes",
      "inventor_name_first": "Harold B",
      "inventor_city": "Boise",
      "inventor_state": "ID",
      "inventor_country": "US"
    }
  ],
  "_processing_info": {
    "original_size": 81014,
    "optimized_size": 2935,
    "reduction_percent": 96.38
  }
}