{
  "filing_date": "20180209",
  "publication_number": "US20180181872A1-20180628",
  "decision": "PENDING",
  "summary": "<SOH> BRIEF DESCRIPTION OF THE DRAWINGS <EOH>The subject matter regarded as the invention is particularly pointed out and distinctly claimed in the concluding portion of the specification. The invention, however, both as to organization and method of operation, together with objects, features, and advantages thereof, may best be understood by reference to the following detailed description when read with the accompanying drawings in which: FIG. 1 is an overview of network diagram depicting multiple city clouds, various information sources linked to a knowledge cloud, according to an embodiment; FIG. 2 is network diagram of a city cloud and its various functionalities and linked resources and clients, according to an embodiment; FIG. 3 is network diagram of a knowledge cloud and its various functionalities and linked resources and clients, according to an embodiment; FIG. 4 is a Data-Information-Knowledge-Wisdom (DIKW) pyramid depicting the levels of information that will be dealt in the different clouds, according to an embodiment; FIG. 5 is a high-level workflow of a Knowledge Cloud (KC), according to an embodiment; FIG. 6 is a schematic view of an expert system employed as a part of a KC, according to an embodiment. FIG. 7 is a cloud system view of a knowledge cloud depicting “Anything as a Service” (XaaS) layers, according to an embodiment; FIG. 8 is a stacked system view depicting infrastructural elements of a KC, according to an embodiment; and FIG. 9 is a layered view depicting baseline high-level architecture of a KC, according to an embodiment; detailed-description description=\"Detailed Description\" end=\"lead\"? It will be appreciated that for clarity, elements may not be to scale or may be repeated among the figures to indicate corresponding or analogous elements.",
  "title": "KNOWLEDGE MANAGEMENT SYSTEM",
  "ipcr_labels": [
    "G06N504"
  ],
  "abstract": "A knowledge management system configured to integrate information and to distill non-obvious knowledge from data by applying various engines operative in accordance with available information knowledge.",
  "patent_number": "nan",
  "application_number": "15892767",
  "date_published": "20180628",
  "main_ipcr_label": "G06N504",
  "date_produced": "20180613",
  "inventor_list": [
    {
      "inventor_name_last": "Lenz",
      "inventor_name_first": "Gdalia",
      "inventor_city": "Zikhron Ya'aqov",
      "inventor_state": "",
      "inventor_country": "IL"
    },
    {
      "inventor_name_last": "Adziashvili",
      "inventor_name_first": "Itzhak",
      "inventor_city": "Haifa",
      "inventor_state": "",
      "inventor_country": "IL"
    },
    {
      "inventor_name_last": "Apelbaum",
      "inventor_name_first": "Yaacov",
      "inventor_city": "Sayville",
      "inventor_state": "NY",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Ben Tzion",
      "inventor_name_first": "Ram",
      "inventor_city": "Ramat Hasharon",
      "inventor_state": "",
      "inventor_country": "IL"
    },
    {
      "inventor_name_last": "Kochavi",
      "inventor_name_first": "Matania Zvi",
      "inventor_city": "Old Westbury",
      "inventor_state": "NY",
      "inventor_country": "US"
    }
  ],
  "_processing_info": {
    "original_size": 33731,
    "optimized_size": 3132,
    "reduction_percent": 90.71
  }
}