{
  "filing_date": "20180228",
  "publication_number": "US20180189637A1-20180705",
  "decision": "PENDING",
  "summary": "<SOH> BRIEF SUMMARY <EOH>One embodiment of the invention provides a system for mapping a neural network onto a neurosynaptic substrate. The system comprises a metadata analysis unit for analyzing metadata information associated with one or more portions of an adjacency matrix representation of the neural network, and a mapping unit for mapping the one or more portions of the matrix representation onto the neurosynaptic substrate based on the metadata information. Another embodiment of the invention provides a method for mapping a neural network onto a neurosynaptic substrate. The method comprises analyzing metadata information associated with one or more portions of an adjacency matrix representation of the neural network, and mapping the one or more portions of the matrix representation onto the neurosynaptic substrate based on the metadata information. These and other features, aspects and advantages of the present invention will become understood with reference to the following description, appended claims and accompanying figures.",
  "title": "IMPLEMENTING A NEURAL NETWORK ALGORITHM ON A NEUROSYNAPTIC SUBSTRATE BASED ON METADATA ASSOCIATED WITH THE NEURAL NETWORK ALGORITHM",
  "ipcr_labels": [
    "G06N306",
    "G06N310",
    "G06N304",
    "G06N308"
  ],
  "abstract": "One embodiment of the invention provides a system for mapping a neural network onto a neurosynaptic substrate. The system comprises a metadata analysis unit for analyzing metadata information associated with one or more portions of an adjacency matrix representation of the neural network, and a mapping unit for mapping the one or more portions of the matrix representation onto the neurosynaptic substrate based on the metadata information.",
  "patent_number": "nan",
  "application_number": "15908415",
  "date_published": "20180705",
  "main_ipcr_label": "G06N306",
  "date_produced": "20180620",
  "inventor_list": [
    {
      "inventor_name_last": "Amir",
      "inventor_name_first": "Arnon",
      "inventor_city": "Saratoga",
      "inventor_state": "CA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Appuswamy",
      "inventor_name_first": "Rathinakumar",
      "inventor_city": "San Jose",
      "inventor_state": "CA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Datta",
      "inventor_name_first": "Pallab",
      "inventor_city": "San Jose",
      "inventor_state": "CA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Flickner",
      "inventor_name_first": "Myron D.",
      "inventor_city": "San Jose",
      "inventor_state": "CA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Merolla",
      "inventor_name_first": "Paul A.",
      "inventor_city": "Palo Alto",
      "inventor_state": "CA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Modha",
      "inventor_name_first": "Dharmendra S.",
      "inventor_city": "San Jose",
      "inventor_state": "CA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Shaw",
      "inventor_name_first": "Benjamin G.",
      "inventor_city": "San Francisco",
      "inventor_state": "CA",
      "inventor_country": "US"
    }
  ],
  "_processing_info": {
    "original_size": 79304,
    "optimized_size": 3042,
    "reduction_percent": 96.16
  }
}