{
  "filing_date": "20180222",
  "publication_number": "US20180189680A1-20180705",
  "decision": "PENDING",
  "summary": "<SOH> SUMMARY <EOH>Various embodiments involve software development platforms for performing one or more of testing, modifying, and deploying decision algorithms. For example, a computing system provides software development interface to a client device. The system sets, based on an input from the client device via the interface, a decision engine to a test mode that causes the decision engine to operate on test data stored in a first database and that prevents the decision engine from applying operations from the client device to production data stored in a second database. The system also configures the decision engine in the test mode to execute a different decision algorithms on the test data. The system also sets, based on another input via the interface, the decision engine to a deployment mode that causes the decision engine to operate on the production data. The system configures the decision engine in the deployment mode to execute one or more of the tested decision algorithms. This summary is not intended to identify key or essential features of the claimed subject matter, nor is it intended to be used in isolation to determine the scope of the claimed subject matter. The subject matter should be understood by reference to appropriate portions of the entire specification, any or all drawings, and each claim. The foregoing, together with other features and examples, will become more apparent upon referring to the following specification, claims, and accompanying drawings.",
  "title": "SOFTWARE DEVELOPMENT PLATFORM FOR TESTING AND MODIFYING DECISION ALGORITHMS",
  "ipcr_labels": [
    "G06N9900",
    "G06Q4002",
    "G06Q2010",
    "G06Q4000"
  ],
  "abstract": "This disclosure involves development and deployment platforms for decision algorithms. For example, a computing system provides software development interface to a client device. The system sets, based on an input from the client device via the interface, a decision engine to a test mode that causes the decision engine to operate on test data stored in a first database and that prevents the decision engine from applying operations from the client device to production data stored in a second database. The system also configures the decision engine in the test mode to execute a different decision algorithms on the test data. The system also sets, based on another input via the interface, the decision engine to a deployment mode that causes the decision engine to operate on the production data. The system configures the decision engine in the deployment mode to execute one or more of the tested decision algorithms.",
  "patent_number": "nan",
  "application_number": "15903001",
  "date_published": "20180705",
  "main_ipcr_label": "G06N9900",
  "date_produced": "20180620",
  "inventor_list": [
    {
      "inventor_name_last": "Gupta",
      "inventor_name_first": "Sandeep",
      "inventor_city": "Alpharetta",
      "inventor_state": "GA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Hall",
      "inventor_name_first": "Christian",
      "inventor_city": "Canton",
      "inventor_state": "GA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Reid",
      "inventor_name_first": "James",
      "inventor_city": "Alpharetta",
      "inventor_state": "GA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Lu",
      "inventor_name_first": "Shen",
      "inventor_city": "Duluth",
      "inventor_state": "GA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Horton",
      "inventor_name_first": "Dennis",
      "inventor_city": "Buford",
      "inventor_state": "GA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Grice",
      "inventor_name_first": "Lee",
      "inventor_city": "Cumming",
      "inventor_state": "GA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Dixon",
      "inventor_name_first": "Thresa",
      "inventor_city": "Canton",
      "inventor_state": "GA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Garten",
      "inventor_name_first": "Scott",
      "inventor_city": "Canton",
      "inventor_state": "GA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Reddy",
      "inventor_name_first": "Sudhakar",
      "inventor_city": "Suwanee",
      "inventor_state": "GA",
      "inventor_country": "US"
    }
  ],
  "_processing_info": {
    "original_size": 150281,
    "optimized_size": 4174,
    "reduction_percent": 97.22
  }
}