{
  "filing_date": "20180302",
  "publication_number": "US20180189663A1-20180705",
  "decision": "PENDING",
  "summary": "<SOH> SUMMARY <EOH>In one illustrative embodiment, a method, in a data processing system, is provided for exploring knowledge. The method comprises receiving, by the data processing system, a set of known facts. The method further comprises traversing, by the data processing system, paths in an ontology for a domain of knowledge from known facts in the set of known facts to one or more hypotheses. The ontology includes a plurality of entity types and a plurality of relationships between the entity types. The method further comprises presenting, by the data processing system, the one or more hypotheses. In other illustrative embodiments, a computer program product comprising a computer useable or readable medium having a computer readable program is provided. The computer readable program, when executed on a computing device, causes the computing device to perform various ones of, and combinations of, the operations outlined above with regard to the method illustrative embodiment. In yet another illustrative embodiment, a system/apparatus is provided. The system/apparatus may comprise one or more processors and a memory coupled to the one or more processors. The memory may comprise instructions which, when executed by the one or more processors, cause the one or more processors to perform various ones of, and combinations of, the operations outlined above with regard to the method illustrative embodiment. These and other features and advantages of the present invention will be described in, or will become apparent to those of ordinary skill in the art in view of, the following detailed description of the example embodiments of the present invention.",
  "title": "Leveraging an External Ontology for Graph Expansion in Inference Systems",
  "ipcr_labels": [
    "G06N504"
  ],
  "abstract": "A mechanism is provided in a data processing system for exploring knowledge. The mechanism receives a set of known facts. The mechanism traverses paths in an ontology for a domain of knowledge from known facts in the set of known facts to one or more hypotheses. The ontology includes a plurality of entity types and a plurality of relationships between the entity types. The mechanism presents one or more hypotheses to a user.",
  "patent_number": "nan",
  "application_number": "15910266",
  "date_published": "20180705",
  "main_ipcr_label": "G06N504",
  "date_produced": "20180620",
  "inventor_list": [
    {
      "inventor_name_last": "Bagchi",
      "inventor_name_first": "Sugato",
      "inventor_city": "White Plains",
      "inventor_state": "NY",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Barborak",
      "inventor_name_first": "Michael A.",
      "inventor_city": "New York",
      "inventor_state": "NY",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Barker",
      "inventor_name_first": "Kenneth J.",
      "inventor_city": "Mahopac",
      "inventor_state": "NY",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Chu-Carroll",
      "inventor_name_first": "Jennifer",
      "inventor_city": "Dobbs Ferry",
      "inventor_state": "NY",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Fan",
      "inventor_name_first": "James J.",
      "inventor_city": "Mountain Lakes",
      "inventor_state": "NJ",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Prage",
      "inventor_name_first": "John M.",
      "inventor_city": "Pomona",
      "inventor_state": "NY",
      "inventor_country": "US"
    }
  ],
  "_processing_info": {
    "original_size": 63599,
    "optimized_size": 3416,
    "reduction_percent": 94.63
  }
}