{
  "inventor_list": [
    {
      "inventor_name_last": "Cheng",
      "inventor_name_first": "Jian",
      "inventor_city": "Beijing",
      "inventor_state": "",
      "inventor_country": "CN"
    },
    {
      "inventor_name_last": "Wu",
      "inventor_name_first": "Jiaxiang",
      "inventor_city": "Beijing",
      "inventor_state": "",
      "inventor_country": "CN"
    },
    {
      "inventor_name_last": "Leng",
      "inventor_name_first": "Cong",
      "inventor_city": "Beijing",
      "inventor_state": "",
      "inventor_country": "CN"
    },
    {
      "inventor_name_last": "Lu",
      "inventor_name_first": "Hanqing",
      "inventor_city": "Beijing",
      "inventor_state": "",
      "inventor_country": "CN"
    }
  ],
  "filing_date": "20180219",
  "ipcr_labels": [
    "G06N304",
    "G06N308",
    "G06F1716"
  ],
  "main_ipcr_label": "G06N304",
  "date_published": "20180830",
  "date_produced": "20180815",
  "publication_number": "US20180247180A1-20180830",
  "title": "DEEP CONVOLUTIONAL NEURAL NETWORK ACCELERATION AND COMPRESSION METHOD BASED ON PARAMETER QUANTIFICATION",
  "summary": "<SOH> SUMMARY <EOH>The acceleration and compression method for a deep convolutional neural network based on quantization of a parameter provided by the application may implement the acceleration and compression for the deep convolutional neural network. According to one aspect of the application, an acceleration and compression method for a deep convolutional neural network based on quantization of a parameter is provided, comprising: quantizing the parameter of the deep convolutional neural network to obtain a plurality of subcode books and the respective corresponding index values of the plurality of subcode books; acquiring an output feature map of the deep convolutional neural network according to the plurality of subcode book and the respective corresponding index values of the plurality of subcode book. The acceleration and compression method for the deep convolutional neural network based on quantization of the parameter provided by the embodiments of the application, a plurality of subcode books and the respective corresponding index values of the plurality of subcode books are obtained by quantizing the parameter of the deep convolutional neural network, the output feature map of the deep convolutional neural network is acquired according to the plurality of subcode books and the respective corresponding index values of the plurality of subcode books, so that the acceleration and compression for the deep convolutional neural network may be attained.",
  "application_number": "15753520",
  "abstract": "An acceleration and compression method for a deep convolutional neural network based on quantization of a parameter provided by the present application comprises: quantizing the parameter of the deep convolutional neural network to obtain a plurality of subcode books and respective corresponding index values of the plurality of subcode books; acquiring an output feature map of the deep convolutional neural network according to the plurality of subcode books and respective corresponding index values of the plurality of subcode books. The present application may implement the acceleration and compression for a deep convolutional neural network.",
  "decision": "PENDING",
  "patent_number": "nan",
  "_processing_info": {
    "original_size": 28627,
    "optimized_size": 3156,
    "reduction_percent": 88.98
  }
}