{
  "inventor_list": [
    {
      "inventor_name_last": "RABENORO",
      "inventor_name_first": "Tsirizo",
      "inventor_city": "Melun",
      "inventor_state": "",
      "inventor_country": "FR"
    },
    {
      "inventor_name_last": "LACAILLE",
      "inventor_name_first": "Jerome Henri Noel",
      "inventor_city": "Rosny Sous Bois",
      "inventor_state": "",
      "inventor_country": "FR"
    }
  ],
  "filing_date": "20180312",
  "ipcr_labels": [
    "G06N9900",
    "G05B2302",
    "B64F560"
  ],
  "main_ipcr_label": "G06N9900",
  "date_published": "20180906",
  "date_produced": "20180822",
  "publication_number": "US20180253664A1-20180906",
  "title": "DECISION AID SYSTEM AND METHOD FOR THE MAINTENANCE OF A MACHINE WITH LEARNING OF A DECISION MODEL SUPERVISED BY EXPERT OPINION",
  "summary": "<SOH> BRIEF DESCRIPTION OF THE DRAWINGS <EOH>Other aspects, purposes, advantages and characteristics of the invention will be better understood after reading the detailed description given below of preferred embodiments of the invention, given as non-limitative examples, with reference to the appended drawings on which: FIG. 1 diagrammatically illustrates a decision aid system for maintenance of a machine according to one possible embodiment of the invention; FIG. 2 diagrammatically illustrates a decision aid method for maintenance of a machine according to one possible embodiment of the invention. detailed-description description=\"Detailed Description\" end=\"lead\"?",
  "application_number": "15759394",
  "abstract": "A decision aid system, method and computer program product for the maintenance of a machine, including anomaly detection modules to determine health indicators on the basis of measurements of physical parameters of the machine, a calculator to compute an operating diagnosis on the basis of health indicators by applying a decision model capable of learning, and a man-machine interface to allow an expert to consult the health indicators and to declare a diagnosis. The calculator can compare an operational diagnosis computed based on a set of health indicators with at least one expert diagnosis declared after consultation of the set of health indicators, and can modify the decision model in the event of disagreement between the anomaly diagnosis computed and an expert diagnosis declared.",
  "decision": "PENDING",
  "patent_number": "nan",
  "_processing_info": {
    "original_size": 23260,
    "optimized_size": 2269,
    "reduction_percent": 90.25
  }
}