{
  "inventor_list": [
    {
      "inventor_name_last": "Bell",
      "inventor_name_first": "Cliff W.",
      "inventor_city": "Daly City",
      "inventor_state": "CA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Stoops",
      "inventor_name_first": "Daniel S.",
      "inventor_city": "Daly City",
      "inventor_state": "CA",
      "inventor_country": "US"
    }
  ],
  "filing_date": "20180108",
  "ipcr_labels": [
    "G06N502",
    "H04L1258",
    "G06Q3002",
    "G06F1730",
    "G06N504"
  ],
  "main_ipcr_label": "G06N502",
  "date_published": "20180510",
  "date_produced": "20180425",
  "publication_number": "US20180129942A1-20180510",
  "title": "SYSTEM AND METHOD FOR CONTROLLED KNOWLEDGE SYSTEM MANAGEMENT",
  "summary": "<SOH> SUMMARY <EOH>Aspects of embodiments of the present invention include a system and method for controlled knowledge system management. According to embodiments of the present invention, in a system for knowledge system management, the system includes: a processor; and a memory coupled to the processor, wherein the memory has stored thereon instructions that, when executed by the processor, cause the processor to: receive a question from a customer; determine whether to not the question satisfies a first criterion for obtaining an automated response to the question; in response to determining that the question satisfies the first criterion, transmit the question to a knowledge system for generating automated responses to questions; receive the automated response to the question from the knowledge system; determine whether or not the automated response satisfies a second criterion for providing the automated response to the customer; and in response to determining that the automated response satisfies the second criterion, transmit the automated response to an electronic device operated by the customer. The instructions may further cause the processor to determine contextual information regarding the question. The contextual information may include a topic trend of the question. The contextual information may include stored profile information regarding the customer. The instructions may further cause the processor to transmit the contextual information to the knowledge system along with the question. The first criterion may include a determination that the customer does not wish to terminate a customer relationship. The second criterion may include a confidence level for an accuracy of the automated response being above a predetermined threshold. The instructions may further cause the processor to route a communication link with the electronic device operated by the customer to an agent device in response to determining that the automated response does not satisf...",
  "application_number": "15865161",
  "abstract": "In a system for knowledge system management, the system includes: a processor; and a memory coupled to the processor, wherein the memory has stored thereon instructions that, when executed by the processor, cause the processor to: receive a question from a customer; determine whether to not the question satisfies a first criterion for obtaining an automated response to the question; in response to determining that the question satisfies the first criterion, transmit the question to a knowledge system for generating automated responses to questions; receive the automated response to the question from the knowledge system; determine whether or not the automated response satisfies a second criterion for providing the automated response to the customer; and in response to determining that the automated response satisfies the second criterion, transmit the automated response to an electronic device operated by the customer,",
  "decision": "PENDING",
  "patent_number": "nan",
  "_processing_info": {
    "original_size": 89939,
    "optimized_size": 3677,
    "reduction_percent": 95.91
  }
}