{
  "inventor_list": [
    {
      "inventor_name_last": "JIANG",
      "inventor_name_first": "Lei",
      "inventor_city": "Shenzhen",
      "inventor_state": "",
      "inventor_country": "CN"
    },
    {
      "inventor_name_last": "CHEN",
      "inventor_name_first": "Ge",
      "inventor_city": "Shenzhen",
      "inventor_state": "",
      "inventor_country": "CN"
    },
    {
      "inventor_name_last": "JIANG",
      "inventor_name_first": "Lieqiong",
      "inventor_city": "Shenzhen",
      "inventor_state": "",
      "inventor_country": "CN"
    },
    {
      "inventor_name_last": "LIU",
      "inventor_name_first": "Lei",
      "inventor_city": "Shenzhen",
      "inventor_state": "",
      "inventor_country": "CN"
    },
    {
      "inventor_name_last": "HUANG",
      "inventor_name_first": "Dongbo",
      "inventor_city": "Shenzhen",
      "inventor_state": "",
      "inventor_country": "CN"
    },
    {
      "inventor_name_last": "LI",
      "inventor_name_first": "Wenjie",
      "inventor_city": "Shenzhen",
      "inventor_state": "",
      "inventor_country": "CN"
    },
    {
      "inventor_name_last": "HUANG",
      "inventor_name_first": "Hao",
      "inventor_city": "Shenzhen",
      "inventor_state": "",
      "inventor_country": "CN"
    },
    {
      "inventor_name_last": "GU",
      "inventor_name_first": "Junqing",
      "inventor_city": "Shenzhen",
      "inventor_state": "",
      "inventor_country": "CN"
    },
    {
      "inventor_name_last": "HUANG",
      "inventor_name_first": "Wei",
      "inventor_city": "Shenzhen",
      "inventor_state": "",
      "inventor_country": "CN"
    },
    {
      "inventor_name_last": "JIANG",
      "inventor_name_first": "Zhi",
      "inventor_city": "Shenzhen",
      "inventor_state": "",
      "inventor_country": "CN"
    },
    {
      "inventor_name_last": "ZHANG",
      "inventor_name_first": "Hong",
      "inventor_city": "Shenzhen",
      "inventor_state": "",
      "inventor_country": "CN"
    },
    {
      "inventor_name_last": "XU",
      "inventor_name_first": "Lan",
      "inventor_city": "Shenzhen",
      "inventor_state": "",
      "inventor_country": "CN"
    },
    {
      "inventor_name_last": "ZHU",
      "inventor_name_first": "Siyu",
      "inventor_city": "Shenzhen",
      "inventor_state": "",
      "inventor_country": "CN"
    },
    {
      "inventor_name_last": "JIN",
      "inventor_name_first": "Wei",
      "inventor_city": "Shenzhen",
      "inventor_state": "",
      "inventor_country": "CN"
    }
  ],
  "filing_date": "20180105",
  "ipcr_labels": [
    "G06N700",
    "G06Q3002",
    "G06N502"
  ],
  "main_ipcr_label": "G06N700",
  "date_published": "20180510",
  "date_produced": "20180425",
  "publication_number": "US20180129964A1-20180510",
  "title": "METHOD, APPARATUS, AND COMPUTER STORAGE MEDIUM FOR PRE-SELECTING AND SORTING PUSH INFORMATION",
  "summary": "<SOH> SUMMARY <EOH>In view of the above, embodiments of the present invention provide a method and an apparatus for pre-selecting and sorting push information, and a computer storage medium, to at least partially resolve the problem of low accuracy of the pre-selection result. Technical solutions of the embodiments are implemented in the followings. One aspect of the embodiments of the present invention provides a method for pre-selecting push information, the method including: based on historical push data of push information including a plurality of push information items, determining, by a computing terminal including at least one processor, a feature for calculating a predicted value, and a weight corresponding to the feature; calculating, by a computing terminal, a standard deviation of the feature; determining, by a computing terminal, a fluctuation probability of the standard deviation; calculating, by a computing terminal, the predicted value based on the weight, the standard deviation, and the fluctuation probability, the standard deviation and the fluctuation probability being used for calculating a fluctuation value for correcting the weight; based on the predicted value, selecting, by a computing terminal, push information items satisfying a preset condition; and pushing, by a computing terminal, the selected push information items to a target user. Another aspect of the embodiments of the present invention provides an apparatus for pre-selecting push information. The apparatus includes a memory storing instructions; and a processor coupled to the memory. when executing the instructions, the processor is configured for: based on historical push data of push information including a plurality of push information items, determining a feature for calculating a predicted value, and a weight corresponding to the feature; calculating a standard deviation of the feature; determining a fluctuation probability of the standard deviation; calculating the predicted v...",
  "application_number": "15863584",
  "abstract": "Embodiments of the present invention disclose a push information pre-selecting method and apparatus. The method includes: based on historical push data of push information including a plurality of push information items, determining a feature for calculating a predicted value, and a weight corresponding to the feature; calculating a standard deviation of the feature; determining a fluctuation probability of the standard deviation; calculating the predicted value based on the weight, the standard deviation, and the fluctuation probability, the standard deviation and the fluctuation probability being used for calculating a fluctuation value for correcting the weight; based on the predicted value, selecting push information items satisfying a preset condition; and pushing the selected push information items to a target user.",
  "decision": "PENDING",
  "patent_number": "nan",
  "_processing_info": {
    "original_size": 72831,
    "optimized_size": 5250,
    "reduction_percent": 92.79
  }
}