{
  "inventor_list": [
    {
      "inventor_name_last": "Stolarz",
      "inventor_name_first": "Damien Phelan",
      "inventor_city": "Los Angeles",
      "inventor_state": "CA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Diaz",
      "inventor_name_first": "David Joseph",
      "inventor_city": "Valley Village",
      "inventor_state": "CA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Rossfeld",
      "inventor_name_first": "James",
      "inventor_city": "Torrance",
      "inventor_state": "CA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Raven",
      "inventor_name_first": "Scott",
      "inventor_city": "Modesto",
      "inventor_state": "CA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "O'Malley",
      "inventor_name_first": "Christopher",
      "inventor_city": "Los Angeles",
      "inventor_state": "CA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Kurpinski",
      "inventor_name_first": "Christopher",
      "inventor_city": "Washington",
      "inventor_state": "DC",
      "inventor_country": "US"
    }
  ],
  "filing_date": "20180126",
  "ipcr_labels": [
    "G06N700",
    "G06F301",
    "G06F314",
    "G06F1730",
    "G06F30482",
    "G06N504"
  ],
  "main_ipcr_label": "G06N700",
  "date_published": "20180614",
  "date_produced": "20180530",
  "publication_number": "US20180165593A1-20180614",
  "title": "MULTIPLE CHOICE DECISION ENGINE FOR AN ELECTRONIC PERSONAL ASSISTANT",
  "summary": "<SOH> SUMMARY OF THE INVENTION <EOH>It is an object of the present invention to provide an electronic personal assistant device that assists the user in recalling information and provides the user with timely reminders and alerts. It is another object of this invention to query and/or infer the user's behavior patterns, on a one-time or ongoing basis, so as to be able to predict desired or necessary actions and present them to the user for approval. It is another object of this invention to record the user's behavior and observe the user's current location and circumstances, and use the resulting data to adapt its operation to best suit the user's needs, predicting as reliably as possible which data the user will need at any given time and presenting it to the user. It is another object of this invention to ask the user dichotomous or multiple-choice questions-i.e., requiring yes/no or other dichotomous answers, or questions with a larger number of choices-to determine whether predictions made as to the user's needs are correct, and adapt future behavior based on the responses to such questions. It is another object of this invention to reduce decisions to simple, direct queries that can be presented to the user, briefly and with all relevant data, for decision, such that the user is asked to make a simple choice between two or more options. It is another object of this invention to allow remote storage and processing of the user's data, including execution of the adaptation and prediction algorithms used. It is another object of this invention to allow the remote storage and processing unit to initiate dichotomous queries of the user by communication via the user's electronic personal assistant device, and receive the responses to said queries from the device for storage and processing, via a phone call, computer network communication or other method. It is another object of this invention to allow the user to deliver commands to an electronic personal assistant de...",
  "application_number": "15881013",
  "abstract": "To simplify assisting a user in their day-to-day activities, a communication for performing an action may be sent to a user in the form of a query, where the query includes the most likely set of choices for the action arranged in a group of dichotomous (e.g., yes/no) or multiple choice answers. In this manner, a user may respond to the query by simply selecting one of the dichotomous or multiple choice answers. Historical logs of past actions, responses, queries, and so forth, may be used to predict future user actions or needs, and to formulate future queries for sending to the user. These techniques may be implemented, for example, through a remote coordination server or directly through a user's personal electronics device.",
  "decision": "PENDING",
  "patent_number": "nan",
  "_processing_info": {
    "original_size": 75300,
    "optimized_size": 4119,
    "reduction_percent": 94.53
  }
}