{
  "inventor_list": [
    {
      "inventor_name_last": "Yang",
      "inventor_name_first": "Lin",
      "inventor_city": "Milpitas",
      "inventor_state": "CA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Dong",
      "inventor_name_first": "Patrick Z.",
      "inventor_city": "San Jose",
      "inventor_state": "CA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Young",
      "inventor_name_first": "Charles Jin",
      "inventor_city": "Fremont",
      "inventor_state": "CA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Sun",
      "inventor_name_first": "Baohua",
      "inventor_city": "Fremont",
      "inventor_state": "CA",
      "inventor_country": "US"
    }
  ],
  "filing_date": "20180214",
  "ipcr_labels": [
    "G06N3063",
    "G06N304",
    "G06N308"
  ],
  "main_ipcr_label": "G06N3063",
  "date_published": "20180621",
  "date_produced": "20180608",
  "publication_number": "US20180174031A1-20180621",
  "title": "Implementation Of ResNet In A CNN Based Digital Integrated Circuit",
  "summary": "<SOH> SUMMARY <EOH>This section is for the purpose of summarizing some aspects of the invention and to briefly introduce some preferred embodiments. Simplifications or omissions in this section as well as in the abstract and the title herein may be made to avoid obscuring the purpose of the section. Such simplifications or omissions are not intended to limit the scope of the invention. Methods and systems for implementation of ResNet in a Cellular Neural Networks (CNN) based digital integrated circuit are disclosed. According to one aspect of the invention, a number of 3×3 filter kernels are used for replacing a combination of first and second original convolutional layers followed by a short path in deep learning network. In one embodiment, the replacement 3×3 filter kernels are implemented in a Cellular Neural Networks (CNN) based digital integrated circuit. According to another aspect of the invention, a digital integrated circuit contains cellular neural networks (CNN) processing engines operatively coupled to at least one input/output data bus. The CNN processing engines are connected in a loop with a clock-skew circuit. Each CNN processing engine includes a CNN processing block and first and second sets of memory buffers. CNN processing block is configured for simultaneously obtaining convolution operations results using input data and pre-trained filter coefficients of a plurality of convolutional layers. At least one set of three particular convolutional layers is further configured for performing equivalent operations of a combination of first and second original convolutional layers followed by a short path. The first set of memory buffers operatively couples to the CNN processing block for storing the input data. The second set of memory buffers operative couples to the CNN processing block for storing the pre-trained filter coefficients. Objects, features, and advantages of the invention will become apparent upon examining the following detailed descript...",
  "application_number": "15897143",
  "abstract": "Operations of a combination of first and second original convolutional layers followed by a short path are replaced by operations of a set of three particular convolutional layers. The first contains 2N×N filter kernels formed by placing said N×N filter kernels of the first original convolutional layer in left side and N×N filter kernels of an identity-value convolutional layer in right side. The second contains 2N×2N filter kernels formed by placing the N×N filter kernels of the second original convolutional layer in upper left corner, N×N filter kernels of an identity-value convolutional layer in lower right corner, and N×N filter kernels of two zero-value convolutional layers in either off-diagonal corner. The third contains N×2N of kernels formed by placing N×N filter kernels of a first identity-value convolutional layer and N×N filter kernels of a second identity-value convolutional layer in a vertical stack. Each filter kernel contains 3×3 filter coefficients.",
  "decision": "PENDING",
  "patent_number": "nan",
  "_processing_info": {
    "original_size": 55909,
    "optimized_size": 4056,
    "reduction_percent": 92.75
  }
}