{
  "inventor_list": [
    {
      "inventor_name_last": "Harrivel",
      "inventor_name_first": "Angela R.",
      "inventor_city": "Poquoson",
      "inventor_state": "VA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Kennedy",
      "inventor_name_first": "Kellie D.",
      "inventor_city": "Poquoson",
      "inventor_state": "VA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Stephens",
      "inventor_name_first": "Chad L.",
      "inventor_city": "Poquoson",
      "inventor_state": "VA",
      "inventor_country": "US"
    },
    {
      "inventor_name_last": "Pope",
      "inventor_name_first": "Alan T.",
      "inventor_city": "Poquoson",
      "inventor_state": "VA",
      "inventor_country": "US"
    }
  ],
  "filing_date": "20180228",
  "ipcr_labels": [
    "G06N9900",
    "G06N504",
    "A61B518"
  ],
  "main_ipcr_label": "G06N9900",
  "date_published": "20180705",
  "date_produced": "20180620",
  "publication_number": "US20180189681A1-20180705",
  "title": "System and Method for Human Operator and Machine Integration",
  "summary": "<SOH> BRIEF SUMMARY OF THE INVENTION <EOH>Aspects of the present disclosure are directed to devices, systems, and methods for optimized integration of a human operator with a machine for safe and efficient operation of an underlying system. Accordingly, aspects of the present disclosure are directed to systems, methods, and devices which evaluate and determine a cognitive state of an operator, and allocate tasks to either the machine and/or operator based on the cognitive state of the operator, among other factors. Aspects of the present disclosure are readily applicable to a variety of applications, such as any system, or device which utilizes or is otherwise affected by the cognitive state of an operator. Embodiments of the present disclosure are directed to a method of task allocation in a human operator-computer interface. The method includes sampling a set of multimodal signals indicative of psycho-physiological responses of the operator over a time period. The set of multimodal signals over the period of time are then associated with one or more cognitive states of the operator. A task is then allocated to either the operator or the computer based at least in part on the one or more cognitive states of the operator. In more specific embodiments, the step of associating the set of multimodal signals with cognitive states of the operator includes classifying the multimodal signals using state-classifiers to determine the cognitive states of the operator. In some embodiments, a system for task allocation in a human operator-computer interface is disclosed. The system comprises a set of sensors that provides a set of multimodal signals indicative of psycho-physiological responses of an operator in a first time period, and controller circuitry communicatively coupled to the set of sensors. The controller circuitry receives and analyzes the set of multimodal signals from the sensors, and classifies the multimodal signals using state-classifiers to determine the one ...",
  "application_number": "15908026",
  "abstract": "Aspects of the present disclosure are directed to devices, systems, and methods for optimized integration of a human operator with a machine for safe and efficient operation. Accordingly, aspects of the present disclosure are directed to systems, methods, and devices which evaluate and determine a cognitive state of an operator, and allocate tasks to either the machine and/or operator based on the cognitive state of the operator, among other factors.",
  "decision": "PENDING",
  "patent_number": "nan",
  "_processing_info": {
    "original_size": 64824,
    "optimized_size": 3474,
    "reduction_percent": 94.64
  }
}