{
  "inventor_list": [
    {
      "inventor_name_last": "Nasle",
      "inventor_name_first": "Adib",
      "inventor_city": "Poway",
      "inventor_state": "CA",
      "inventor_country": "US"
    }
  ],
  "filing_date": "20180226",
  "ipcr_labels": [
    "G06N504",
    "H04L2906",
    "G06N9900",
    "G06F1750"
  ],
  "main_ipcr_label": "G06N504",
  "date_published": "20180705",
  "date_produced": "20180620",
  "publication_number": "US20180189662A1-20180705",
  "title": "Systems and Methods for Automatic Real-Time Capacity Assessment for Use in Real-Time Power Analytics of an Electrical Power Distribution System",
  "summary": "<SOH> SUMMARY <EOH>Systems and methods for monitoring and predictive analysis of systems in real-time are disclosed. In one aspect, a system for conducting a real-time power capacity assessment of an electrical system is disclosed. The system includes a data acquisition component, a power analytics server and a client terminal. The data acquisition component is communicatively connected to a sensor configured to acquire real-time data output from the electrical system. The power analytics server is communicatively connected to the data acquisition component and is comprised of a virtual system modeling engine, an analytics engine and a machine learning engine. The virtual system modeling engine is configured to generate predicted data output for the electrical system utilizing a virtual system model of the electrical system. The analytics engine is configured to monitor the real-time data output and the predicted data output of the electrical system initiating a calibration and synchronization operation to update the virtual system model when a difference between the real-time data output and the predicted data output exceeds a threshold. The machine learning engine is configured to store and process patterns observed from the real-time data output and the predicted data output, forecasting power capacity of the electrical system subjected to a simulated contingency event. The client terminal is communicatively connected to the power analytics server and configured to allow for the selection of the contingency event and display a report of the forecasted power capacity. In another aspect, a method for conducting a real-time power capacity assessment of an electrical system subjected to a contingency event is disclosed. The virtual system model of the electrical system is updated in response to real-time data. The virtual system model includes real-time voltage stability model data for the components comprising the electrical system. The contingency to simulate is ch...",
  "application_number": "15904909",
  "abstract": "A system for conducting a real-time power capacity assessment of an electrical system is disclosed. The system includes a data acquisition component, a power analytics server and a client terminal. The data acquisition component is communicatively connected to a sensor configured to acquire real-time data output from the electrical system. The power analytics server is communicatively connected to the data acquisition component and is comprised of a virtual system modeling engine, an analytics engine and a machine learning engine. The machine learning engine is configured to store and process patterns observed from the real-time data output and the predicted data output, forecasting power capacity of the electrical system subjected to a simulated contingency event.",
  "decision": "PENDING",
  "patent_number": "nan",
  "_processing_info": {
    "original_size": 136650,
    "optimized_size": 3435,
    "reduction_percent": 97.49
  }
}