{
  "inventor_list": [
    {
      "inventor_name_last": "Burchard",
      "inventor_name_first": "Paul",
      "inventor_city": "Jersey City",
      "inventor_state": "NJ",
      "inventor_country": "US"
    }
  ],
  "filing_date": "20180227",
  "ipcr_labels": [
    "G06N500",
    "G06F758",
    "G06N312",
    "G06N9900"
  ],
  "main_ipcr_label": "G06N500",
  "date_published": "20180705",
  "date_produced": "20180620",
  "publication_number": "US20180189653A1-20180705",
  "title": "SYSTEM AND METHOD FOR PERFORMING FAST COMPUTATIONS USING QUANTUM COUNTING AND PSEUDO-RANDOM SETS",
  "summary": "<SOH> SUMMARY <EOH>This disclosure provides a system and method for performing fast computations using quantum counting and pseudo-random sets. In a first embodiment, a method is provided for solving a computational problem that is reducible to a problem of counting solutions to an associated decision problem. The method includes, using a quantum computer, estimating a number of the solutions to the decision problem by determining if there is at least one solution to the decision problem that lies in a pseudo-random set. The method also includes outputting or using the estimated number of the solutions to the decision problem as a solution to the computational problem. In a second embodiment, an apparatus includes a quantum computer having at least one quantum circuit. To solve a computational problem that is reducible to a problem of counting solutions to an associated decision problem, the quantum computer is configured to use the at least one quantum circuit to estimate a number of the solutions to the decision problem by determining if there is at least one solution to the decision problem that lies in a pseudo-random set. The estimated number of the solutions to the decision problem represents a solution to the computational problem. In a third embodiment, a system includes a quantum computer having at least one quantum circuit and a classical computer having at least one processor configured to execute instructions stored in at least one memory. To solve a computational problem that is reducible to a problem of counting solutions to an associated decision problem, the quantum computer is configured to use the at least one quantum circuit to estimate a number of the solutions to the decision problem by determining if there is at least one solution to the decision problem that lies in a pseudo-random set. The quantum computer is also configured to output, to the classical computer, the estimated number of the solutions to the decision problem as a solution to th...",
  "application_number": "15906217",
  "abstract": "A method is provided for solving a computational problem that is reducible to a problem of counting solutions to an associated decision problem. The method includes, using a quantum computer, estimating a number of the solutions to the decision problem by determining if there is at least one solution to the decision problem that lies in a pseudo-random set. The method also includes outputting or using the estimated number of the solutions to the decision problem as a solution to the computational problem. Determining if there is at least one solution to the decision problem that lies in the pseudo-random set could include determining if there is a sequence of solutions to the decision problem that, taken together, lies in the pseudo-random set.",
  "decision": "PENDING",
  "patent_number": "nan",
  "_processing_info": {
    "original_size": 53894,
    "optimized_size": 3374,
    "reduction_percent": 93.74
  }
}