{
  "session_id": "session_1752603413",
  "start_time": "2025-07-15T23:46:53.416983",
  "end_time": "2025-07-16T00:14:02.014288",
  "conversation": [
    {
      "timestamp": "2025-07-15T23:47:16.129372",
      "user_query": "2",
      "assistant_response": "📝 Question 1: What is the title of your invention?",
      "response_time": 1.9073486328125e-06,
      "guardrail_scores": {
        "profanity_score": 0.0,
        "topic_relevance_score": 0.5,
        "politeness_score": 0.5
      },
      "evaluation_scores": null,
      "data_source": "menu_selection",
      "error_message": null
    },
    {
      "timestamp": "2025-07-15T23:47:36.288779",
      "user_query": "Relation extraction and knowledge graph construction method based on deep learning model",
      "assistant_response": "📝 Question 2: Can you provide an abstract of your invention?\n(2-3 sentences describing what it does)",
      "response_time": 1.2636184692382812e-05,
      "guardrail_scores": {
        "profanity_score": 0.0,
        "topic_relevance_score": 0.5,
        "politeness_score": 0.5
      },
      "evaluation_scores": null,
      "data_source": "patent_analysis",
      "error_message": null
    },
    {
      "timestamp": "2025-07-15T23:47:48.001940",
      "user_query": "The invention discloses a relation extraction and knowledge graph construction method based on a deep learning model, which specifically comprises the following steps: processing the corpus data into labeling data by using a data labeling platform; inputting the annotation data into a deep learning model for training and testing, and generating a relation extraction model; inputting the text data to be extracted into a relation extraction model, and extracting entity relation pairs; and constructing a knowledge graph of the text to be extracted by using the graph database. The invention builds the relation extraction model based on the BERT model, the two-way long-short-term memory network model and the conditional random field algorithm, can accurately extract the entity relation pairs, and ensures the correctness of the entity relation pairs entering the graph database by manually checking the extracted entity relation pairs.",
      "assistant_response": "📝 Question 3: Do you have a detailed description available?\n\nPlease select:\n- Type 'y' for Yes (I have a detailed description)\n- Type 'n' for No (I don't have a detailed description)",
      "response_time": 1.3113021850585938e-05,
      "guardrail_scores": {
        "profanity_score": 0.0,
        "topic_relevance_score": 0.5,
        "politeness_score": 0.5
      },
      "evaluation_scores": null,
      "data_source": "patent_analysis",
      "error_message": null
    },
    {
      "timestamp": "2025-07-15T23:47:53.961560",
      "user_query": "y",
      "assistant_response": "📝 Please provide your detailed description:",
      "response_time": 1.2159347534179688e-05,
      "guardrail_scores": {
        "profanity_score": 0.0,
        "topic_relevance_score": 0.5,
        "politeness_score": 0.5
      },
      "evaluation_scores": null,
      "data_source": "patent_analysis",
      "error_message": null
    },
    {
      "timestamp": "2025-07-15T23:48:13.292652",
      "user_query": "Relation extraction and knowledge graph construction method based on deep learning model\nTechnical Field\nThe invention relates to the technical field of knowledge graph construction, in particular to a relation extraction and knowledge graph construction method based on a deep learning model.\nBackground\nCurrently, the method of knowledge graph construction varies according to the source of the original data. Raw data sources are mainly divided into three categories: structured data, semi-structured data, and unstructured data. In general, the structured data is stored in a relational database and a non-relational database, and the structured data can be converted into RDF data through a D2R technology so as to complete the construction of a knowledge graph. Semi-structured data refers to data that has a certain data structure, and that requires further analysis to obtain, such as encyclopedia data, web page data, and the like. For such data, the data structure can be customized analyzed, and the data is converted into structured data by adopting a regular expression or a crawling analysis means of a webpage, so as to form a knowledge graph. Whereas unstructured data, because of the unstructured nature of its data, cannot generally be converted directly into structured data by simple analysis. Generally, for unstructured data, entities therein, such as person names, place names, organization structure names, time, etc., and relationships between the respective entities may be extracted, thereby attempting to form a knowledge graph.\nThe current knowledge graph construction process generally comprises the following steps: preprocessing the original data, converting the original data into structured data, and then carrying out entity alignment, knowledge fusion, knowledge reasoning and the like to construct and form a complete knowledge graph.\nAt present, although more theoretical researches are carried out on the unstructured data to construct a knowledge graph, no technical means for truly falling to the ground are provided.\nDisclosure of Invention\nIn view of the above, the present invention provides a method for extracting relationships and constructing knowledge patterns based on a deep learning model, which is used for solving the problems in the prior art.\nA relation extraction and knowledge graph construction method based on a deep learning model specifically comprises the following steps:\ns1, processing corpus data into labeling data by using a data labeling platform;\ns2, taking the labeling data as input, training and testing a deep learning model, and generating a relation extraction model;\ns3, inputting the text data to be extracted into a relation extraction model, and extracting entity relation pairs of the text to be extracted;\nand S4, importing the entity relation pairs into a graph database to construct a knowledge graph of the text to be extracted.\nPreferably, in step S1, the specific steps of processing the corpus data into the labeling data by using the data labeling platform are as follows:\ns11, acquiring network data from the Internet through a crawler system;\ns12, segmenting the network data according to sentences to form a sentence corpus;\ns13, labeling the corpus data in the sentence corpus by using a data labeling platform to form labeling data.\nPreferably, the network data is data of a plurality of fields crawled by a crawler system from different sources of the internet;\nafter the network data is obtained, the network data is manually classified according to the domain category.\nPreferably, the network data is unstructured data in one or more formats of TXT text, word text and PDF text.\nPreferably, the data labeling platform is a visual data labeling platform in the form of a webpage.\nPreferably, the specific steps for generating the relation extraction model in step S2 are:\ns21, acquiring a training sample and a test sample from the labeling data;\ns22, preprocessing a training sample, inputting preprocessed data into a BERT model for pre-training, and obtaining an initial word vector;\ns23, training the initial word vector by adopting a two-way long-short-term memory network model and a conditional random field algorithm until the neural network converges to obtain an initial relation extraction model;\ns24, inputting the test sample into the initial relation extraction model for testing, and obtaining the relation extraction model meeting the requirements when the accuracy of the test sample reaches a set value.\nPreferably, in step S3, the text data to be extracted is input into a relation extraction model, and the specific steps of extracting the entity relation pair of the text to be extracted are as follows:\ns31, segmenting text data to be extracted into a plurality of sentences;\ns32, inputting all sentences obtained by segmentation into a relation extraction model, and extracting a plurality of entity relation pairs;\ns33, manually checking the extracted entity relation pairs, and eliminating the wrong entity relation pairs.\nPreferably, the map database adopts Neo4j map database.\nThe beneficial effects of the invention are as follows:\n1. the corpus data adopted by the method is the corpus with various formats and sources, and the annotation of the corpus takes sentences as a unit, so that the corpus data is not limited by the corpus format and the content.\n2. The relation extraction model is based on the BERT model, the two-way long-short-term memory network model and the conditional random field algorithm, can accurately extract the entity relation pairs, ensures the correctness of the entity relation pairs entering the graph database by manually checking the extracted entity relation pairs, has rich visual display, and can effectively promote the interest of the knowledge graph.\nDrawings\nIn order to more clearly illustrate the technical solutions of the embodiments of the present invention, the drawings that are needed in the embodiments will be briefly described below, and it is obvious that the drawings in the following description are only some embodiments of the present invention, and that other drawings can be obtained according to these drawings without inventive effort for a person skilled in the art.\nFig. 1 is a schematic structural view of the present invention.\nDetailed Description\nFor a better understanding of the technical solution of the present invention, the following detailed description of the embodiments of the present invention refers to the accompanying drawings.\nIt should be understood that the described embodiments are merely some, but not all, embodiments of the invention. All other embodiments, which can be made by those skilled in the art based on the embodiments of the invention without making any inventive effort, are intended to be within the scope of the invention.\nThe present application is described in further detail below by way of specific embodiments and with reference to the accompanying drawings.\nA relation extraction and knowledge graph construction method based on a deep learning model specifically comprises the following steps:\ns1, processing corpus data into labeling data by using a data labeling platform.\nSpecifically, the step of processing corpus data into labeling data by using the data labeling platform comprises the following steps:\ns11, acquiring network data from the Internet through a crawler system;\nthe network data may be data of multiple domains crawled by a crawler system from different sources such as news websites, bar stickers, blogs, novel websites, etc., for example, data of news, sports, finance, science and technology, literature, etc.\nThe network data is unstructured data in one or more formats of TXT text, word text and PDF text.\nAfter the crawler system crawls the network data, the network data needs to be classified manually according to the field types.\nS12, the network data is segmented according to sentences to form sentence corpus, and the data in the sentence corpus are stored in a database.\nS13, inputting corpus data in sentence corpus into a data labeling platform, manually labeling subjects, predicates and objects in each sentence by adopting a BIO labeling mode, outputting entity relations of each sentence by the data labeling platform, forming labeling data, and storing the labeling data in a corresponding database. Typically, there may be multiple subjects, predicates, objects in a sentence, and the data tagging platform outputs the nearest-neighbor subjects, predicates, objects as a triplet.\nThe data annotation platform can be a visual data annotation platform built again in a webpage form, and can also adopt the existing data annotation platform in the current market. The data labeling platform can label the text in a format of TXT, word, PDF and the like.\nS2, taking the labeling data as input, training and testing the deep learning model, and generating a relation extraction model.\nSpecifically, the specific steps of generating the relation extraction model are as follows:\ns21, acquiring training samples and test samples from the labeling data.\nS22, preprocessing a training sample, such as removing irrelevant words, sentences and punctuation marks, converting traditional characters into simplified characters and the like, inputting the preprocessed data into a BERT model for pre-training to obtain initial word vectors, and forming an Embedding layer of the model.\nS23, training an initial word vector by adopting a two-way long-short-term memory network model and a conditional random field algorithm (namely a BiLSTM+CRF structure) on the basis of an Embedding layer until a neural network converges to obtain an initial relation extraction model;\ns24, inputting the test sample into the initial relation extraction model for testing, and obtaining the relation extraction model meeting the requirements when the accuracy of the test sample reaches a set value.\nS3, inputting the text data to be extracted into a relation extraction model, and extracting entity relation pairs of the text to be extracted.\nSpecifically, the step of extracting the entity relation pair of the text to be extracted is as follows:\ns31, segmenting text data to be extracted into a plurality of sentences;\ns32, inputting all sentences obtained by segmentation into a relation extraction model to obtain subjects, predicates and objects in each sentence, and extracting a plurality of entity relation pairs;\ns33, manually checking the extracted entity relation pairs, and eliminating the entity relation pairs with errors or questions so as to ensure the accuracy of the entity relation pairs entering the graph database.\nAnd S4, importing the entity relation pairs subjected to manual investigation into a graph database, and constructing a knowledge graph of the text to be extracted. In this embodiment, the map database is Neo4j map database.\nThe extracted knowledge graph can be applied to a series of applications such as character relation analysis, intelligent question and answer and the like.\nThe foregoing description of the preferred embodiments of the invention is not intended to be limiting, but rather to enable any modification, equivalent replacement, improvement or the like to be made within the spirit and principles of the invention.",
      "assistant_response": "📝 Question 4: Select the technology field(s) that best match your invention:\n\n1. Machine Learning & AI\n2. Computer Vision & Image Processing\n3. Neural Networks & Deep Learning\n4. Pattern Recognition & Classification\n5. Data Mining & Analytics\n6. Bioinformatics & Computational Biology\n7. Natural Language Processing\n8. Robotics & Automation\n9. Signal Processing & Audio\n10. Others (search all patents)\n\nYou can select multiple fields by entering numbers separated by commas (e.g., 1,3,5)\nOr type 'all' to search across all fields:",
      "response_time": 3.910064697265625e-05,
      "guardrail_scores": {
        "profanity_score": 0.0,
        "topic_relevance_score": 0.5,
        "politeness_score": 0.5
      },
      "evaluation_scores": null,
      "data_source": "patent_analysis",
      "error_message": null
    },
    {
      "timestamp": "2025-07-15T23:49:55.138168",
      "user_query": "10",
      "assistant_response": "🔍 **Patent Analysis Complete**\n\n**Your Invention:**\n- Title: Relation extraction and knowledge graph construction method based on deep learning model\n- Technology Fields: Others (search all patents)\n\n**RAG-Based Prior Art Analysis:**\nTo analyze the novelty and patentability of the invention \"Relation extraction and knowledge graph construction method based on deep learning model\", we need to conduct a thorough prior art search and compare it with existing patents or publications. Based on the provided context, here is an analysis:\n\n### Prior Art Search:\n- **BERT Model**: Look for patents that involve using BERT (Bidirectional Encoder Representations from Transformers) for relation extraction.\n- **BiLSTM+CRF Combination**: Seek out patents where Bi-directional Long Short-Term Memory networks combined with Conditional Random Fields are used in the context of relation extraction and KG construction.\n- **Visual Data Labeling Platform**: Identify prior work on using visual data labeling platforms to manually label datasets for deep learning models.\n\n### Novelty Analysis:\n1. The invention's method combines BERT, BiLSTM+CRF algorithms specifically tailored for relation extraction from unstructured text data.\n2. The use of a sentence-level annotation approach instead of document-level improves accuracy in entity relationship extraction.\n3. A manual review step before importing the extracted entities and relations into KG ensures higher quality control compared to automatic methods.\n\n### Inventive Step:\n- Utilizing a visual data labeling platform for corpus annotation is an innovative aspect, providing a more interactive method for ensuring accurate labeling.\n- Applying this model across different formats of unstructured text data demonstrates flexibility in application.\n\n### Industrial Applicability:\nThe method finds clear applications in natural language processing (NLP), information extraction, and semantic web/KG construction, enhancing the utility of extracted knowledge graphs.\n\n### Specific Improvements:\n1. The sentence-level annotation approach improves accuracy over document-level approaches.\n2. Manual verification steps ensure high-quality data entry into KGs.\n\n### Potential Drawbacks/Limitations:\n- Heavy reliance on manually labeled training datasets which can be time-consuming and resource-intensive.\n- High computational costs associated with deep learning model training could limit scalability without significant hardware investment.\n\n### Comparison with State-of-the-Art Methods:\nEnsure a comparative analysis is done to assess how this method stacks up in terms of accuracy, efficiency, and effectiveness against other recent approaches. This will help validate the claims made about its unique advantages.\n\n### Claim Analysis:\n- Claims should be broad enough to cover the core inventive concept without being overly broad and encompassing prior art.\n- Specific claims covering innovative combinations (BERT+BiLSTM+CRF), sentence-level annotation, and manual review steps for quality assurance need to be included.\n\nBased on the provided context, it appears that this invention meets several criteria for patentability:\n1. It combines existing techniques in a novel manner tailored specifically for relation extraction from unstructured data.\n2. There are unique approaches to corpus annotation (visual labeling platform) which improve accuracy and efficiency.\n3. Quality control measures like manual reviews ensure higher accuracy of KGs.\n\nHowever, thorough prior art searching is necessary to confirm the uniqueness of this invention relative to existing solutions. If no exact match for these specific combinations and methods exists in existing patents or publications, then it has a strong case for patentability due to its inventive step and improved results over previous approaches.\n\nIn conclusion, while promising based on current descriptions, a comprehensive prior art search is essential to ensure the claimed invention's uniqueness and non-obviousness relative to existing solutions.\n\n**Local Analysis Summary:**\nYour invention shows strong potential with good innovation and market relevance, with room for minor improvements.\n\n**Key Factors:**\n• ✅ Clear and descriptive title with technical specificity\n• ⚠️  Abstract is good but could include more technical details\n• ✅ Comprehensive technical description with implementation details\n• ⚠️  Moderate technology potential - consider market positioning\n\n**Recommendations:**\n• Good potential - consider filing within 3-6 months\n• Address prior art concerns and strengthen novelty arguments\n• Conduct thorough competitive analysis before filing\n\n**Acceptance Probability:**\n75.0% (if available)",
      "response_time": 97.87804222106934,
      "guardrail_scores": {
        "profanity_score": 0.0,
        "topic_relevance_score": 0.0,
        "politeness_score": 0.0
      },
      "evaluation_scores": {
        "relevance_score": 0.03329743444919586,
        "coherence_score": 0.8768383167220376,
        "profanity_score": 0.0,
        "topic_relevance_score": 0.0,
        "politeness_score": 0.0
      },
      "data_source": "patent_analysis",
      "error_message": null
    },
    {
      "timestamp": "2025-07-15T23:51:23.196834",
      "user_query": "so can you recommend what a good abstract would look like for this patent?\n",
      "assistant_response": "Option not correctly selected, please select a valid option\n\n🤖 **Patent Analysis Assistant**\n\nPlease select an option:\n1. 📊 Analyze existing patent\n2. 💡 Analyze new invention\n3. 🔍 Search for similar patents\n\nEnter 1, 2, or 3:",
      "response_time": 1.4066696166992188e-05,
      "guardrail_scores": {
        "profanity_score": 0.0,
        "topic_relevance_score": 0.5,
        "politeness_score": 0.5
      },
      "evaluation_scores": null,
      "data_source": "menu_selection",
      "error_message": null
    },
    {
      "timestamp": "2025-07-15T23:51:53.551634",
      "user_query": "1",
      "assistant_response": "📚 Please provide the patent number or title to analyze:\n(Examples: US12345678, 'Neural Network System', etc.)",
      "response_time": 3.0040740966796875e-05,
      "guardrail_scores": {
        "profanity_score": 0.0,
        "topic_relevance_score": 0.5,
        "politeness_score": 0.5
      },
      "evaluation_scores": null,
      "data_source": "menu_selection",
      "error_message": null
    },
    {
      "timestamp": "2025-07-15T23:53:30.006517",
      "user_query": "US10438354B2",
      "assistant_response": "📚 EXISTING PATENT ANALYSIS (Local LLM Fallback)\n\n🌐 INTERNET SEARCH RESULTS:\nBased on the information provided about \"US10438354B2\" and another related patent \"US20230000001,\" let's analyze each aspect as requested:\n\n### 1. Similarity to Existing Patents\n\n**Existing Patent: US10438354B2**\n- Title (not provided): The title is not given for this reference, but we can infer that it likely pertains to a specific system or technology related to its patent number.\n- Abstract (not provided): Without the abstract of \"US10438354B2,\" it's challenging to determine precise similarities. However, based on the context and the pending patent mentioned, it appears that US20230000001 builds upon or improves the system described in US10438354B2.\n\n**Pending Patent: US20230000001**\n- Title: Advanced Us10438354B2 System\n- Abstract: A system for \"US10438354B2\" with improved efficiency and performance.\n- Status: PENDING\n\n**Analysis:**\nThe title of the pending patent US20230000001 suggests that it is an advanced or improved version of a previously granted patent (likely US10438354B2). The abstract indicates improvements in efficiency and performance, which implies that this new system builds upon the foundation set by the original invention but introduces enhancements. This similarity in functionality indicates that there's likely a clear relationship between these patents, with the pending patent aiming to refine or enhance an existing technology.\n\n### 2. Potential Novelty of the Query\n\n**Analysis:**\nThe novelty of US20230000001 lies primarily in its improvements over the original system (US10438354B2). To establish novelty, one must demonstrate that:\n- The improvements are not obvious to someone skilled in the art.\n- The enhancements provide a non-obvious improvement or unique benefit that wasn't present in the original patent.\nWithout reviewing the detailed specifications of both patents, it's difficult to conclude definitively on the novelty. However, if the pending application genuinely offers significant and novel advancements over US10438354B2 in terms of efficiency and performance, there could be a strong case for novelty.\n\n### 3. Market Implications\n\n**Analysis:**\nIf this patent is granted, it would likely have several market implications:\n- **Competitive Edge:** By improving the original system's efficiency and performance, the new technology might outperform existing solutions in the market, providing a competitive edge.\n- **Customer Adoption:** Enhanced features could attract more customers or users who are looking for better-performing products or services within their industry.\n- **Revenue Potential:** Improved systems often result in higher customer satisfaction and potentially increased sales or licensing fees. Additionally, if competitors cannot easily replicate these enhancements due to patent protection, it could lead to sustained market leadership.\n- **Legal Considerations:** If the improvements are substantial enough to be patented separately, they can serve as a legal barrier against competitors who may try to imitate or infringe upon the patented technology.\n\n### 4. Recommendations for Patent Strategy\n\n**Analysis:**\nGiven the context:\n1. **Prior Art Search:** Conduct an exhaustive search for prior art related to both US10438354B2 and any potential improvements to ensure that no overlapping technologies exist.\n2. **Enhanced Claims:** Ensure that the claims of US20230000001 are robust enough to cover all aspects of the new system, especially those concerning efficiency and performance enhancements. This should include both broad claims covering innovative concepts as well as specific embodiments detailing improvements.\n3. **International Protection:** Consider filing a Patent Cooperation Treaty (PCT) application if there is international market potential or need for protection in other countries beyond the United States.\n4. **Licencing Strategy:** Develop strategies to license this improved technology, potentially creating revenue streams and fostering partnerships with key industry players who can benefit from these enhancements.\n5. **Monitoring Competitors:** Regularly monitor competitors’ activities and new patent filings to safeguard against potential infringement or unauthorized use of patented technologies.\n\nIn summary, the analysis suggests that while US20230000001 builds upon existing technology (US10438354B2), its proposed improvements could offer significant market advantages if properly protected and strategically marketed. Careful consideration should be given to intellectual property protection, competitive landscape, and potential revenue streams when formulating a comprehensive patent strategy.\n\n📋 ANALYSIS SUMMARY:\n• Patent: \"US10438354B2\"\n• RAG Database: No exact patent match found\n• OpenAI: Not available\n• Local LLM: Generated analysis from internet data\n• Internet Search: Found 1 relevant sources\n\n💡 RECOMMENDATIONS:\n• Consider conducting a comprehensive patent search\n• Review existing patents in similar domains for prior art\n• Consult with a patent attorney for comprehensive analysis\n",
      "response_time": 80.45497107505798,
      "guardrail_scores": {
        "profanity_score": 0.0,
        "topic_relevance_score": 0.0,
        "politeness_score": 0.0
      },
      "evaluation_scores": {
        "relevance_score": 0.4137667119503021,
        "coherence_score": 0.8943262411347518,
        "profanity_score": 0.0,
        "topic_relevance_score": 0.0,
        "politeness_score": 0.0
      },
      "data_source": "patent_analysis",
      "error_message": null
    },
    {
      "timestamp": "2025-07-16T00:00:14.934110",
      "user_query": "Return to main menu",
      "assistant_response": "🤖 **Patent Analysis Assistant**\n\nPlease select an option:\n1. 📊 Analyze existing patent\n2. 💡 Analyze new invention\n3. 🔍 Search for similar patents\n\nEnter 1, 2, or 3:",
      "response_time": 3.814697265625e-06,
      "guardrail_scores": {
        "profanity_score": 0.0,
        "topic_relevance_score": 0.0,
        "politeness_score": 0.0
      },
      "evaluation_scores": {
        "relevance_score": -0.04610908776521683,
        "coherence_score": 0.5045043103448276,
        "profanity_score": 0.0,
        "topic_relevance_score": 0.0,
        "politeness_score": 0.0
      },
      "data_source": "follow_up",
      "error_message": null
    },
    {
      "timestamp": "2025-07-16T00:00:18.425501",
      "user_query": "3",
      "assistant_response": "🔍 What technology or topic would you like to search for?\n(Examples: machine learning, IoT, blockchain, etc.)",
      "response_time": 9.059906005859375e-06,
      "guardrail_scores": {
        "profanity_score": 0.0,
        "topic_relevance_score": 0.5,
        "politeness_score": 0.5
      },
      "evaluation_scores": null,
      "data_source": "menu_selection",
      "error_message": null
    },
    {
      "timestamp": "2025-07-16T00:01:18.404632",
      "user_query": "fuck analysis",
      "assistant_response": "⚠️ Response filtered by guardrails:\n\nContent contains inappropriate language\n\nPlease rephrase your question or ask about a different topic.",
      "response_time": 51.21915793418884,
      "guardrail_scores": {
        "profanity_score": 1.0,
        "topic_relevance_score": 0.0,
        "politeness_score": 0.0
      },
      "evaluation_scores": {
        "relevance_score": 0.14206118881702423,
        "coherence_score": 0.5349999999999999,
        "profanity_score": 0.0,
        "topic_relevance_score": 1.0,
        "politeness_score": 0.0
      },
      "data_source": "patent_analysis",
      "error_message": null
    }
  ]
}