{
  "doc-2181ad1dddfb75b804b7d4aa3746db8a": {
    "content": "Title: SINGLE CYCLE MULTI-BRANCH PREDICTION INCLUDING SHADOW CACHE FOR EARLY FAR BRANCH PREDICTION\n\nApplication Number: 13824013\n\nPublication Number: US20170262287A1-20170914\n\nDecision: PENDING\n\nIPC Labels: G06F938, G06F930, G06F120875\n\nAbstract: A method of identifying instructions including accessing a plurality of instructions that comprise multiple branch instructions. For each branch instruction of the multiple branch instructions, a respective first mask is generated representing instructions that are executed if a branch is taken. A respective second mask is generated representing instructions that are executed if the branch is not taken. A prediction output is received that comprises a respective branch prediction for each branch instruction. For each branch instruction, the prediction output is used to select a respective resultant mask from among the respective first and second masks. For each branch instruction, a resultant mask of a subsequent branch is invalidated if a previous branch is predicted to branch over said subsequent branch. A logical operation is performed on all resultant masks to produce a final mask. The final mask is used to select a subset of instructions for execution."
  },
  "doc-cae6a8ed5e00a1c9e1e24ccf8040377a": {
    "content": "Title: Sensor Device and Method for the Detection of a Gripping of a Hand-Held Device as Well as a Hand-Held Device\n\nApplication Number: 13808700\n\nPublication Number: US20160285450A1-20160929\n\nDecision: PENDING\n\nIPC Labels: H03K1796, G06F132, G01N2722\n\nAbstract: A sensor device for the detection of a gripping of a hand-held device with one hand has at least one first electrode and at least one second electrode. The first electrode can be operated in a first operating mode. The second electrode can be operated in the first operating mode and in a second operating mode. In the first operating mode, the capacitive coupling between the first electrode and the second electrode is analyzed. In the second operating mode, a capacitive load of the second electrode is analyzed against a reference ground."
  },
  "doc-55d7c1834dd1337e4fdd10aefe90066c": {
    "content": "Title: SYSTEMS AND METHODS FOR ENABLING SECURE TRANSACTIONS WITH MOBILE DEVICES\n\nApplication Number: 13976539\n\nPublication Number: US20160335619A1-20161117\n\nDecision: PENDING\n\nIPC Labels: G06Q2032, H04W1206, G06Q2038, H04W400, H04B500\n\nAbstract: Techniques for enabling transactions using mobile devices are described herein. A mobile device is configured to wirelessly receive from a provider of products and services an encrypted near field communications (NFC) data exchange format (NDEF) message using an over-the-air communications standard different from the NFC standard. The NDEF message is decrypted to recover the NDEF payload. An NFC emulated card is generated from the information included in the NDEF payload and stored in the mobile device. The NFC emulated card is used to store funds for making payments. For conducting a transaction at the provider's place of business, the NFC emulated card is provided to a point-of-sale terminal for authorization, fund transfer, and completion of transaction."
  },
  "doc-30b4493e0176dd05f6a77d8d68e4ba5b": {
    "content": "Title: View Locking Multi-Monitor Screen Magnifier\n\nApplication Number: 13952383\n\nPublication Number: US20150033183A1-20150129\n\nDecision: ACCEPTED\n\nIPC Labels: G06F30481\n\nAbstract: A method of locking magnified screen views including the steps of magnifying a portion of a graphic user interface on a first monitor to establish a first magnified view having upper, lower, left and right boundaries, magnifying a portion of the graphic user interface on a second monitor to establish a second magnified view having upper, lower, left and right boundaries, whereby the graphic user interface of the first monitor is extended in the direction of the second monitor, responsive to an end-user selectable setting, restricting pointer indicia movement to an area defined by the boundaries of each view that are not between first and second monitor, and responsive to pointer indicia moving from first monitor towards second monitor displaying pointer indicia within second magnified view responsive to pointer indicia crossing the boundary of first magnified view in the direction of second monitor."
  },
  "doc-d6f6d6b829fb2a70a694a12e6858de84": {
    "content": "Title: SYSTEMS, METHODS AND APPARATUS THAT EMPLOY STATISTICAL ANALYSIS OF STRUCTURAL TEST INFORMATION TO IDENTIFY YIELD LOSS MECHANISMS\n\nApplication Number: 13822625\n\nPublication Number: US20170220706A1-20170803\n\nDecision: PENDING\n\nIPC Labels: G06F1750\n\nAbstract: A method for statistically analyzing structural test information to identify at least one yield loss mechanism includes executing a plurality of instructions on a computer system. The executed instructions cause the computer system to perform the steps of: 1) identifying potential root causes for items of structural test information obtained for a plurality of semiconductor devices; 2) statistically analyzing the items of structural test information to identify at least one non-random device failure signature within the items of structural test information; and 3) identifying from the potential root causes a probable root cause for at least a first of the at least one non-random device failure signature."
  }
}